{"page 123":"“That is a wise proposal.”\n\nHe takes a few minutes to consult with his cabinet.\n\nHe turns back to you and beams. “A peaceful assurance is just what my domain needs to maintain stability. Today marks a glorious occasion. The day when our two peoples forge a bond that will never be broken. I hereby vow that we will never take arms against you or your allies.”\n\n\"And I pledge the same to you,\" you respond.\n\nDuke Dizen tells his assistant to bring his ceremonial chalice. He pours a bit of water into the golden goblet decorated with green jade and red rubies. He drinks from it. You do the same. Then you both cup your hands and bend your bodies forward three times in the final ritual of the alliance ceremony.\n\n“Since we are now allies, I feel we can talk a bit more freely amongst each other. You may or may not know this already, but I am friends with Governor Toleron. He is a hard working man who is very frugal. Sometimes too frugal, I think. But if you propose a beneficial alliance that does not eat into his treasury, he would be a willing ally.”\n\nYou thank the Duke for his generous advice and return home with a new alliance. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 244":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 122":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 243":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 125":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 246":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 124":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 245":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 127":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 248":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 126":"“Hrrmph,\" Duke Dizen grunts.\n\n\"Even my patience has limits. You and I are just too different.” He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you are looking for allies, you will want to speak with my friend Governor Toleron. Try to speak to him with an angry tone, or tell him of your admiration of General Nahru. He would be delighted to hear that.\"\n\n\"Goodbye President Min. Perhaps one day we shall meet again.”\n\nYou return to your kingdom without an alliance. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 247":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 129":"Kahn clenches his fists and his eyes widen. “How dare you waste my time!”\n","page 128":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 249":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 79":"You order your troops to stand down in case your enemy’s retreat is strategic and leads to a trap. You allow Toleron’s troops to run away.\n\nAlthough your arrow bombs are gone, you still have 50 thousand infantry, 5 thousand archers, 40 thousand cavalry, and 5 ballistae. You march back to your base camp to heal your wounds and pick up reinforcements and supplies before going deeper into Toleron territory.\n\nOne week passes. Your soldiers are back to full health. You receive five thousand archers recruited from nearby villages as reinforcement. You launch another assault at Toleron.\n\nThis battle sets up much like last time, except now his 70 thousand infantry are unaccompanied by archers. However, they did not come alone. Behind his infantry you make out several wooden vehicles.\n\nBallistae. 15 of them.\n\nToleron must have returned to his castle after your first battle and retrieved his ballistae. You allowed him to regroup and come back with reinforcements.\n\nYour five ballistae stand no chance against his fifteen. Toleron\u0027s ballistae roll toward your army and send a storm of bolts flying toward your ballistae. You watch in horror as Toleron\u0027s ballistae wreck yours and you are forced to charge at them with your army.\n\nBy the time your troops make their way across the battlefield, Toleron’s battery of ballistae has decimated your ranks. His 70 thousand infantry now outnumber your troops. This time, with their morale greatly improved, Toleron\u0027s forces prevail.\n\nYour campaign to conquer the world ends here. You are captured and what you often do to your enemies is done to you, as your head ends up on Toleron’s flagpole as a warning to anyone who would attack him.\n\nTHE END\n","page 78":"You cannot let Toleron get away and regroup. When he gets his hands on his 15 ballistae it will be much tougher to defeat him. You order your 40 thousand mounted cavalry to charge after the 70 or so thousand retreating footmen.\n\nThey gallop over the dry plains and soon catch up to the enemy. Infantry, even ones running for their lives, cannot outrun thoroughbreds. Panicked soldiers cannot keep from tripping over themselves, let alone defend against your charging cavalry\u0027s spears. A massacre ensues.\n\nOne of your alert officers spots Toleron himself and captures him alive. He is thrown in front of you with bound ankles and wrists.\n\n“Why should I spare your pathetic life?” you ask a defiant Toleron.\n\n“There is no need. Ever since I converted to Buddhism I have seen the way. The pain and suffering of existence are meaningless. In time, your people will agree with me. Killing me will only send me to nirva-”\n\n“Enough! Your death will serve me much better than it will serve you, believe me. Off with his head!”\n\nWhen you take over Toleron’s castle you find his 15 ballistae in good condition and add them to your fleet. In addition, winning a battle against a huge enemy while suffering negligible losses astronomically raises your kingdom\u0027s morale. Another huge spike in conscription occurs, this time increasing your troops to 500 thousand infantry, 500 thousand archers, and one million mounted cavalry. Furthermore, your increasing stable of skilled tradesmen have completed construction on several cloud ladders.\n\nCloud ladders, or siege towers, are slow-moving, wheeled, vertically extendable wooden structures. They allow infantry and archers to directly reach the top of castle walls and towers without being bombarded by arrows on the way. Damp cloth is draped over the outside to protect it against burning arrows. Unlike regular arrows, ballista bolts can penetrate the cloud ladder\u0027s wooden shell and eventually wreck the entire structure. Cloud ladders also cannot accommodate any cavalry, so your mounted troops would not be able to support your infantry and archers. Your war machines now total 20 ballistae and 10 cloud ladders.\n\nOne day, as you are preparing for another offensive campaign, you are visited by an emissary.\n\n“I am here on a mission of peace from President Min. He has heard tales of your victories and is in awe of your military brilliance. Now that all other remaining warlords in China have allied themselves with the President, your joining us is overdue. He asks that you keep your troops within the boundaries of your newly acquired territories in north, south, and east China in exchange for him keeping all the other warlords from invading your territory. You are still free to attack anyone you want outside of China. What reply shall I bring back to President Min?”\n\n“Ahahahaha!” You have not had such a good laugh in a long time. “Don’t worry,” you say, “I’ll take care of that for you.”\n\nYou grin as your men drag the diplomat away to be executed and his head put in a box and sent back to Min.\n\nBy now you hold three quarters of China. But the last opposition is the strongest. Min has convinced his allies to all resist you as one. Their most defensible position is Min\u0027s capital, where 1.5 million soldiers await you in battle.\n\nYou march your army to Min’s last bastion. A giant castle stands in the distance. In front of it are thousands of tents nestled close together, where the one million infantry of Min’s allies are camped. Perched on the castle walls are Min\u0027s 200 thousand infantry and 300 thousand archers. Ten ballistae sit atop his towers, pointed in your direction. Due to their elevation, Min\u0027s ballistae possess much greater range than yours. The battlefield terrain is a low plain with no trees, and a brisk wind blows from behind your back.\n\nYour legions stand tall facing the enemy. Your day of glory has finally come. Before the moment sinks in however, Min’s allies suddenly attack you. All one million infantry charge as one at your formation and taking the initiative away from you. You have no option but to fight back.\n\nYour one million cavalry are the first to engage the enemy. Soldiers on their front few lines are knocked down by your cavalry\u0027s ferocious charge. Your mounted troops quickly slaughter the infantry while taking moderate losses. Soon, all one million infantry are either dead or scattered, while you have lost 500 thousand of your cavalry.\n\nCareful to remain just out of the range of Min\u0027s ballistae, you walk past the tents and closer to Min’s towering castle. You still have 500 thousand each of infantry, archers, and cavalry, as well as 20 ballistae and 10 cloud ladders. Min still has 200 thousand infantry, 300 thousand archers and 10 ballistae guarding his fortress. How will you assault the castle? Thanks to your exceptional tactical decisions in earlier battles, you now have better options at your disposal. There are two appealing choices, but decide carefully.\n\nYou know that as your ballistae move close enough to fire on the castle, they would also likely be fired on during the assault as well and eventually all destroyed by Min\u0027s longer ranged ballistae.\n","page 71":"You order your archers to march forward and shoot your arrow bombs into the forest. Once they enter firing range, your archers are pelted by Toleron\u0027s arrows. This resistance merely delays your barrage however; all the arrow bombs eventually reach their target. One explosion after another rocks the battlefield.\n\nThe dry weather makes the trees extra flammable, and the stiff breeze fans the flames. Enemy archers who are not directly killed in the explosions are roasted in its blaze.\n\nThe front columns of Toleron\u0027s infantry hear the scary explosions behind them and turn around. They watch the trees burst into flames and their comrades die bloody deaths. They hesitate for a second before throwing down their shields and weapons and running away. The rest of Toleron\u0027s army pauses, then does likewise retreat.\n\nHow do you respond?\n","page 70":"You yet again decline the use of your secret weapon. Instead you try to capitalize on your five ballistae\u0027s great range and damage output. You order your ballistae to fire at the enemy.\n\nThe ballista is an impressive machine, and you watch them wipe out hundreds of enemy infantry before Toleron reacts to being slaughtered. He commands every last one of his 90 thousand men, including his archers, to charge at your army in order to negate your range advantage. This is exactly what you want. Now you engage his army with yours.\n\nYour men are noticeably better trained. Your infantry\u0027s footwork is quicker and their swordplay stronger than Toleron\u0027s. Your archers are far more accurate. Your mounted cavalry are also vastly superior to his infantry in close combat. Your troops annihilate his ranks while you suffer modest losses. Toleron himself tries to escape but is tracked down by a cavalry unit a few hours later. He is thrown in front of you with bound ankles and wrists.\n\n“Why should I spare your pathetic life?” you ask a defiant Toleron.\n\n“There is no need. Ever since I converted to Buddhism I have seen the way. The pain and suffering of existence are meaningless. In time, your people will agree with me. Killing me will only send me to nirva-”\n\n“Enough! Your death will serve me much better than it will serve you, believe me. Off with his head!”\n\nWhen you take over Toleron’s castle you find his 15 ballistae in good condition and add them to your fleet. In addition, winning a battle against a huge enemy while suffering modest losses raises your kingdom\u0027s morale a good bit. Another spike in conscription occurs, this time increasing your troops to 500 thousand infantry, 200 thousand archers, and 300 thousand mounted cavalry. Furthermore, your increasing stable of skilled tradesmen have completed construction on several cloud ladders.\n\nCloud ladders, or siege towers, are slow-moving, wheeled, vertically extendable wooden structures. They allow infantry and archers to directly reach the top of castle walls and towers without being bombarded by arrows on the way. Damp cloth is draped over the outside to protect it against burning arrows. Unlike regular arrows, ballista bolts can penetrate the cloud ladder\u0027s wooden shell and eventually wreck the entire structure. Cloud ladders also cannot accommodate any cavalry, so your mounted troops would not be able to support your infantry and archers. Your war machines now total 20 ballistae and 10 cloud ladders.\n\nOne day, as you are preparing for another offensive campaign, you are visited by an emissary.\n\n“I am here on a mission of peace from President Min. He has heard tales of your victories and is in awe of your military brilliance. Now that all other remaining warlords in China have allied themselves with the President, your joining us is overdue. He asks that you keep your troops within the boundaries of your newly acquired territories in north, south, and east China in exchange for him keeping all the other warlords from invading your territory. You are still free to attack anyone you want outside of China. What reply shall I bring back to President Min?”\n\n“Ahahahaha!” You have not had such a good laugh in a long time. “Don’t worry,” you say, “I’ll take care of that for you.”\n\nYou grin as your men drag the diplomat away to be executed and his head put in a box and sent back to Min.\n\nBy now you hold three quarters of China. But the last opposition is the strongest. Min has convinced his allies to all resist you as one. Their most defensible position is Min\u0027s capital, where 1.5 million soldiers await you in battle.\n\nYou march your army to Min’s last bastion. A giant castle stands in the distance. In front of it are thousands of tents nestled close together, where the one million infantry of Min’s allies are camped. Perched on the castle walls are Min\u0027s 200 thousand infantry and 300 thousand archers. Ten ballistae sit atop his towers, pointed in your direction. Due to their elevation, Min\u0027s ballistae possess much greater range than yours. The battlefield terrain is a low plain with no trees, and a brisk wind blows from behind your back.\n\nYou realize that you still have your arrow bombs. If this occasion isn’t worth using them for then they will never see combat. The terrain and weather provide perfect conditions for your arrow bombs to burn the tents and cause maximum damage. On your command, each archer in your front row fires an arrow bomb at the tents.\n\nMin’s allies see what you are doing and hastily prepare to attack. But before they can take even one step, loud explosions shake their camp. The blasts and piercing glass shrapnel directly kill many of Min\u0027s allies. The explosions also start fires in the grass.\n\nMany soldiers are trapped between the castle walls and the fires fanned toward them by the wind. Min refuses to open his castle\u0027s gates as its occupation is already completely full. Some men die of smoke inhalation. Others’ deaths are fiery and painful as the fire jumps from tent to tent. The survivors abandon Min and run for their lives. You have wiped out the entire camp without a single casualty.\n\nAfter the fires burn out, you walk past the charred ruins and closer to Min’s towering castle, careful to remain just out of the range of Min\u0027s ballistae. You still have 500 thousand infantry, 200 thousand archers, and 300 thousand cavalry, as well as 20 ballistae and 10 cloud ladders. Min still has 200 thousand infantry, 300 thousand archers and 10 ballistae guarding his fortress. How will you assault the castle? Thanks to your waiting until now to deploy your arrow bombs, you have three decent options.\n\nYou know that as your ballistae move close enough to fire on the castle, they would also likely be fired on during the assault as well and eventually all destroyed by Min\u0027s longer ranged ballistae.\n","page 73":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders.\n\nThey slowly approach the walls, with your infantry and archers forming long lines behind them. Your 500 thousand cavalry can only wait outside the castle, anxious to enter the fray.\n\nYou watch as your foot soldiers crawl out of their cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. Soon you see your 700 thousand foot soldiers dwindle to only a few thousand. Your cavalry can only watch as their comrades are cut down hundreds of feet above them. You feel abject failure.\n\nYour cavalry cannot enter the castle nor attack anyone, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a great chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 72":"You order your ballistae forward. You beam with pride as your ballistae operators bravely push them onward in the face of enemy ballistae fire. A few of them are destroyed before they are in range, but most of them reach their destination.\n\nYou watch intently as your ballistae shower Min’s castle gate with bolts. Eventually the giant gate becomes so covered with shafts you can barely see any wood. Several minutes later, as the last of your ballistae is destroyed, you see the gate crack, then wobble, and finally collapse. It is time.\n\nOne million of your bravest warriors charge toward the castle opening. You see Min’s soldiers hurriedly rush toward the gap to protect the keep. As you expected, Min\u0027s ballistae rain death upon your troops as they advance toward the castle. Many do not survive. But enough do that you still possess a modest advantage in numbers when the apocalyptic clash begins.\n\nThe chaos of metal clanging, primal shouting, hooves galloping, and millions of intense combatants sort themselves out in the scene before you. Blood and dead bodies slowly fill up the battlefield. You get chills, almost in glee, watching all the carnage. But who will triumph and etch their name in the history books?\n\nYour modest edge in numbers very slowly wears down Min’s ranks. Min\u0027s troops have the extra motivation of defending their homeland. Your forces have the advantages of being more bloodthirsty and experienced in combat. Little by little, your army overwhelms the defenders and push them deeper into the castle. At times they are pushed back, but then surge forward again past their fallen comrades. Closer and closer to the keep you get, until Min’s flag drops from its pole and is replaced with your bloody banner.\n\nCarefully, you step into the keep after surveying the battle scene. No one wearing Min’s uniform is still standing. The throne room is extravagant, but empty. You sprint up the steps and leap onto the ornate gold throne. Min is brought before you with his hands tied behind his back.\n\n“I surrender, great conqueror. Please spare my life. I will serve you, and, and never betray you! I can help you rule, and I know this area well having lived here my whole life. I would be forever grateful to you. Please spare me!”\n\nTo avenge your fallen soldiers who helped you unite all of China, you execute President Min despite his plead. But China is only the beginning. From where the sun rises to where it sets are lands ripe for the taking. You declare yourself emperor and begin a new dynasty. You go on to become the greatest conqueror China has ever known. Thanks to your military skills,\n\nYOU WIN.\n","page 74":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders.\n\nThey slowly approach the walls, with your infantry forming long lines behind them. Your 500 thousand cavalry and 200 thousand archers can only wait outside the castle, anxious to enter the fray.\n\nYou watch as your foot soldiers crawl out of their cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. In desperation, you send all your archers up the cloud ladders as well. They are even worse at close quarter combat than your infantry were and are decimated too. Soon you see your 700 thousand foot soldiers dwindle to only a few thousand. Your cavalry can only watch as their comrades are cut down hundreds of feet above them. You feel abject failure.\n\nYour cavalry cannot enter the castle nor attack anyone, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a great chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 130":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 251":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nA few desperate warlords attack you, sensing weakness. General Nahru, true to his word, sends troops to help you. Your minor allies provide some military assistance as well. Your combined forces fight a multi-front war against several hostile warlords. Just as the tide begins to turn in your favor, General Nahru is tragically killed in battle. His son Lurdu takes over and, fed up with your uselessness to him and diminishing international stature, immediately betrays the alliance and cuts off help.\n\nYour kingdom’s morale plunges. Soon consecutive attacks by enemy forces penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 250":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 132":"Kahn clenches his fists and his eyes widen. “How dare you waste my time!”\n","page 253":"“An Arranged Marriage...well, yes I...guess we could do that. I will wed my firstborn to your first child of the opposite sex.\"\n\nToleron announces, \"May they live in a world of prosperity and peace, and may our friendship last for eternity.”\n\nYou return home with an arranged marriage for your child. Unfortunately, it holds no sway in international relations. A few desperate renegade warlords see this soft alliance as a sign of weakness and invade your territory. General Nahru, true to his word, sends troops to help you. Your minor allies provide some military assistance as well. Your combined forces fight a multi-front war against several hostile warlords. Just as the tide begins to turn in your favor, General Nahru is tragically killed in battle. His son Lurdu takes over and, fed up with your uselessness to him and diminishing international stature, immediately betrays the alliance and cuts off help.\n\nYour kingdom’s morale plunges. Soon consecutive attacks by enemy forces penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYour last stand comes when your castle comes under attack by General Nahru\u0027s treacherous son Lurdu. His formidable army destroys your installations and ransacks your castle. To avoid the humiliation of your severed scalp being put on display outside your former castle, you commit suicide in your throne room by burning yourself to a crisp.\n\nTHE END\n","page 131":"“You\u0027re not getting to the point. What is it that you want?”\n","page 112":"The prince rolls his eyes.\n\n“You’re speaking to me like I was the tsar and not a prince. How do you expect me to have any say in important national matters like those? Man, you’re no fun. If I was tsar I would have you beheaded. Get out of here. I don’t want to see you anymore.” You ashamedly bow and quickly back out of his sight. You depart from Russia and return to your capital.\n\nYou are fortunate that Prince Yevgeni is not more serious-minded or else antagonizing him would have harsher consequences. You arrive back home in several days.\n\nYou turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 233":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 111":"The prince rolls his eyes.\n\n“You’re speaking to me like I was the tsar and not a prince. How do you expect me to have any say in important national matters like those? Man, you’re no fun. If I was tsar I would have you beheaded. Get out of here. I don’t want to see you anymore.” You ashamedly bow and quickly back out of his sight. You depart from Russia and return to your capital.\n\nYou are fortunate that Prince Yevgeni is not more serious-minded or else antagonizing him would have harsher consequences. You arrive back home in several days.\n\nYou turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 232":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 114":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 235":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 113":"“Ohh Min. You are too much. Let’s get to the point. What exactly do you have in mind?\"\n","page 234":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 116":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 237":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 115":"“Ohh Min. You are too much. Let’s get to the point. What exactly do you have in mind?\"\n","page 236":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 118":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 239":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 117":"Deep vertical furrows emerge at the base of Duke Dizen’s forehead. He stares at you grimly.\n\n“Is that something to be proud of?”\n","page 238":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 119":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 82":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae still intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders.\n\nThey slowly approach the walls, with your infantry and archers forming long lines behind them. Your 500 thousand cavalry can only wait outside the castle, anxious to enter the fray.\n\nYou watch as your foot soldiers crawl out of their cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. Soon you see your one million foot soldiers dwindle to only a few hundred thousand. Your cavalry can only watch as their comrades are cut down hundreds of feet above them. You feel abject failure.\n\nYour cavalry cannot enter the castle nor attack anyone, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a great chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 81":"You order your ballistae forward. You beam with pride as your ballistae operators bravely push them onward in the face of enemy ballistae fire. A few of them are destroyed before they are in range, but most of them reach their destination.\n\nYou watch intently as your ballistae shower Min’s castle gate with bolts. Eventually the giant gate becomes so covered with shafts you can barely see any wood. Several minutes later, as the last of your ballistae is destroyed, you see the gate crack, then wobble, and finally collapse. It is time.\n\nOne and half million of your bravest warriors charge toward the castle opening. You see Min’s soldiers hurriedly rush toward the gap to protect the keep. As you expected, Min\u0027s ballistae rain death upon your troops as they advance toward the castle. Many do not survive. But enough do that you still possess a large advantage in numbers when a clash the magnitude of which you have never seen begins.\n\nThe chaos of metal clanging, primal shouting, hooves galloping, and millions of intense combatants sort themselves out in the scene before you. Blood and dead bodies slowly fill up the battlefield. You get chills, almost in glee, watching all the carnage. But who will triumph and etch their name in the history books?\n\nYour large edge in numbers slowly wears down Min’s ranks. Min\u0027s troops have the extra motivation of defending their homeland. Your forces have the advantages of being more bloodthirsty and experienced in combat. Little by little, your army overwhelms the defenders and push them deeper into the castle. Closer and closer to the keep you get, until Min’s flag drops from its pole and is replaced with your bloody banner.\n\nCarefully, you step into the keep after surveying the battle scene. No one wearing Min’s uniform is still standing. The throne room is extravagant, but empty. You sprint up the steps and leap onto the ornate gold throne. Min is brought before you with his hands tied behind his back.\n\n“I surrender, great conqueror. Please spare my life. I will serve you, and, and never betray you! I can help you rule, and I know this area well having lived here my whole life. I would be forever grateful to you. Please spare me!”\n\nIn a rare moment of mercy, you decide to imprison President Min. Something about his meek pleading touches you. You don\u0027t really trust him however, so he spends the rest of his life in jail, alone.\n\nYou have now conquered China. But this is only the beginning. From where the sun rises to where it sets are lands ripe for the taking. You declare yourself emperor and begin a new dynasty. You go on to become the greatest conqueror the world has ever known. Thanks to your unsurpassed military skills,\n\nYOU WIN.\n","page 86":"The prince yawns. Loudly.\n\n“Yeah... what?”\n\nHe sounds pretty bored, like he’s heard this all before from the likes of you his entire life.\n","page 85":"Yevgeni laughs. “You’re pretty cool.\"\n\nAfter you both down a few shots, he says, \"Let me guess, you want to make some sort of request of me.\"\n\nYou smile and nod.\n\nHe smiles back. \"I\u0027m smarter than I look.”\n","page 240":"General Nahru rises from his bearskin rug.\n\n\"Your idea is reasonable and I believe it is appropriate. A military alliance is one I can keep. Our military might will be multiplied.\"\n\nNahru steps toward you.\n\n\"Our day of glory is close at hand. When it comes you will reap your just rewards. Let us pray to each other\u0027s ancestors to seal the agreement.”\n\nYou pray with General Nahru at a shrine. After you both stand up, you give him a long firm handshake. Then you bid farewell to your new powerful ally.\n\nSecuring a pact with General Nahru greatly enhances your prestige. Your people deem the alliance cause to hold celebrations and parades in your honor. You are lauded by foreign diplomats as a brave and intelligent ruler.\n\nYou are ready for your final challenge. You finish preparing for negotiations with Governor Toleron.\n","page 121":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 242":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 120":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. Now you plan your meeting with the other nearby warlord and potential ally- Lord Kahn. You make your preparations.\n","page 241":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 6":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 125 yuan {-75} /////// Army: Small (-25)///////////////////Masses: High\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou travel to the mudslide devastated community and distribute donations. Sunburned peasants give you wide gap-toothed grins as you walk among them. Some applaud when you grab a two-handed saw and help remove a tree toppled over the middle of a road.\n\nWord spreads of your leadership during the relief effort. The populace now believes that you share their priorities and values. You become the people\u0027s favorite throughout the South.\n\nYour citizens now work together with your police to ward off infiltrators. Neighboring warlords no longer bother sending saboteurs or assassins to your realm. As a result your small Army\u0027s morale temporarily spikes.\n\nYour Treasury adviser reports that, although your Treasury has been dramatically reduced, you still possess just enough yuan to make the fiscal investment that will ensure you do not go broke. The Buddhist temple chastises your lack of piousness, but otherwise does not frown upon you for tending to your people. Some government professionals complain about not getting a raise, but most remain optimistic and continue to work for your benefit. They even finish construction on a castle, a sturdy, gated structure that will serve as your residence and enhance your capital\u0027s defenses.\n\nYou listen to news from faraway lands. The northern empire of General Nahru is experiencing internal turmoil and the General is barely holding onto his own life. He will not pose any threat to you, at least for now. Your other main rival, President Min, has been seen traveling East in your direction. He reportedly met with several minor warlords nearby. Other warlords had been skirmishing back and forth among each other, but none had acquired enough power to be worth your time.\n\nWhile the chaos in China has been wearing on the populace, hope has not been lost. The people long for a capable leader who will bring peace and create a sound economic environment. They say they would be willing to secede from their kingdom and join such a leader if one were to emerge.\n\nYour next move...\n\n------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 125 yuan {-75} /////// Army: Small (-25)///////////////////Masses: High\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n","page 145":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 266":"“The self-serving Duke Dizen- consider it done. To chaos.”\n\nWith that, he slips out of your room as quietly and stealthily as he entered. Later on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and make plans to tighten up your palace security.\n\nA few days later, you receive a scroll from one of Duke Dizen\u0027s messengers. You open it and it reads, “Duke Dizen, noble servant of the people, has died. He was fatally bitten by a poisonous cobra. Guards arrested a snake charmer dressed in black loitering near the Duke\u0027s tent. He refused to answer the guards\u0027 questions about his purpose for being in Duke Dizen\u0027s compound. The man was summarily executed on suspicion of assassination. A card with the pictograph of an eight-point star was later discovered on the snake charmer\u0027s body.\"\n\nYou burn the scroll and never mention this to anyone. You don\u0027t hear again from Iconoclast.\n\nWithout its leader, Dizen’s territory becomes unstable and plunges once again into unrest. It was an average power to begin with and now becomes even more irrelevant.\n\nYou refocus your attention on making more allies. You still have no close ties with any strong warlords. You need to secure one soon to avoid being seen as an easy target by predatory warlords. By this time General Nahru and Governor Toleron are the only two in China powerful enough to be worth meeting with. Who do you visit first?\n","page 5":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 100 yuan {-75} /////// Army: Small (-25)///////////////////Masses: Low {-25}\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: High\n\n-------------------------------\n\nYou donate a large chunk of funds to the temple. The high monks are overjoyed by your generosity and invite you to the nearest monastery for a lavish conversion ceremony. Facing a bronze idol of Buddha and lit red candles, you chant newly learned Buddhist hymns alongside monks in saffron colored robes. The monks compliment your devotion and spread word of your piousness far and wide.\n\nBack home however, your subjects deride you for throwing your precious yuan away currying favor with foreigners. The Masses, angry that you did not help them with their repairs, decide to give their support to other warlords. While it is nice to be liked by foreigners, you are not yet powerful enough to attract them to your kingdom, so they remain merely subjects of other warlords.\n\nWithout the Masses\u0027 base of support, your realm remains susceptible to sabotage. One nearby warlord raids your grain silo and pilfers the winter\u0027s supply of rice. Another burns an armory of your troops\u0027 weapons.\n\nOne night you are awakened by loud noises outside your sleeping tent. You open the door to see what is happening and see your personal bodyguards being cut down by a group of assassins. You recognize several peasants among them.\n\n\"Your death will be quick. Commander Wan is a merciful man,\" the one closest to you says as he chops your head off as a trophy for their leader.\n\nTHE END\n","page 144":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 265":"“The coward Lord Kahn it is. To chaos.”\n\nWith that, he slips out of your room as quietly and stealthily as he entered. Later on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and make plans to tighten up your palace security.\n\nA few days later, one of your scouts rushes into your tent, out of breath. He squeezes out words between gasps. “President Min…I have…urgent news…Lord Kahn...assassinated…last night…” You patiently wait for the soldier to catch his breath.\n\n“A servant noticed the foul odor of poison gas coming from the Lord\u0027s room and went in to check on him. He found Lord Kahn lying lifelessly in his bed, his body stiff and eyes rolled back in his head. The servant rang the alarm and guards quickly noticed a figure in black trying to escape the compound and they shot him dead with arrows. They found a card with the pictograph of an eight-point star on his body. He was probably the same assassin who had killed several warlords recently…”\n\nYou thank the soldier and dismiss him. You reflect on the news. Without its leader, Lord Kahn’s territory will soon fragment. It was not a major state to begin with and now becomes even more irrelevant.\n\nAfter you upgrade your palace security, you refocus on securing alliances. By now, other local leaders are no longer worth your time. You need to secure an alliance with a major warlord soon to avoid being seen as an easy target by predatory warlords. General Nahru and Governor Toleron are the only two powerful enough to be worth meeting with. Who do you visit first?\n","page 8":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 100 yuan {-75} /////// Army: Large (-75)///////////////////Masses: Low {-25}\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou raise your Army\u0027s wages, rewarding old veterans and attracting new recruits. On occasion you join your colonels at muster and personally inspect the raw cadets. Improved morale and increased enlistment soon transform your military into a formidable fighting machine.\n\nYour peasants however are envious of your soldiers and angry at you for tending to your Army before them. As a result the Masses give their support to other warlords. Your powerful Army\u0027s threat of force temporarily deters them from revolting and rival warlords from sabotaging you however. When President Min and his allies lay siege to your capital a week later, your mighty Army deals a crushing defeat to the hapless invaders.\n\nUnfortunately, spending such a large portion of your budget on your Army now means there is no way for you to improve your cash flow. As a result your Treasury soon runs out of money to pay your Army. Many of your soldiers desert you, leaving only those who served with you from the beginning.\n\nWeary of the bureaucratic bickering and threat of peasant revolt, your Army\u0027s morale declines by the day. Months later, General Nahru sends one million troops who, aided by the peasantry, vanquish your forces in a decisive battle. As Nahru\u0027s army overruns your former city, you pay your last visit to your late mother\u0027s grave. You see nothing left to do but grab your sword, and, trembling, shove it through your abdomen.\n\nTHE END\n","page 147":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 268":"“The delusional Toleron it is. To chaos.”\n\nWith that, he slips out of your room as quietly and stealthily as he entered. Later on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and make plans to tighten up your palace security.\n\nA few days later, a courier jogs into your tent. He kneels down before you.\n\n“I carry major news from the eastern provinces, President Min. Governor Toleron was assassinated two nights ago. It was a lone lunatic screaming something about chaos. The guards saw him shoot Governor Toleron in the chest with an arrow and quickly swarmed the assassin and chopped his head off…”\n\nSo ends the episode of the masked assassin. You never hear anything about him again and you don’t think you ever will. At least he did you a favor before he died.\n\nWithout its noble leader, Toleron’s territory soon fragments as warlords try to usurp his power. None of the pretenders have the allegiance of the masses like Toleron did, so the region descends into chaos once again. It looks like Iconoclast got his wish after all, at least in part, for now.\n\nYou ready yourself for the final challenge. You finish preparing for negotiations with General Nahru.\n","page 7":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 75 yuan (+150) /////// Army: Small (-25)///////////////////Masses: Low {-25}\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou hold long meetings with your director of horticulture to ensure that the project will be a success. After many hours of precise planning, you commission your planters to buy the best lychee seeds for planting in your most fertile soil. You eagerly anticipate the opening harvest and its boost to your economy.\n\nBefore your trees can bear any fruit however, the peasants are angry at you for ignoring their suffering. Some publicly question whether your heart has any compassion. Without the Masses\u0027 base of support, your realm remains susceptible to sabotage. One nearby warlord raids your grain silo and pilfers the winter\u0027s supply of rice. Another burns an armory of your troops\u0027 weapons.\n\nOne night you are awakened by loud noises outside your sleeping tent. You open the door to see what is happening and see your personal bodyguards being cut down by a group of assassins. You recognize several peasants among them.\n\n\"Your death will be quick. Commander Wan is a merciful man,\" the one closest to you says as he chops your head off as a trophy for their leader.\n\nTHE END\n","page 146":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 267":"“Nahru- that little boy. Very well. To chaos.”\n\nWith that, he slips out of your room as quietly and stealthily as he entered. Later on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and make plans to tighten up your palace security.\n\nA few days later, an advisor speaks up during a routine cabinet meeting. “I have been hesitant to tell you this before today because the rumors were unconfirmed, but now I believe I have heard enough reports from reliable sources to state this as fact. General Nahru has been assassinated.\"\n\nYour other advisors sit in slack-jawed silence. He continues, “The General\u0027s servants heard loud noises coming from his tent and ran in, only to discover General Nahru and a masked man frozen in place, facing each other, with each man\u0027s sword fixed in the other one\u0027s chest. Nahru was reputed to have been one of the most ferocious swordsman in the world, so the masked man had to have been equally impressive. I am not sure yet about the identity of the masked man, but I heard he was carrying a card with a pictograph of an eight-point star, like the ones left behind from the other assassinations. He may have been involved in those as well.”\n\nSo ends the episode of the masked assassin. You never hear anything again about him and you don’t think you ever will. At least he did you a favor before he died.\n\nLosing their charismatic leader so suddenly, Nahru’s troops are demoralized and lose their focus. Many desert his ranks. His empire crumbles and chaos reigns again in the north. None of the lesser warlords competing to take Nahru\u0027s place stand out from the rest. It looks like Iconoclast got his wish after all, at least in part, for now.\n\nYou ready yourself for the final challenge. You finish preparing for negotiations with Governor Toleron.\n","page 2":"                                                            \nYou command 18 thousand infantry and 5 thousand archers, each drilled and trained to be the best. Although you have no support units or advanced machines, you know that the battle is often not won by the best equipped, but by the most decisive.\n\nYour territory contains little infrastructure or arable soil. Although your castle is a majestic fortress providing a big defensive advantage for an occupying army, you decide it is time to set out and do battle. You will bring all 23 thousand soldiers with you. Crown Prince Lurdu, your eldest son, will stay and defend your capital from potential invaders. You have not spent as much time with him as you would have liked and he has grown into an insolent, manipulative, and petty brat. Lurdu\u0027s only saving grace is that, like you, he always finishes what he starts, all the way to the end. Retreat is never an option.\n\nTo your East is the ocean. You wish that one day engineers can devise a sea-faring vehicle that hold up in its tsunamis, but for now, the ocean is an impenetratable barrier. To your West is a barren desert. No people reside in it, and its conditions would decimate your army if they were to march through it.\n\nBeyond your Southern border is the medium sized territory of Governor Toleron. It is a land of dense forests and dry plains. His subjects are loyal to him and he has an army more than three times the size of yours, at 90 thousand troops. Fortunately for you, Toleron is a peacenik and using them solely to defend his empire. He has pledged not to increase the size of his standing army and is not at all an aggressor.\n\nTo your North are small Mongol tribes. They are neither organized nor united and are too distracted with each other to defend against you. While they do not own much technology or infrastructure, if you conquer them you will gain some additional tax revenue and possibly reinforcements, as well as strike more fear into the hearts of would be enemies.\n\nWhere do you expand your kingdom first?\n","page 149":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 1":"                                                 \nOnly one week has passed since you declared yourself Governor of this southern province. The majority of your subjects are ignorant of your ambitions and accomplishments. Outside your core group of devoted followers, precious few bother to differentiate between you and other warlords. To avoid death at the swords of your enemies, you will need to prioritize pressing concerns while juggling outspoken factions.\n\nAfter outfitting your militia, your Treasury is down to 200 yuan. If your Treasury ever reaches negative, you will be unable to pay your Workers or Army their wages. If that ever happens they will become infuriated and quit permanently and your campaign will come to a crashing halt. The peasants who make up the majority of your citizens are unfortunately very poor and thus your tax income is effectively zero. Your Treasury adviser suggests an idea to mass cultivate lychees, a small red fruit with juicy white flesh native to the South. Since lychees can only be grown in your Southern soil, exporting them to the North guarantees ample returns. It requires an investment of 75 yuan to plant the seeds, and patience to wait for the trees to mature. (If you make this choice, 75 yuan will be deducted from your current Treasury total. Two turns after that, 150 yuan will be added to your Treasury, then 300 yuan the turn immediately after that one, 600 yuan the turn immediately following, and so on.)\n\nYour Army is fierce, loyal, and small. Although there are no warlords with much larger forces in your immediate area, there are several nearby warlords rivaling you in power who each itch to add your territory to his realm. Your colonels report that a pay increase for your Army would raise conscription considerably, giving you a much stronger fighting force. (You begin with a Small army, which costs you 25 yuan in upkeep cost per turn. If you make this choice your Army will go from Small to Large, and cost you 75 yuan in upkeep cost per turn, effective immediately. No further upgrades are available for your army in this story.)\n\nMeanwhile, the professionals toiling for your government- masons, accountants, carpenters, iron workers, tailors, etc- are imploring for higher wages. Your advisers would like you to attract more capable skilled Workers to your domain as well, as peasantry does not exactly provide the best pool of candidates to help run a kingdom. (Your Workers begin with a rating of Low and costing you 25 yuan in wages per turn. If you make this choice your Workers rating will go from Low to High, and cost you 75 yuan in upkeep cost per turn, effective immediately. No further upgrades are available for your Workers.)\n\nThe Buddhist temple has yet to endorse any warlord for emperor. While Buddhism has propagated throughout China, your province is somehow the lone exception. Seeing an opportunity to gain more followers, the leaders of the religion request your donations and conversion to Buddhism in exchange for their support. Improving your relations with the Temple will ensure a favorable reputation with citizens of other kingdoms throughout China. (Your rating with the Buddhists starts at Low. If you make this choice a one-time cost of 50 yuan will be deducted from your Treasury and your rating will become High for the duration of the story.)\n\nFinally, there are still millions of people in your region who are undecided about which warlord to back. A sympathetic populace hides your person from enemy assassins. Your advisers tell you about a recent torrential mudslide that devastated the countryside where farmers live and work and ruined much of their infrastructure. The leaders of the peasants are pleading for help in repairing the destroyed houses and equipment. Aiding the peasants will ensure that the Masses are loyal to you. (Your rating with the Masses starts at Low. If you make this choice a one-time cost of 25 yuan will be deducted from your Treasury and your rating will become High for the duration of the story.)\n\nWhat do you do first:\n\n(The numbers in parentheses ( ) next to a faction in the Status Box signifies its per-turn upkeep cost to be effected on your Treasury after this turn is complete and before the next turn begins. The numbers in braces { } in the Status Box signify the one-time cost to upgrade the status of that particular faction.)\n\n------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 200 yuan {-75} /////// Army: Small (-25)///////////////////Masses: Low {-25}\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n","page 148":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 269":"“Nobody?\" Iconoclast arches an eyebrow. \"Are you sure?”\n\n“Yes,” you respond.\n\n“I don’t like it. I hope you know what you’re going up against. But I’ll acquiesce to your wishes if it means my ultimate goal can be achieved. Good luck. May chaos continue for eternity. To chaos.”\n\nWith that, he slips out of your room as quietly and stealthily as he entered. You never hear from the masked assassin ever again.\n\nYou listen for new reports of warlord assassinations, but no news comes. You suppose your words had an effect on your mysterious visitor, or at least you would like to think so.\n\nLater on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and tighten up your palace security.\n\nYou refocus on making alliances with powerful warlords. You need to secure one soon to avoid being seen as an easy target by predatory warlords. By this time General Nahru and Governor Toleron are the only two in China powerful enough to be worth meeting with. Who do you visit first?\n","page 4":"-------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 100 yuan {-75} /////// Army: Small (-25)///////////////////Masses: Low {-25}\n\n////////////////////////////////////////Workers: High (-75)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou announce salary raises for your professional Workers. They are happy to hear the news and your government\u0027s administrative efficiency improves greatly.\n\nHowever, the peasants grow envious of the Workers and look down on you for attending to your Workers before them. As a result they give their support to other warlords. Without the Masses\u0027 base of support, your realm remains susceptible to sabotage. One nearby warlord raids your grain silo and pilfers the winter\u0027s supply of rice. Another burns an armory of your troops\u0027 weapons.\n\nOne night you are awakened by loud noises outside your sleeping tent. You open the door to see what is happening and see your personal bodyguards being cut down by a group of assassins. You recognize several peasants among them.\n\n\"Your death will be quick. Commander Wan is a merciful man,\" the one closest to you says as he chops your head off as a trophy for their leader.\n\nTHE END\n","page 3":"                                                 \nYour kingdom rests on a solid foundation. The masses find you agreeable. Your government workers like you. You are respected by both your soldiers and the Buddhist temple. Even your treasury is healthy. However, in order to make good on its potential, a solid foundation requires expansion. You are not very knowledgeable in the art of war nor of administration, so the best way for you to grow your influence is to create alliances with other warlords.\n\nThere are three possible types of alliances you can make: the Arraigned Marriage, an unofficial and informal understanding that each party will wed their children to the other\u0027s, and which is usually ignored outside of the enjoined kingdoms; the Peace Agreement, an internationally recognized edict where the parties agree never to attack each other nor each other’s allies, and furthers peace; the Military Alliance, an internationally recognized edict where, in addition to never attacking each other nor each other’s allies, each party also provides troops and other military aid to the other as needed, and tends to increase involvement in war and violent conflict.\n\nSecuring alliances will earn you much prestige and bring you closer to your goal of uniting China. Your two biggest rivals whom you will need to win over are General Nahru to the north and Governor Toleron to the east. Besides Nahru and Toleron, there are also less powerful warlords nearby who may help or hurt your quest depending on your relations.\n\nOne day, an emissary from a faraway land visits your court.\n\n“I bring a message from Prince Yevgeni of Russia. He has not had any diplomatic relations with any Chinese politico, and would like you to be the first. He invites you to his court to experience one of Russia\u0027s famous winters.\n\n\"Many big cultural events are about to happen. The New Year\u0027s celebration is legendary. Russians don\u0027t just celebrate from the 31st to the 1st- but from the 31st all the way to January 10th. No liver is safe!\n\n\"Will you join the Prince at his court?”\n\nYour foreign policy advisors have informed you of this Prince Yevgeni. The prince is known as a good natured and naïve goofball who likes to have a good time. His father is the ruler of the kingdom of Russia, to the north of Mongolia and west of the barren wastelands.\n\nRussia has never meddled with the affairs of China. Perhaps the Prince would wish to begin a new policy one day when he himself ascends to the throne.\n\nDo you visit Prince Yevgeni, who has little political influence as of now, or ignore him and meet with two nearby warlords, Lord Kahn and Duke Dizen, who have more influence in China and are able to provide more immediate assistance? If you decline the prince’s offer he will not make the same offer again.\n","page 9":"Throngs of shouting supporters energize your army as it leaves for the countryside. Your army stays in high spirits as it marches towards the steppes of Mongolia. Soldiers placate their hunger with white rice and small game, picking the occasional cherry tree lining the road.\n\nYour spies report that the Mongolians still have not made preparations against your army. Their permanent state of disorganization means they have no chance of mounting any defenses whatsoever. You thank your diligent spies for the information and continue on your way. Your spies have never let you down.\n\nThe winding north road becomes a dirt path as it passes through the center of Clearbrook Forest. Suddenly, your second in command slumps over on his horse. You look over your shoulder and see an arrow through his chest. Looking behind you, you see more arrows flying toward your troops. You ascertain that the arrows are coming from the dense forest on both sides of the narrow path your troops are marching on. You cannot see where the enemy is however.\n\nDo you:\n","page 91":"The prince rolls his eyes.\n\n“You’re speaking to me like I was the tsar and not a prince. How do you expect me to have any say in important national matters like those? Man, you’re no fun. If I was tsar I would have you beheaded. Get out of here. I don’t want to see you anymore.” You ashamedly bow and quickly back out of his sight. You depart from Russia and return to your capital.\n\nYou are fortunate that Prince Yevgeni is not more serious-minded or else antagonizing him would have harsher consequences. You arrive back home in several days.\n\nYou turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 90":"\"Hrrrrrm...\" He considers your proposal.\n\n“Sure, why not? I don’t have any kids yet but I’ll let you know when I do.\" He makes eye contact with the two giggling young women laying at his side.\n\nYou agree to stay over for dinner and drinks to celebrate your agreement as well as the Russian New Year. While you wait to be joined by a few traveling diplomats, the Prince mutters an aside. \"This is the first time I’ve ever made an agreement with a foreign diplomat. Most of the them come here asking for formal treaties, like I was in charge or somethi-.”\n\nBefore the Prince can finish his sentence, an ornately dressed man saunters into the throne room. Wearing a bead-covered headdress, a sheepskin robe intricately lined with jade stones and pearls, and shoes made of gold silk, he smiles and walks toward you with cupped hands. \"It is my honor to meet you President Min. I am Khirnorek- chief diplomat of the Mongolian Kitan Empire.\"\n\n\"Thank you, thank you,\" you bow in reply.\n\nThen another man enters the room. Wearing a camel fur coat, he looks positively demure compared to Khirnorek. \"A pleasure to meet you all. I am Shalihasa, a courtier from Shah Kamaluka\u0027s court in Afghanistan. I bring a message of friendship from my shah. Prince Yevgeni, the future of Russia is bright in your hands. President Min, you are the best hope for a united China. Sir Khirnorek, the mighty Mongolian Kitan Empire is the envy of all rulers.\"\n\n\"Enough, guys,\" the Prince says. \"Let\u0027s eat. Giorgi!\" Prince Yevgeni puts two fingers up and his butler places several plates of food on the table as all three guests take their seats.\n\nYou indulge in whitefish, racks of lamb, smoked salmon, and caviar, while drinking copious amounts of honey vodka. In between mouthfuls of food, Khirnorek and Shalihasa discuss the civil war going on in China.\n\n“I heard from my friend that Lord Kahn hates it when people don\u0027t get straight to the point. I also hear he\u0027s been giving compliments to General Nahru,” says one.\n\n“Really? I heard that Duke Dizen also likes people who speak directly. But he\u0027s allied with Governor Toleron,” replies the other.\n\nThe rest of the dinner conversation is uneventful. Shalihasa excuses himself from the table after stuffing his belly and leaves. Khirnorek does likewise soon thereafter. Prince Yevgeni himself is completely passed out on his throne. You decide to retire to your quarters and sleep off the abundant meal.\n\nYou wake up and realize it would be more prudent to see to your kingdom\u0027s affairs than to resume senseless partying. You return home happy to have made a long term ally as well as having gleaned some useful information for your next sit-down. Which of the two will you visit now?\n","page 93":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 95":"“I\u0027m no longer in the mood for jokes. You are no different from all the other stupid diplomats who come to my court. Begone!”\n\nAnd with that you are dismissed. You depart Russia for your capital. You look back at the Prince\u0027s opulent palace as you leave, thinking of what might have been had you been more observant of your host\u0027s temperament.\n\nYou arrive back home in several days. You turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 94":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 150":"Kahn clenches his fists and his eyes widen. “How dare you waste my time!”\n","page 271":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 270":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners and bloody heads of vanquished enemies adorn the perimeter of General Nahru\u0027s compound. Hundreds of elite guards stand ramrod-straight at attention on either side of the path leading to the main war tent.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 152":"“You\u0027re not getting to the point. What is it that you want?”\n","page 273":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 151":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 272":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners and bloody heads of vanquished enemies adorn the perimeter of General Nahru\u0027s compound. Hundreds of elite guards stand ramrod-straight at attention on either side of the path leading to the main war tent.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 154":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 275":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners decorate the perimeter of General Nahru\u0027s compound, with hundreds of elite guards standing at attention on either side of the path leading to the main war tent. Along the way you see more than a few skulls and bloody body parts from vanquished enemies on display.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 153":"Kahn clenches his fists and his eyes widen. “How dare you waste my time!”\n","page 274":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 134":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 255":"Governor Toleron\u0027s smile disappears.\n\n“I do not believe that would be a wise policy. Political entanglements leading to wars on a massive scale can only bring suffering and pain. I do not favor aggression.\"\n\n\"I think it is time you leave.”\n","page 133":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 254":"“That is just what I had in mind as well. You are indeed a wise and capable ruler.\"\n\n\"Our alliance may lead to bigger and better things for us both,\" Toleron says. \"Who is to say that one of us should rule all of China by himself. As long as there is peace, there can be prosperity, and that is the best we can do as rulers.”\n\nHe sends you off with a gift of ten prize horses and twenty gold statues of Buddha. You have gained a reliable and invaluable ally.\n\nThis significant development of your new alliance marks a high point in your prestige throughout China. When you return home your subjects build statues and write biographies of you in your honor. You are hailed by citizens all over to be the one who will unify China.\n\nHaving secured powerful allies such as Governor Toleron and General Nahru, no one dares to attack you for fear of your allies’ collective military might and economic muscle. A few independent warlords hear of your diplomatic reputation and come to you offering alliances. You are able to secure agreements in your favor and rise to the top of China’s warlord hierarchy. Even Nahru and Toleron maintain an uneasy truce. And once the major powers settle their differences, lesser warlords fall in line.\n\nEvery warlord eventually signs an accord with you. Since you are allies with everyone, a peace settles across regions ravaged by war for decades. Everyone looks to you for leadership after you have brought them together as a cooperative. You are appointed the first ever President of China.\n\nYou lead a coalition of the more influential warlords in ratifying a Constitution that lays the foundation for a unified republic. You extend diplomatic channels to far-flung lands such as Turkey, Ethiopia, and Indonesia. Tsar Yevgeni, who has by now succeeded his father to the Russian throne, opens an embassy in your capital. International trade increases, military tactics sharpen, and diplomatic relations improve. China\u0027s economy burgeons, scientists invent powerful new technology, and explorers map out the four oceans. You use your persuasiveness to mold China into the greatest power in the world. Thanks to your diplomatic skills.\n\nYOU WIN\n","page 138":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 259":"He looks hatefully at you.\n\n“A thoughtful answer, but wrong. A man like yourself is bound to try and end the chaos and bring order to the people. This evil cannot pass.”\n\nIconoclast\u0027s comment lingers in the air before his dagger splits through it. You dodge the attack and run behind your nightstand.\n\nYou grab the candle and wield it as a weapon. Iconoclast flips the table aside and closes in. You fling the candle at his body. He skillfully parries it with his left forearm and it falls harmlessly to the floor.\n\nYou make a last ditch lunge at him but in one motion he dodges you and stabs you in the side. You wince and fall to the ground. He pulls the blade out of your ribcage and slices your throat to finish you off.\n\nTHE END\n","page 137":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 258":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nA few desperate warlords attack you, sensing weakness. General Nahru, true to his word, sends troops to help you. Your minor allies provide some military assistance as well. Your combined forces fight a multi-front war against several hostile warlords. Just as the tide begins to turn in your favor, General Nahru is tragically killed in battle. His son Lurdu takes over and, fed up with your uselessness to him and diminishing international stature, immediately betrays the alliance and cuts off help.\n\nYour kingdom’s morale plunges. Soon consecutive attacks by enemy forces penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 139":"You can see the gears turning in Lord Kahn\u0027s head.\n\n“I can agree to that. I assume your army is ready and prepared for battle?”\n\n\"Absolutely.\"\n\n“It remains to be seen whether I can count on you. May our oath secure prosperity and glory for us both.\n\n“As a token of our new friendship, I will give you a piece of advice. If you ever speak with General Nahru, show him some courtesy. He is one of the best leaders in China and deserves your respect.”\n\nYou thank Lord Kahn for his generous advice and return home with a new ally. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 0":"   \nThree legendary warlords. One land. Who will rule?\n\nWarlords: Strategic Conquest is a story set in medieval China. Each choice you make will logically determine how your campaign proceeds. Clues to help you select the best choices are woven into the narrative.\n\nBackground story:\n\nIt is 907 A.D., and China has seen better days. Riots spreading like wildfire ended three hundred years of Tang rule. Ordinary citizens overthrew their local politicians, fed up with inept government and rising taxes. The central government responded by increasing the allowance of military power to each province. Amidst the political unrest and military buildup, ambitious warlords everywhere saw a chance to grab their piece of the pie. These absolute leaders, exercising both military and civil power, declared their independence from Tang authority, seized private property, fought each other, and turned order upside down.\n\nChina\u0027s power vacuum longs to be filled by someone skilled enough to defeat his opponents and unite the country once again. Three particular warlords stand out:\n\nGovernor Toleron\n\nGrowing up in a poor Southern village, Toleron\u0027s childhood was marred by domestic violence. His seldomly employed father spent what little money his family had on liquor and gambling. The more he drank the angrier he would get at not being able to provide for his family. Toleron\u0027s mother would often receive the brunt of his father\u0027s drunken temper. Toleron stayed home for his mother\u0027s sake, but resolved to make a better life for himself. At the age of 20 he finally left home and started his own business as a fabric manufacturer. He worked hard and his company eventually became one of the most profitable businesses in the South. After transferring company ownership to his mother, Toleron joined the Tang army\u0027s civilian staff. Thanks to his knack for organization, he soon rose to a high administrative post. After the revolution began, a loyal following of soldiers urged him on to take over the provincial government. Toleron is highly regarded for his expertise in leveraging resources and logistics. Everyone serving under him believes he would make a wise emperor.\n\nGeneral Nahru\n\nAbandoned by his parents at the age of three, Nahru spent his childhood learning the power of violence while fighting for scraps on the streets. After learning what Tang soldiers get paid to do, he immediately enlisted in the army. In battle, Nahru fought fearlessly against Korean revolts and Mongol invasions. After years of heavily decorated service, he was promoted to Supreme Commander of the Northern Forces. He sees the revolution as a golden opportunity to carve out his own empire. Famous for his ruthlessness and hot temper, Nahru inspires as much fear as respect among his own colonels, but that keeps them focused lest they make a career-ending mistake. He is confident that he will one day take over the entire world, and no one would bet against him considering his unblemished battle record.\n\nPresident Min\n\nMin was born into an affluent family in western China. An only child, his mother was overprotective and smothered him with attention. He grew up shy, awkward, and shunned by peers at school. His only constant companions were books. In addition to helping him make excellent grades, the books also cultivated Min\u0027s fanciful imagination. He started to notice people\u0027s body language and what it would indicate. Over time he honed his communication skills until he could impress anyone he came across. He talked his way into mayorship of a burgeoning western city only a few weeks after graduating from Soh Lin University. Over the years Min has built a reputation as a peerless diplomat. When the rebellions began, several admiring towns voluntarily incorporated themselves into his territory and elected him president. With a persuasive tongue like his, there is no limit to what Min can accomplish.\n\nWho are you?\n","page 260":"He looks hatefully at you.\n\n“A thoughtful answer, but wrong. A man like yourself is bound to try and end the chaos and bring order to the people. This evil cannot pass.”\n\nIconoclast\u0027s comment lingers in the air before his dagger splits through it. You dodge the attack and run behind your nightstand.\n\nYou grab the candle and wield it as a weapon. Iconoclast flips the table aside and closes in. You fling the candle at his body. He skillfully parries it with his left forearm and it falls harmlessly to the floor.\n\nYou make a last ditch lunge at him but in one motion he dodges you and stabs you in the side. You wince and fall to the ground. He pulls the blade out of your ribcage and slices your throat to finish you off.\n\nTHE END\n","page 141":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 262":"He grins.\n\n“Chaos is the natural state of things and only within chaos can good arise. Order brings about stagnation and evil. Anyone who tries to rule is in effect unfit for rule because they are evil. No ruler can be good. China must remain in chaos.\"\n\n\"Yes,\" you mumble.\n\n“You understand the way things have to be. You are in a better position than I to spread our philosophy throughout China. However, I can eliminate your competitors, those wretches trying to unite the empire and return it to order. I will aid you by assassinating one Chinese warlord of your choice. Who do you want me to kill?\"\n","page 140":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 261":"He looks at you with disgust. “You’ll never amount to anything anyway. I’ll let your blood stain someone else’s blade. I’ll spare your life, but don’t even try to follow me.” He spins around, dashes out, and disappears into the night.\n\nLater on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and tighten up your palace security.\n\nYou never hear from the masked assassin ever again.\n\nYou recover in a few days from this harrowingly close call with death. During your recovery you reflect on the fact that you still have no close ties with any strong leaders. You need to secure one soon to avoid being seen as an easy target by predatory warlords. By now General Nahru and Governor Toleron are the only two rulers in China powerful enough to be worth meeting with. Who do you visit first?\n","page 143":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 142":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 263":"Your loud shout echoes through the dark compound. “You have made a fatal mistake,” he states. He lunges at your neck with his dagger.\n\nYou block the assassin\u0027s lead wrist with your arms. The blade slices through your forearm and blood begins to leak. Yet the pain is barely noticeable with your adrenaline pumping through your veins. You dash to the door in an attempt to make it out of your room. But before you reach the threshold you feel a sharp pain in your neck. Your legs shake and you collapse to the floor, dead from a dagger in the back of your neck.\n\nTHE END\n","page 167":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 288":"Governor Toleron\u0027s smile disappears.\n\n“I do not believe that would be a wise policy. Political entanglements leading to wars on a massive scale can only bring suffering and pain. I do not favor aggression.\"\n\n\"I think it is time you leave.”\n","page 166":"“Ohh Min. You are too much. Let’s get to the point. What exactly do you have in mind?\"\n","page 287":"“That is just what I had in mind as well. You are indeed a wise and capable ruler.\"\n\n\"Our alliance may lead to bigger and better things for us both,\" Toleron says. \"Who is to say that one of us should rule all of China by himself. As long as there is peace, there can be prosperity, and that is the best we can do as rulers.”\n\nHe sends you off with a gift of ten prize horses and twenty gold statues of Buddha. You have gained a reliable and invaluable ally.\n\nThis significant development of your new alliance greatly raises your prestige throughout China. When you return home your subjects hold celebrations and parades in your honor. You are lauded as wise and intelligent and you unifying China as inevitable.\n\nA few independent warlords hear of your diplomatic reputation and come to you offering alliances. You are able to secure agreements in your favor and rise to the top of China’s warlord hierarchy. No one dares to attack you for fear of your allies’ collective economic muscle.\n\nSeeing the advantages gained by your allies, more and more warlords follow suit until peace and prosperity spreads far and wide. The days of conflict come to an end when everyone has signed an alliance with you.\n\nSince you are now allied with everyone, a peace settles across regions ravaged by war for decades. Everyone looks to you for leadership after you have brought them together as a cooperative. You are appointed the first ever President of China.\n\nYou lead a coalition of the more influential warlords in ratifying a Constitution that lays the foundation for a unified republic. You extend diplomatic channels to far-flung lands such as Turkey, Ethiopia, and Indonesia. Tsar Yevgeni, who has by now succeeded his father to the Russian throne, opens an embassy in your capital. International trade increases, military tactics sharpen, and diplomatic relations improve. China\u0027s economy burgeons, scientists invent powerful new technology, and explorers map out the four oceans. You use your persuasiveness to mold China into the greatest power in the world. Thanks to your diplomatic skills,\n\nYOU WIN\n","page 169":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 168":"“Ohh Min. You are too much. Let’s get to the point. What exactly do you have in mind?\"\n","page 170":"Deep vertical furrows emerge at the base of Duke Dizen’s forehead. He stares at you grimly.\n\n“Is that something to be proud of?”\n","page 291":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nSome warlords start attacking you believing that you are not strong. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 172":"He smiles.\n\n“That is good to hear. Allies are a good thing. They keep citizens in both domains interested in affairs abroad, a precondition for a strong economy. And you need a strong economy in order to preserve a stable society.\"\n\n\"What type of alliance do you propose for us two?”\n","page 293":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 171":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 292":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 174":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 295":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 173":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 294":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 176":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 297":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 175":"“That is a wise proposal.”\n\nHe takes a few minutes to consult with his cabinet.\n\nHe turns back to you and beams. “A peaceful assurance is just what my domain needs to maintain stability. Today marks a glorious occasion. The day when our two peoples forge a bond that will never be broken. I hereby vow that we will never take arms against you or your allies.”\n\n\"And I pledge the same to you,\" you respond.\n\nDuke Dizen tells his assistant to bring his ceremonial chalice. He pours a bit of water into the golden goblet decorated with green jade and red rubies. He drinks from it. You do the same. Then you both cup your hands and bend your bodies forward three times in the final ritual of the alliance ceremony.\n\n“Since we are now allies, I feel we can talk a bit more freely amongst each other. You may or may not know this already, but I am friends with Governor Toleron. He is a hard working man who is very frugal. Sometimes too frugal, I think. But if you propose a beneficial alliance that does not eat into his treasury, he would be a willing ally.”\n\nYou thank the Duke for his generous advice and return home with a new ally. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 296":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 156":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 277":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 155":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 276":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners and bloody heads of vanquished enemies adorn the perimeter of General Nahru\u0027s compound. Hundreds of elite guards stand ramrod-straight at attention on either side of the path leading to the main war tent.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 158":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 279":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 157":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 278":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 159":"“Get out of my tent- immediately! Fools like you have no place here!\" He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you ever want to gain a powerful ally, President Min, you should speak to my friend General Nahru. When you meet him, go straight to the point, or tell him you are friends with Governor Toleron. He would just be delighted to hear that.\n\n\"Farewell President Min. Perhaps one day we will meet again.”\n\nYou return to your kingdom without an alliance. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 280":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 161":"He nods slowly.\n\n“In that case, what do you want from me?”\n","page 282":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 160":"You can see the gears turning in Lord Kahn\u0027s head.\n\n“I can agree to that. I assume your army is ready and prepared for battle?”\n\n\"Absolutely.\"\n\n“It remains to be seen whether I can count on you. May our oath secure prosperity and glory for us both.\n\n“As a token of our new friendship, I will give you a piece of advice. If you ever speak with General Nahru, show him some courtesy. He is one of the best leaders in China and deserves your respect.”\n\nYou thank Lord Kahn for his generous advice and return home with a new ally. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 281":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 163":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card left behind, etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 284":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 162":"Kahn pauses, then speaks coldly.\n\n“I commend you on the thought, but I have no use for the likes of you. Your fancy words do not hide your lack of substance and logic. Goodbye.”\n\nYou return to your kingdom after getting the cold shoulder from Lord Kahn. Now you plan your meeting with the other nearby warlord and potential ally- Duke Dizen. You make your preparations.\n","page 283":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 165":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card left behind, etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 286":"“An Arranged Marriage...well, yes I...guess we could do that. I will wed my firstborn to your first child of the opposite sex.\"\n\nToleron announces, \"May they live in a world of prosperity and peace, and may our friendship last for eternity.”\n\nYou return home with an arranged marriage for your child. Unfortunately, it holds no sway in international relations. Some desperate renegade warlords see this soft alliance as a sign of weakness and invade your territory. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deeper into your territory. Not having enough consequential alliances ultimately dooms your efforts to rule China.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYour last stand comes when a band of mercenaries attack your castle. You can hear them destroying your installations and ransacking your castle from inside your room. You try to come up with something clever to say to their leader. Before you know it, there are shadows of torches outside your room.\n\n“President Min. It is my pleasure to finally meet you,” one chap in an orange helmet says. \"With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the orange helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 164":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card left behind, etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 285":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nSome warlords start attacking you believing that you are not strong. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 188":"You’d be damned if you\u0027d just let some assassin kill you without fighting back. You kick at his solar plexus with all your might. He staggers back a couple of steps.\n\nYour attacker’s eyes reveal a look of surprise. He did not expect you to fight back. You may live through this assassination attempt after all, you prematurely think to yourself.\n\nHe recovers uncannily fast. With a lightning quick movement he closes in and unleashes a furious combination of dagger strikes; first at your leg, then your head, and finally your chest. Your reflexes take over and you miraculously parry each of the thrusts.\n\nYou counterattack with a flurry of punches and kicks of your own, while careful to avoid his blade. The assassin dodges your blows and slides his dagger through an opening into your chest. You slump over and your breath swiftly leaves you.\n\nTHE END\n","page 192":"You’d be damned if you\u0027d just let some assassin kill you without fighting back. You kick at his solar plexus with all your might. He staggers back a couple of steps.\n\nYour attacker’s eyes reveal a look of surprise. He did not expect you to fight back. You may live through this assassination attempt after all, you prematurely think to yourself.\n\nHe recovers uncannily fast. With a lightning quick movement he closes in and unleashes a furious combination of dagger strikes; first at your leg, then your head, and finally your chest. Your reflexes take over and you miraculously parry each of the thrusts.\n\nYou counterattack with a flurry of punches and kicks of your own, while careful to avoid his blade. The assassin dodges your blows and slides his dagger through an opening into your chest. You slump over and your breath swiftly leaves you.\n\nTHE END\n","page 191":"He looks at you with disgust. “You’ll never amount to anything anyway. I’ll let your blood stain someone else’s blade. I’ll spare your life, but don’t even try to follow me.” He spins around, dashes out, and disappears into the night.\n\nLater on, you question your guards but none of them noticed anything out of the ordinary. You chastise them for their incompetence and tighten up your palace security.\n\nYou never hear from the masked assassin ever again.\n\nYou recover in a few days from this harrowingly close call with death. During your recovery you reflect on the fact that you still have no close ties with any strong leaders. You need to secure one soon to avoid being seen as an easy target by predatory warlords. By now General Nahru and Governor Toleron are the only two rulers in China powerful enough to be worth meeting with. Who do you visit first?\n","page 194":"Your delegation reaches the eastern territory of Governor Toleron. He is a major presence in China due to his realm’s economic prosperity and contentment among his subjects. Toleron is known to be a diligent, peaceful, frugal, and pragmatic ruler.\n\nHis meeting quarters are sparse but elegant, and he approaches you warmly. He greets you. “A thousand welcomes, auspicious ruler. Your presence honors me and my citizens.”\n","page 193":"Your loud shout echoes through the dark compound. “You have made a fatal mistake,” he states. He lunges at your neck with his dagger.\n\nYou block the assassin\u0027s lead wrist with your arms. The blade slices through your forearm and blood begins to leak. Yet the pain is barely noticeable with your adrenaline pumping through your veins. You dash to the door in an attempt to make it out of your room. But before you reach the threshold you feel a sharp pain in your neck. Your legs shake and you collapse to the floor, dead from a dagger in the back of your neck.\n\nTHE END\n","page 196":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 195":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners and bloody heads of vanquished enemies adorn the perimeter of General Nahru\u0027s compound. Hundreds of elite guards stand ramrod-straight at attention on either side of the path leading to the main war tent.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 198":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 197":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 178":"“Hrrmph,\" Duke Dizen grunts.\n\n\"Even my patience has limits. You and I are just too different.” He gets up to leave, but suddenly pauses. There is a twinkle in his eye.\n\n“If you are looking for allies, you will want to speak with my friend Governor Toleron. Try to speak to him with an angry tone, or tell him of your admiration of General Nahru. He would be delighted to hear that.\"\n\n\"Goodbye President Min. Perhaps one day we shall meet again.”\n\nYou return to your kingdom without an alliance. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 299":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 177":"Duke Dizen\u0027s face hardens.\n\nHe speaks distantly. “I have done my best to understand your attempt at reason, but find no advantage in continuing this conversation.” He stands up from his seat and walks out of his conference room, followed by his cabinet and entourage.\n\nYou return to your kingdom after getting the cold shoulder from Duke Dizen. By now, other local leaders are no longer worth your time. General Nahru and Governor Toleron are the only two warlords powerful enough to be worth meeting with. Who do you visit first?\n","page 298":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 179":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 181":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 180":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 183":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 182":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 185":"Your mystery visitor relaxes, seeing that you have no intentions other than finding out who he is. He keeps the dagger trained at your throat with one hand and lifts the black cloth from his face with the other.\n\n“You do not react like the other warlords. My name is Iconoclast. Answer this question correctly, and I may spare your life.\n\n\"If, say, all other warlords in China disappeared, and you were the last one left, what would you do?\"\n","page 184":"One night, you have trouble sleeping. Your recent negotiations with rival warlords have been wearing on you, and your impending meeting with one of the most powerful leaders in China weighs on your mind as well.\n\nYou sit up in your bed and look for the candle. You light it up and to your surprise a shadowy figure crouches silently between you and the door.\n\nHe looks you in the eye, and then takes several silent steps toward you. He holds a sharp dagger in his right hand. His face is entirely covered by a black cloth, except a slit over his eyes, and his clothing\u0027s black cotton dampens any sound.\n\nDo you:\n","page 187":"Your loud shout echoes through the dark compound. “You have made a fatal mistake,” he states. He lunges at your neck with his dagger.\n\nYou block the assassin\u0027s lead wrist with your arms. The blade slices through your forearm and blood begins to leak. Yet the pain is barely noticeable with your adrenaline pumping through your veins. You dash to the door in an attempt to make it out of your room. But before you reach the threshold you feel a sharp pain in your neck. Your legs shake and you collapse to the floor, dead from a dagger in the back of your neck.\n\nTHE END\n","page 186":"He charges up to you, then gathers himself and kicks you. You feel heavy thumps bruising your back and sides. You double over in severe pain. What do you do now?\n","page 199":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 19":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 25 yuan {-75} /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: High\n\n-------------------------------\n\nYou donate a large chunk of funds to the temple. The high monks are overjoyed by your generosity and invite you to the nearest monastery for a lavish conversion ceremony. Facing a bronze idol of Buddha and lit red candles, you chant newly learned Buddhist hymns alongside monks in saffron colored robes. The monks compliment your devotion and spread word of your piousness far and wide.\n\nCitizens throughout China approve of you. Unfortunately, you are not yet powerful enough to attract immigrants to your kingdom. They remain subjects of other warlords. You return home.\n\nUpon arrival, you hear to your surprise that President Min and his allies have marched their armies to a position a few miles outside your castle. \"No rest for the weary,\" you mutter to yourself.\n\nYour militia knocks on every door rallying citizens to help defend your city. The next day, Min and his allies unfurl a large white banner half a mile away from your castle. It reads:\n\n\"Astute Governor Toleron, we offer you a proposition. If you relinquish your claim to China and open your castle gate, we will spare the lives of everyone inside. Otherwise we will have no choice but to lay siege to your castle. At that point, we will no longer show mercy.\"\n\nYou keep your gate closed. They stay true to their word and blockade your castle. Weeks pass, but your citizenry\u0027s faith in your guidance keeps their spirits high. The attacking force, on the other hand, begins to lose cohesiveness. One warlord cites your small Army and insists on launching a full scale attack on your walls. Another advocates a long-term siege, using their pooled advantage in resources to wear you out, taking years if need be. Another has citizens back home pushing for more attention to other matters and would rather call off the attack completely. President Min is unsure of what to do. He is not quite prepared for actual bloodshed, thinking originally that his larger forces would induce your surrender. On the other hand, resigning so easily would be a bitter pill to swallow. After much bickering and deliberation, they halfheartedly send their troops to attack your walls.\n\nFoot soldiers carrying rope ladders charge at your parapets. Your archers respond with barrages of burning arrows. Many attackers expire before reaching your walls. The ones who do encounter dense fire as they climb up their ladders. Some fall to their doom when your warriors cut through their rope. Those who manage to reach the top meet ferocious resistance from everyone stationed inside. Sparks fly between clanging swords while crimson blood flows readily over the battleground.\n\nYour ranks gradually shrink, but for each of your warriors killed in battle, the invaders lose five of theirs. Without a strong leader, the remaining attackers outside your castle lose their resolve and give up. Remnants of the invading force disperse, to the cheers of your triumphant defenders.\n\nWarlords all over China learn of your improbable victory. Many now think so little of President Min that he will never wield much diplomatic influence again. Unfortunately, your outlook is no brighter. Raising your workforce\u0027s wages without first improving cash flow has depleted your funds. You will not be able to keep both your Workers and Army.\n\nYou allocate your remaining resources to your military since it keeps you safe. Soon, your professionals desert you, leading to inefficiency throughout your kingdom. Your castle falls into disrepair, military supplies dwindle, and rations become scarce.\n\nWhen General Nahru regains control of his forces and leads one million troops to your castle a couple of months later, your city is already at half-strength. Unlike President Min, General Nahru\u0027s army is stout and well trained. They surround your castle and quickly overwhelm your defenses. All of your troops eventually die in battle.\n\nAs you meet for the last time with your most trusted advisers in your throne room, General Nahru\u0027s commandos barge inside without warning. They forcefully bind you and your advisers\u0027 hands behind your backs. You are then all led blindfolded to a gravelly patch of soil outside. Haunting regrets and pleasant memories slowly float into your mind.\n\n\"Ready.\"\n\n\"Aim.\"\n\n\"Fire!\"\n\nYour spirit leaves its arrow-riddled body before your head hits the ground.\n\nTHE END\n","page 18":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 25 yuan {-75} /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: High (-75)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou announce salary raises for your professional Workers. They are happy to hear the news and your government\u0027s administrative efficiency greatly improves.\n\nJust days later, you hear to your surprise that President Min and his allies have marched their armies to a position a few miles outside your castle. \"No rest for the weary,\" you mutter to yourself.\n\nYour militia knocks on every door rallying citizens to help defend your city. The next day, Min and his allies unfurl a large white banner half a mile away from your castle. It reads:\n\n\"Astute Governor Toleron, we offer you a proposition. If you relinquish your claim to China and open your castle gate, we will spare the lives of everyone inside. Otherwise we will have no choice but to lay siege to your castle. At that point, we will no longer show mercy.\"\n\nYou keep your gate closed. They stay true to their word and blockade your castle. Weeks pass, but your citizenry\u0027s faith in your guidance keeps their spirits high. The attacking force, on the other hand, begins to lose cohesiveness. One warlord cites your small Army and insists on launching a full scale attack on your walls. Another advocates a long-term siege, using their pooled advantage in resources to wear you out, taking years if need be. Another has citizens back home pushing for more attention to other matters and would rather call off the attack completely. President Min is unsure of what to do. He is not quite prepared for actual bloodshed, thinking originally that his larger forces would induce your surrender. On the other hand, resigning so easily would be a bitter pill to swallow. After much bickering and deliberation, they halfheartedly send their troops to attack your walls.\n\nFoot soldiers carrying rope ladders charge at your parapets. Your archers respond with barrages of burning arrows. Many attackers expire before reaching your walls. The ones who do encounter dense fire as they climb up their ladders. Some fall to their doom when your warriors cut through their rope. Those who manage to reach the top meet ferocious resistance from everyone stationed inside. Sparks fly between clanging swords while crimson blood flows readily over the battleground.\n\nYour ranks gradually shrink, but for each of your warriors killed in battle, the invaders lose five of theirs. Without a strong leader, the remaining attackers outside your castle lose their resolve and give up. Remnants of the invading force disperse, to the cheers of your triumphant defenders.\n\nWarlords all over China learn of your improbable victory. Many now think so little of President Min that he will never wield much diplomatic influence again. Unfortunately, your outlook is no brighter. Raising your workforce\u0027s wages without first improving cash flow has depleted your funds. You will not be able to keep both your Workers and Army.\n\nYou allocate your remaining resources to your military since it keeps you safe. Soon, your professionals desert you, leading to inefficiency throughout your kingdom. Your castle falls into disrepair, military supplies dwindle, and rations become scarce.\n\nWhen General Nahru regains control of his forces and leads one million troops to your castle a couple of months later, your city is already at half-strength. Unlike President Min, General Nahru\u0027s army is stout and well trained. They surround your castle and quickly overwhelm your defenses. All of your troops eventually die in battle.\n\nAs you meet for the last time with your most trusted advisers in your throne room, General Nahru\u0027s commandos barge inside without warning. They forcefully bind you and your advisers\u0027 hands behind your backs. You are then all led blindfolded to a gravelly patch of soil outside. Haunting regrets and pleasant memories slowly float into your mind.\n\n\"Ready.\"\n\n\"Aim.\"\n\n\"Fire!\"\n\nYour spirit leaves its arrow-riddled body before your head hits the ground.\n\nTHE END\n","page 301":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 300":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 302":"General Nahru rises from his bearskin rug.\n\n\"Your idea is reasonable and I believe it is appropriate. A military alliance is one I can keep. Our military might will be multiplied.\"\n\nNahru steps toward you.\n\n\"Our day of glory is close at hand. When it comes you will reap your just rewards. Let us pray to each other\u0027s ancestors to seal the agreement.”\n\nYou pray with General Nahru at a shrine. After you both stand up, you give him a long firm handshake. Then you bid farewell to your new powerful ally.\n\nThis significant development of your new alliance greatly raises your prestige throughout China. When you return home your subjects hold celebrations and parades in your honor. You are lauded as brave and intelligent and you unifying China as inevitable.\n\nA few independent warlords hear of your diplomatic reputation and come to you offering alliances. You are able to secure agreements in your favor and rise to the top of China’s warlord hierarchy. No one dares to attack you for fear of your allies’ collective military might.\n\nEvery warlord eventually signs an accord with you. Since you are allies with everyone, a peace settles across regions ravaged by war for decades. Everyone looks to you for leadership after you have brought them together as a cooperative. You are appointed the first ever President of China.\n\nYou lead a coalition of the more influential warlords in ratifying a Constitution that lays the foundation for a unified republic. You extend diplomatic channels to far-flung lands such as Turkey, Ethiopia, and Indonesia. Tsar Yevgeni, who has by now succeeded his father to the Russian throne, opens an embassy in your capital. International trade increases, military tactics sharpen, and diplomatic relations improve. China\u0027s economy burgeons, scientists invent powerful new technology, and explorers map out the four oceans. You use your persuasiveness to mold China into the greatest power in the world. Thanks to your diplomatic skills,\n\nYOU WIN\n","page 11":"You enter Prince Yevgeni’s court.\n\nDespite the wintry season, conditions inside his throne room are quite pleasant. His friends, courtiers, and jesters are all over the room. A couple of scantily clad young women lay at his side. Wrestling posters and bottles of Russian alcohol adorn the interior.\n\nHow do you greet Prince Yevgeni?\n","page 10":"You march your 23 thousand soldiers against Governor Toleron. He meets you behind his border with a large contingent of his army.\n\nAlthough you expected a hard fight, nothing prepared you for so many factors being on Toleron\u0027s side. No military tactic can overcome Toleron\u0027s peasants aiding his troops, their knowledge of familiar terrain, his soldiers fighting to protect their homeland, and their vast advantage in numbers.\n\nYou lead a spirited charge at Toleron\u0027s tent but take heavy losses. Your ranks steadily thin and when it no longer looks like you have a chance of winning, your troops desert you and you are surrounded by Toleron\u0027s soldiers. Even in the face of death you are filled with diatribe and rage. It looks like you were not cut out to be a general after all, or perhaps you did not think it through enough. Your stupid decision ends in your premature defeat.\n\nTHE END\n","page 13":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 12":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 21":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 25 yuan {-75} /////// Army: Large (-75)///////////////////Masses: High\n\n////////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou raise your Army\u0027s wages, rewarding old veterans and attracting new recruits. Improved morale and increased enlistment soon transform your military into a formidable fighting machine. Days later, when President Min and his allies lay siege to your capital, your mighty Army crushes the hapless invaders.\n\nUnfortunately, increasing the size of your Army puts unbearable strain on your Treasury. Without any income, you are neither able to maintain a larger Army nor keep both your Workers and a smaller Army. You decide to allocate your remaining resources to your military since it keeps you safe.\n\nWith each passing day, more soldiers desert you; only the veterans who have served your Army since its initial inception remain. Your Workers likewise resign en masse, leading to inefficiency throughout your kingdom. Your castle falls into disrepair, military supplies dwindle, and rations become scarce.\n\nWhen General Nahru regains control of his forces and leads one million troops to your castle a couple of months later, your city is already at half-strength. Unlike President Min, General Nahru\u0027s army is stout and well trained. They surround your castle and quickly overwhelm your defenses. All of your troops eventually die in battle.\n\nAs you meet for the last time with your most trusted advisers in your throne room, General Nahru\u0027s commandos barge inside without warning. They forcefully bind you and your advisers\u0027 hands behind your backs. You are then all led blindfolded to a gravelly patch of soil outside. Haunting regrets and pleasant memories slowly float into your mind.\n\n\"Ready.\"\n\n\"Aim.\"\n\n\"Fire!\"\n\nYour spirit leaves its arrow-riddled body before your head hits the ground.\n\nTHE END\n","page 24":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 50 yuan (+300) /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: High\n\n-------------------------------\n\nYou donate a sizable chunk of funds to the Temple. The high monks are overjoyed by your generosity and invite you to the nearest monastery for a lavish conversion ceremony. Facing a bronze idol of Buddha and lit red candles, you chant newly learned Buddhist hymns alongside monks in saffron colored robes. The monks compliment your devotion and spread word of your piousness far and wide.\n\nYour standing among foreign citizens does improve, but the state of your sovereignty remains too volatile for immigration to your kingdom. They remain subjects of other warlords.\n\nIn the meantime, your relationship with domestic tradesmen worsens. Disappointed by your stingy ways, your Workers followed through on their threats of mass desertions while you visited the Buddhist monks. Professionals leave your fallow kingdom for greener pastures. This brain drain leads to inefficiency throughout your kingdom. Your castle falls into disrepair, military supplies dwindle, and rations become scarce.\n\nUpon returning from the monastery, you learn that General Nahru had conquered all of northern China and, upon hearing of your domestic turmoil, decided that this would be the perfect opportunity to dispose of you. He begins to accumulate troops along your northern border.\n\nYou regret ignoring your skilled tradesmen\u0027s demands. You quickly enact labor reforms for professionals- raising wages, increasing vacation time, and even offering free education for their children.\n\nYour attempt at restoring your workforce comes a bit late. A week later, when General Nahru marches one million troops to your castle, many government posts remain unmanned. Unlike President Min, General Nahru\u0027s army is sophisticated and well trained. They surround your castle and break through your depleted defenses. Your lines are pushed back towards your keep.\n\nSoon, you hear metallic sounds and shouts outside your inner sanctum. While you weigh your options, fire suddenly engulfs your compound. You immediately try to escape but fail. No one can hear your cries as you are burned alive.\n\nTHE END\n","page 23":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 50 yuan (+300) /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: High (-75)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou announce salary raises for your professional Workers. They are happy to hear the news and your government\u0027s administrative efficiency greatly improves.\n\nThanks to your careful strategic planning, you have increased your kingdom\u0027s cohesiveness and prestige, developed an economy that generates lots of income, and maintained peace throughout your realm. Your citizens are content and recognize you as a wise leader.\n\nMeanwhile, General Nahru has wiped out his enemies and now rules northern China unopposed. However, he is incensed at your growing opposition to his goal of complete world domination. Your scouts report that General Nahru has been amassing enough troops along your northern border to launch a heavy assault.\n\nDo you:\n\n------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 50 yuan (+300) /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: High (-75)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n","page 25":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 50 yuan (+300) /////// Army: Large (-75)///////////////////Masses: High\n\n//////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou raise your Army\u0027s wages, rewarding old veterans and attracting new recruits. On occasion you join your colonels at muster and personally inspect the raw cadets. Improved morale and increased enlistment soon transform your military into a formidable fighting machine.\n\nWhile other warlords are impressed by your newfound might, your domestic tradesmen are unswayed. Disappointed by your stingy ways, your Workers followed through on their threats of mass desertions while you focused on your soldiers. Workers leave your fallow kingdom for greener pastures. This brain drain leads to inefficiency throughout your realm. Your castle falls into disrepair, military supplies dwindle, and rations become scarce.\n\nYou regret ignoring your skilled tradesmen\u0027s demands. You quickly enact labor reforms for professionals- raising wages, increasing vacation time, and even offering free education for their children.\n\nYour new soldiers have barely left basic training when you learn that General Nahru had conquered all of northern China and, upon hearing of your domestic turmoil, decided that this would be his best opportunity to dispose of you. He begins to accumulate troops along your northern border.\n\nYour attempt at restoring your workforce comes a bit late. A week later, when General Nahru marches one million troops to your castle, many government posts remain unmanned.\n\nGeneral Nahru, aware of your sizable Army, sieges your castle instead of risking his troops in an immediate clash. You too are wary of engaging the enemy, knowing that your inexperienced rookies are no match for General Nahru\u0027s seasoned veterans. You wait behind your stone walls and hope that Nahru succumbs to attrition before you do.\n\nUnlike President Min, General Nahru\u0027s army is well disciplined. No supplies or persons enter or exit your capital for months while you cling onto your defensive fortifications. Meanwhile, the lack of qualified professionals cause breakdowns in every area of your kingdom. Inefficiency saps funds from your Treasury, decreases your Army\u0027s morale, and damages your relations with the Masses and the Buddhist temple.\n\nThe siege weakens your kingdom day by day. General Nahru waits until the odds turn in his favor. He then attacks. A long bloody battle ends with General Nahru\u0027s soldiers capturing you alive. Recognizing your symbolic significance as the last major obstacle between him and all of China, General Nahru leaves your severed scalp on a stake outside your former castle.\n\nTHE END\n","page 20":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 0 yuan (+150) /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou hold long meetings with your director of horticulture to ensure that the project will be a success. After many hours of precise planning, you commission your planters to buy the best lychee seeds for planting in your most fertile soil. You eagerly anticipate the opening harvest and its boost to your economy.\n\nJust as your laborers sow the last batch of seeds, you learn to your surprise that President Min and his allies have marched their armies to a position a few miles outside your castle. \"No rest for the weary,\" you mutter to yourself.\n\nYour militia knocks on every door rallying citizens to help defend your city. The next day, Min and his allies unfurl a large white banner half a mile away from your castle. It reads:\n\n\"Astute Governor Toleron, we offer you a proposition. If you relinquish your claim to China and open your castle gate, we will spare the lives of everyone inside. Otherwise we will have no choice but to lay siege to your castle. At that point, we will no longer show mercy.\"\n\nYou keep your gate closed. They stay true to their word and blockade your castle. Weeks pass, but your citizenry\u0027s faith in your guidance keeps their spirits high. The attacking force, on the other hand, begins to lose cohesiveness. One warlord cites your small Army and insists on launching a full scale attack on your walls. Another advocates a long-term siege, using their pooled advantage in resources to wear you out, taking years if need be. Another has citizens back home pushing for more attention to other matters and would rather call off the attack completely. President Min is unsure of what to do. He is not quite prepared for actual bloodshed, thinking originally that his larger forces would induce your surrender. On the other hand, resigning so easily would be a bitter pill to swallow. After much bickering and deliberation, they halfheartedly send their troops to attack your walls.\n\nFoot soldiers carrying rope ladders charge at your parapets. Your archers respond with barrages of burning arrows. Many attackers expire before reaching your walls. The ones who do encounter dense fire as they climb up their ladders. Some fall to their doom when your warriors cut through their rope. Those who manage to reach the top meet ferocious resistance from everyone stationed inside. Sparks fly between clanging swords while crimson blood flows readily over the battleground.\n\nYour ranks gradually shrink, but for each of your warriors killed in battle, the invaders lose five of theirs. Without a strong leader, the remaining attackers outside your castle lose their resolve and give up. Remnants of the invading force disperse, to the cheers of your triumphant defenders.\n\nWarlords all over China learn of your improbable victory. Many now think so little of President Min that he will never wield much diplomatic influence again.\n\nWhile recovering from this clash, you hear from spies that General Nahru is preoccupied with capturing and executing disloyal subjects in his kingdom and consolidating his power base in northern China. He will not be free to attack you anytime soon. No other warlords remain much of a threat.\n\nOn the domestic front, many Workers threaten to desert you and work for other warlords if you do not increase their wages now. The Temple also grows impatient with your lack of communication. And your colonels still suggest an increase in conscription.\n\nWhat will you do next?\n\n------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 0 yuan (+150) /////// Army: Small (-25)///////////////////Masses: High\n\n//////////////////////////////////////Workers: Low (-25)/////////////////Buddhists: Low {-50}\n\n-------------------------------\n","page 200":"Governor Toleron sits in stunned silence.\n\nHe gives you a strange look.\n","page 202":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 201":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 204":"“You are fortunate I do not believe in violence or I would have had you beheaded already!” Toleron\u0027s smile has vanished, replaced by a menacing look.\n\nHe makes eye contact with his guards and tilts his head in your direction. They forcefully push you towards the exit. You are given an unceremonious boot to the curb.\n","page 203":"“I have been looking forward to a meeting with the great President. Which kind of alliance do you think is appropriate for us at this time?”\n","page 205":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nSome warlords start attacking you believing that you are not strong. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 33":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 200 yuan (+600) /////// Army: Large (-75)///////////////////Masses: High\n\n/////////////////////////////////////////Workers: High (-75)/////////////////Buddhists: High\n\n-------------------------------\n\nYou donate a big chunk of funds to the temple. The high monks are overjoyed by your generosity and invite you to the nearest monastery for a lavish conversion ceremony. Facing a bronze idol of Buddha and lit red candles, you chant newly learned Buddhist hymns alongside monks in saffron colored robes. The monks compliment your devotion and spread word of your piousness far and wide.\n\nTales of your empire\u0027s prosperity and your popularity among your people travel with those of your piety. When citizens all over China learn of your realm\u0027s high quality of life, not only do the best, brightest, and bravest flock to your kingdom, but some cities even secede from their local warlord and voluntarily raise your banner.\n\nDespite fierce crackdowns by the General\u0027s men, half of General Nahru\u0027s provinces secede from his kingdom and join yours. Nahru is enraged at you and vows to conquer you. However, it is obvious to his colonels that you now have the most powerful army in China as well as the strongest economy, smartest professionals and highest public support. They are not suicidal enough to provoke you and so execute the raving General instead.\n\nAs if there was any doubt left about your victory, each of General Nahru’s remaining cities secede and join your empire. President Min, along with all the other surviving warlords, long ago pledged his allegiance to you and surrendered all his holdings. You declare yourself emperor and begin your own dynasty. Thanks to your administrative skills,\n\nYOU WIN.\n\n \n","page 208":"“That is just what I had in mind as well. You are indeed a wise and capable ruler.\"\n\n\"Our alliance may lead to bigger and better things for us both,\" Toleron says. \"Who is to say that one of us should rule all of China by himself. As long as there is peace, there can be prosperity, and that is the best we can do as rulers.”\n\nHe sends you off with a gift of ten prize horses and twenty gold statues of Buddha. You have gained a reliable and invaluable ally.\n\nThis alliance solidifies your status as one of the more powerful warlords in China. Your prestige rises, both inside and outside your kingdom. Your people deem the alliance cause to hold celebrations and parades in your honor. You are lauded by foreign diplomats as wise and intelligent.\n\nYou are ready for your final challenge. You finish preparing for negotiations with General Nahru.\n","page 207":"“An Arranged Marriage...well, yes I...guess we could do that. I will wed my firstborn to your first child of the opposite sex.\"\n\nToleron announces, \"May they live in a world of prosperity and peace, and may our friendship last for eternity.”\n\nYou return home with an arranged marriage for your child. Unfortunately, it holds no sway in international relations. Some hawkish warlords see you lacking in close ties with strong warlords and invade your territory. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deeper into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYour last stand comes when your castle comes under attack by an up-and-coming warlord known as the Red Helmet. His army destroys your battalions and ransacks your castle. To avoid the humiliation of your severed scalp being put on display outside your former castle, you commit suicide in your throne room by burning yourself to a crisp.\n\nTHE END\n","page 209":"Governor Toleron\u0027s smile disappears.\n\n“I do not believe that would be a wise policy. Political entanglements leading to wars on a massive scale can only bring suffering and pain. I do not favor aggression.\"\n\n\"I think it is time you leave.”\n","page 37":"Your archers scramble to prepare their bows for a volley. In the meantime your men have nowhere to hide from the arrows coming at them.\n\n“Ready!\" you roar. \"Aim into the forest. Fire!”\n\nYou watch as your archers’ arrows fly left and right. Your new second in command echoes your orders and another volley enters the trees.\n\nThe situation hardly changes. Your men continue to be under heavy fire and you don’t see any dead bodies in the trees. It is simply impossible to gauge where the enemy is hiding while standing on the road.\n\n“Infa-…“ Before you finish giving your new orders one arrow catches you in the neck. You fall off your horse and crumple to the ground. Your last thought is of the tactical mistake you made in firing at a covered enemy.\n\nTHE END\n","page 36":"Infantry scatter to both sides of the forest. Not too long passes before you see them join the enemy in battle. Your men take a few initial losses while entering the trees but are able to uncover the enemy from their hiding spots. Your warriors eviscerate the enemy force, with your infantry\u0027s superior hand to hand combat ability overwhelming enemy archers.\n\nOne of your lieutenants drags a wounded soldier to you. “This is their leader,” he says.\n\nYou look at the disheveled soldier. He looks back at you with contempt.\n\n“Who are you and why did you attack me?” you ask.\n\n“I am a captain in Crown Prince Lurdu\u0027s royal guard. After you left your castle Lurdu left the capital to retrieve his secret army of 15 thousand men and is currently on his way back to claim the city as his own. He sent me out here to destroy your army while he usurps your power. You are a horrible ruler and he will annihilate you.”\n\n“Lurdu! That scoundrel!” He rubbed you the wrong way even back when he used to take your battalions and make misguided excursions against his personal enemies. Now that insolent brat is trying to start a revolt in your capital. Even worse, he knows all the brutal things you have done and can actually turn your people against you. All you can think about now is how to execute your traitorous son. After you chop off the captain’s head,\n\nDo you:\n","page 39":"You must not reverse your army\u0027s momentum. You march on to Mongolia.\n\nThe dawn had hardly begun when you gaze down at the first tribe. Fifteen gigantic yurts, or tents, flap in the cool breeze. There is no human activity save for a few early risers tending their goats. You waste no time charging into the yurts and raining chaos onto the unsuspecting camp. As predicted, the Mongolians had no idea you were coming and did not conscript any soldiers. The first settlement surrenders quickly, followed by their neighbors. You slaughter their leaders, force their successors to pay monthly tributes, take a few young women as trophies, and commandeer what supplies your army can carry.\n\nEven in victory, hardly a moment goes by without thoughts of revenge on the treacherous Lurdu.\n\nYou head back toward your capital. Your scouts report that Lurdu has indeed captured the city. He has also stationed 15 thousand troops behind the castle walls but your scouts are unsure what type they are.\n\nAfter a long march, you arrive at the closed gates of your former castle. Lurdu’s archers and blue banners are not a welcoming sight.\n\nWith your entire army away, Lurdu was able to easily capture your capital. However, he will pay for his crimes with a heavy penalty. His head.\n\nShaking with anger, you order your archers to fire at Lurdu\u0027s soldiers stationed on the parapets while your infantry scale the walls with rope ladders. A few of your colonels can see that your emotions are clouding your judgment, but are too afraid of you to dissent. They hesitate for a moment before bravely charging the castle. Lurdu sees your tactics and chuckles. He responds by having his archers rain salvos on your troops.\n\nElevation gives Lurdu a big advantage in this battle. Your troops take heavy losses while his ranks remain relatively unscathed. Just as you are about to reconsider your strategy, the front gates open and you see Lurdu\u0027s mounted cavalry rush out at your remaining troops. Too tired to run away, you order them to stand fast and brave the inevitable assault.\n\n“For our homeland!” you shout. You draw your sword and enter the fray.\n\nYour soldiers fight valiantly but in vain. Tired foot soldiers are no match for charging cavalry. In the end you are surrounded by eight of Lurdu’s troops. You swing your sword wildly before three blades simultaneously converge on your internal organs.\n\nTHE END\n","page 31":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 200 yuan (+600) /////// Army: Large (-75)///////////////////Masses: High\n\n/////////////////////////////////////////Workers: High (-75)//////////////Buddhists: Low {-50}\n\n-------------------------------\n\nYou raise your Army\u0027s wages, rewarding old veterans and attracting new recruits. On occasion you join your colonels at muster and personally inspect the raw cadets. Improved morale and increased enlistment soon transform your military into a formidable fighting machine.\n\nGeneral Nahru still itches to attack you, but cannot act on it as you now have more fighting men, kingdom morale, technology, and money than he does. Even he is not suicidal enough to attack you in your current state. All he can do is spout more vitriol to his colonels about your supposedly imminent defeat with every passing day.\n\nWhat will you do next?\n\n------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 200 yuan (+600) /////// Army: Large (-75)///////////////////Masses: High\n\n/////////////////////////////////////////Workers: High (-75)//////////////Buddhists: Low {-50}\n\n-------------------------------\n","page 30":"------------------------------\n\n//////////////////////////////////////////////////[STATUS BOX]///////////////////////////////////\n\n///Treasury: 200 yuan (+600) /////// Army: Small (-25)///////////////////Masses: High\n\n/////////////////////////////////////////Workers: High (-75)/////////////////Buddhists: High\n\n-------------------------------\n\nYou donate a sizable chunk of funds to the temple. The high monks are overjoyed by your generosity and invite you to the nearest monastery for a lavish conversion ceremony. Facing a bronze idol of Buddha and lit red candles, you chant newly learned Buddhist hymns alongside monks in saffron colored robes. The monks compliment your devotion and spread word of your piousness far and wide.\n\nTales of your empire\u0027s prosperity and your popularity among your people travel with those of your piety. When citizens all over China learn of your realm\u0027s high quality of life, not only do the best, brightest, and bravest flock to your kingdom, but some cities even secede from their local warlord and voluntarily raise your banner.\n\nDespite fierce crackdowns by the General\u0027s men, half of General Nahru\u0027s provinces secede from his kingdom and join yours. Nahru is enraged at you and predictably launches an all out assault bent on destroying you once and for all.\n\nYou hurriedly gather your troops at your capital. Due to your decision to postpone increasing your soldiers\u0027 pay, you can only put up a cursory defense.\n\nGeneral Nahru\u0027s troops tear through your capital, razing and destroying every symbol of power you have ever built.\n\nJust as you hear from your remaining advisers that General Nahru has announced he will execute anyone who surrenders from your camp, you all die in an unannounced flurry of arrows.\n\nTHE END\n","page 44":"Your infantry courageously charge at the oncoming cavalry while you and your archers make a run for the gate a few hundred yards away. The townsfolk are happy to see your army return and open the gate for your troops, but there is no time for pleasantries. Your archers immediately run up the parapets and towers to see your infantry taking heavy losses.\n\nYour infantry spot your archers atop the castle and drop their weapons and shields, then make a run for the gate. Meanwhile your arrows rain from the sky over the space your infantry just vacated.\n\nIn the heat of battle, Lurdu\u0027s cavalry is unaware of your archers\u0027 bombardment until it is too late. They enter its volley radius and many are riddled with arrows and crumple to the ground. Your archers\u0027 vastly higher ground greatly improves their range and turns the tide in the skirmish. With arrows falling all around them, many of Crown Prince Lurdu\u0027s troops are unsure of where to go. In the chaos that ensues, one of your arrows shoots Lurdu dead. His forces scatter without their leader and completely dissolve.\n\nYou emerge from the battle victorious, with 13 thousand infantry and 5 thousand archers remaining.\n\nYou take some time to regroup and heal your wounded. After you do so, you march back to Mongolia.\n\nThe dawn had hardly begun when you gaze down at the first tribe. Fifteen gigantic yurts, or tents, flap in the cool breeze. There is no human activity save for a few early risers tending their goats. You waste no time charging into the yurts and raining chaos onto the unsuspecting camp. As predicted, the Mongolians still had no idea you were coming and did not conscript any soldiers. The first settlement surrenders quickly, followed by their neighbors. You slaughter their leaders, force their successors to pay monthly tributes, take a few young women as trophies, and commandeer what supplies your army can carry.\n\nUpon your return to your capital, your citizens are delighted to hear your tales of victory. One ardent supporter invents the ballista, a gigantic crossbow that fires spear-sized arrows. These spears deal much greater damage and have far greater range than arrows fired by handheld bows.\n\nYou are impatient to conquer again. You institute a draft to conscript more soldiers. However, after the last revolt you feel you must now leave enough men behind to guard your capital, so your marching army stays the same size for now.\n\nYou yearn to capture Governor Toleron\u0027s territory, but worry about how you can defeat the much larger enemy force.\n\nOne day, help comes from an unexpected source. It seems that a group of bandits had robbed a caravan traveling through your kingdom on its way to India and your police was able to arrest them and confiscate the loot. When your police could not locate any surviving owners, they gave you the wares as a gift.\n\nIt turns out they were carrying gunpowder, an extremely rare and powerful substance. When it is lit on fire, the fine particles explode violently, causing great destruction. The limited amount you have is converted into its most efficient form- arrow bombs. Shards of broken glass, straw, and gunpowder are held together with cement inside a hollowed out miniature watermelon with a wick leading out of it. The bomb is then tied around the base of an arrow. Your archers would light the wick on fire and then shoot the bomb at opposing troops, causing shrapnel explosions and igniting blazes. You do not load your ballista bolts with bombs as multiple bombs strapped onto one bolt would explode right next to each other and waste its considerable blast radii. In addition, the ballista\u0027s long reload time makes quick barrages impossible. Furthermore, salvos would be limited by the number of ballista you have at a time whereas with arrows you can fire as many bombs as you have archers.\n\nGunpowder is extremely rare, so chances are you will never get any more of it. On the other hand, since very few other people have ever even heard of gunpowder, its effects may very well seem supernatural to the average enemy soldier.\n\nBrimming with confidence from your new secret weapons, you march South toward Governor Toleron’s kingdom. But before you reach one of his cities, you encounter the army of Commander Wan.\n\nWan is a local warlord with ties to President Min and Governor Toleron. Min, Wan, and Toleron are currently enjoying an uneasy peace between them, as bloodshed has decreased in their region for the time being. He has not achieved much else of note. You are not impressed by this lackey, and prepare for battle.\n\nYour spies had reported that his army consists solely of 20 thousand infantry, and you see that they are absolutely right once again as a dense cluster of 20 thousand infantry stand in formation to block your way. Wan looks out at your 13 thousand infantry, 5 thousand archers, and the one ballista that your carpenters have finished building. The battlefield is a flat plain with the occasional small tree. Nothing else is notable about the terrain or weather.\n\nDo you:\n","page 43":"The battle begins with a strategic retreat by your infantry. This gives your archers more time to fire on the cavalry before hand to hand combat begins. You manage to take out half their cavalry before they are upon your troops. Lurdu\u0027s archers return fire against your archers but can’t do as much damage due to being on lower ground.\n\nOnce close combat is enjoined, your footmen are dominated by the elevated and faster cavalry. Your infantry have no answer for the horsemen\u0027s extended reach and speed. Their horses even trample some of your troops.\n\nBut your early advantage proves too much for Lurdu. While both sides take catastrophic losses, your strategic retreat gave you just enough of an edge to outlast him. When he sees that all of his troops are dead, Lurdu jumps off his injured horse and runs away from the battlefield. He is soon caught by one of your faster soldiers. Ignoring his pleas for mercy, you quickly decapitate him before he can attempt another act of treachery against you.\n\nYou emerge from the battle victorious, but with only 3 thousand infantry and 1 thousand archers remaining.\n\nThe townsfolk are generally happy upon your return, as most of them liked you better than Crown Prince Lurdu. You take some time to restock your supplies and heal your wounded. After you do so, you march back to Mongolia.\n\nThe dawn had hardly begun when you gaze down at the first tribe. Fifteen gigantic yurts, or tents, flap in the cool breeze. There is no human activity save for a few early risers tending their goats. You waste no time charging into the yurts and raining chaos onto the unsuspecting camp. As predicted, the Mongolians still had no idea you were coming and did not conscript any soldiers. The first settlement surrenders quickly, followed by their neighbors. You slaughter their leaders, force their successors to pay monthly tributes, take a few young women as trophies, and commandeer what supplies your army can carry.\n\nUpon your return to your capital, your citizens are delighted to hear your tales of victory. One ardent supporter invents the ballista, a gigantic crossbow that fires spear-sized arrows. These arrows deal much greater damage and have far greater range than arrows fired by handheld bows.\n\nYou are impatient to conquer again. You institute a draft to conscript more soldiers. However, after the last revolt you feel you must now leave enough men behind to guard your capital, so your marching army stays the same size for now.\n\nYou yearn to capture Governor Toleron\u0027s territory, but worry about how you can defeat the much larger enemy force.\n\nOne day, help comes from an unexpected source. It seems that a group of bandits had robbed a caravan traveling through your kingdom on its way to India and your police was able to arrest them and confiscate the loot. When your police could not locate any surviving owners, they gave you the wares as a gift.\n\nIt turns out they were carrying gunpowder, an extremely rare and powerful substance. When it is lit on fire, the fine particles explode violently, causing great destruction. The limited amount you have is converted into its most efficient form- arrow bombs. Shards of broken glass, straw, and gunpowder are held together with cement inside a hollowed out miniature watermelon with a wick leading out of it. The bomb is then tied around the base of an arrow. Your archers would light the wick on fire and then shoot the bomb at opposing troops, causing shrapnel explosions and igniting blazes. You do not load your ballista bolts with bombs as multiple bombs strapped onto one bolt would explode right next to each other and waste its considerable blast radii. In addition, the ballista\u0027s long reload time makes quick barrages impossible. Furthermore, salvos would be limited by the number of ballista you have at a time whereas with arrows you can fire as many bombs as you have archers.\n\nGunpowder is extremely rare, so chances are you will never get any more of it. On the other hand, since very few other people have ever even heard of gunpowder, its effects may very well seem supernatural to the average enemy soldier.\n\nBrimming with confidence from your new secret weapons, you march south toward Governor Toleron’s kingdom. But before you reach one of his cities, you encounter the army of Commander Wan.\n\nWan is a local warlord with ties to President Min and Governor Toleron. Min, Wan, and Toleron are currently enjoying an uneasy peace between them, as bloodshed has decreased in their region for the time being. He has not achieved much else of note. You are not impressed by this lackey, and prepare for battle.\n\nYour spies had reported that his army consists solely of 20 thousand infantry, and you see that they are absolutely right once again as a dense cluster of 20 thousand infantry stand in formation to block your way. Wan looks out at your 3 thousand infantry, 1 thousand archers, and the one ballista that your carpenters have finished building.\n\nA frontal assault is clearly not an option. The battlefield is a flat plain with the occasional small tree. Nothing else is notable about the terrain or weather.\n\nDo you:\n","page 46":"The battle begins with your ballista unloading a few giant bolts. Your men are pretty accurate and wipe out several enemy soldiers. Meanwhile, each archer in your front row loads an arrow bomb and fires on your command.\n\nThe opening salvo of bombs shocks Wan’s front lines. Shards of glass pierce their armors and no one within a hundred yards of the explosions survive. Wan\u0027s army has never seen nor heard of arrow bombs and are too dumbfounded to make sense of what just happened even after several more explosions wipe out hundreds more. The smell of burnt flesh further demoralizes his troops. Sections of Wan’s infantry begin to scatter and run away.\n\nBy the time you run out of arrow bombs, half of Wan’s 20 thousand soldiers are dead, while most of the rest are wounded or have already fled. Your ballista by now has done severe damage as well. Your infantry rush in to finish the bloodbath and Commander Wan surrenders.\n\n“Please allow me to live,” he begs.\n\nYou smirk. “What use would I have for a bungling commander? Fool!”\n\nYou take over Commander Wan’s headquarters. You turn it into your new base of operations, while leaving his severed head on the flagpole as a reminder of your power.\n\nYour victory is somewhat tempered by your loss of your secret weapon. Still, winning a large battle against incredible odds and recent notable successes have nicely increased your kingdom\u0027s morale. You now control a large portion of northern China. A great deal of men hear tales of your courage and leadership and volunteer to join your fighting force. In addition, skilled carpenters, mechanics, and artisans offer their services to help you build more war machines. Collecting the best and brightest from nearby towns and cities, your army swells to 40 thousand infantry, 10 thousand archers, and 5 ballistae.\n\nWhen word of your victory against Wan reaches the kingdom of Governor Toleron, he readies his 90 thousand troops for defense. His army greets yours on a forest clearing a few miles outside his capital.\n\nYou sit in your tent awaiting information from your spies. You tap your toes impatiently and rub your elbows raw on your armrests. Suddenly, your lead spy bats the door flap open and gets down on one knee.\n\n“Sir, Toleron has placed his archers in the dense forest facing us. That allows them to fire on our army positioned in the open without themselves being targets for our archers. We have also found out that Toleron has left 15 ballistae in his castle that he did not bring with him. He must have underestimated our resolve.”\n\nYou step outside your tent and look out over the battlefield. You cannot see his archers, but you see his 70 thousand infantry lined up a hundred yards in front of the forest. Upon closer inspection, their faces are those of panicked idiots. While your soldiers are both intelligent and brave, Toleron\u0027s soldiers are shaking in their boots and look like they would flee at any omen of doom.\n\nYou confer with your colonels to decide on the best tactic. There is a brisk wind at your back and the air is dry. Due to no longer having arrow bombs, your only options are:\n","page 47":"Despite being severely outnumbered, you believe you can win this battle without using your arrow bombs. Your colonels look at you like you’ve lost your mind but still execute your orders.\n\nThe ballista is an impressive machine, and you watch it wipe out wave after wave of enemy infantry. It takes their footmen a while to reach your troops; in the meantime your giant ballista repeatedly pummels their ranks.\n\nOnce they do catch up however, their sheer numbers overwhelm your units. This is the wrong occasion to save your arrow bombs. You and your brave soldiers all fight to their deaths.\n\nTHE END\n","page 40":"You immediately turn back towards your capital. You cannot afford to lose your only base of power and its infrastructures. If Lurdu\u0027s army gains control of the fortress he would own a large tactical advantage in battle. The Mongolians were not making any preparations based on your spies\u0027 report and you doubt they ever will. Your army reaches your capital’s outskirts just as Lurdu’s troops arrive.\n\nThe sunset\u0027s orange glow gives the brown dirt a reddish tint. Small clouds of sand and dust slowly dissipate behind the two armies. Lurdu rides his mount at the back of his formation and looks over your 18 thousand infantry and 5 thousand archers. You see his 10 thousand cavalry on horses and 5 thousand archers.\n\nThe terrain consists of small raised ridges to your left and right. Your archers crowd onto this raised terrain and receive a slight high ground advantage while your infantry stand in the middle. Lurdu smirks and orders his cavalry to charge at you. They do, and with quite a bit of momentum.\n\nDo you:\n","page 42":"You order your infantry to engage the oncoming horsemen while your archers fire away. They can only do so for a few seconds before the cavalry are upon your ground troops.\n\nThe elevated and faster cavalry dominate your footmen in close quarter combat. Your infantry have no answer for the horsemen\u0027s extended reach and speed. Their horses even trample some of your troops.\n\nAfter smashing your infantry lines, Lurdu\u0027s cavalry rush the hills. Your archers kill some of his cavalry, but not enough. Lurdu\u0027s archers eventually catch up with his horsemen and help them finish off the remaining stragglers. You are captured alive and executed by Lurdu.\n\nTHE END\n","page 101":"The prince gives you a bemused look.\n\n“What?\"\n\nHe shrugs, then shakes his head. \"I have no idea what you’re talking about.”\n","page 222":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 100":"The prince yawns. Loudly.\n\n“Yeah... what?”\n\nHe sounds pretty bored, like he’s heard this all before from the likes of you his entire life.\n","page 221":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 103":"Yevgeni laughs. “You’re pretty cool.\"\n\nAfter you both down a few shots, he says, \"Let me guess, you want to make some sort of request of me.\"\n\nYou smile and nod.\n\nHe smiles back. \"I\u0027m smarter than I look.”\n","page 224":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 102":"The prince gives you a bemused look.\n\n“What?\"\n\nHe shrugs, then shakes his head. \"I have no idea what you’re talking about.”\n","page 105":"“I\u0027m no longer in the mood for jokes. You are no different from all the other stupid diplomats who come to my court. Begone!”\n\nAnd with that you are dismissed. You depart Russia for your capital. You look back at the Prince\u0027s opulent palace as you leave, thinking of what might have been had you been more observant of your host\u0027s temperament.\n\nYou arrive back home in several days. You turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 226":"General Nahru rises from his bearskin rug.\n\n\"Your idea is reasonable and I believe it is appropriate. A military alliance is one I can keep. Our military might will be multiplied.\"\n\nNahru steps toward you.\n\n\"Our day of glory is close at hand. When it comes you will reap your just rewards. Let us pray to each other\u0027s ancestors to seal the agreement.”\n\nYou pray with General Nahru at a shrine. After you both stand up, you give him a long firm handshake. Then you bid farewell to your new powerful ally.\n\nThis significant development of your new alliance marks a high point in your prestige throughout China. When you return home your subjects build statues and write biographies of you in your honor. You are hailed by citizens all over to be the one who will unify China.\n\nHaving secured powerful allies such as Governor Toleron and General Nahru, no one dares to attack you for fear of your allies’ collective military might and economic muscle. A few independent warlords hear of your diplomatic reputation and come to you offering alliances. You are able to secure agreements in your favor and rise to the top of China’s warlord hierarchy. Even Nahru and Toleron maintain an uneasy truce. And once the major powers settle their differences, lesser warlords fall in line.\n\nEvery warlord eventually signs an accord with you. Since you are allies with everyone, a peace settles across regions ravaged by war for decades. Everyone looks to you for leadership after you have brought them together as a cooperative. You are appointed the first ever President of China.\n\nYou lead a coalition of the more influential warlords in ratifying a Constitution that lays the foundation for a unified republic. You extend diplomatic channels to far-flung lands such as Turkey, Ethiopia, and Indonesia. Tsar Yevgeni, who has by now succeeded his father to the Russian throne, opens an embassy in your capital. International trade increases, military tactics sharpen, and diplomatic relations improve. China\u0027s economy burgeons, scientists invent powerful new technology, and explorers map out the four oceans. You use your persuasiveness to mold China into the greatest power in the world. Thanks to your diplomatic skills,\n\nYOU WIN\n","page 104":"“I\u0027m no longer in the mood for jokes. You are no different from all the other stupid diplomats who come to my court. Begone!”\n\nAnd with that you are dismissed. You depart Russia for your capital. You look back at the Prince\u0027s opulent palace as you leave, thinking of what might have been had you been more observant of your host\u0027s temperament.\n\nYou arrive back home in several days. You turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 225":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 107":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 228":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 106":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 55":"You order your ballistae forward. You beam with pride as your ballistae operators bravely push them onward in the face of enemy ballistae fire. A few of them are destroyed before they are in range, but most of them reach their destination.\n\nYou watch intently as your ballistae shower Min’s castle gate with bolts. Eventually the giant gate becomes so covered with shafts you can barely see any wood. Several minutes later, as the last of your ballistae is destroyed, you see the gate crack, then wobble, and finally collapse. It is time.\n\nSix hundred thousand of your bravest warriors charge toward the castle opening. You see Min’s soldiers hurriedly rush toward the gap to protect the keep. As you expected, Min\u0027s ballistae rain death upon your troops as they advance toward the castle. Many do not survive. But enough do to give you a small advantage in numbers when a clash for the ages begins.\n\nThe chaos of metal clanging, primal shouting, and millions of intense combatants sort themselves out in the scene before you. Blood and dead bodies slowly fill up the battlefield. You get chills, almost in glee, watching all the carnage. But who will triumph and etch their name in the history books?\n\nYour small edge in numbers very slowly, almost imperceptibly, wears down Min’s ranks. Min\u0027s troops have the extra motivation of defending their homeland. Your forces have the advantages of being more bloodthirsty and experienced in combat. Little by little, your army push the defenders deeper into the castle. At times they are pushed back, but then surge forward again past their fallen comrades. Many of your soldiers fight on even with severe flesh wounds or arrows buried deep in their backs. Closer and closer to the keep you get, until Min’s flag drops from its pole and is replaced with your bloody banner.\n\nCarefully, you step into the keep after surveying the battle scene. No one wearing Min’s uniform is still standing. The only soldiers still alive from your army are colonels; all other troops are dead. The throne room is extravagant, but eerily empty. You stride up the steps to the ornate gold throne. Min is brought before you with his hands tied behind his back.\n\n“I surrender, great conqueror. Please spare my life. I will serve you, and, and never betray you! I can help you rule, and I know this area well having lived here my whole life. I would be forever grateful to you. Please spare me!”\n\nYou execute him in spite of his plead to avenge your fallen soldiers. You feel like you owed them a great debt for helping you unite all of China.\n\nYou take a much deserved vacation. Who knows, you may even conquer the rest of the world one day. But for now, you’re happy to have united China. Thanks to your military skills,\n\nYOU WIN.\n","page 109":"Before you depart for a meeting with Lord Kahn, you hear some stunning news. Commander Wan, a warlord in central China, was killed in a tent fire. While Wan and most of his guards were sleeping, a blaze began in his sleeping tent, which eventually engulfed the entire compound. Wan and his best officers all perished in the fire and without its leader his territory will inevitably be divided amongst neighboring warlords. The only clue indicating who was responsible is a pictograph of an eight-point star, engraved on a charred scrap of iron left behind at the scene. Nervousness sweeps through China as no one has any idea who is behind it, and you do not feel safe either not knowing who did it.\n\nThe day finally arrives when you meet Lord Kahn. You enter his war tent. The Lord is sitting behind a wooden table. He beckons for you to sit down across from him.\n\nLord Kahn sits rigidly on his throne dressed in full armor. He has the stern face of a man who does not tolerate nonsense. He directs a hierarchal system of government and is known as a staunch supporter of militant values, such as might and honor.\n\nLord Kahn\u0027s lips are tight. He stares you straight in the eye.\n\nWhat do you say?\n","page 108":"Before you depart for a meeting with the renowned Duke Dizen, you hear some shocking news. Several semi-prominent warlords at a regional summit were discovered dead by poison in their meeting tent. Their sickly purple innards were found regurgitated out of their mouths. No indication of who was responsible was found at the scene except for a card etched with the pictograph of an eight-point star. No one has any idea who was behind it. A wave of fear ripples among the warlords.\n\nThe day finally arrives when you meet Duke Dizen. There is an electric atmosphere of excitement inside his conference room. You exchange bows with Dizen\u0027s cabinet members. Each of them appears capable, confident, and intelligent.\n\nThen Duke Dizen steps into the room. He is known as a charismatic and beloved figure among his subjects. Those who have worked with him in the past describe him as a willing compromiser who exemplifies pragmatism. He solemnly looks you in the eye and speaks in a calm and resonant tone.\n\n“Please sit down. I couldn’t be happier that Chinese leaders such as you and I have found enough common ground to sit down and talk. What\u0027s on your mind?”\n","page 229":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 57":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae still intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders.\n\nThey slowly approach the walls, with your infantry forming long lines behind them. Your 200 thousand archers can only wait outside the castle, anxious to enter the fray.\n\nYou watch as your infantry crawl out of their cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. In desperation, you send your 200 thousand archers up the cloud ladders as well. They are even worse at close quarter combat than your infantry were and are decimated too. Soon you see your 600 thousand foot soldiers dwindle to only a few thousand. You feel abject failure.\n\nYou have lost most of your troops, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 56":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae still intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders. They slowly approach the walls, with your infantry and archers forming long lines behind them.\n\nYou watch as your foot soldiers crawl out of their cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. Soon you see your 600 thousand foot soldiers dwindle to only a few thousand. You feel abject failure.\n\nYou have lost most of your troops, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 58":"You decide to not expose your troops to inevitable heavy casualties from ballistae fire. You order your ballistae forward. They move into range to destroy the installations. A battle of the ballistae ensues as bolts furiously fly back and forth. Ballistae on both sides slowly wreck and break down. Your 20 to 10 advantage is offset by their greater range and accuracy. When the giant bolts cease flying, neither side has a single ballistae still intact.\n\nThis is the result you were looking for. Now you finally get the chance to use your cloud ladders.\n\nThey slowly approach the walls, with your archers forming long lines behind them. Your 400 thousand infantry can only wait outside the castle, anxious to enter the fray.\n\nYou watch as your archers crawl out of your cloud ladders and attempt to assail the walls. The enemy is well positioned, sniping the exit points of your cloud ladders and maximizing the effectiveness of their 300 thousand archers. Almost none of your troops make it onto the walls alive, and those few who do are quickly cut down by the 200 thousand infantry supporting the archers. There are simply too many enemy archers for your cloud ladders to safely deploy your troops.\n\nYou rue your decision of not attacking the gate with your ballistae, but now it is too late as they have been destroyed. The defenders slaughter each wave of your soldiers, who reach the top of their cloud ladder only to be outnumbered and outmaneuvered like the wave before them. In desperation, you send your 400 thousand infantry up the cloud ladders as well, but they fare only slightly better and are eventually decimated as well. Soon you see your 600 thousand foot soldiers dwindle to only a few thousand. You feel abject failure.\n\nYou have lost most of your troops, and Min is certainly not going to open his doors, so you have no choice but to tell your troops to turn back. However, your colonels have had enough of your idiocy and decide it is time for a new leader. You can\u0027t blame them; after all you did just blow a chance at victory. Your colonels execute you on the spot. Soon they start bickering amongst themselves about how to divide power and none achieves the dream you once had of uniting China.\n\nTHE END\n","page 51":"You try to capitalize on your five ballistae\u0027s great range and damage output. You order your ballistae to fire at the enemy.\n\nThe ballista is an impressive machine, and you watch them wipe out hundreds of enemy infantry before Toleron reacts to being slaughtered. He commands every last one of his 90 thousand men, including his archers, to charge at your army in order to negate your range advantage. This is exactly what you want. Now you engage his army with yours.\n\nYour men are noticeably better trained. Your infantry\u0027s footwork is quicker and their swordplay stronger than Toleron\u0027s. Your archers are far more accurate. Having almost twice as many troops pales in comparison to being prepared for battle. You suffer terrible losses but annihilate Toleron\u0027s ranks and score a crucial victory. Toleron himself tries to escape but is tracked down by a scout unit a few hours later. He is thrown in front of you with bound ankles and wrists.\n\n“Why should I spare your pathetic life?” you ask a defiant Toleron.\n\n“There is no need. Ever since I converted to Buddhism I have seen the way. The pain and suffering of existence are meaningless. In time, your people will agree with me. Killing me will only send me to nirva-”\n\n“Enough! Your death will serve me much better than it will serve you, believe me. Off with his head!”\n\nWhen you take over Toleron’s castle you find his 15 ballistae in good condition and add them to your fleet. In addition, winning a huge battle while being vastly outnumbered raises your kingdom\u0027s morale a good bit. Another spike in conscription occurs, this time increasing your troops to 500 thousand infantry, 200 thousand archers, and 300 thousand mounted cavalry. Furthermore, your increasing stable of skilled tradesmen have completed construction on several cloud ladders.\n\nCloud ladders, or siege towers, are slow-moving, wheeled, vertically extendable wooden structures. They allow infantry and archers to directly reach the top of castle walls and towers without being bombarded by arrows on the way. Damp cloth is draped over the outside to protect it against burning arrows. Unlike regular arrows, ballista bolts can penetrate the cloud ladder\u0027s wooden shell and eventually wreck the entire structure. Cloud ladders also cannot accommodate any cavalry, so your mounted troops would not be able to support your infantry and archers. Your war machines now total 20 ballistae and 10 cloud ladders.\n\nOne day, as you are preparing for another offensive campaign, you are visited by an emissary.\n\n“I am here on a mission of peace from President Min. He has heard tales of your victories and is in awe of your military brilliance. Now that all other remaining warlords in China have allied themselves with the President, your joining us is overdue. He asks that you keep your troops within the boundaries of your newly acquired territories in north, south, and east China in exchange for him keeping all the other warlords from invading your territory. You are still free to attack anyone you want outside of China. What reply shall I bring back to President Min?”\n\n“Ahahahaha!” You have not had such a good laugh in a long time. “Don’t worry,” you say, “I’ll take care of that for you.”\n\nYou grin as your men drag the diplomat away to be executed and his head put in a box and sent back to Min.\n\nBy now you hold three quarters of China. But the last opposition is the strongest. Min has convinced his allies to all resist you as one. Their most defensible position is Min\u0027s capital, where 1.5 million soldiers await you in battle.\n\nYou march your army to Min’s last bastion. A giant castle stands in the distance. In front of it are thousands of tents nestled close together, where the one million infantry of Min’s allies are camped. Perched on the castle walls are Min\u0027s 200 thousand infantry and 300 thousand archers. Ten ballistae sit atop his towers, pointed in your direction. Due to their elevation, Min\u0027s ballistae possess much greater range than yours. The battlefield terrain is a low plain with no trees, and a brisk wind blows from behind your back.\n\nYour army stands ready to face your enemies. Your day of glory has finally come. Before you can savor the moment however, Min’s allies suddenly attack you. All one million infantry charge as one at your formation and taking the initiative away from you. You have no option but to fight back.\n\nYour 300 thousand cavalry are the first to engage the enemy. Soldiers on their front few lines are knocked down by your cavalry\u0027s ferocious charge. Outnumbered, your mounted troops slaughter the infantry while taking heavy losses. Your infantry and archers eventually catch up with your cavalry and join the fray. Several bloody hours later, all one million infantry are either dead or scattered, while you have lost all 300 thousand cavalry and 100 thousand of your infantry.\n\nCareful to remain just out of the range of Min\u0027s ballistae, you walk past the tents and closer to Min’s towering castle. You still have 400 thousand infantry, 200 thousand archers, 20 ballistae and 10 cloud ladders. Min still has 200 thousand infantry, 300 thousand archers and 10 ballistae guarding his fortress. How will you assault the castle? You have four choices, but decide carefully.\n\nYou know that as your ballistae move close enough to fire on the castle, they would also likely be fired on during the assault as well and eventually all destroyed by Min\u0027s longer ranged ballistae.\n","page 50":"Your infantry charge across the battlefield. Toleron\u0027s archers fire away. Many of your infantry literally fall dead in their tracks.\n\nWhile your infantry charge toward his archers, Toleron commands his infantry to intercept yours.\n\nHaving already begun the battle with a disadvantage in numbers, your mounting casualties further hurt your chances of victory. Even your ballistae cannot kill Toleron\u0027s troops fast enough to offset their big edge. You simply did not make the right tactical decision to expose your infantry by themselves early on.\n\nYou are ashamed of your colossal mistake and atone for it the only way you know how. You ride into the fray with the rest of your troops, your sword pointed high at the sky.\n\nYour inevitable death comes from a spear thrust through your heart.\n\nTHE END\n","page 52":"Your eyes are red with bloodlust. This is a time for courage, not strategy. You order all your troops to rush at and kill every last enemy.\n\nAs you get closer you can sense the tentativeness in Toleron’s troops. Then the arrows start flying out of the forest.\n\nA third of your troops are dead before they can engage the enemy. Fortunately your ballistae wipe out some of their infantry in the meantime.\n\nClose combat is eventually enjoined. Your troops fight valiantly as they always have. You even manage to kill some of Toleron\u0027s archers; unfortunately most of his troops are fighting two on one against yours. A close, bloody contest dwindles down to just a few men, with you on the losing side.\n\nGovernor Toleron confronts you.\n\n“It is time you paid for your crimes, Nahru. Slaughtering so many innocent people in the name of conquest. Your life is evil. And today, it ends!”\n\n“And I\u0027m taking you with me!” you growl. You lunge at Toleron\u0027s throat with a mighty swing of your sword. If only his officers did not plunge their weapons deep in your back, your last ditch attempt might have succeeded.\n\nTHE END\n","page 110":"The prince rolls his eyes.\n\n“You’re speaking to me like I was the tsar and not a prince. How do you expect me to have any say in important national matters like those? Man, you’re no fun. If I was tsar I would have you beheaded. Get out of here. I don’t want to see you anymore.” You ashamedly bow and quickly back out of his sight. You depart from Russia and return to your capital.\n\nYou are fortunate that Prince Yevgeni is not more serious-minded or else antagonizing him would have harsher consequences. You arrive back home in several days.\n\nYou turn your attention back to matters at hand. Lord Kahn or Duke Dizen- who do you speak to next?\n","page 231":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 230":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 211":"Your diplomatic caravan reaches the northern lands of General Nahru. He is famous for his quick temper and warmongering tendencies. He has been known to attack warlords for a mere slip of the tongue. On the other hand, Nahru is a smart commander-in-chief and a strong proponent of honorable conduct.\n\nBanners and bloody heads of vanquished enemies adorn the perimeter of General Nahru\u0027s compound. Hundreds of elite guards stand ramrod-straight at attention on either side of the path leading to the main war tent.\n\nYou can’t help but feel a bit intimidated as you step inside. The General sits cross-legged atop a giant bearskin rug, his eyes fixed on yours while wearing a cocksure grin. His eldest son, Lurdu, stands beside him and looks coldly upon you with disdain.\n","page 213":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 212":"You return to your kingdom without a crucial alliance. Your reputation suffers as warlords across China hear the news of your failure.\n\nSome warlords start attacking you believing that you are not strong. Your army fends off the first few advances, but your kingdom’s morale plunges. Then consecutive attacks by larger armies penetrate deep into your territory.\n\nThe invaders set fire to your villages, pillage your cities, and generally wreak havoc on your people. Your minor allies provide as much military assistance as they can but are overwhelmed by the numerous opportunists taking advantage of your multiple fronts. Your citizens flee to Toleron\u0027s territory as refugees. In the face of impending defeat, many of your soldiers desert your army as well.\n\nYou stand inside your throne room trying to come up with something to say to the enemy troops sure to beat down your door any minute. Sure enough, shadows of torches soon appear outside your room.\n\nA group of infantry barge through your screen doors, led by a chap in a red helmet.\n\n“President Min. It is my pleasure to finally meet you. With you out of the way, I will be another step closer to conquering China!”\n\nYou plead. \"Let me join your army as an adviser. I am very knowledgeable about this local area. I will not forget your generosity.”\n\n“I have enough talented advisers. Besides, I don’t trust you.”\n\nHe arcs his sword through the air at your head. You manage to duck out of the way. It is only a temporary reprieve however as several men, including the one in the red helmet, surround you and savagely slice you to pieces.\n\nTHE END\n","page 215":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 214":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 217":"Nahru’s face reddens. “How dare you talk to me like that!”\n","page 216":"“I am glad to see you accord me the respect I deserve. I do not have much time to parlay with you. There are battles to win and countries to conquer. Now, which type of alliance do you want to make with me?\"\n","page 219":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 65":"You believe you can win this battle without using your arrow bombs. Your secret weapon may prove more useful later on when the odds are more stacked against you.\n\nYou order your archers and ballista to fire at the enemy. The ballista is an impressive machine, and you watch it wipe out wave after wave of enemy infantry. It takes their footmen a while to reach your troops; in the meantime your giant ballista repeatedly pummels their ranks.\n\nOnce they do catch up however, your archers and ballista are far less effective in close combat against Wan\u0027s infantry. Your own infantry is forced to engage his. Your ballista and arrows have whittled down Wan\u0027s advantage in numbers, so it is a close contest. You watch as thousands of soldiers from both Wan and your army fall in battle.\n\nHours of intense fighting later, it all comes down to a few hundred combatants. In the frantic chaos, you are left to fend for yourself. A small unit of Wan’s soldiers closes in on you. You manage to inflict mortal wounds on three of them before succumbing to a spear in the heart.\n\nTHE END\n","page 218":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n","page 68":"You try to capitalize on your five ballistae\u0027s great range and damage output. You order your ballistae to fire at the enemy.\n\nThe ballista is an impressive machine, and you watch them wipe out hundreds of enemy infantry before Toleron reacts to being slaughtered. He commands every last one of his 90 thousand men, including his archers, to charge at your army in order to negate your range advantage. This is exactly what you want. Now you engage his army with yours.\n\nYour men are noticeably better trained. Your infantry\u0027s footwork is quicker and their swordplay stronger than Toleron\u0027s. Your archers are far more accurate. Having almost twice as many troops pales in comparison to being prepared for battle. You suffer terrible losses but annihilate Toleron\u0027s ranks and score a crucial victory. Toleron himself tries to escape but is tracked down by a scout unit a few hours later. He is thrown in front of you with bound ankles and wrists.\n\n“Why should I spare your pathetic life?” you ask a defiant Toleron.\n\n“There is no need. Ever since I converted to Buddhism I have seen the way. The pain and suffering of existence are meaningless. In time, your people will agree with me. Killing me will only send me to nirva-”\n\n“Enough! Your death will serve me much better than it will serve you, believe me. Off with his head!”\n\nWhen you take over Toleron’s castle you find his 15 ballistae in good condition and add them to your fleet. In addition, winning a huge battle while being vastly outnumbered raises your kingdom\u0027s morale a good bit. Another spike in conscription occurs, this time increasing your troops to 500 thousand infantry, 200 thousand archers, and 300 thousand mounted cavalry. Furthermore, your increasing stable of skilled tradesmen have completed construction on several cloud ladders.\n\nCloud ladders, or siege towers, are slow-moving, wheeled, vertically extendable wooden structures. They allow infantry and archers to directly reach the top of castle walls and towers without being bombarded by arrows on the way. Damp cloth is draped over the outside to protect it against burning arrows. Unlike regular arrows, ballista bolts can penetrate the cloud ladder\u0027s wooden shell and eventually wreck the entire structure. Cloud ladders also cannot accommodate any cavalry, so your mounted troops would not be able to support your infantry and archers. Your war machines now total 20 ballistae and 10 cloud ladders.\n\nOne day, as you are preparing for another offensive campaign, you are visited by an emissary.\n\n“I am here on a mission of peace from President Min. He has heard tales of your victories and is in awe of your military brilliance. Now that all other remaining warlords in China have allied themselves with the President, your joining us is overdue. He asks that you keep your troops within the boundaries of your newly acquired territories in north, south, and east China in exchange for him keeping all the other warlords from invading your territory. You are still free to attack anyone you want outside of China. What reply shall I bring back to President Min?”\n\n“Ahahahaha!” You have not had such a good laugh in a long time. “Don’t worry,” you say, “I’ll take care of that for you.”\n\nYou grin as your men drag the diplomat away to be executed and his head put in a box and sent back to Min.\n\nBy now you hold three quarters of China. But the last opposition is the strongest. Min has convinced his allies to all resist you as one. Their most defensible position is Min\u0027s capital, where 1.5 million soldiers await you in battle.\n\nYou march your army to Min’s last bastion. A giant castle stands in the distance. In front of it are thousands of tents nestled close together, where the one million infantry of Min’s allies are camped. Perched on the castle walls are Min\u0027s 200 thousand infantry and 300 thousand archers. Ten ballistae sit atop his towers, pointed in your direction. Due to their elevation, Min\u0027s ballistae possess much greater range than yours. The battlefield terrain is a low plain with no trees, and a brisk wind blows from behind your back.\n\nYour army stands ready to face your enemies. Your day of glory has finally come. Before you can savor the moment however, Min’s allies suddenly attack you. All one million infantry charge as one at your formation and taking the initiative away from you. You have no option but to fight back.\n\nYour 300 thousand cavalry are the first to engage the enemy. Soldiers on their front few lines are knocked down by your cavalry\u0027s ferocious charge. Outnumbered, your mounted troops slaughter the infantry while taking heavy losses. Your infantry and archers eventually catch up with your cavalry and join the fray. Several bloody hours later, all one million infantry are either dead or scattered, while you have lost all 300 thousand cavalry and 100 thousand of your infantry.\n\nCareful to remain just out of the range of Min\u0027s ballistae, you walk past the tents and closer to Min’s towering castle. You still have 400 thousand infantry, 200 thousand archers, 20 ballistae and 10 cloud ladders. Min still has 200 thousand infantry, 300 thousand archers and 10 ballistae guarding his fortress. How will you assault the castle? You have four choices, but decide carefully.\n\nYou know that as your ballistae move close enough to fire on the castle, they would also likely be fired on during the assault as well and eventually all destroyed by Min\u0027s longer ranged ballistae.\n","page 67":"Your infantry charge across the battlefield. Toleron\u0027s archers fire away. Many of your infantry literally fall dead in their tracks.\n\nWhile your infantry charge toward his archers, Toleron commands his infantry to intercept yours.\n\nHaving already begun the battle with a disadvantage in numbers, your mounting casualties further hurt your chances of victory. Even your ballistae cannot kill Toleron\u0027s troops fast enough to offset their big edge. You simply did not make the right tactical decision to expose your infantry by themselves early on.\n\nYou are ashamed of your colossal mistake and atone for it the only way you know how. You ride into the fray with the rest of your troops, your sword pointed high at the sky.\n\nYour inevitable death comes from a spear thrust through your heart.\n\nTHE END\n","page 69":"Your eyes are red with bloodlust. This is a time for courage, not strategy. You order all your troops to rush at and kill every last enemy.\n\nAs you get closer you can sense the tentativeness in Toleron’s troops. Then the arrows start flying out of the forest.\n\nA third of your troops are dead before they can engage the enemy. Fortunately your ballistae wipe out some of their infantry in the meantime.\n\nClose combat is eventually enjoined. Your troops fight valiantly as they always have. You even manage to kill some of Toleron\u0027s archers; unfortunately most of his troops are fighting two on one against yours. A close, bloody contest dwindles down to just a few men, with you on the losing side.\n\nGovernor Toleron confronts you.\n\n“It is time you paid for your crimes, Nahru. Slaughtering so many innocent people in the name of conquest. Your life is evil. And today, it ends!”\n\n“And I\u0027m taking you with me!” you growl. You lunge at Toleron\u0027s throat with a mighty swing of your sword. If only his officers did not plunge their weapons deep in your back, your last ditch attempt might have succeeded.\n\nTHE END\n","page 64":"You believe you can win this battle without using your arrow bombs. Your secret weapon may prove more useful later on when the odds are more stacked against you. However, this is no time to rely on archers who stand on flat ground. Your infantry dart away to encircle the enemy.\n\nBefore Commander Wan\u0027s troops know what hit them, you are raining arrows, both regular and giant sized, and bearing down on them from two sides.\n\nThis classical Art of War maneuver works to perfection. Chaos ensues in their formerly organized formation. You create mismatches of 2 or even 3 of your infantry against one of theirs. As the enemy soldiers are pinned closer together, your ballista and archers rain death upon them.\n\nIt only takes a few hours for the carnage to induce Wan\u0027s surrender. You take some losses and your army is down to 10 thousand infantry, 5 thousand archers and one ballista. Nevertheless, you and your soldiers are ecstatic after completely decimating Wan\u0027s army while keeping your store of arrow bombs intact. Spirits are high when Commander Wan crawls to you and begs for mercy.\n\n“Please allow me to live,” he begs.\n\nYou smirk. “What use would I have for a commander without any knowledge of formation tactics? Fool!”\n\nYou take over Commander Wan’s headquarters. You turn it into your new base of operations, while leaving his severed head on the flagpole as a reminder of your power.\n\nYour spectacular victory and recent string of successes have greatly improved your kingdom\u0027s morale. You now control a large portion of northern China. Many men hear tales of your courage and leadership and volunteer to join your fighting force. In addition, skilled carpenters, mechanics, and artisans offer their services to help you build more war machines. Collecting the best and brightest from nearby towns and cities, your army swells to 50 thousand infantry, 10 thousand archers, 40 thousand mounted cavalry, and 5 ballistae.\n\nWhen word of your victory against Wan reaches the kingdom of Governor Toleron, he readies his 90 thousand troops for defense. His army greets yours on a forest clearing a few miles outside his capital.\n\nYou sit in your tent awaiting information from your spies. You tap your toes impatiently and rub your elbows raw on your armrests. Suddenly, your lead spy bats the door flap open and gets down on one knee.\n\n“Sir, Toleron has placed his archers in the dense forest facing us. That allows them to fire on our army positioned in the open without themselves being targets for our archers. We have also found out that Toleron has left 15 ballistae in his castle that he did not bring with him. He must have underestimated our resolve.”\n\nYou step outside your tent and look out over the battlefield. You cannot see his archers, but you see his 70 thousand infantry lined up a hundred yards in front of the forest. Upon closer inspection, their faces are those of panicked idiots. While your soldiers are both intelligent and brave, Toleron\u0027s soldiers are shaking in their boots and look like they would flee at any omen of doom.\n\nYou confer with your colonels to decide on the best tactic. Due to now having mounted cavalry as well as arrow bombs, you are able to rule out lesser maneuvers. There is a stiff breeze at your back and the air is dry. Your two best attack options are:\n","page 63":"The battle begins with your ballista unloading a few giant bolts. Your men are pretty accurate and wipe out several enemy soldiers. Meanwhile, each archer in your front row loads an arrow bomb and fires on your command.\n\nThe opening salvo of bombs shocks Wan’s front lines. Shards of glass pierce their armors and no one within a hundred yards of the explosions survive. Wan\u0027s army has never seen nor heard of arrow bombs and are too dumbfounded to make sense of what just happened even after several more explosions wipe out hundreds more. The smell of burnt flesh further demoralizes his troops. Sections of Wan’s infantry begin to scatter and run away.\n\nBy the time you run out of arrow bombs, half of Wan’s 20 thousand soldiers are dead, while most of the rest are wounded or have already fled. Your ballista by now has done severe damage as well. Your infantry rush in to finish the bloodbath and Commander Wan surrenders.\n\n“Please allow me to live,” he begs.\n\nYou smirk. “What use would I have for a bungling commander? Fool!”\n\nYou take over Commander Wan’s headquarters. You turn it into your new base of operations, while leaving his severed head on the flagpole as a reminder of your power.\n\nYour victory is somewhat tempered by your loss of your secret weapon. Still, this victory and recent string of successes have slightly improved your kingdom\u0027s morale. You now control a large portion of northern China. A good number of men hear tales of your courage and leadership and volunteer to join your fighting force. In addition, skilled carpenters, mechanics, and artisans offer their services to help you build more war machines. Collecting the best and brightest from nearby towns and cities, your army swells to 40 thousand infantry, 10 thousand archers, and 5 ballistae.\n\nWhen word of your victory against Wan reaches the kingdom of Governor Toleron, he readies his 90 thousand troops for defense. His army greets yours on a forest clearing a few miles outside his capital.\n\nYou sit in your tent awaiting information from your spies. You tap your toes impatiently and rub your elbows raw on your armrests. Suddenly, your lead spy bats the door flap open and gets down on one knee.\n\n“Sir, Toleron has placed his archers in the dense forest facing us. That allows them to fire on our army positioned in the open without themselves being targets for our archers. We have also found out that Toleron has left 15 ballistae in his castle that he did not bring with him. He must have underestimated our resolve.”\n\nYou step outside your tent and look out over the battlefield. You cannot see his archers, but you see his 70 thousand infantry lined up a hundred yards in front of the forest. Upon closer inspection, their faces are those of panicked idiots. While your soldiers are both intelligent and brave, Toleron\u0027s soldiers are shaking in their boots and look like they would flee at any omen of doom.\n\nYou confer with your colonels to decide on the best tactic. There is a brisk wind at your back and the air is dry. Due to no longer having arrow bombs, your only options are:\n","page 220":"“Min, you are a madman. Guards! Execute this fool!”\n\nYou are surrounded by muscular thugs. They push your head down over a bloodstained chopping block. You can only move your head as the rest of your body is immobilized by Nahru\u0027s guards. You try to say something but no sounds emanate from your mouth when your head falls to the floor.\n\nTHE END\n"}