{"page 33":"Weeks turn into months on the road. For the most part, you pass abandoned townships and dead forests on the road. Occasionally you will find an occupied township, and trade with grime-smeared, emaciated yeomans. You start to notice some changes in yourself. You’re stronger now, leaner and faster. You’ve grown a respectable beard, a feat hitherto impossible to you. You carry a knife alongside your skull, which John Boy instructs you in every night. You’re beginning to think that the boy who left might not recognize the man who arrives at his destination. \n\n\nYou sit on a fog-capped moor, trying to dry your socks off next to the fire. \n\n\nStitcher is crouched over a pan, frying hard tack and rabbit bacon. The meat is stringy and looks revolting. \n\n\n“I don’t see you makin’ anything better,” she says. She removes the rabbit from the heat and takes a nibble. “It’s not so bad.” \n\n\nYou extend a hand and she tosses you a strip of meat. You devour it ravenously, then look at her expectantly. \n\n\n“That’s it, I’m afraid. We gotta make the rations last.” \n\n\nYour stomach begins to rumble as your mind turns to breakfast. “Where are the others, anyway? Seems like they went off hunting hours ago.” \n\n\nStitcher takes a ferocious bite out of the chewy rabbit meat before answering. “Ah, you know John Boy. Probably found something big and insisted on stalking it.” \n\n\n“I wouldn’t mind a spot of venison right now. What about you, Crowley?” you turn your gaze to the armoured sentinel standing at the edge of the camp. He shrugs. “Figures.” \n\n\n“Don’t doubt my leadership again, lads! Never again!” you hear Frye’s good-natured scolding long before you see it happen. Stitcher smiles. \n\n\nFrye emerges out of the fog, beaming from ear to ear, carrying two sackcloth grocery bags overflowing with fresh produce. \n\n\n“How in the Hundred Hells did you come across that?” \n\n\n“Start frying these potatoes and onions and I’ll tell you, m’boy.”  \n\n\nYou eat a better meal than you’ve had in months, complete with bacon, fresh bread, apples and smoked fish. The meat is delicious, far more fatty and healthy than anything John Boy has caught in the wilds. \n\n\nYou all sit in silence and gorge yourselves, save for Crowley who seems content to smell the frying bacon. “So what do we owe this bounty to?” you ask, sucking grease from your finger. \n\n\n“Thought I’d give this lot,” John Boy jerks his finger at Frye and Tor, “a few lessons in stalking. We were following something big.” \n\n\n“A mighty beast, no doubt,”  Tor says wistfully, no doubt picturing a glorious battle with a snarling monster. \n\n\n“And then we stumbled right upon this village. It was far and away the most prosperous village I’ve ever seen, certainly since leaving. Lots of farms, families, healthy-looking folk. All of it behind the biggest wall you’ve ever seen in your life.” \n\n\n“Grass was too green,” John Boy remarks. \n\n\n“That’s the most remarkable part. The whole village was teeming with life, right down to the grass. Everything was alive, as it should be; like it appears in your books,” he says, tossing a glance at one of your leatherbound volumes. “The mayor showed us their cattle, and their apple orchard. They had a proper inn with beer and bread and stew, nothing like the swill they served us back in the city.” \n\n\nAs Frye talks, he’s met with increasing interest from the party. People lean forward, place hands under chins, eager to absorb this story that sounds too good to be true. \n\n\n“There’s a catch,” John Boy says. \n\n\nFrye waves a hand dismissively. “We spoke with the mayor, a man of exceptional manners, by the way, and he expressed an interest in the service of rough men. If we did him a favour, we’d be welcome for as long as we like; I don’t know about you lot, but I’m ready for some hospitality.” \n\n\n“We’ve still a mission,” Stitcher says, “and who knows what these people are doing for their prosperity? Not even the sisters at the abbey could grow healthy apples. Seems foul magic to me.”\n\n\nFrye looks at you. “Of course, of course. We’re to deliver Lord Winter to Seffonshire. I was only suggesting we hear the mayor out, and maybe rest a spell. If you’d prefer to push on to Seffonshire, then we will. You’re the man paying for this, after all.” \n\n\nAs Frye smiles self-effacingly, you feel as if he’s trying to charm you into going into town. Then again, you could do with a bath and a hot meal.\n\n\nYou gaze sadly at your wet socks. “The mission can wait. We go into town, talk to the mayor, and see what they want.” \n\n\nYou’re met with a chorus of approving grunts. You spend a half hour packing up camp, then begin the trek to where the village is supposed to be. As you cross the misty, dead hills of the moor, you come across the village quite abruptly. \n\n\nThe term “village” seems inappropriate. It is a small city. It’s surrounded on all sides by an impressive nine-foot stone palisade. Outside the palisade wall is a deep trench encircling the city and filled with sharpened wooden spikes and pitch. There’s only one entrance in the form of a drawbridge, which is lowered at this time. As you approach the drawbridge, you get a glimpse beyond the walls. The buildings are built wide and tall from sturdy brick. The streets are clean, and filled with people milling about. \n\n\nAs you arrive at the drawbridge, you’re greeted by two guards with spears. One of them is an older man with a moustache and a gut that’s beginning to press against his gambeson. The other, a younger man, has a face spattered with acne and an almost perfectly triangular Adam’s apple. \n\n\n“Hail, travelers!” the moustached man says with a jovial smile. His voice is deep and his demeanour pleasant. “You must be cold, coming in off the moor!” \n\n\n“Freezing!” Frye replies. “Is the mayor about?” \n\n\n“Mayor d’Harcourt is secluded in study at the moment, I’m afraid. But I’d be happy to show you to your lodgings.” \n\n\n“Lodgings, already? He knew we’d accept his offer?” Frye says. \n\n\nThe older guard tips his head forward. “Mayor d’Harcourt has a way of people. This way, gentlemen, my lady.” \n\n\nStitcher scoffs as you enter the town. It is the most pleasant place you recall being in. The sun seems to shine brighter. The townsfolk seem healthy and strong. There are artisans hawking their wares, everywhere you turn; tailors, swordsmiths and toymakers alike. \n\n\nAs Frye begins to chatter away with the guard, you let yourself drift back in the party until you’re walking in lockstep with Stitcher. \n\n\n“How is this possible?” she asks. \n\n\n“No clue,” you answer. \n\n\nShe looks around, staring at a group of laughing children like one might stare at an egg to see if it is rotten. “I’ve heard of such things.” \n\n\n“I’ve never heard of anything like this,” you say, quite honestly. \n\n\n“I wouldn’t expect you to. In times before, folk used to do all manner of devilry to ensure the prosperity of the village. Sacrifice animals and crops, for one. Sometimes children. They’d offer them up to one devil-god or another, for prosperity, or safety from barbarians, or even something as simple as a good harvest.” \n\n\nYou’re not familiar with the folk traditions of the countryside, but you’re rather familiar with the notion of human sacrifice. You think back to the spellbooks you pilfered from the underground study, where almost half of the arcane rituals involve human blood to some degree. “I suppose people are unpredictable, when they get desperate,” you say measuredly. \n\n\nShe nods. “Be on your guard.”\n\n\nWhen you reach your lodgings, you drop your guard almost instantly. The fat guard shows you to the local inn. When you enter, a portly, red-faced alewife is wiping a thick coat of dust off the bartop. It’s empty, save for you, your companions, the guard and the woman. \n\n\n“Hello, lovelies,” she coos as you enter, “just give me a moment and I’ll fix you some nice lamb stew.” \n\n\n“Thank you, my lady,” Frye says gallantly. He sits at one of the many empty tables, doffing his hat. He winces as he leans back. For the first time, you think of Frye’s age. He presents himself as invincible, but the man has to be pushing forty-five and still sleeping in wet tents and going on perilous adventures. It’s no wonder his joints hurt. \n\n\nYou join him at the table as the guard takes his leave. Before any conversation can begin, you’re interrupted by the alewife carrying out trays of ale and lamb stew. You tear into it without thinking, shoveling soup into your mouth with chunks of crusty bread that you then devour, then washing it down with cold ale. \n\n\n“I could get used to that,” Tor says as he begins to suck the broth off his fingers. \n\n\nStitcher furrows her brow, but her bowl lies empty before her. You notice John Boy has yet to remove his cloak, and scans the room while he eats. Frye wipes the gravy from his moustache. Crowley, who has not sat down, stares into the distance.\n\n\nYour eyes begin to feel heavy. You yawn. The yawn is taken up like a battle-cry, as yawns often are. Soon, you feel bleary as the stew, ale, and bread begins to reach your stomach. You want nothing more than sleep. “What say we turn in? This Mayor d’Harcourt can send someone along to wake us,” you say. \n\n\nYou’re met with four desperate nods, save for Stitcher. She furrows her eyebrows slightly, as if to say: what happened to keeping your guard up? \n\n\n“You worry too much, my friend. If these folk meant to eat us, why would they share their hospitality like this,” Frye says. \n\n\n“But —” she begins. \n\n\n“It’s fine. Besides, Crowley can stand watch,” Frye says. \n\n\nWith the matter resolved, you turn into your rooms on the second floor. It’s the first time you’ve had your own room in some time. You pull one of your ancestor’s books from your pack, and begin to flick through it. You read the disquieting, mathematical wisdom of Francisco Al-Wahad, a strange mystic famous for his idiosyncratic rituals and baffling disappearance. He claims that his wisdom was revealed to him by the Far Ones, who traveled the stars and time itself with their strange mathematics. It contains a set of detailed instructions for operating what he claims to be a “multi-headed gateway of most sublime blasphemy”. Fascinating though it may be, it is not a page turner, and you fall asleep with the volume resting open on your chest. \n\n\nYou wake up hours later, with the last rays of sun peeking through the window. You feel phenomenally well-rested. Your footsteps are lighter than you remember them being in years. As you walk downstairs, a delicious smell sends you hurtling into a distant childhood memory. It’s earthy, smokey and complex. You remember. Coffee. A fantastically expensive drink, grown in the exotic ports that were hit last by the Final Blight.  \n\n\nYou find the rest of the party gathered around a table, with five mugs before them. Tor looks up as you walk downstairs. You take your seat at the table, between Stitcher and John Boy. \n\n\n“A kingly gift from Mayor d’Harcourt, that he sent along. Have you ever had coffee, my boy?”\n\n\nYou shake your head. \n\n\n“Who was it that paid us in beans?” Stitcher wonders aloud. \n\n\n“Srevenika?” Tor responds. \n\n\n“No, that was the one who tried to duel John Boy,” says Stitcher. \n\n\n“That was Sturgesson. Srevenika was the beans,” says John Boy. \n\n\nFrye picks his mug up and raises a toast. “To a rest well-earned!” \n\n\nYou repeat the toast and take your first sip of coffee. It is astoundingly bitter. You nearly gag. Seeing everyone else’s obvious relish, you choke down the cup in one giant sip. \n\n\nThe alewife enters, and glances out the window at the setting sun. “I think you’d better get on to the Town Hall, Mayor D’Harcourt would like to chat with you lovelies. Did you like your gift?” \n\n\nFrye stands up, takes his hat off, and sweeps it across his chest. “It was enchanting, my dear, as are you.” \n\n\nStitcher rolls her eyes as you all leave. You notice her fist is tightened around the grip of her mace. As you step back out into the streets, you notice that they’re empty, save for a few villagers who are scurrying into their houses. It’s dusk, now, and the sky is purple with the last golden rays of the sun spilling out over the horizon. \n\n\nTown Hall is easy enough to find. It’s located at the exact centre of town. Town Hall seems like somewhat of a misnomer; it’s really more of a large, multi-story mansion. It’s a gorgeous piece of construction, all marble pillars and stained glass windows. You approach from behind, and you can see a large amphitheatre, dug into a hill behind the building. You guess that that’s where Mayor d’Harcourt addresses his constituents. \n\n\nYou come around to the front, and walk the well-manicured pathway through the garden up to the front door. The door is fashioned from one piece of solid oak, intricately carved with esoteric geometry that only you recognize. D’Harcourt must be a learned man. \n\n\nBefore you can use the brass lion-head knocker, the door opens. Before you stands a well-dressed nobleman in fine robes. His hair is black and well-manicured, his fingernails are sharp, and his easy smile reveals his pointed fangs. \n\n\nStitcher is the first to attack, drawing and swinging her mace at his head with blinding speed. He vanishes into a cloud of smoke, before rematerializing some ten feet behind you. \n\n\n“Easy, my friends!” he says quickly as John Boy levels a crossbow at his chest, “what kind of host feasts on his own guests?” \n\n\n“Easy Crowley!” Frye says as the giant knight steps towards d’Harcourt. \n\n\nD’Harcourt slowly lowers his hands. “Let’s all calm down. I know, my appearance is frightful, but I promise I can explain everything, and no harm will come to you.” \n\n\nReluctantly, you lower your weapons.\n","page 35":"“I won’t abandon my companions,” you say, “I’ll help them end this vampire.” \n\n\nYou’re met with a chorus of approval. John Boy and Stitcher affectionately slap your back. “Good man,” Frye says. \n\n\nD’Harcourt narrows his eyes almost imperceptibly. “Excellent. Since you’re rested and prepared, Terrence can lead you to the beast’s lair now.” \n\n\n“We’re always prepared,” Frye declares. \n\n\n“Terrence, lead them to the lair,” d’Harcourt says slowly to the pale butler. Terrence maintaining his expressionless gaze, exits the room without so much as glancing at you. You follow behind him. “Fortune smile upon you, brave ones.” \n\n\nYou exit the house, and Terrence begins to lead you through the streets. It’s night, now, and the glassy-eyed Butler begins to lead you out to the hinterlands of the town. Behind the town’s protective wall, there are acres upon acres of luscious pasture that would be ideal for a nocturnal man-killer to dig a warren in. \n\n\n“That bit about vampires not killing vampires. Is that true?” Stitcher asks as you walk. \n\n\n“I don’t know,” you admit, “I’ve heard of similar laws with certain kinds of devils. I’m afraid we simply don’t know much about vampires.” \n\n\n“The sisters at the abbey used to say they’re born liars,” she says. \n\n\n“That much we do know,” you respond. \n\n\n“What’s wrong with the butler?” John Boy asks, tossing a suspicious glance at your wordless guide. \n\n\n“If I had to guess, I’d say he’s a thrall. A kind of construct, but fashioned from a human corpse.” \n\n\nThe thrall blankly points sticks a hand in the direction of the field. You can see a few holes in the field, resembling over-sized gopher holes. Tunnels, perhaps? You’ve never known a vampire to tunnel, but you’re far from a daemonologist. \n\n\n“Is the creature around here?” you ask. The thrall blankly nods. \n\n\nFrye lights a torch and begins to lead the party forward. You approach the first of the tunnel-mouths, and look in. It’s clearly a part of a much larger network. It leads down for about six feet, then joins up with another, much larger tunnel, which stretches as far as the eye can see. \n\n\nTor eyes the tunnels nervously. “Fighting away from the open sky…” \n\n\n“I’ll take the lead,” Frye says, “wouldn’t be right to ask anyone else to.” \n\n\nWith that, he crawls into the tunnel. He has a pistol in one hand and a torch in the other. The tunnel is so narrow that it forces him to crawl along his stomach. A few minutes later, he gives the all clear. \n\n\nStitcher is next. She grunts in displeasure as she has to squeeze her broad shoulders through the narrow passage. John Boy is next, and crawls through without complaint. Tor follows after him, muttering the whole time about how it’s not right for a mighty warrior to crawl through worm-infested tunnels. \n\n\nCrowley stares at the tunnel entrance blankly. You look up at the armoured giant. “It’s not worth you getting stuck down there. Keep watch up here.” \n\n\nHe nods. You take one last look at the sky, before crawling into the warrens. \n\n\nYou despise it immediately. There is barely enough room to move your arms. The dirt presses in on you from all sides. The tunnel seems alive, somehow; contorting and squirming in the dark, waiting to digest anything that enters. \n\n\n“Almost through, lad!” Frye shouts encouragingly. You will yourself to keep crawling, even as dirt enters your lungs. Finally, you burst free on the other end of the tunnel, and rejoin the others. \n\n\nYou emerge into a tarnished antechamber, leading into what appears to be a set of stone catacombs. The bricks are ancient. You wonder why they were laid, so far removed from where anyone could possibly see them. \n\n\nFrye holds the flickering torch up to the entrance. Beyond the feeble yellow cone of light, there is only inky blackness. As you enter, the shadows seem to swallow you. \n\n\n“We’ve been in worse situations,” Tor says uncertainly, “this is nothing to slayers such as us.” \n\n\n“Shut your gob,” Stitcher quietly hisses, “we’ve no idea what’s listening.” \n\n\nFrye stops abruptly. Everyone backs into each other. The tunnel fills with surprised cursing. He lifts the torch to the ceiling. \n\n\n“Lord Winter, what the fuck is that?” he says. You look up and squint. After a moment, you notice what he’s talking about; the ceiling is coated in fleshy veins, pulsing with ichor. You shudder as the veins squirm and contort with musical recurrence. The veins are grey and pallid like a cadavre. \n\n\n“Could be leylines, I suppose,” you say. \n\n\n“Are you telling me we’re dealing with a faerie infestation, Lord Winter?” says Frye.\n\n\n“No, a leyline is… well, it’s kind of like… imagine how a farmer irrigates his field. The water must flow from a central point, to get where it’s going. A leyline is that for magic.” \n\n\n“What does that mean for us?” Frye asks. \n\n\n“We should follow it. Whatever lives in this blasted maze probably has something to do with the leylines.” \n\n\nWith Frye’s torch raised upwards, you follow the fleshy veins through the twisting corridors. The darkness is absolute and all-encompassing. Inky blackness presses on you from all sides like water at the bottom of the ocean. You march onwards in total silence, save for the scuffing of feet against the cold stone. Icy terror rises in your breast. \n\n\nYou remember a trick from Stitcher. Three deep breaths in, and on the third, you hold it for as long as you can bear. Then, you exhale and repeat the drill until the terror is gone. All things will pass, she said. \n\n\nYou try to fight off hopelessness as you wind your way through the catacombs. You take a left, a right, two lefts, a right… this cannot be possible. How could a maze of such startling complexity be left underground, in abject darkness. \n\n\n“I don’t think a vampire built this…” you say quietly. \n\n\nThe maddening journey through the catacombs ends abruptly as you emerge into a garganguant stone chamber. It is roughly spherical, fashioned from the same rough brick-and-mortar as the rest of the catacombs. In the flickering torchlight, you can see stone steps leading down into depths of profane tenebrosity.\n\n\n“Wait,” you say, “that’s impossible.” \n\n\n“How do you figure?” Tor asks. You can hear his blade scrape on a wall as he readies it. \n\n\n“We didn’t descend more than a few feet, back in the dirt tunnels. This chamber is gigantic. It would be sticking out on the surface.” \n\n\n“Foul fucking magic,” Stitcher mutters. \n\n\n“Agreed,” you say. \n\n\n“Only one way through this now,” Frye says quietly. He begins to descend the steps. The torch seems hilariously inadequate against the dark that threatens to swallow you whole. You follow close behind him. \n\n\nAt the bottom of the stairs lies a round marble dais. Atop it is perfectly-hewn piece of black glass, as tall as a man. It’s impossibly smooth and polished to a mirror sheen. The surface is decorated with delicately painted white runes. It hums with magical potential. You look up, and see that the leylines converge over the slab; a criss-crossing, writhing spider web of veins, drip-feeding magical energy to this object. For what purpose? \n\n\n“I think we should leave it alone,” you say. Your grandfather’s skull loudly gasps for air. \n\n\n“Agreed,” Frye says, as he begins to back away. You do the same. Your heel catches on a step, and you tumble backwards. \n\n\nThe slab begins to hum angrily, as if your presence has offended it. The runes begin to glow, searing their shapes into your eyeballs. The slab begins to shake. \n\n\n“Get down!” you yell, diving blindly for cover into the darkness. \n\n\nThe slab explodes in a violent discharge of magic potential. Searing white light overtakes your vision, and your hearing gives way to ringing. \n","page 34":"D’Harcourt whistles, and a servant emerges from the mansion. The servant is dressed in fine clothing, but his skin is deathly pale and his gaze is blank. “Terrence, lead the guests to the sitting room.”\n\n\nTerrence wordlessly complies, leading you into the depths of the house. It’s as spectacular on the inside as it is on the outside, the walls covered in rare art and gorgeous sculptures. D’Harcourt seems to be a real appreciator of portraiture, perhaps to compensate for the lack of mirrors in his house. You figure out his nature almost instantly. \n\n\nAs Terrence leads you through the house, you lean in to whisper into Frye’s ear. “Be careful, this one’s a —” \n\n\n“A vampire, yes,” d’Harcourt says, “it’s an unfortunate term, but I suppose it works well enough for our purposes. I’m forced to sustain myself off blood, a fact that I cannot say I am particularly proud of.” \n\n\nBefore you can formulate a response, you arrive at the sitting room. It’s a finely decorated lounge with leather couches, fine cherry-wood tables, and a softly carpeted floor. A fireplace is burning in the corner. \n\n\n“Please, sit,” d’Harcourt says with the practiced manners of an experienced host. You comply, save for Crowley. He stands at attention, as if expecting violence to break out at any moment. \n\n\n“Crowley, don’t piss it off,” John Boy whispers. \n\n\n“If the gentleman is more comfortable standing, he can stand,” d’Harcourt says with a smile, “I could chain myself up, if it would make you all more comfortable.” \n\n\n“You could break through chains in an instant,” you say. To this, d’Harcourt raises his hands in mock guilt. \n\n\n“My friends, I harbour no ill will towards the living, and I didn’t mean to deceive you. The townspeople know what I am, and we live in harmony.” \n\n\n“How do you sustain yourself?” you ask. You vaguely remember a taxonomical study on vampires that describes them as creatures of deception, hunting through social manipulation and clever disguises. \n\n\n“Every solstice, I accept an offering. In return, my knowledge of the arcane sciences provides the prosperous village you saw. The villagers are quite happy to trade two people a year for healthy soil, clean water, and full bellies.” \n\n\nA moment goes by as you digest that information. “What task have you for us, then?” Frye says, breaking the silence. \n\n\n“I’m glad you ask. Unfortunately, I am… unable to kill another of my own kind, and another vampire has taken residence in the warrens below the town. He is unscrupulous, and kills when the fancy strikes him. Worse still, he infects recklessly. I’m worried he will spread vampirism through the village quite recklessly, and all of my work in setting up a sanctuary will have been for nothing.” \n\n\n“And what’s in it for us?” Frye asks. \n\n\n“As you can see, I am a wealthy man. I can pay you handsomely, and provide you with the bounty of our harvest, as provisions of our travels.” \n\n\n“We’ll do it,” Frye says instantly. \n\n\n“You sure about this one?” John Boy asks. \n\n\n“I’ve never killed a vampire. I wonder what it’s like,” Tor says. \n\n\nStitcher reluctantly nods. “It’s bad enough these folk have to deal with one creature of the night. We’ve a duty to kill this beast.” \n\n\nD’Harcourt’s gaze turns to you. He glances at your signet ring. “Lord Winter, I am terribly sorry. I should have recognized a member of your most noble line sooner,” he bows immaculately. “I suppose you are a man of the arcane sciences, then? If I remember correctly, the men of your family were great mages, were they not?” \n\n\nYou nod. “I’ve been instructed in the mysteries since I was a lad.” \n\n\n“Then, perhaps you would feel more at home in my library, while your companions dispatch with this menace? You travel with famed adventurers, but if you don’t mind my saying so, I doubt the field of battle is the appropriate place for a scholar such as yourself.” \n\n\n“The lordling fights well,” Stitcher says. \n\n\n“Everyone here is free. I won’t force you to come along, Lord Winter,” Frye says.\n","page 78":"Unfortunate for them, you suppose, but the lives of mortals are fleeting. You are no longer attached enough to humankind to care. The villagers in the hamlet are as cattle to you; you haven’t spoken to one in a hundred years, at this point. They die so fast that there is no point in growing attached. There is also the matter of you killing them to sustain yourself, which complicates mortal friendships. \n\n\nYou turn yourself to scholarly pursuits in an even more dedicated fashion. You read for months at a time, only stopping to feed yourself. Eventually, d’Harcourt stops bothering to speak to you. You read every book of his extensive collection, then you read them twice, then three times. You memorize them word by word, then read them all over again. Eventually, the boredom grows intolerable. \n\n\nYour thirst for blood is matched only by your thirst for knowledge, at this point. D’Harcourt begins to sense your dissatisfaction. \n\n\n“You’re not a prisoner here, you know,” he says one day. It’s the first word he has spoken to you in years. \n\n\nThe sound of his voice startles you. “I know,” you say. Your voice croaks; you are ill-practiced at speaking. It’s the last thing you say to each other for some time. His words plant a seed in your mind, however, which soon blossoms into an all-consuming obsession. You must leave. \n\n\nYears later, you do. You bid d’Harcourt a brief farewell, and set off into the world. For the next few centuries, you brave the abandoned cities and their libraries, rescuing knowledge from the shadowed depths of antiquity. \n","page 37":"Your ears ring. Strange lights flash before your eyes. You’re falling forward, tumbling endlessly into a sea of bright light. You realize your eyes are closed, and open them. \n\n\nYou are instantly assailed by hideous sights. Strange geometries and blasphemous constellations dance before you. You laugh and can see the soundwaves echoing from your throat. You are awash in the cosmic sea; it is strange, beautiful, alien, hostile. You realize, as all madmen do, that the world of flesh and blood, of soil and sky, is but a tiny island, surrounded by an ocean of madness. \n\n\nBefore you lose your grasp on sanity, you slam your eyes shut and clap your hands over your ears. \n\n\nThree deep breaths. In through the nose. Out through the mouth. \n\n\nSome time later, you land roughly in the dirt. \n\n\nYou get up. Your legs shake like a novice sailor’s.Your stomach rebels, and you double over and start vomiting. A few moments later, you wipe your mouth and take stock of your surroundings. \n\n\nYou’re standing in a dirt field. You estimate that there are five to six times more stars in the night sky than there should be. Blue, wisp-like clouds coat the ground like a thick blanket. In the distance, you see the outline of a city; jagged, knife-like buildings stabbing into the sky. \n\n\nYou do a slow three-hundred-sixty turn. The field seems to stretch on forever. You can make out the strange, moving shapes of gargantuan arthropods. The creatures move at a ponderous speed, sifting through the dirt with their prehensile mandibles. You focus on one, and see it lift a human-sized figure off the ground, and gingerly stuff them into a gargantuan sack-gland on its back. \n\n\nThree deep breaths. In through the nose. Out through the mouth. \n\n\nRe-uniting with the party seems paramount to survival. \n\n\nYou wonder if one of your companions may have fallen victim to one of the giant arthropods. You wonder what the purpose of kidnapping human beings is; why take such pains to lift them from the ground, intact? \n\n\nYou approach one of the creatures and lay in the dirt from what you deem to be a safe distance. You observe the beast for several minutes. You estimate it to be fifteen feet tall. It stands on six ponderous legs; it perennially stumbles forward. Its movements seem drunken, somehow; as if the beast is unaccustomed to its own gargantuan size, and is perennially shifting its balance so as not to collapse under its own weight. \n\n\nYou hear a man screaming. Your eyes automatically turn to the source of the noise. You breathe a sigh of relief as you realize the screamer is a stranger. A man in strange garb cowers before the giant insect. \n\n\nPonderously, it crouches down, staring at him for a few seconds with its dozens of eyes. Then, its mandibles slowly extend. It gently grabs the man by the waist. You watch in horror and fascination as its neck bends completely perpendicular to its body, and it deposits him into the writhing sack-gland located on its back. You make out other, squirming figures; other victims, perhaps? \n\n\nYou can make out other human figures, secured in the creature’s membranous pouch. You wonder if your compatriots could be contained within. \n","page 36":"You stay behind with the urbane vampire. He lounges easily on the couch, staring at a wallpaper. “So tell me, how are your studies at the University?” \n\n\n“How did you know I was a student?” \n\n\nHe chuckles. “I knew some of your family. Prodigious magicians, all. Terribly secretive, however.” \n\n\nYou shrug. “I didn’t know any of them well.” \n\n\n“Loneliness is the worst curse of them all, is it not?” he says. \n\n\n“I can think of worse curses,” you say. “No offence.” \n\n\nHe laughs politely. “None taken. Mine is a dire condition.” \n\n\nA few moments go by in amicable silence. “I have some bad news for you,” he says. \n\n\n“What’s that?” \n\n\n“Your friends are dead. There is no beast, there is no other vampire. I lured them into an interdimensional gateway and fed them to a curious race of pain-worshippers I encountered in my younger days. In exchange, a portion of their magic goes to sustaining our village.” \n\n\nYou’re momentarily stunned by his matter-of-factness. “Why are you telling me this?” you ask, after collecting yourself. \n\n\n“You are a student of the arcane, are you not? I offer you a choice. Learn the arts with me, or I will drink of your blood,” even as he threatens you, he still doesn’t drop his courtly manners. He speaks with the politeness of a man asking if you fancy a sporting fencing match. \n","page 70":"You continue to walk with your new companion. You walk in silence, for a few minutes, eyes trained on the foreboding structures in the distance. The jagged buildings begin to remind you of a mouth full of sharp fangs, jutting upwards into the sky, as if some hideous creature were just underneath the surface with its mouth open. \n\n\n“The name’s Thompson,” the ginger man says after a minute of silence. \n\n\n“Winter,” you say. \n\n\n“Odd name,” he responds. \n\n\n“It’s a family name. Surprised you haven’t heard it.” \n\n\nHe shrugs. “Where ya from?” \n\n\n“Exenforde,” you answer. \n\n\n“Never heard of it.” \n\n\n“It’s the largest city in the world, how have you not heard of it?” \n\n\nHe shrugs again. Having established how little the two of you have in common, you proceed in silence for the next few minutes. The city looms larger. You begin to count your breaths again as panic rises in your breast. As you get closer, you can make out more details of the city. \n\n\nThe buildings are gargantuan, and not fashioned out of any material you’re familiar with; they look as if they were fashioned from a single piece of black iron. There are strange outcroppings on the sides of the buildings that resemble metal tree branches. As you get closer, you can see, for the first time, the people suspended from the branches. \n\n\nDozens, if not hundreds of people are strung from them. Men, women, and children have all been gutted and hanged by their entrails. Each unfortunate victim is still alive. The city is alive with the weeping and wailing of the damned. \n\n\n“How are they still alive?” \n\n\nThompson shakes his head. “No one dies here.” \n\n\nIn the distance, you hear the telltale crack-BANG! of a flintlock being discharged. \n\n\n“Friends of yours?” Thompson asks. \n\n\nYou nod. He shoulders his gargantuan sword and the two of you begin to run towards the city. You pass over the crest of a small hill. The rest of the party comes into view. \n\n\nStitcher, Tor, John Boy and Frye stand with their backs to each other. They are surrounded on all sides by baying, sneering, naked men, their bodies emaciated and their skin calcified. You estimate the ghoulish horde to be around fifteen or twenty. They carry cruel, makeshift weapons; hooked poles, chains, cudgels with nails through them. A few don’t carry weapons, but instead appear to have gnawed their fingers down to sharpened points. \n\n\nFrye fires again. The horde flinches, and backs away a few paces. You can see him holster his last, spent pistol. A few of the creatures turn, and look at you. With their attention divided, you guess that you have a few seconds to act. \n","page 72":"You close your fist and summon a crackling ball of arcane energy. You hurl the ball at the vampire’s head, but he effortlessly summons a shimmering ward that harmlessly dissipates the spell. \n\n\n“Perhaps your bloodline is weak, after all,” he says with a smile. He crosses the room in less than a second, before biting your throat with such force that it cracks your spine in two. \n","page 31":"When you awake, Frye’s words ring in your ears: don’t let them take you. Your vision is blurred and you feel like throwing up. Something’s scraping against your back ? the ground. Someone is dragging you by the foot.\n\n\n“Frye?” you ask blearily. \n\n\nThe Donkey turns around and snorts at you, then continues to drag you. Nausea rises in your belly once again, and you vomit all over yourself.  Everything is dark. Taking stock of your surroundings, you realize you’re underground. Torches burn on the wall. Grim images of rape and torture flood your mind. You reach for the skull, but it’s gone. Figures. \n\n\nIf you had to guess, you would say that you’re being dragged down some kind of mineshaft. You want to scream for help, but cannot produce more than a horse whisper. Dread fills your chest like cold water as the Donkey drags you further from the surface. \n\n\n“Fuck,” you whisper before unconsciousness takes you once more. \n\n\nWhen you awake, your head hurts more than you can bear and your thoughts are confused. You remember a terrible blow to the head, and nothing after. You open your eyes to see three sneering Donkeys standing over you. You remember everything, now. The battle, your cowardice, and the mad look of lust on the Donkey that incapacitated you. \n\n\nOne of them stomps on your head with its hoof. You hear a terrible cracking sound as a fracture opens on your skull. Your thoughts become scrambled as blood trickles down into your eye. They laugh and bray as they stomp you, breaking your body in a half dozen places. You are a miserable, wretched thing, now. Your feeble attempts to crawl away are met with more laughter as they drag you back in place. \n\n\nYou think the final coherent thought of your life:  I will suffer greatly before I die. \n\n\nYour prognostication is correct. You suffer terrible indignities for hours. First they take turns raping you. Then, they cut your fingers off. You gaze miserably at the ruined stumps that used to be your hands. You try to call for help, but the most you can produce is a pitiable moan. It feels like a mercy when one of the Donkeys stomps your head with such force that your skull caves in like a rotted pumpkin. \n","page 75":"One night, you awake from your bed with a rising sense of fury. D’Harcourt killed your friends. He has taught you much, and sometimes you even enjoy his company, but he cannot be allowed to get away with this. His manners, his sense of humour, even his knowledge of the liberal arts begins to infuriate you. He must die. \n\n\nOne day, you cover yourself in a cloak and take a stroll through the village. You approach the blacksmith. He’s a swarthy man, with greasy fingers and a long beard. \n\n\n“Master Winter!” he says jovially. You’re well known around the village. Your condition is of no secret to the villagers, but in their minds, vampirism is somehow associated with the hamlet’s prosperity; they are sheep, loyal to the shepherd, even as he leads them to slaughter.\n\n\n“Can you forge this into a knife?” you ask. You scatter a collection of priceless silver coins onto his desk. \n\n\n“What for?” he asks. His eyes widen. \n\n\n“I want to kill myself,” you say dryly. “Do it now.” \n\n\nYou watch him heat the forge. “It needs to be a silver-iron alloy so it’s hard enough to stab. At least thirty percent needs to be silver,” you read a half dozen books on forgecraft in preparation for this moment. He hands you your weapon without asking for payment; his payment is his life. \n\n\nYou grab it with a gloved hand and stuff it into your cloak, before wordlessly going back to the manner. \n\n\nD’Harcourt smiles when he sees you. “Be careful in the sun my friend!” he says. His concern is genuine, but it still angers you. You approach him. He frowns. “Is something wrong?” \n\n\nIn a flash, you stab him in the chest with the silver dagger. The blade is soft and bends immediately, but the damage is done. He glances down at the blade protruding from his chest and realizes his eternal life has come to an end. \n\n\n“Why?” he asks. \n\n\nYou don’t answer. Instead, you watch him topple to the floor. He breathed his last breath millenia ago, but you watch the light leave his eyes. You leave the corpse on the floor, and turn to reading an ancient treatise on funerary practices of the mid-third century. \n\n\nIt dawns on you that you are the lord of the manner, now. \n","page 30":"As the last Donkey’s lifeblood seeps into the dirt, your hands begin to shake violently and your eyes involuntarily well up with tears. A chill passes over your skin. You have to sit down. The rest of the party joins you. Together, you sit in silence for a moment, proudly regarding the pile of slain demons that lies before you. \n\n\nStitcher stands up abruptly and opens her book to a leatherbound passage. “Alright, who’s injured?” \n\n\n“A minor scrape, my dear,” Frye says, noticing a crudely made knife jutting out of his shoulder. Blood is pooling in his armour at an alarming rate. \n\n\nStitcher’s lips pull back and her eyebrows knit together. “You fucking idiot,” mutters under her breath as she approaches Frye. “Right, Tor,  be ready to pull this out. John Boy, be ready with a rag. Lordling, go fetch something to stick in Frye’s mouth.” \n\n\nMoving quick, you pull a knife from its resting place in a Donkey’s eye socket. You wipe the blood and ocular fluid off on your sleeve, then offer Frye the leatherbound hilt to bite down on. \n\n\n“Three, two, one. Pull,” Stitcher says tersely. Tor yanks on the dagger. Frye’s screams are muffled by the knife. After a second of straining, the knife pops out, carrying with it a chunk of bloodied meat and sinew. The “knife” is little more than a sharpened piece of bone with metal hooks drilled into the side, making it agony to remove. John Boy stuffs a clean rag over the wound with practiced efficiency as Stitcher reads aloud from the book. Her right hand glows brightly and begins to emit a pleasant warmth as she presses it against Frye’s bloodied arm. His screams subside almost instantly as his wounds heal. John Boy pulls the rag away, and you watch as his shoulder stitches itself up in real time \n\n\n“Thanks,” Frye says breathlessly as he leans backwards, “we’ve a new story for the songs! One-Eye Frye the cunning and brave, shivved in the arm by a pack of rapist devils.” \n\n\nExhausted as they are from the skirmish, no one laughs at Frye’s joke. “Fair enough.” \n\n\nYou depart some twenty minute laters, the pile of corpses in your wake. As soon as your backs are turned to the dead Donkeys, a flock of crows has gathered. You hear their squawks of delight as they begin their grim feast. \n\n\nAs you make camp that night, you swap stories and drink, as has become the custom. As the group swaps boasts about the day’s battle, Frye locks eyes with you. “Lordling, why don’t you tell us about the one you took down?” \n\n\nYou become aware of ten eyeballs staring at you. “Right, well, uh. I think I was behind you, Frye, and I got distracted watching that mad bastard Tor rip a Donkey’s jaw clean off.” \n\n\n“A mighty deed it was!” Tor declares without an ounce of modesty, earning himself a light boot in the shin from Stitcher. \n\n\n“And the next thing I know, something grabs me by the hair and starts dragging me backwards. I looked up, and there I saw this Donkey; spitting and raving, and fully, um, engorged. I knew I had to act fast. So I barbecued the bastard.”\n\n\n“You did more than barbecue the bastard, I’d say. Brain shot clear out his head,” John Boy remarks. \n\n\nFrye smiles wide, at that. “We’ll make a warrior of you, yet.” \n\n\nStitcher raises her wineskin. “To the lordling!” \n\n\nTor raises his cup. “To barbecuing bastards!” \n\n\nYou raise your flask. “To making it out alive!” \n","page 74":"What does one do with an eternity? For vampires, or at least this vampire, the answer appears to be “read”. D’Harcourt’s library is massive. It contains every tome imaginable on history, philosophy, folklore, military strategy, and more; not to mention an impressive selection of magical lore. \n\n\nFor the first few months, you wonder why d’Harcourt turned you. You think you know the answer: intellectual narcissism. You begin to secretly believe that he simply needed an audience for his tremendous knowledge, and that the peasants of the village were too hayseed to satiate his thirst for an audience. \n\n\nIt’s not intolerable, however. He is a scholar’s scholar, and has lived long enough to be a firsthand witness of many historical events. You learn of long-distant wars, courtly gossip two hundred years out of date, fencing techniques lost to time, and military tactics so convoluted that they make your head spin. Your sorcerous abilities also grow tenfold, as he teaches you the secrets of peering through dimensions, creating thralls, magical exsanguination, and many other terrible and wondrous techniques.\n\n\nAfter a few years, his arrogance becomes of little surprise. How could one not be arrogant? A mortal soul simply doesn’t have the time to study military theory, philosophy, religion, and magic in order to truly master all these disciplines. Your physical superiority is something to behold, now; you are strong, fast, and unmistakably more than human. \n\n\nSometimes, your thoughts turn to your compatriots; those luckless adventurers who died, all those years ago. Are they still suffering? Does it matter? You think on this question for at least a year; your sense of temporal urgency is long gone, thanks to your unlimited lifespan. \n","page 44":"You wake up a second later, gasping for breath. You feel awful, as if you’ve just been resurrected from the dead with the worst hangover imaginable. \n\n\n“Fuckin’ magic,” Stitcher says. A small smile crosses her lips as you sit up. “The lordling’s alive.” \n\n\n“Starting to think this one might be invincible!” Frye says excitedly. He approaches you as he reloads his pistols with practiced ease.\n\n\n“Don’t feel invincible,” you say, “I feel like I just died.” \n\n\n“Catch your breath for a minute, lad, then I’ll tell you about my plan to get us out of here,” Frye says. He stuffs his last pistol into its holster, claps a hand on your shoulder, and sits down alongside you. For a moment, the two of you stare at the city in silence. \n\n\nTor winces in pain as Stitcher seals a gash on his cheek. He rubs the new scar in grateful admiration. John Boy reloads his crossbow and retrieves his bloodied knife from the dirt. You wonder if they can survive another encounter like that. \n\n\n“What’s this plan, then?” you ask. \n\n\n“John Boy, tell him what you saw,” says Frye. \n\n\nJohn Boy walks over as he wipes his hunting dagger on a filthy sleeve. “Frye sent me out. Couple hours ago.” \n\n\n“How is that possible? I came over as soon as we arrived,” you say. \n\n\nHe shrugs. “Nothing works right, here. Whole place seems to be designed around funneling stragglers into the city.” \n\n\n“That’s where those spider-things are taking the people?” \n\n\n“Right. Saw something else, too. Two sentries on patrol. They wore hoods, weird masks. Carried rifles. Overheard their conversation. Didn’t recognize some words, thought you might. Talking about planes, captives, other realms. Also talked a lot about some kind of machine.” \n\n\nYou reach into your knapsack and pull out a well-worn volume: Sacred Geometries of the Yellow Order. \n\n\n“Are you planning on reading us out of here?” Tor asks, walking over. He leans heavily on his harpoon. \n\n\nJohn Boy shakes his head at Tor. “That’s intel.” \n\n\nYou open it to a dog-eared page. “The Yellow Order were a third-century post-Harvest order of mystics. Their leader, Francisco Al-Wahad, disappeared after claiming to unlock the secret of interdimensional travel. Some of their practical magic still gets taught, but the more esoteric stuff has fallen out of favour.” \n\n\n“Interdimensional travel…” Frye begins. \n\n\n“Or, like Tor heard, travel between planes. It means the same thing. The denizens of this plane clearly know how to cross over, using that black stone we saw.” \n\n\n“Why would that blasted Mayor turn us over to these people?” \n\n\nYou ponder this for a moment. “They’re clearly very advanced. Some of their magic is beyond anything we’re capable of. Perhaps they gave him something in return? And he offers up tributes?” \n\n\n“What does a mayor have to gain from striking a deal with fiends from beyond?” Stitcher asks. \n\n\n“Think about it. What village that you know of has green grass? What about healthy cattle?” you say. \n\n\n“I knew there was something foul about that village,” Stitcher says. \n\n\n“Exactly. I’d need to look at this machine to know more, but bet it runs off human tribute. In return, maybe they offer their magic to the village?” \n\n\n“That’s how d’Harcourt doesn’t get his lair destroyed by angry villagers. Few of them go missing each year. They think it’s just his feeding habits. Don’t realize that they wind up here.” \n\n\nYou look at Frye. “So what’s the plan, here?” \n\n\nHe ponders this, for a moment. “We try to ambush a patrol. We take them by surprise, hold them up for information. Then, we try to push forward into the city and look for the exit.” \n\n\nYou swallow your fear as best you can as you move towards the city. The screams of the damned grow louder. The inhuman metropolis comes more to life as you get closer. In addition to human screaming, you can also hear the wail of distant beasts; you recognize barking dogs and squawking chickens, and hear strange, exotic noises as well. It is surrounded by a smooth, featureless wall, formed from the same metal as the gargantuan buildings. The wall is dotted by regular guardhouses, every half a mile. \n\n\nPatrolling soldiers move in and out of the city. They wear leather masks that cover their entire face, with two large glass eye-plates set in brass. In place of a mouth they have a circular valve, connected by a hose to a backpack that resembles a blacksmith’s bellows. The bellows wheeze and contract, pumping air into the lungs of the bearer. \n\n\nYou circle around the city  in silence, until you come across a guardhouse that seems the most remote. The guardhouse is an upraised, rectangular building set into the side of the wall. The wall facing out of the city has a section carved out, perhaps for sentries to shoot out of. \n\n\nNext to the guardhouse is a sort of gate, formed from rigid metal spikes that interlock with each other. You guess that the mechanism to unlock them is held inside. \n\n\nYou circle together outside the walls and discuss a plan of attack. \n\n\n“Two inside. Will call for help,” John Boy says. \n\n\nYou nod. “We need to take them by surprise, and take them down fast.” \n\n\nTor takes his harpoon from his back and raps the head against his palm. “I’m ready.” \n\n\nFrye shakes his head. “You’ll alert them. Lord Winter, can you hold a man fast without him screaming?” \n\n\nYou nod. “Easily.” \n\n\n“Good. You and John Boy will slip in and clear the way.” \n\n\nYou look over to John Boy. He nods. \n\n\n“Hold a minute,” Stitcher says as you turn to leave. She reaches down and grabs a fistful of dirt. Before you say a word, she sprinkles it over your head. \n\n\n“Do you swear to do good, forsake evil, and honour the gods?” she asks. \n\n\nYou think about it for a second. “I suppose.” \n\n\n“Congratulations, you’re baptized,” she says, slapping you on the shoulder. \n\n\nWith the matter of your eternal soul out of the way, you turn your attention to the task at hand. You and John Boy crouch down low and approach the guardhouse, leaving the others a safe distance behind. You approach stealthily, crawling on your stomachs up to the firing slit. \n\n\nHe presses his lips to your ear, then whispers: “I kill the one on the left. You hold the one on the right.” \n\n\nYou silently nod. He counts you down on one hand from three. When one finger remains, you both leap to your feet. The two sentries are taken wholly unawares. John Boy, never one to miss his mark, hits one square in the eye with a bolt. The eye-plate is instantly shattered as the bolt enters its brain, and the guard limply falls to the ground. \n\n\nBefore the other can scream for its fallen comrade, you reach out with your mind and encase it in a field of telekinetic energy. You hurl it against the ceiling, dashing its head so hard that it loses consciousness, before dropping it against the floor. \n\n\nThe danger gone, you wave your compatriots over to the gatehouse. For a moment, you stand outside the spike-gate, contemplating how to get in. The wall is smooth and featureless, and likely difficult to scale. The firing slit is too small to fit through. \n\n\n“Stand aside,” Tor says as he steps forward. He grabs one of the spikes and pulls ferociously. At first, he strains fruitlessly. Then, slowly, it begins to retract. He grits his teeth in frustration and plants his feet. The mechanism breaks with a great metallic noise, and the spike easily slides back into its slot. He does the same for the other five spikes, breaking off their locking mechanisms and slamming them back into place. \n\n\nWhen his task is complete, he sits down and pants in exhaustion. Every inch of his body is covered in sweat. \n\n\n“This is why,” he wipes the sweat from his brow, “you must always travel with a great hero.” \n\n\nWith Tor resting, you turn your attention to the task of interrogating the prisoner. As you enter the guardhouse, it is rousing from unconsciousness and reaching for its rifle. You kick it from its hands, then stomp on its hand. Underneath its mask, you hear a muffled whimper. \n\n\nFrye grabs it by the shoulders and hauls it to a sitting position. He presses a pistol against the guard’s stomach. \n\n\n“What’s your name?” \n\n\nIt chatters in an alien tongue. \n\n\nStitcher enters, mace in hand. “Let me end this quickly.” \n\n\nJohn Boy enters the room. He says nothing, and lurks in the corner. His eyes are trained on the captive. \n\n\n“What’s your fucking name?” Frye asks. He jams the pistol into the guard’s stomach. \n\n\nThe guard continues to speak. There’s a desperation to its foreign words as its tempo increases. \n\n\n“It’s holding out,” John Boy says, breaking his silence. \n\n\n“What do you mean?” you ask. \n\n\n“Heard them talking. They speak our language.” \n\n\nThe guard raises its hands, guiltily. “I had to try.” \n\n\nA moment of silence passes. Frye cracks a smile, then he begins to laugh. “That’s a good one,” he admits, before he throws the guard on the ground and begins to pummel its head with the barrel of his gun.\n\n\n“Stop, stop!” the guard begs. Their voice is somewhere between a man and a woman.\n\n\n“Start talking or I’ll rip those fucking bellows off your back,” Frye hisses. \n\n\nThe guard moans pitiably. “I can show you the Machine and tell you everything, just spare my life!” \n\n\nFrye holsters the pistol and smiles diplomatically. “That was all I wanted. No reason we can’t all be reasonable, here.” \n\n\nThe guard sits up. “This one is Rashid Ptah-Gad. To understand, properly, you need to understand the history of all the Ptah-Gad…” \n","page 46":"You draw your grandfather’s skull, close your eyes, and try to draw from your reservoir\n\n\nof concentration. You can hear panting and mad laughter as they draw nearer. \n\n\n“Lad!” Frye shouts a warning. You open your eyes. They’re inches away. You throw yourself backwards and channel as much magical energy through the skull as you’re capable of. Magic courses through your body. Every hair on your neck stands up. Your teeth itch.\n\n\nYou open your eyes, half-expecting to see the face of a blood-crazed ghoul sinking a knife into your belly. Instead, the pack is seemingly frozen in place. Before you and your assailants lies a shimmering triangle of  yellow light. Unearthly energies blow through like a cold wind through an open window. \n\n\nThe ghouls stand there, wild-eyed and shaking. You can smell the sea and hear chirping birds, in the distance. You stare into the triangle and catch a glimpse of the ocean. An instant later, the ghouls are sucked through and the portal closes. \n\n\nThe exertion makes you weak. You pass out a second later. The last thing you see is approaching footsteps. \n","page 45":"You fire four bolts of searing energy into the crowd. Each one hits one of the ghoul; their dry skin burns like tinder, and their ruined bodies fall to the ground. Your efforts are woefully insufficient. \n\n\nA wave of screaming naked bodies crashes over you. You’re instantly held fast by a dozen iron grips. You are stabbed, bitten, and ripped to pieces. Your body is rended and shattered.  The creatures fight over your  wretched remains like chickens squabbling over pieces of grain; you watch two ghouls do a tug-of-war with a section of your intestines. A ghoul standing over you, your severed arm in its mouth. \n\n\nAlthough your body is ruined and in pieces, you are still very much alive. You can see the battle; your comrades are overtaken shortly after you. Stitcher is the last to fall; a battle-prayer is on her lips as she defends the remains of her fallen compatriots. The giant woman fights like a cornered bear until a ghoul thrusts a spear through the back of her head and out her mouth, sending her teeth and tongue shooting out the front. As soon as she falls, her corpse is simultaneously raped and devoured. \n\n\nYou are spared the indignity of watching your own remains be further defiled, as a ghoul tears your eyes out. The last thing you see before an eternity of darkness is two corpse-like thumbs reaching into your eye sockets. \n\n\nAs you lay in darkness, ruined and defiled beyond all recognition, you realize why the people you saw strung up in the city are not dead. No one dies here. \n\n\nEventually, the pack grows bored, and moves on. When the agony fades, boredom sets in. You only have an eternity to wait. \n","page 48":"You wake up a second later, gasping for breath. You feel awful, as if you’ve just been resurrected from the dead with the worst hangover imaginable. \n\n\n“Fuckin’ magic,” Stitcher says. A small smile crosses her lips as you sit up. “The lordling’s alive.” \n\n\n“Starting to think this one might be invincible!” Frye says excitedly. He approaches you as he reloads his pistols with practiced ease.\n\n\n“Don’t feel invincible,” you say, “I feel like I just died.” \n\n\n“Catch your breath for a minute, lad, then I’ll tell you about my plan to get us out of here,” Frye says. He stuffs his last pistol into its holster, claps a hand on your shoulder, and sits down alongside you. For a moment, the two of you stare at the city in silence. \n\n\nTor winces in pain as Stitcher seals a gash on his cheek. He rubs the new scar in grateful admiration. John Boy reloads his crossbow and retrieves his bloodied knife from the dirt. You wonder if they can survive another encounter like that. \n\n\n“What’s this plan, then?” you ask. \n\n\n“John Boy, tell him what you saw,” says Frye. \n\n\nJohn Boy walks over as he wipes his hunting dagger on a filthy sleeve. “Frye sent me out. Couple hours ago.” \n\n\n“How is that possible? I came over as soon as we arrived,” you say. \n\n\nHe shrugs. “Nothing works right, here. Whole place seems to be designed around funneling stragglers into the city.” \n\n\n“That’s where those spider-things are taking the people?” \n\n\n“Right. Saw something else, too. Two sentries on patrol. They wore hoods, weird masks. Carried rifles. Overheard their conversation. Didn’t recognize some words, thought you might. Talking about planes, captives, other realms. Also talked a lot about some kind of machine.” \n\n\nYou reach into your knapsack and pull out a well-worn volume: Sacred Geometries of the Yellow Order. \n\n\n“Are you planning on reading us out of here?” Tor asks, walking over. He leans heavily on his harpoon. \n\n\nJohn Boy shakes his head at Tor. “That’s intel.” \n\n\nYou open it to a dog-eared page. “The Yellow Order were a third-century post-Harvest order of mystics. Their leader, Francisco Al-Wahad, disappeared after claiming to unlock the secret of interdimensional travel. Some of their practical magic still gets taught, but the more esoteric stuff has fallen out of favour.” \n\n\n“Interdimensional travel…” Frye begins. \n\n\n“Or, like Tor heard, travel between planes. It means the same thing. The denizens of this plane clearly know how to cross over, using that black stone we saw.” \n\n\n“Why would that blasted Mayor turn us over to these people?” \n\n\nYou ponder this for a moment. “They’re clearly very advanced. Some of their magic is beyond anything we’re capable of. Perhaps they gave him something in return? And he offers up tributes?” \n\n\n“What does a mayor have to gain from striking a deal with fiends from beyond?” Stitcher asks. \n\n\n“Think about it. What village that you know of has green grass? What about healthy cattle?” you say. \n\n\n“I knew there was something foul about that village,” Stitcher says. \n\n\n“Exactly. I’d need to look at this machine to know more, but bet it runs off human tribute. In return, maybe they offer their magic to the village?” \n\n\n“That’s how d’Harcourt doesn’t get his lair destroyed by angry villagers. Few of them go missing each year. They think it’s just his feeding habits. Don’t realize that they wind up here.” \n\n\nYou look at Frye. “So what’s the plan, here?” \n\n\nHe ponders this, for a moment. “We try to ambush a patrol. We take them by surprise, hold them up for information. Then, we try to push forward into the city and look for the exit.” \n\n\nYou swallow your fear as best you can as you move towards the city. The screams of the damned grow louder. The inhuman metropolis comes more to life as you get closer. In addition to human screaming, you can also hear the wail of distant beasts; you recognize barking dogs and squawking chickens, and hear strange, exotic noises as well. It is surrounded by a smooth, featureless wall, formed from the same metal as the gargantuan buildings. The wall is dotted by regular guardhouses, every half a mile. \n\n\nPatrolling soldiers move in and out of the city. They wear leather masks that cover their entire face, with two large glass eye-plates set in brass. In place of a mouth they have a circular valve, connected by a hose to a backpack that resembles a blacksmith’s bellows. The bellows wheeze and contract, pumping air into the lungs of the bearer. \n\n\nYou circle around the city  in silence, until you come across a guardhouse that seems the most remote. The guardhouse is an upraised, rectangular building set into the side of the wall. The wall facing out of the city has a section carved out, perhaps for sentries to shoot out of. \n\n\nNext to the guardhouse is a sort of gate, formed from rigid metal spikes that interlock with each other. You guess that the mechanism to unlock them is held inside. \n\n\nYou circle together outside the walls and discuss a plan of attack. \n\n\n“Two inside. Will call for help,” John Boy says. \n\n\nYou nod. “We need to take them by surprise, and take them down fast.” \n\n\nTor takes his harpoon from his back and raps the head against his palm. “I’m ready.” \n\n\nFrye shakes his head. “You’ll alert them. Lord Winter, can you hold a man fast without him screaming?” \n\n\nYou nod. “Easily.” \n\n\n“Good. You and John Boy will slip in and clear the way.” \n\n\nYou look over to John Boy. He nods. \n\n\n“Hold a minute,” Stitcher says as you turn to leave. She reaches down and grabs a fistful of dirt. Before you say a word, she sprinkles it over your head. \n\n\n“Do you swear to do good, forsake evil, and honour the gods?” she asks. \n\n\nYou think about it for a second. “I suppose.” \n\n\n“Congratulations, you’re baptized,” she says, slapping you on the shoulder. \n\n\nWith the matter of your eternal soul out of the way, you turn your attention to the task at hand. You and John Boy crouch down low and approach the guardhouse, leaving the others a safe distance behind. You approach stealthily, crawling on your stomachs up to the firing slit. \n\n\nHe presses his lips to your ear, then whispers: “I kill the one on the left. You hold the one on the right.” \n\n\nYou silently nod. He counts you down on one hand from three. When one finger remains, you both leap to your feet. The two sentries are taken wholly unawares. John Boy, never one to miss his mark, hits one square in the eye with a bolt. The eye-plate is instantly shattered as the bolt enters its brain, and the guard limply falls to the ground. \n\n\nBefore the other can scream for its fallen comrade, you reach out with your mind and encase it in a field of telekinetic energy. You hurl it against the ceiling, dashing its head so hard that it loses consciousness, before dropping it against the floor. \n\n\nThe danger gone, you wave your compatriots over to the gatehouse. For a moment, you stand outside the spike-gate, contemplating how to get in. The wall is smooth and featureless, and likely difficult to scale. The firing slit is too small to fit through. \n\n\n“Stand aside,” Tor says as he steps forward. He grabs one of the spikes and pulls ferociously. At first, he strains fruitlessly. Then, slowly, it begins to retract. He grits his teeth in frustration and plants his feet. The mechanism breaks with a great metallic noise, and the spike easily slides back into its slot. He does the same for the other five spikes, breaking off their locking mechanisms and slamming them back into place. \n\n\nWhen his task is complete, he sits down and pants in exhaustion. Every inch of his body is covered in sweat. \n\n\n“This is why,” he wipes the sweat from his brow, “you must always travel with a great hero.” \n\n\nWith Tor resting, you turn your attention to the task of interrogating the prisoner. As you enter the guardhouse, it is rousing from unconsciousness and reaching for its rifle. You kick it from its hands, then stomp on its hand. Underneath its mask, you hear a muffled whimper. \n\n\nFrye grabs it by the shoulders and hauls it to a sitting position. He presses a pistol against the guard’s stomach. \n\n\n“What’s your name?” \n\n\nIt chatters in an alien tongue. \n\n\nStitcher enters, mace in hand. “Let me end this quickly.” \n\n\nJohn Boy enters the room. He says nothing, and lurks in the corner. His eyes are trained on the captive. \n\n\n“What’s your fucking name?” Frye asks. He jams the pistol into the guard’s stomach. \n\n\nThe guard continues to speak. There’s a desperation to its foreign words as its tempo increases. \n\n\n“It’s holding out,” John Boy says, breaking his silence. \n\n\n“What do you mean?” you ask. \n\n\n“Heard them talking. They speak our language.” \n\n\nThe guard raises its hands, guiltily. “I had to try.” \n\n\nA moment of silence passes. Frye cracks a smile, then he begins to laugh. “That’s a good one,” he admits, before he throws the guard on the ground and begins to pummel its head with the barrel of his gun.\n\n\n“Stop, stop!” the guard begs. Their voice is somewhere between a man and a woman.\n\n\n“Start talking or I’ll rip those fucking bellows off your back,” Frye hisses. \n\n\nThe guard moans pitiably. “I can show you the Machine and tell you everything, just spare my life!” \n\n\nFrye holsters the pistol and smiles diplomatically. “That was all I wanted. No reason we can’t all be reasonable, here.” \n\n\nThe guard sits up. “This one is Rashid Ptah-Gad. To understand, properly, you need to understand the history of all the Ptah-Gad…” \n","page 49":"“In the beginning, in the Time Before Time, we were, — how do you say —  born, from the seeds planted by another race. They were the Far Travelers, they came from beyond the stars, and created us with their magic. We were created without the annah-ptah, though; the, thing, the…” they trail off, searching for the right word. \n\n\n“Soul?” you offer. \n\n\n“Soul, right, yes, the soul. You are a learned one, so you know that the soul is what all magic must spring from. Without it, we must rely on the magic of the Far Ones. But the Far Ones do not speak, anymore. Their magic is gone from the world. In their absence, they left us the Machine; it keeps us alive; it processes the annah-ptahim, the souls, of others, and allows us to live,” they motion to the bellows on their back, “we breathe them.” \n\n\n“Well that’s all well and good, but how does that get us out of here?” Frye asks impatiently. \n\n\n“The Machine, the life-giver, it is connected to the, how do you say, the door that brought you here. If you can enter, and you have one who can read the maps, you can leave.” \n\n\nFrye turns to you. “Do we have someone who can read the maps?” \n\n\nYou answer truthfully: “I don’t know.” \n\n\n“It will have to do,” Frye pulls a pistol and levels it at the creature’s head. “You’ve been most helpful; make peace with whoever you will.” \n\n\n“Wait!” they hiss, “the Machine will reject you!” \n\n\n“What do you mean?” Frye asks, finger tightening on the trigger. \n\n\n“It knows you do not have souls. It will not open for you. You need someone to let you in. One of my kind.” \n\n\nStitcher taps her mace against her hand. “Kill this freak.” \n\n\n“I do not want to be stuck in this unholy place,” Tor says. \n\n\n“Easy, easy,” you say, “I don’t think this thing is lying.” \n\n\n“Alright, you’re coming with us. One false move, and I rip that thing off your back and see what happens,” Frye says. \n\n\n“A most charitable act,” the guard says. “I am most grateful and—” \n\n\n“No one asked your fucking feelings,” Stitcher says,  raising her fist in the air. The creature flinches and raises its hands defensively. \n\n\n“Mercy!” Rashid-Ptah-Gad cries. \n\n\n“Should get a move on,” John Boy says, “bound to be more soon.” \n","page 40":"You fire four bolts of searing energy into the crowd. Each one hits one of the ghoul; their dry skin burns like tinder, and their ruined bodies fall to the ground. Your efforts are woefully insufficient. \n\n\nA wave of screaming naked bodies crashes over you and Thompson. The big man is dragged down immediately. He doesn’t have time to scream before a sharpened stake is thrust into his mouth. A second later, his guts are ripped out by eagre clawed hands. \n\n\nHis agonized screams barely register, to you. You’re held fast by a dozen iron grips. You are stabbed, bitten, and ripped to pieces. Your body is rended and shattered.  The creatures fight over your  wretched remains like chickens squabbling over pieces of grain; you watch two ghouls do a tug-of-war with a section of your intestines. A ghoul standing over you, your severed arm in its mouth. \n\n\nThompson was right. No one dies here. Although your body is ruined and in pieces, you are still very much alive. You can see the battle; your comrades are overtaken shortly after you. Stitcher is the last to fall; a battle-prayer is on her lips as she defends the remains of her fallen compatriots. The giant woman fights like a cornered bear until a ghoul thrusts a spear through the back of her head and out her mouth, sending her teeth and tongue shooting out the front. As soon as she falls, her corpse is simultaneously raped and devoured. \n\n\nYou are spared the indignity of watching your own remains be further defiled, as a ghoul tears your eyes out. The last thing you see before an eternity of darkness is two corpse-like thumbs reaching into your eye sockets. \n\n\nEventually, the pack grows bored, and moves on. When the agony fades, boredom sets in. You only have an eternity to wait. \n","page 42":"You walk in silence, eyes trained on the foreboding structures in the distance. The jagged buildings begin to remind you of a mouth full of sharp fangs, jutting upwards into the sky, as if some hideous creature were just underneath the surface with its mouth open. \n\n\nThe city looms larger as you continue towards it. You begin to count your breaths again as panic rises in your breast. As you get closer, you can make out more details of the towering, hostile-looking metropolis. \n\n\nThe buildings are gargantuan, and not fashioned out of any material you’re familiar with; they look as if they were fashioned from a single piece of black iron. There are strange outcroppings on the sides of the buildings that resemble metal tree branches. As you get closer, you can see, for the first time, the people suspended from the branches. \n\n\nDozens, if not hundreds of people are strung from them. Men, women, and children have all been gutted and hanged by their entrails. Each unfortunate victim is still alive. The city is alive with the weeping and wailing of the damned. \n\n\nIn the distance, you hear the telltale crack-BANG! of a flintlock being discharged. You rush forward, and cross over the crest of a hill. Stitcher, Tor, John Boy and Frye stand with their backs to each other. They are surrounded on all sides by baying, sneering, naked men, their bodies emaciated and their skin calcified. You estimate the ghoulish horde to be around fifteen or twenty. They carry cruel, makeshift weapons; hooked poles, chains, cudgels with nails through them. A few don’t carry weapons, but instead appear to have gnawed their fingers down to sharpened points. \n\n\nFrye fires again. The horde flinches, and backs away a few paces. You can see him holster his last, spent pistol. A few of the creatures turn, and look at you. With their attention divided, you guess that you have a few seconds to act. \n","page 41":"You draw your grandfather’s skull, close your eyes, and try to draw from your reservoir\n\n\nof concentration. You can hear panting and mad laughter as they draw nearer. Thompson screams as you hear the sound of wet meat being desecrated by a dozen blades. \n\n\n“Lad!” Frye shouts a warning. \n\n\nYou open your eyes. They’re inches away. You throw yourself backwards and channel as much magical energy through the skull as you’re capable of. Magic courses through your body. Every hair on your neck stands up. Your teeth itch.\n\n\nYou open your eyes, half-expecting to see the face of a blood-crazed ghoul sinking a knife into your belly. Instead, the pack is seemingly frozen in place. Before you and your assailants lies a shimmering triangle of  yellow light. Unearthly energies blow through like a cold wind through an open window. \n\n\nThe ghouls stand there, wild-eyed and shaking. You can smell the sea and hear chirping birds, in the distance. You stare into the triangle and catch a glimpse of the ocean. An instant later, the ghouls are sucked through and the portal closes. \n\n\nThe exertion makes you weak. You pass out a second later. The last thing you see is approaching footsteps. \n","page 19":"“I”ll need another drink to explain it to you foreign savages,” Tor says. His accent marks him as a foreigner from distant lands. He enunciates every word carefully, as if terrified of being misunderstood. “My father was my tribe’s Recaller, so I’ll tell it as he did to me. At least, I’ll try. I’ve forgotten some of it.\n\n\nIn the beginning, there was nothing but Grass, Sea, and Father Sand. Grass and Sea were in love, but Father Sand would never allow such a union. So Sea came up with a cunning plan; she would wash over Father Sand, to meet her lover Grass. But when she washed over him, Father Sand turned to mud,” Tor speaks low and slow. There is a moment of silence, broken only by the sounds of Crowley sharpening his sword and the crackle of the campfire. “Now, Father Sand was furious, so he cursed the lovers. ‘Whenever Grass and Sea meet, Grass shall surely die!’ he bellowed as he raged. Ages passed, and Grass grew lonely. So, when Father Sand was asleep, he took some of the mud from Father Sand, and fashioned it into the first men and gods,” a small smile creeps across Tor’s lips, “and that is why all men are dark like mud.”\n\n\n“I should like to visit your barbarian land someday, my friend,” Frye says softly.\n\n\n“It was gone before I was born,” Tor says bleakly.\n\n\nWine-drunk and tired, you retire for the night. Crowley takes first watch, as he always does. Stitcher and Frye hang back by the campfire, talking into the night, as is their custom. Tor heads to his tent, and sleeps next to his harpoon. \n","page 18":"“I don’t think I should,” you say. \n\n\nShe frowns. “That’s a shame. I’ve seen some of your work, it’s not bad. Lacking imagination, but not bad at all.” \n\n\n“Thanks,” you say, not quite sure what to make of the compliment. She turns, spilling a bit of blood on her shoe. Selina doesn’t seem to notice. As she walks away, you wonder what kind of opportunity you may have just turned down. You tell yourself that it does not matter, and that no unsanctioned experiment would justify being expelled for blood magic or necromancy. \n\n\nYou return to your residence, and begin to attack the pile of readings stacked on your desk. Days pass, then weeks, then months You excel in your classes, but never shake the feeling of drudgery. You advance your theoretical knowledge of magic, but learn no techniques worth knowing. You don’t want to memorize lists of arcane geometrical formations, you want power over life and death, and the ability to raze whole armies. \n\n\nEventually, you graduate. You are a licensed Arcanist, permitted to practice magic within the city walls. You open up a small office, and spend the entirety of your career helping wealthy scions make sure their new property acquisitions are not cursed. \n\n\nAlthough you are materially comfortable, you cannot help but feel that you have wasted your potential. \n","page 7":"You step outside, into the chilly afternoon air. The buildings of the University are as old as the city itself, and the campus has a way of making one feel small under the eternal gaze of the gargoyles.  Selina holds her prize, grinning. “Thanks,” she says.\n\n\n“Don’t mention it. What’s it for?” \n\n\n“Some friends and mine, we’re working on something that needs a lot of meat. Cheaper to get it here.” \n\n\n“I take it you’re not cooking a meal,” you say. Suspicion creeps into your voice. Whatever magic ritual is performed secretly and requires buckets of meat, it is probably not sanctioned by the authorities. \n\n\nSelina smiles guiltily. “You should come join us, tonight,” she says. \n\n\nIt’s a tempting offer. Your studies have begun to frustrate you, as of late. You are learning much of what you already know, and you are becoming increasingly convinced that the path to arcane mastery does not involve sitting in a classroom.\n","page 2":"You grab a corner table at the local alehouse with Frye, and he leaves instructions with his crew to come when they finish unloading the ship. He drinks ale like it’s water, happy to drink on your dime. As he drinks, he regails you with war stories. \n\n\n“.. and there I was, surrounded by corpses on all sides. The Donkey Men were patrolling the battlefield, lookin’ for wounded to rape. You ever see a Donkey, boy?” \n\n\n“No.” \n\n\n“Well you know what a regular donkey is, don’t you?” \n\n\n“Yes.” \n\n\n“Then you should be able to picture a Donkey pretty well. Savage lot. We had been scrapping with them all night, and they fight like devils. They’ll chop your head off with one of their axes right as they kick you in the cock with those hooves of theirs, and fuck your corpse for good measure. So one of these bastards is sniffing around, right where I’m laying, and I hear this god awful yell. And in comes Stitcher, with a string of grenades, yelling about how if anyone gets to rape the chief, it’s going to be her. Killed a half dozen in the explosion, wounded ten more. Scared them off.” \n\n\nThe door to the tavern opens, and sunlight spills inside. A gigantic woman in layers of cloth and heavy armour enters. She wears a tattered cloth hat, underneath which her tangled blonde hair spills out. A giant leatherbound book hangs at her belt; you recognize it as The Second Tome of the Sustainer, a book that instructs the faithful on practical miracles, and a favourite of battle-healers. She also wears a morningstar with a cylindrical, spiked head. \n\n\n“Aye, Stitcher!” Frye says with a grin, “come and drink with us!” \n\n\n“If I have no choice, I suppose I’ll drink with you,” she says, returning the smile. She glances at you. “Who is the little lordling?” \n\n\n“Our salvation, Stitcher! My friend, the little lordling, needs passage, and he’s good to pay for it.” \n\n\nShe squints at him. “Passage to where?” \n\n\n“Seffonshire,” you say. \n\n\nShe doesn’t even glance at you. “Frye, that’s far. We barely surv -” \n\n\n“We survived just fine, Stitcher. And we made it back with a haul of treasure that would make your Sustainer blush.” \n\n\nShe opens her mouth, glances at you, then shuts it. For a moment, the three of you sit in silence. “I was just telling our friend the lordling about the time you fought the Donkeys for my virtue.” \n\n\n“You have no virtue,” she says. Frye laughs.\n\n\nOver the course of the day, you’re introduced to the rest of Frye’s companions. First, you meet John Boy, a peg-legged survivalist with a thick beard, bushy eyebrows, and unerring accuracy with his gargantuan crossbow. Then there’s Tor, the man you saw on the ship. He’s a muscle-bound brute of a man with dark brown skin, a bald head covered in scars, and a whaler’s harpoon as tall as you are. Finally, there’s Crowley; a plated knight with a gargantuan broadsword, and a faded tabard that reveals his noble bona fides. You try to inquire about his background, but it’s explained to you that he’s taken a vow of silence until evil is purged from the world, so expect him to be silent for a while. \n\n\nJohn Boy spreads a map out over the table. His voice is as rough as a carpenter’s hands. “We’re here,” he says, pointing at a little city on the map. \n\n\nYou nod. You’re following along so far. \n\n\n“Seffonshire is… here,” his finger slides almost to the other end of the map. You’re separated from Seffonshire by drawings of rivers, twisted thickets, and depictions of tiny devils. \n\n\n“That’s why I’m paying you so handsomely.” \n\n\n“No doubt. Near as I figure, two ways to do this.” \n\n\n“Don’t leave us in suspense, John Boy,” Frye says after a moment of silence. \n\n\n“Right, right. So. Two routes, one longer than the other. We take the forest, it adds a couple weeks. Plus, all the usual forest shit; beasties, madmen, maybe a lesser devil if we get unlucky.” \n\n\n“And the faster route?” you ask. \n\n\n“We take the old Lordspath. Gets us where we’re going quicker, plus good line of sight. Harder to sneak up on.”\n\n\nStitcher shakes her head. \n\n\n“What’s the problem with that?” you ask. \n\n\n“Better to stay away from the abandoned places, little lordling. Dark things are drawn there.” \n\n\n“You’re the one funding this expedition. What do you think?” Frye asks of you. \n\n\n\"Don\u0027t fancy our chances on the Lordspath. We take the Forest road,\" you say. \n","page 1":"The next day, you skip your lecture on Intermediate Natural Philosophy and head instead to the docks, known to be a warren of cut-throats and sailors. With the condition of the oceans these days, mariners are often as hardy as soldiers. \n\n\nUnder your cloak, firmly affixed to your belt, is the skull of your grandfather with two glinting gems in his eyes. It hums with magical promise as you run your hand over it. You almost wish someone would try to rob you. \n\n\nFor a while, you wander through a crowd of stevedores and wild-eyed sailors. The sun shines feebly, barely able to penetrate the sickly fog that lays heavy on the city. The smell of salt fills your nostrils. You catch snippets of sea stories, each one disturbing in its own right. \n\n\n“As big as a whale it were, but covered in eyes!” \n\n\n“Cut Old Jeckles in half, clear as the sky it did!” \n\n\n“I swear by the Three, I saw the Thirsting One himself out on the waves…” \n\n\nYou notice a dangerous looking man stepping off a galley. His wide-brimmed hat is torn, his chainmail shirt is pockmarked and clawed, and one of his eyes is missing. He wears a harness with a half dozen breech-loaded pistols, and carries a sabre at his belt. He carries a red standard in one hand, six feet in length, banner hanging limply in the breeze. \n\n\nYou approach him. \n\n\n“You’re, uh, accustomed to violence?” you ask. Your upper crust accent gives you away immediately. \n\n\nHe looks at you and smiles widely. “Aye friend, me and my companions are known for our might in every harbour.” \n\n\n“I’m looking for passage to Seffonshire.” \n\n\n“Friend, you must be truly mad. That’s across the wastes,” you can tell you have lost his attention. He turns his back to you, shifting his attention to a brawny man with black skin and a scarred bald head who is carrying what appears to be an ancient statue with a cloth draped over it. “Oi! Be careful with that, Tor, you fucking ox of a man!” \n\n\n“I can pay. Handsomely.” \n\n\n“Define handsomely, friend. One-Eye Frye and his Fighting Men are known the world over.” \n\n\nYou flash your signet ring. “I can pay you and your men your weight in silver.” \n\n\nHe cocks his head. “How about you start with a round of ale for me and the lads?”\n","page 4":"You yank the skull from your belt and stare into your grandfather’s eyes. You point your left finger at the deer and utter a quick string of cosmic blasphemies. Frost forms on the ground around you, and your surroundings become a little darker. \n\n\nThe deer buckles under an unseen pressure as the air around it shimmers. A second later, it explodes, showering the clearing with gore. \n\n\nJohn Boy looks at you. “Why?” he grunts.\n\n\n“Watch,” you say, pointing at the viscous puddle that had antlers a moment before. It begins to bubble and shift like water on a stovetop. Soon, an arm bursts from the puddle, followed by another. A bloody, humanoid form begins to drag itself towards you. It resembles a man, but its mouth gapes wider than your head and its skin has the consistency of tar. \n\n\nA crossbow bolt tears through the creature’s head, finishing it off for good. You glance over at John Boy, and he gives you a single nod. \n\n\n“We’d better find something else for the camp,” you say. \n\n\nUseless at hunting, you wander off to check the snares while John Boy enters the bush. An hour later, you reunite; you with a string of rabbits, him with some kind of wild dog slung over his shoulder. \n\n\n“Not bad,” he remarks as you both head back to camp. Your campsite is a lively place, made all the livelier against the backdrop of the deathly stillness of the forest. The fire roars from the ample dead timbre scattered around. Frye, Stitches and Tor are seated around the campfire. Stitcher stares bright eyed at Frye as he recounts the tales of his adventures. Away from the rest, Crowley, still in his armour, sharpens his broadsword; under the helmet, you imagine him grimacing. \n\n\nAs John Boy gets to work skinning and skewering the rabbits, you sit at the fire. You relish the heat against your fingers. Only as you begin to warm up do you realize how cold the forest is. Tor hands you a cup and a wineskin. \n\n\n“We were just telling tales, Mister Winter,” Frye says. You stare into your cup and swirl the red liquid around for a moment, before taking a sip. It’s shockingly good. “Well don’t look so surprised. I’m far from a well-bred lordling such as yourself, but my tastes are still renowned.” \n\n\nAt that, you smile. \n\n\n“Tor, tell us the story of your funny gods, again,” Frye says to Tor.\n","page 3":"He pulls the trigger. The drawstring slams forward, and with a heavy twang, the thick cable sends the bolt flying at the deer. It never arrives. The deer parries the bolt with its antlers, before turning its attention to the pair of you. \n\n\nIt lets out a deafening shriek that sends you reeling into the mud. Squinting through watering eyes, you watch as the deer stands on two legs and its antlers burst further out of its head. Bone shards protrude from its body. A pair of arms burst from its shoulders, spraying blood on the ground. \n\n\nYou dimly remember one of your father’s books: Daemonology, Vol. II. This is a Form-Changer, one of the predatory demons that’s roamed the world since time immemorial.\n\n\nJohn Boy draws a dagger from his belt as it charges. It crosses the clearing in an instant, and ignores him entirely. Instead, it launches a bone spike into the soft flesh of your right hand, pinning it to a tree. You reach for the skull with your other arm, but another spike hits your shoulder with such force that it nearly tears your arm off. The pain is dazzling, so intense that you cannot think or speak. \n\n\nImmobilized and helpless, you watch as it tears John Boy’s arms off in one smooth motion. You struggle helplessly as the demon turns to you. You can only watch as it effortlessly tears five feet of your intestines out and feasts on them before your still-living eyes. \n\n\nYour last breath is spent on a whimper before darkness takes you.\n","page 11":"There’s little time for making friends. You strike while the iron is hot, and begin the laborious process of chanting, conjuring, and above all, dumping prodigious amounts of offal and blood into the vessel. The lights in the room shimmer strangely. The chanting takes on a manic tone after a couple hours. Sweat begins to drip down your forehead. \n\n\nSomething begins to take shape in the clay pot. Meat begins to fuse. First it grows a mouth, then three more, then a few eyes, an ear stalk, and a few appendages you don’t recognize. Blood begins to spew from its mouth as the creature vomits the amniotic fluid of its blasphemous womb. \n\n\n“Something’s wrong,” James says nervously. His eyes are wide with fear. \n\n\nYou barely mask your contempt as you speak. “Shut the fuck up, and hide your fear better.” \n\n\nSarah gasps in pain. You can see her visibly struggling to hold up her end of the ritual. Why are you surrounded by such fools? Selina is the only one with enough competence to not endanger you all. \n\n\n“Why…” the creature whispers. Blood spews from its many mouths as it speaks its first word. “Do… you…” \n\n\n“The connection is weak,” Sarah warns. “I’m holding on as best I can.” \n\n\n“Fuck!” Selina yells. “The dead flesh!” \n\n\nAn idea occurs to you. “Hang on,” you say. You step outside the circle, and grab a bung hammer resting on a discarded cask. \n\n\n“What the fuck are you doing?” Sarah asks. She begins to whimper as the psychic strain grows unbearable. Selina grits her teeth in frustration. Tears begin to stream down James’ face. You can see his resolve failing in real time. \n\n\nYou bash James’ skull with the wooden hammer with such force that he lurches forward into the cauldron. “In you go, fatty,” you hiss as you plant a knee on his back and shove him face-first inside. He screams as his head liquifies and a thousand hands reach out from the vessel, dragging him into the unfathomable depths of the abyss. You can hear his miserable whimpers from a thousand miles away as a fountain of gore erupts from the cauldron. \n\n\n“What the fuck did you do?” Sarah asks.   \n\n\n“He saved the ritual,” Selina says, smiling.  She wipes blood off her lips as she stares at you in admiration. “We needed live blood,” \n\n\n“He killed James!” she protests. \n\n\n“James was a fat, incompetent fuck. He served his purpose,” you say. The cauldron begins to bubble. \n\n\nA great thing emerges from the unfathomable depths of the portal. It casts off James’ gore like a spent cloak as it reveals its terrible forms. Its body is an unfurling spiderweb of eyes and arms; it clutches a sword and a trumpet. \n\n\n“I am Chn’magoth, the Herald!” its mouths move but its voice appears in your mind. \n\n\n“Say the fucking words!” you yell at Sarah. \n\n\nShe fumbles with her spellbook. “Chn’magoth, the Herald, hear our words. We have summoned you from the Beyond, and given you new flesh. Accept our offer of blood, give us mastery over life and death, tell us the secret things.” \n\n\nChn’magoth’s teeth chatter as it simmers with incomprehensible irritation. “I am compelled to accept,” the ghostly voice says in your mind. \n","page 55":"When you cross the threshold into the building, it feels as if you have entered into a world of madness and despair. The floors are slick with blood. Every available surface is covered in human sacrifices, gruesomely nailed in place with gargantuan iron nailed. Every victim is still alive; each one writhes in agony, fruitlessly trying to free themselves from their eternal torment. \n\n\n  Their screams and groans echo off the stone floor, reverberating like a choir of the damned. There are dozens, perhaps hundreds of people nailed in this way. Their blood drips to the floor like a steady rainfall. \n\n\nYou conjure a flame to light the way forward. You move in silence through a narrow corridor, surrounded on all sides by a writhing, twisting tapestry of human agony. It feels like hours, but you walk only for a few minutes. No one speaks as you move slowly down the corridor, which feels as if it’s slowly beginning to constrict around you. \n\n\nSomething grabs your hair. You scream, and realize that one of the victims attached to the wall has latched onto you in desperation. Frye draws his sword and lops the poor soul’s arm off in one smooth motion. \n\n\n“Help me…” they moan softly. \n\n\nYou shake your head and move on. You come to a gargantuan central chamber. The domed ceiling stretches high above you. High above you, the seething, convulsing mass of tortured bodies seems to blend into one dreadful tapestry; it is a tapestry woven by an unknown intellect, for mad purposes. \n\n\nIn the centre of the chamber lies the Machine. It is a gargantuan thing, composed of shifting angles and strange materials. Its movements are hypnotic; a strange dance of clicking, sliding, grinding, mechanical parts. Your grandfather’s teeth begin to chatter uncontrollably. \n\n\n“This is wrong,” Tor says. His voice cracks. “This is wrong, this is wrong, this is all wrong.” \n\n\n“Easy, man,” Stitcher says. \n\n\n“Can you… turn it on?” Frye asks. You can hear his courage failing in his weak voice. You can feel your own courage failing, every second you linger in this place. \n\n\n“I can try,” you say. You pull Sacred Geometries of the Yellow Order from your pack, and flip to the dictionary of symbols. With the book in your left hand, and your grandfather’s skull in your right, you approach the insane thing that lies before you. Your eyes water. You can feel your mind straining to make sense of what lies before you. \n\n\nYou chant the sacred words. You picture the sacred symbols in your mind’s eye, as vividly as you can.  Your grandfather’s eyes begin to emit a cone of white light into the shimmering aura of the machine. \n\n\nBehind you, Tor wails incoherently. The others try to comfort him.\n\n\nYou reach out with your mind, touching the dreadful intellect that lies in the Machine. \n\n\nYou float. You are in total darkness. The screams are muted; here, they are little more than underwater echoes.  \n\n\n“A soul touches the Machine,” a voice tells you. The voice is impossibly deep. It comes from everywhere at once, cascading through this strange corridor of unreality. “Why?” \n\n\n“We were trapped in this place,” you explain, “and were told that you were our way out.” \n\n\n“What place?” the voice has a ponderous, bemused quality to it. \n\n\n“A place where strange beings torture mortals. They say that it’s to feed you.” \n\n\n“I see. You met the Soulless Ones. They are the most primitive of the children.” \n\n\n“The children?” \n\n\n“The children of the Far Ones, of course. When they left on their journey, I was left to keep track of the races they begat.” \n\n\n“I see.” \n\n\n“No, you do not. You cannot see, for you do not have the eyes. What is the purpose of this audience?” \n\n\nYou think on this, for a brief instant. “I’ve come to ask for a favour, I suppose.” \n\n\n“You are not the first.” \n\n\n“Who was?” \n\n\n“One called Francisco Al-Wahad. He came from your land.” \n\n\n“What became of him?” \n\n\n“He cast off his human form, and has learned much.” \n\n\n“Could I do the same?”\n\n\n“If you so desire.” \n","page 54":"You jerk your head. “Go on, get out of here.” \n\n\n“Thank you, oh mighty one. Your generosity is legendary,” Rashid-Ptah-Gad says as they drop to their knees and grab your hands. You pull your hands free. \n\n\nStitcher looks at the strange creature as it leaves. “I hope we don’t come to regret that.” \n","page 13":"You lean forward and tenderly kiss Selina. She’s startled, but soon leans in and wraps her hands around your head. You slide a hand around the nape of her neck. She gasps as a claw protrudes from your finger, neatly severing her spinal cord. She falls to the ground as blood begins to spill from her lips. \n\n\n“Not so fast,” you say. You trap her soul in her body, trapping her in a state of undeath.\n\n\nShe stares at you. Her lips can’t move, but her eyes are full of unconcealed hatred. You chop her head off and hand it to Sarah. “Be a dear and carry this for me.” \n\n\nWith your undead butler in tow, you bring Selina’s severed, but very much alive, head to Chn’mgoath’s cell. His physical form is rotten and emaciated, and no amount of sacrifice seems to be able to restore his health. \n\n\n“Chn’mgoath, I offer you the soul of the most powerful sorcerer I could find. Take this gift, restore it, and teach me your final mysteries.” \n\n\nHe scuttles over on his many-jointed limbs. He is emaciated, and his dozens of eyes are aflame with the hunger of an addict in need of a fix. You twist your hand, and the bars of his cell vanish. You toss him the head. \n\n\nHe digs out her eyes and scoops out her brain, smearing himself greedily in the meat. Then, he places three hands on her ravaged skull, and sucks the soul from the meat. You watch in fascination as he grows plump, like a mosquito filled with blood. \n\n\n“Very good,” he says. “You have done well, my child.” \n\n\n“Teach me the final mystery,” you say, having tired of supplication and formality. \n\n\n“Very well,” Chn’mgoath says, “I shall honour our bargain. Drink of my blood, and you shall have power like me.” \n\n\nHe slits one of his wrists with a fang, and offers it to you. You gag as you press your lips to his fetid veins, and drink of his eldritch blood. You fight the urge to vomit. \n\n\n“What’s changed?” you ask. \n\n\n“You may feast on souls, as I do,” he says. \n\n\n“Interesting,” you say. \n\n\nHe does not have time to respond before you leap on him. You grow fangs and arms and legs and wings as you tear the demon to pieces, gorging yourself both on his meat and every soul he has ever absorbed. When he is dead and in pieces, you admire your reflection in the puddle of blood on the floor. You gaze upon your venom sacks, your hooves, your horns, and your forked tongue. You find yourself to be beautiful and terrible. \n\n\nYou cackle in delight as you leap into the air, punching a hole through the ceiling, and flying off into the night. \n","page 57":"“So be it.” \n\n\nYou are cast out of the strange, inky netherworld and back into your body. The screams are loud, once again. They no longer disturb you. You turn to your comrades. Tor is laying on the floor, his body wracked with sobs. The sight of the Machine has shattered his mind into a thousand pieces. \n\n\n“I’m afraid you’ll have to find your own way out,” you say. Smugness creeps into your voice. Why should these uneducated barbarians be given salvation off your hard work?\n\n\nBefore they can curse you, you drop dead. \n\n\nYour soul is ripped from your body with startling force. You are pulled through the roof of the cathedral. As you continue to ascend, the whole city pulls into view. You ascend even further, and begin to see the curvature of the planet. \n\n\nYou are being pulled through the cosmos at breathtaking speed, now. Strange glittering clouds and bizarre formations abound. You can sense strange intelligences turning ancient gazes to you as you hurtle through their domains. \n\n\nYou can sense the Far Ones, now. \n\n\nAwe fills your soul as your creators draw near. As you gaze upon them for the first time, you realize the truth. To them, past and future and future are nothing. They know the fates of all their children. They know all things. \n\n\nThey are reaching out to you. \n\n\nYou can feel your mind slipping away as you merge with their sublime intellect. Terrible and wondrous knowledge fills the vessel of your mind, pushing out everything else; humanity, ambition, love, these are paltry things compared with the great didactical bounty presented before you. \n\n\nThe Far Ones speak to you, now. \n\n\nYou know everything.\n","page 12":"Chn’magoth’s blessings are as numerous as they are obscene. He teaches you every spell the fools at the University have to offer. You abandon your education, finding it severely lacking compared to the bounty of knowledge you have conjured from the infernal places. Silena matches your enthusiasm. She is a sorceress as skilled in the blasphemous arts as you; you spend hours hurling firebolts at each other, summoning horrors, and learning the secret languages that afford you power over other men. \n\n\nYou take a dozen scholars from the University, and they recruit a dozen more. Soon, you are a body unto yourselves; two hundred souls or so, referring to themselves as the Ones who Understand. You teach your acolytes some of the miraculous truths, but not too many; your primacy must not be challenged. \n\n\nBy happenstance, you recruit a high-level nobleman into your organization, one Viscount Chevernier. He hosts you and your acolytes at his estate. The secrecy afforded by the high walls is good for ones who study the hidden facets of reality.. \n\n\nYou stand at centre stage in a grand theatre. Chevernier was once a great sponsor of the arts, but you now use it as a lecture hall, where you disseminate what Chn’magoth tells you. Your breast swells with pride as you see your students in attendance; they stare at you with rapt attention underneath the theatre lights. Good. Let them admire your superior knowledge. \n\n\nThe sacrifice writhes under his magical constraints. It’s the same imbecile you slept with, in what feels like another night; luring him into an alley was trivially easy. Such was his profound ignorance that he barely even noticed when you put the rag over his mouth, before unceremoniously stuffing him into the back of a carriage. \n\n\n“With the right application of the Secret Words, you can defy even Death himself!” you say confidently. Your audience cheers as you draw an ornate broadsword with the practiced grace of a circus ringmaster. You behead him in one stroke. His severed head screams wordlessly as you trap his soul in the body, preventing his flight to the Underworld. Your students politely clap as you brandish it to the audience. \n\n\nYou look into the head’s eyes as it mouths a plea for mercy. You toss it on the floor for someone to clean up, before deciding to retire to your chambers. \n\n\nYou retire to your chambers. Silena is there, lounging in a chair, leafing through your notes. Her hair has grown out a bit, and you have finally managed to talk her into wearing makeup and finer clothing. “It is simply not appropriate for an acolyte of Chn’magoth to look like a spinster,” you repeatedly said. \n\n\n“Good demonstration?” she asks. \n\n\n“Yes,” you say, a little suspiciously. You’re not sure why she’s in your room, but you feel reflexively irritated at her going through your notes. \n\n\n“Chn’magoth isn’t happy,” she says. \n\n\n“He’s never happy. I gave him a whole arm the other day, what’s wrong with him now?” \n\n\n“He wants to expand our operation,” she says. Silena snaps her finger. A mummified corpse, animated with elder magic, shuffles into the room. It\u0027s still wearing the spectacles it wore in life. “Sarah, show us the meeting I had with Chn’magoth.” \n\n\nSarah opens her mouth and doubles over. She begins to retch. \n\n\n“Get a fucking tray!” you bark. Sarah grabs a discarded platter, and vomits blood into it. A second later, the blood begins to shift, granting you a view of a past event, ripped from Sarah’s memories. The images are faintly distorted, like a moving oil painting. \n\n\nYou see Chn’magoth’s hideous form, standing opposite to Silena. \n\n\n“You must take control,” the demon croons. “Kill the other one, and offer me his soul. Then, I shall teach you the final mysteries, and this plane can be ours.” \n\n\n“I’ll think of it,” Memory-Silena says. The blood-memory ends. \n\n\n“That’s a tempting offer,” you say. “Why didn’t you take it?” \n\n\n“You’re not bad at what you do,” she says with a smile. “Not great, but not bad.” \n\n\n“Appreciate the compliment,” you say. \n\n\n“Besides, I like having you around.” \n\n\nYou think about this, for a moment. \n","page 56":"When you cross the threshold into the building, it feels as if you have entered into a world of madness and despair. The floors are slick with blood. Every available surface is covered in human sacrifices, gruesomely nailed in place with gargantuan iron nailed. Every victim is still alive; each one writhes in agony, fruitlessly trying to free themselves from their eternal torment. \n\n\n  Their screams and groans echo off the stone floor, reverberating like a choir of the damned. There are dozens, perhaps hundreds of people nailed in this way. Their blood drips to the floor like a steady rainfall. \n\n\nYou conjure a flame to light the way forward. You move in silence through a narrow corridor, surrounded on all sides by a writhing, twisting tapestry of human agony. It feels like hours, but you walk only for a few minutes. No one speaks as you move slowly down the corridor, which feels as if it’s slowly beginning to constrict around you. \n\n\nSomething grabs your hair. You scream, and realize that one of the victims attached to the wall has latched onto you in desperation. Frye draws his sword and lops the poor soul’s arm off in one smooth motion. \n\n\n“Help me…” they moan softly. \n\n\nYou shake your head and move on. You come to a gargantuan central chamber. The domed ceiling stretches high above you. High above you, the seething, convulsing mass of tortured bodies seems to blend into one dreadful tapestry; it is a tapestry woven by an unknown intellect, for mad purposes. \n\n\nIn the centre of the chamber lies the Machine. It is a gargantuan thing, composed of shifting angles and strange materials. Its movements are hypnotic; a strange dance of clicking, sliding, grinding, mechanical parts. Your grandfather’s teeth begin to chatter uncontrollably. \n\n\n“This is wrong,” Tor says. His voice cracks. “This is wrong, this is wrong, this is all wrong.” \n\n\n“Easy, man,” Stitcher says. \n\n\n“Can you… turn it on?” Frye asks. You can hear his courage failing in his weak voice. You can feel your own courage failing, every second you linger in this place. \n\n\n“I can try,” you say. You pull Sacred Geometries of the Yellow Order from your pack, and flip to the dictionary of symbols. With the book in your left hand, and your grandfather’s skull in your right, you approach the insane thing that lies before you. Your eyes water. You can feel your mind straining to make sense of what lies before you. \n\n\nYou chant the sacred words. You picture the sacred symbols in your mind’s eye, as vividly as you can.  Your grandfather’s eyes begin to emit a cone of white light into the shimmering aura of the machine. \n\n\nBehind you, Tor wails incoherently. The others try to comfort him.\n\n\nYou reach out with your mind, touching the dreadful intellect that lies in the Machine. \n\n\nYou float. You are in total darkness. The screams are muted; here, they are little more than underwater echoes.  \n\n\n“A soul touches the Machine,” a voice tells you. The voice is impossibly deep. It comes from everywhere at once, cascading through this strange corridor of unreality. “Why?” \n\n\n“We were trapped in this place,” you explain, “and were told that you were our way out.” \n\n\n“What place?” the voice has a ponderous, bemused quality to it. \n\n\n“A place where strange beings torture mortals. They say that it’s to feed you.” \n\n\n“I see. You met the Soulless Ones. They are the most primitive of the children.” \n\n\n“The children?” \n\n\n“The children of the Far Ones, of course. When they left on their journey, I was left to keep track of the races they begat.” \n\n\n“I see.” \n\n\n“No, you do not. You cannot see, for you do not have the eyes. What is the purpose of this audience?” \n\n\nYou think on this, for a brief instant. “I’ve come to ask for a favour, I suppose.” \n\n\n“You are not the first.” \n\n\n“Who was?” \n\n\n“One called Francisco Al-Wahad. He came from your land.” \n\n\n“What became of him?” \n\n\n“He cast off his human form, and has learned much.” \n\n\n“Could I do the same?”\n\n\n“If you so desire.” \n","page 9":"“I’d love to,” you say.\n\n\n“Good,” she says, “come by the Fits when it gets dark. Go up to the bartender, and ask for me.” \n\n\nYou recognize the Fits; a popular short-form for Fits and Starts, a seedy pub frequented by slumming students. “I’ll be there.” \n\n\nThat night, you don your coat and step out into the rain-slicked streets to make your way to the Fits. Inside the pub is a lively affair, full of drunks in various states of dress. At the tables, men play knucklebones and droughts while women of loose moral fibre hang on their arms. Ale flows like water from a spring. The air is heavy with sweat and vulgarity. \n\n\nYou approach the bar. The bartop is a gargantuan, smooth piece of bone. The bartender is a round man, with an eyepatch, bulging biceps, a tattoo of a harpoon on his neck, and not much of a mind for stereotypes. \n\n\n“Looking for Selina and the rest,” you say. You’re not quite sure who “the rest” is, but it seems the right thing to say. \n\n\nHe nods. “Aye, in the back,” he says as he jerks his head towards a back door. \n\n\n“‘Preciate it,” you say as you head for the back. You step into a basement, and descend some narrow steps. It’s dark down here, and the smell of sweat and alcohol fades away and is replaced by the smell of moist stone. You reach a thick stone door, and knock on it three times. \n\n\nIt swings open, and Selina is standing on the other side. She smiles when she sees you, and bids you enter. It’s a respectably sized  cellar, but all of the casks have been shoved to one side. You recognize some of your peers, lounging on the casks. There’s James, a round-faced alchemist-in-training from the year under you; Sarah, a mousy, bespectacled  brown-haired girl your age, with a perennially unfinished sleeve of crude-looking tattoos, Selina, and yourself. \n\n\nIn the centre of the room is an empty clay vessel. The outside is adorned with sacred sigils, some of which you recognize; the Ankh of Life, the Talons of the Stranger, and the First Malediction. \n\n\n“You know your stuff,” you say with some admiration. \n\n\nSelina smiles. “We’ve been working on this for almost a year, now.” \n\n\nJames shifts fidgets nervously. “Are we sure we can tell him what we’re working on?” \n\n\n“You don’t have to. You’re hosting a demon,” you say confidently. \n\n\n“Bingo,” Selina says. \n\n\n“You’re not going to rat us out?” James says. \n\n\n“Wouldn’t be here if I meant to,” you say. “What needs doing?” \n\n\nSelina explains the rest to you. They have all the components, surreptitiously stored in one of the casks (this took a hefty bribe), but needed another competent occultist to actually breathe life into the creature. You and Selina will keep the link to the outer plane stabilized, while Sarah binds it to the group’s will, and James keeps its physical form stable. When the ritual is done, if done correctly, the demon will be compelled to answer your questions. \n","page 14":"You kiss Selina without thinking about it. Then, as a true romantic, you bend her over an armchair and make unsentimental love to her while a slack-jawed corpse stares listlessly into a pool of its own bloody vomit. After, you lay in each other’s arms, you stare into each other’s eyes, and talk about how the narrow-minded fools of the world will soon suffer under your combined vision and brilliance. \n\n\nThe next morning, you both confront Chn’magoth. Its mortal form is decaying as its demonic essence erodes its fleshy prison from within. The air in his cell smells of plague. The offal of the many sacrifices required to keep him on this plane are strewn about the cell. \n\n\n“You have considered my offer,” Chn’magoth says. The voice in your mind sounds faint, now, as he fades from the world. \n\n\n“I have,” Selina says. “And I refuse.” \n\n\n“Fool!” Chn’magoth hisses. It launches a stream of corrosive vomit at you, and it burns clean through the bars of his cell. You shove Selina back and effortlessly form a shimmering ward that disperses the bright-green spew. “You will regret this, flesh-things!” \n\n\n“Eat shit and die,” you respond matter-of-factly. You tear his head from his shoulders, his arms from his torso, and his knees from his thighs. For a moment, the demon’s composite parts float in the air, before you hurl them against the wall with such strength that they liquify. \n\n\nFor a brief instinct, you can see his true form. It is fundamentally incompatible with this world, and the sight of it chills your soul. Its ten thousand eyes gaze at you with such baleful malevolence that for a moment, you feel as if your very essence will be ripped from your body and dragged into a realm of unfathomable violence. Fortunately for you, the sane world is incompatible with Chn’magoth’s true form, and he quickly dissipates. \n\n\nLater,  you summon your flock to the theatre. As you stand on stage, covered in blood, you begin to speak: “Chn’magoth was a false teacher. I have destroyed him, and taken his power.” \n\n\nA stunned silence settles over the theatre. How can this be? You are not stricken down immediately, however, so it must be true. Silena begins to speak: “We know all things, of this world, and of all the other worlds too. We will lead you into an era of enlightenment, and grant you unimaginable power.” \n\n\n“All you have to do is kneel,” you say. \n\n\nOne by one, they drop to their knees. Their hands are stretched up in rapturous awe. You can see the jealousy and fear in their eyes, but it doesn’t matter; they should be jealous. These fools will be the first to kneel, but not the last.\n","page 58":"“A sensible request.” \n\n\nYou are cast out of the strange, inky netherworld, and back into your body. The screams grow loud, once again. They chill your soul. You turn to your comrades. Tor is laying on the floor, his weapon discarded, with tears streaming down his face. Stitcher is praying over him. \n\n\n“His mind is gone,” Frye says. \n\n\nYou walk quickly up to them. “I think I just negotiated our way out.” \n\n\nFrye looks at you with burning intensity. “How?” \n\n\nAn idea blossoms in your mind, planted from a seed not your own. “Get close to me.”\n\n\n“You heard the lad! Get close!” Stitcher barks his orders and the party obeys. John Boy and Stitcher lift Tor off the floor, dragging the weeping giant towards you. The idea in your mind continues to blossom. It crowds out your other thoughts. You realize that you are no longer in control of your own actions. You watch as your hands trace a sigil in the air, your fingers followed by a streak of bright light. You listen as your mouth speaks the sacred words. A swirling, inky rift opens around you and your companions. You feel a faint sense of removed serenity as you’re sucked through. \n\n\nWhen you’re spat out the other side, you regain control of your body instantly. You curl your fingers in appreciation as you hit the dirt. You find yourself staring at the night sky; a wave of relief washes over you as you recognize the constellations. One nightmare is over; hopefully, no more lie ahead. \n\n\nYou sit up. Your compatriots lay scattered around you. They wear looks of confusion on their faces. You decide to give them a moment of respite. You stand and scan the horizon. \n\n\nA city lies in the distance . It’s guarded by great stone walls, complete with a drawbridge and portcullis. Inside the city, great domes and spires stretch up against the evening sky. A thousand plumes of smoke and pinpricks of light are visible on the walls. Beyond the city lies a great river, and along its banks you see farms. On the other side of the river, a herd of cows peaceably mills about. \n\n\n“We’ve arrived,” you say quietly. \n\n\n“Arrived where?” Stitcher asks. She’s clinging to her mace like a protective charm. \n\n\n“a,” you say. These last months have felt like some odd dream. You almost forgot that your journey had a destination. For a time, you felt as if you were one of Famous Frye’s Fighting Men. All dreams must end, however. It’s time to pay your mercenaries. \n\n\n“We should head in,” you say. “Is Tor fit to stand?” \n\n\nEveryone looks to Tor. He seems to have regained a modicum of composure, but he refuses to speak. Instead, he mutely stands. Frye approaches him, and moves to clap a comforting hand on the big man’s shoulders; he stops halfway through. His hand hovers in the air, for a moment, before he rests it back on the hilt of his sabre. “We’ve seen horrors,” he murmurs. \n\n\nYou lead the party to the city gates. You’re greeted by a half dozen crossbowmen on a battlement. Their chainmail gleams in the firelight, and their dark-green gambesons seem freshly dyed. \n\n\n“Announce your business!” one of them orders. He carries himself with the air of a leader, and his heraldry marks him out as a serjeant. \n\n\n“I am Lord Winter,” you say, flashing your signet ring, “I’ve come to settle the estate of my recently deceased uncle. These are my companions.”\n\n\nThey murmur among themselves uneasily. “Pardon me, my lord. You and your companions are most welcome in the city. You will find House Winter’s estate on the intersection of Copperhammer Lane and Third Street.” \n\n\nThe portcullis opens with a mechanical screech and you enter the shadowed streets. You notice a street labeled First Street. With that landmark, it is trivial to walk until you find third, and then walk until you find the intersection with Copperhammer. The streets are empty and wide. The streetlamps are bright and uniformly lit, a detail which impresses you; your home of Exxenforde has long since abandoned the practice of maintaining municipal public servants. \n\n\nYou arrive at your palatial family home. It is a sprawling, stately manner, abandoned for some time. The gate swings open before you. Before you is a spacious garden, although the planters are long empty. A fountain-statue of a nude woman, her arms snapped off and her breasts covered in graffiti, dominates the centre of the garden. \n\n\nThe front door to the house is one solid slab of wrought-iron, with a central receptacle for your signet ring. Cold dread trickles into your breast as you walk towards it. Your companions linger behind you. \n\n\n“There’s evil magic, here,” Stitcher cautions you. Her voice is flat. She looks up at the gargoyles above you, who leer with predatory intent. “I can feel it.” \n\n\n“I’ll get your payment from the treasury,” you say. You slot your ring into the door. It clicks satisfyingly, and the door slides down into a niche on the floor. “Wait here.” \n","page 17":"No. You’ve learned too much, and your studies are almost complete. It seems a hideous waste to throw away years of studious dedication to the occult just to claim an inheritance. \n\n\nYou awake the next morning, clutching the letter in your hand. Your companion stirs blearily in his sleep. \n\n\n“What’s going on?” he mumbles.\n\n\n“Time for you to go,” you say. He protests, but with a bit of effort you’re able to force him out the door. You turn your attention to the letter, which still seems rich with the promise of adventure. In life, one must be practical, you suppose to yourself. You twist your thumb and forefinger and it catches flame, burning away in a few seconds. As the ash blows out the open window, it’s as if the letter never existed at all. \n\n\nYou resolve to recommit yourself to your studies, in the hopes of becoming as proficient an occultist as you can. \n\n\nLater, you find yourself bored. You are a half hour into a lecture on human anatomy. It is held in a gargantuan lecture theatre and operating hall. The oak floors and carved wood seats lend a certain gravity to the whole affair. In the centre of the room, the professor — a tedious, doddering old man — is dutifully dissecting a corpse. He holds each element of the body up to the light, for his students to appreciate, before dumping it unceremoniously in a bucket with a wet schlop! \n\n\nNext to you sits one of your peers. She’s a plain looking young woman with a recently-shaved head and bags under her eyes. She bears the distinctive pallor that all aspiring occultists at the University bear. You mentally search around for her name. Sarah? No, but something like it. Selina? That sounds more like it. \n\n\nYou glance over at her. She rolls her eyes. \n\n\n“Fuck this,” you mouth. She smiles.\n\n\n“Can you get me the offal bucket?”  she whispers, so softly as to be almost inaudible.\n\n\n“What do you need the offal bucket for?” you whisper back. \n\n\n“I’m working on something. Just do it, I’ll make it worth your while.” \n\n\nWhen the tedious lecture ends, you approach the professor, distracting him with a meaningless barrage of questions. He answers slowly, carefully enunciating so as to make himself understood; you understand none of it. He also manages to shower you with a barrage of spit. Selina flashes you a smile as she steals the bucket of meat, and some human blood sloshes on the floor. The old man does not notice. \n","page 51":"Moving through the city is a disquieting affair. Superficially, it bears the form of a regular metropolis; it has buildings and streets, arranged in the familiar way. The buildings are far too large, though, and loom over you like the oldest pines in a shadowed, ancient wood. Every building has at least a dozen victims strung from it; their screams and wretched gurgles blend together in a symphony of pain. The streets are slick with blood and tears that fall to the ground. \n\n\nRashid-Ptah-Gad leads you through the city. They move quickly, beckoning you follow with quick gestures and nervous glances. Every now and then, a patrol will pass, and they will dive into an alley. \n\n\n“Why do you hang your victims?” you ask them as you walk. \n\n\n“Their pain, it… resonates, with the machine. Keeps us alive,” they say. \n\n\nStitcher grimaces. “This is no place for us.” \n\n\nAfter a few more minutes, it becomes clear that you’re being led to the centre of the city. One building, larger than the rest, begins to stand out; it is a gargantuan metal dome, covered in spikes, with hundreds of writhing victims mounted on it. The black iron is painted red and brown by a thick coat of festering gore. As you grow nearer, the screams grow louder, into a never-ending crescendo of misery. \n\n\n“Is this Machine in there?” Frye asks. \n\n\nYour guide enthusiastically nods. “The doors will open for me. I will allow you to pass through, and then you will allow me to leave?” \n\n\nFrye nods. \n\n\n“You are lucky, thing. I would snap your neck if it were up to me,” Tor says. Stitcher murmurs in agreement. \n\n\nYou lurk in the shadows as a column of masked soldiers goes by. Rashid-Ptah-Gad stiffens, as if preparing to warn them, but John Boy gently presses his knife to their breathing-tube until the soldiers pass. \n\n\nThe strange being scurries across the street, beckoning you follow. They lead you to the steps of the cathedral. The screams are overwhelmingly loud, and you smell the stench of rot for the first time. The hapless fools pasted to the walls are decomposing for eternity; they are festering, bleeding, wailing, forever dying but never dead. \n\n\nYou stand in front of the cathedral, now. It is an architectural marvel, built by insane hands for a purpose you can scarcely comprehend. \n\n\nRashid-Ptah-Gad scurries over to the cathedral’s entrance: two colossal stone doors, locked by a gargantuan stone seal. The seal is a perfectly circular stone, and every inch of it is inscribed with geometric forms that hum with foreign magic. You recognize a few of them from Sacred Geometries of the Yellow Order. Did the author travel to this blasted place? If so, he must have returned somehow. You take comfort in this. \n\n\n“You know how to open this?” Frye says suspiciously. Your hostage nods enthusiastically. “Then fucking open it.” \n\n\nThe creature closes their eyes and presses a hand against the seal. The figures on the seal light up. The seal rolls to the side; as it does, you hear a hissing sound as a wispy green gas escapes the cathedral. You hypothesize that it’s the same chemical breathed by the strange denizens of this place. \n\n\n“The door is open, your path is clear,” Rashid-Ptah-Gad says. “Am I free to go, mighty ones?” \n\n\n“Kill it,” Stitcher says. \n\n\n“The gods hate an oathbreaker…” Tor says nervously. \n\n\nJohn Boy shrugs and grunts. \n\n\n Frye turns to you. “What say you, lad?” \n","page 50":"“Shut the fuck up,” you snap. The creature looks up in surprise. “We don’t have time to listen to your explanations, demon. Show us the exit this instant or I’ll flense you so slowly that you’ll beg for death.” \n\n\n“Mercy! Mercy! Mercy!” it cries. The creature throws itself at your feet. “I will take you to the Machine. One of my kind must open the way.”  \n\n\nTo illustrate your point, you ignite a roaring flame in your palm. You hold it close to the creature’s face; the flame reflects off its goggles, giving them a yellow, cat-like countenance. “If you betray me, your suffering will be legendary, even here. Do you understand?” \n\n\n“If I betray you, you will flense me most agonizingly. I understand.” \n\n\nJohn Boy snorts. “We’d best get going.”\n","page 53":"You conjure a flame inside the creature’s skull. Their brain boils like an egg and wordlessly slumps to the floor. Their goggles crack and shatter as their head burns. Boiled brain matter seeps onto the floor through their ruined eye sockets. \n\n\n“I suppose that settles the matter,” Frye says as you enter the cathedral. You step over Rashid-Ptah-Gad’s ruined carcass without a second thought. \n","page 52":"Moving through the city is a disquieting affair. Superficially, it bears the form of a regular metropolis; it has buildings and streets, arranged in the familiar way. The buildings are far too large, though, and loom over you like the oldest pines in a shadowed, ancient wood. Every building has at least a dozen victims strung from it; their screams and wretched gurgles blend together in a symphony of pain. The streets are slick with blood and tears that fall to the ground. \n\n\nRashid-Ptah-Gad leads you through the city. They move quickly, beckoning you follow with quick gestures and nervous glances. Every now and then, a patrol will pass, and they will dive into an alley. \n\n\n“Why do you hang your victims?” you ask them as you walk. \n\n\n“Their pain, it… resonates, with the machine. Keeps us alive,” they say. \n\n\nStitcher grimaces. “This is no place for us.” \n\n\nAfter a few more minutes, it becomes clear that you’re being led to the centre of the city. One building, larger than the rest, begins to stand out; it is a gargantuan metal dome, covered in spikes, with hundreds of writhing victims mounted on it. The black iron is painted red and brown by a thick coat of festering gore. As you grow nearer, the screams grow louder, into a never-ending crescendo of misery. \n\n\n“Is this Machine in there?” Frye asks. \n\n\nYour guide enthusiastically nods. “The doors will open for me. I will allow you to pass through, and then you will allow me to leave?” \n\n\nFrye nods. \n\n\n“You are lucky, thing. I would snap your neck if it were up to me,” Tor says. Stitcher murmurs in agreement. \n\n\nYou lurk in the shadows as a column of masked soldiers goes by. Rashid-Ptah-Gad stiffens, as if preparing to warn them, but John Boy gently presses his knife to their breathing-tube until the soldiers pass. \n\n\nThe strange being scurries across the street, beckoning you follow. They lead you to the steps of the cathedral. The screams are overwhelmingly loud, and you smell the stench of rot for the first time. The hapless fools pasted to the walls are decomposing for eternity; they are festering, bleeding, wailing, forever dying but never dead. \n\n\nYou stand in front of the cathedral, now. It is an architectural marvel, built by insane hands for a purpose you can scarcely comprehend. \n\n\nRashid-Ptah-Gad scurries over to the cathedral’s entrance: two colossal stone doors, locked by a gargantuan stone seal. The seal is a perfectly circular stone, and every inch of it is inscribed with geometric forms that hum with foreign magic. You recognize a few of them from Sacred Geometries of the Yellow Order. Did the author travel to this blasted place? If so, he must have returned somehow. You take comfort in this. \n\n\n“You know how to open this?” Frye says suspiciously. Your hostage nods enthusiastically. “Then fucking open it.” \n\n\nThe creature closes their eyes and presses a hand against the seal. The figures on the seal light up. The seal rolls to the side; as it does, you hear a hissing sound as a wispy green gas escapes the cathedral. You hypothesize that it’s the same chemical breathed by the strange denizens of this place. \n\n\n“The door is open, your path is clear,” Rashid-Ptah-Gad says. “Am I free to go, mighty ones?” \n\n\n“Kill it,” Stitcher says. \n\n\n“The gods hate an oathbreaker…” Tor says nervously. \n\n\nJohn Boy shrugs and grunts. \n\n\n Frye turns to you. “What say you, lad?” \n","page 29":"Something about the bared teeth and the lust-filled eye of the Donkeys chills your soul. Your courage fails as the others charge ahead, and you lag behind. You try to assist the party past best you can as they fall upon the Donkeys and blood and limbs begin to fly through the air. As you watch the skirmish, your feet seem to root themselves to the ground. The blood in yeour veins runs cold. \n\n\nTime seems to slow to a halt as you watch Stitcher cave a Donkey’s head in with her cudgel. She bashes it as it lays twitching on the ground, and doesn’t notice a second one behind her. It grabs her by the hair and flings her to the ground before climbing on top of her. She covers her face with her arms as it wildly slashes at her with a knife. Panic begins to rise in your breast. Have you sent these people to their deaths? \n\n\nYou never find out. As you stand there, rooted to the spot, a Donkey hurls a stone at your head. Darkness takes you almost instantly. \n","page 22":"Lacking options, you follow the knight. In the moonlight, you can fully appreciate the man’s gargantuan stature; he stands easily six and a half feet tall. His sword is the length of both of your arms put together, and he wields it comfortably with one hand. Where did they find this beast? \n\n\nHe grabs a pitch-covered torch off the ground and thrusts it into the smouldering remains of the campfire. It ignites easily, and he hands it to you with a nod. He takes a half step away, and then turns back, and tosses something to you. It’s only after you catch it that you realize it’s your grandfather’s skull, and he had disarmed you. \n","page 66":"It’s been three days since you entered the forest. Already, the city feels like a distant memory. Spirits are high. Each night, you share ale, fire, and stories with the Fighting Men. \n\n\nThe forest is disquieting. The trees, which have stood before the time of the Grim Harvest, seem to possess inhuman intelligences. The mist is always thick to the point of being difficult to breathe in. It’s perpetually cold. \n\n\nYou are crouched near to the ground with John Boy next to you. His crossbow is drawn. You’re both staring at a muddied path with a half dozen tracks running over it. The tracks are unreadable to you, but he points one of them out. \n\n\n“Deer.” \n\n\nYou nod, and wordlessly follow him. Sure enough, the tracks break away from the muddle, and transform into the familiar split shape of deer tracks; not that you’ve ever seen a deer, but you’ve read enough books on the subject. You closely follow in his footsteps. Even with one leg, he moves with the practiced grace of an experienced woodsman. Soon, you come out of the mist into a clearing. \n\n\nOn the other side of the clearing is a buck, dipping its nose in a puddle. Its pelt is shockingly clean and you can’t see its ribs, making it the healthiest beast you’ve seen since your arrival in the wilderness. The skull at your belt hums as John Boy draws his crossbow and takes a knee. \n\n\nYou place a finger on the skull. As soon as you make contact with the polished bone, the hairs on your neck stand up. Something is wrong. \n","page 21":"You open your mouth to scream. With blinding speed, Crowley punches you with two fists. Your ribcage is instantly sundered as his gauntleted hands tear through your body and reach out the back. For a brief second, you uselessly try to scream, but all that escapes your lips is a hoarse whisper. \n\n\nAs the knight drags you out of the tent by the foot, your head lolls down and you stare into your own ruptured chest cavity. Your mind wanders to the anatomy lessons you received as a child. You recognize your own heart and lungs. Those two spears jutting out of you like boar tusks? Why, those must be your ribs! \n\n\nYou feel a faint sense of intellectual accomplishment. You barely notice as Crowley lifts you over his head and rips you in half. \n","page 24":"You don’t give him a chance to realize his mistake. The second you catch the skull, you point it at him and shout an incantation. He lunges towards you, but you strike him in the chest with a beam of negative energy. His breastplate buckles, and the force of the blow sends him reeling. \n\n\nHe draws his gargantuan sword and holds it like a throwing axe before swiftly launching it at your head. It whips through the air at blinding speed. You narrowly catch it in a shimmering field of light. It strains in the air as you strain to stop it from cleaving your body in twain. Cracks spread through the blade and it shatters loudly. \n\n\nYou dodge shards of metal shrapnel. Crowley seizes his opportunity, covering the distance between you almost instantly. You dive into the dirt. His fingers close around the space your skull occupied a moment before. \n\n\nYou roll, avoiding two stomps in rapid succession. \n\n\n“Crowley! What the fuck are you doing?” Frye shouts, emerging from his tent, half asleep.  One pistol-bracer is slung over his shoulder. Three shots. \n\n\nCrowley waves at him dismissively, before advancing on you. Three loud cracks resound. You watch as three holes open up in Crowleys chest. Black ichor pours from the wound. You don’t give him a chance to regain his footing. With both hands, you form a sphere of withering darkness around Crowley and lift him into the air. You scream with exertion. Blood trickles from your left eye. \n\n\nYou collapse on the ground, gasping for breath. You look up, expecting to see Crowley standing over you, preparing his murder-stroke. To your surprise, you’re not greeted with an angry knight. \n\n\nAs you stand on unsteady feet, you gaze at Crowley. His armour is rusted and buckled. His helmet has been torn off, revealing the leering skull within. His empty black eyes stare blankly at the sky, no trace of their former fury within. \n\n\n“Crazy bastard,” Frye murmurs ruefully as he approaches the corpse. The rest of the party emerges. \n\n\n“And where were you lot, a moment ago?” you hiss. No one responds. Your compatriots stare at Crowley\u0027s ruined corpse, then at you. Their narrowed eyes tell you all you need to know.\n\n\n. You shift uneasily, and then look down at your boots. The hilt to Crowley’s sword is resting at your feet. On a whim, you pick it up and turn it over. There’s a small carving on the pommel. \n\n\nThe Lion of House Winter stares at you with cool dignity. \n","page 67":"A few days later, you break out of the forest and into the countryside. What grass there is is grey and desiccated. Rolling hills comprised of soil that no longer sustains life stretches as far as the eye can see, dotted by rotted farmhouses. Old fence posts jut out of the ground like so many rotted teeth in a necrotising mouth. \n\n\n“There is scarcely bett’r picture, of what is lost and died,” Frye says.\n\n\n“There surely is no sadness, like the dam-ned countryside,” you finish the old saying. You never liked it, and cringe at the tortured rhyme. Frye grins.\n\n\nThe party comes to a halt ahead of a bridge, which clearly once forded a substantial river. Looking left and right, you see the remains of a watermill and a few boats. Now, though, it scarcely amounts to more than a few rotted planks scaling a filthy ditch. \n\n\n“Reckon we ought to cross one at a time,” Stitcher says. She goes first, followed by Tor, then Frye and Crowley, leaving you alone on the embankment.  “Say, lordling,” Stitcher says as you take a few uncertain steps, “I hope your books aren’t heavy.” \n\n\n“Not as heavy as your fat fucki?” your foot goes through a rotten plank, quickly followed by the rest of your body. You slam into the mud and immediately start to sink. As you struggle to arise, a piece of timber falls on your head, sending you sprawling. The mud gurgles and laps at your clothing. You struggle to keep your face out of the mud.\n\n\nSomething seizes you with a grip as cold as ice and as strong as iron. You scream through a mouthful of mud, before a hand clamps over your mouth. You feel hot breath on your neck and smell the stench of death.You ball your hand up and drive it upwards and behind you, scoring a hit on something. You feel rotted flesh tear underneath your knuckles. \n\n\nYou whirl around to face your assailant. You see a creature that resembles a man, but with double-jointed knees and arms longer than its body, and a mouth full of rotted fangs. The remains of a tattered pair of trousers hangs limply off its frame. You put a leg in front of it just as it leaps for your throat, holding it off long enough to grab the skull from your belt. \n\n\nThere’s no time to cast a spell. “Sorry, grandfather!” you hiss as you drive his skull into the creature’s face. Dark blood coats your hands. With the creature dazed, you whisper a few dark words. Your grandfather’s eyes glow. You seize it by the neck with one hand, and press the ornamented skull into its face. The beast wails in inhuman agony as its flesh sears away almost instantly. The monster tries to pull away as its skull slowly disintegrates, but you push it forward. The monster’s skull simultaneously caves in and burns away. The wet, gooey mass of its brain superheats and it goes limp. \n\n\nStitcher charges down a second later, mace drawn. She stops in her tracks, as Tor and Frye stumble to a halt behind her. Her eyes go to the dead monster, then to you. “You beat that thing to death? Not bad, lordling.” \n\n\nAs you push it off of yourself, a metal gauntlet closes around your arm and hoists you into the air. Crowley stands knee deep in the mud. He easily holds you in the air with the strength of one arm. For a moment, he stares into your eyes and you into his. You see that behind the helmet, the skin is wrinkled and cracked, and his eyes are milky white. You cringe in pain as his grip tightens and his fingers dig into your arm. He wordlessly deposits you on the embankment. \n\n\nDeciding not to correct her, you wordlessly nod as a rising tide of nausea swells in your stomach. You fall to your knees and start retching.\n\n\nYou pitch your tents in an open field, the kind where cows might have grazed. The night is cold, drawing everyone into the flame. Crowley sits apart from the party as he obsessively runs his hands over his armour, looking for damage. His helmet makes his mood inscrutable, but you get the sense he’s staring at you. \n\n\n“Aren’t you cold?” you ask uneasily, noticing the layer of frost that’s accumulated on his armour. It doesn’t seem to bother him. \n\n\n“Best not to bother Crowley, lad,” John Boy says quietly. \n\n\n“Is something the matter with him?” you ask, “most men wouldn’t want to sit on the cold and freeze.” \n\n\n“Most men wouldn’t keep their armour on their entire lives, either,” says Stitcher. \n\n\n“Listen here, and listen well. Crowley is among the finest of men I’ve ever fought with,” Frye says, tossing a glance over his shoulder, “but he’s not at all like you or I. I’ve never seen him eat or drink, and I’ve seen him shrug off blows that would kill a lesser man. Hell, I think they’d kill a greater man, too.” \n\n\n“So he’s unkillable. What is he, then? Some kind of mutant? Cursed?” \n\n\n“Don’t you say that in his presence. Ever,” Stitcher snaps. \n\n\nFrye nods. “Crowley hates magic like no man I’ve ever seen, and he kills demons like an archangel sent from on high. We’ve all seen that trinket at your belt, lordling; best you don’t do any magic in front of him.” \n\n\n“I’m paying for this expedition, Frye. I’ve a right to defend myself, do I not.” \n\n\n“You speak true. I can’t say I’m thrilled about escorting a mage, but it’s your immortal soul you’re gambling with, lordling. Crowley on the other hand…” Stitcher trails off. \n\n\n“He once ripped a mage’s head off with just his hands.” \n\n\nYou whistle. “I’ll keep it to myself, then.” \n\n\n“Aye, lad. You will,” John Boy says softly, tossing a log into the fire. You retire to your tent and sleep takes you quickly. \n","page 26":"The next morning, you depart without Crowley. You try to speak, but you are met with stony glares. Self defence or not, you killed a member of the party. \n\n\nHours turn into days. You break out of the forest, after a while. You cover miles of dead scrubland, passing dessicated farms where cattle once was kept. You are surrounded by the bones of civilization, wherever you go. \n\n\nAt night, the light of the campfire is no longer a source of comfort. The eyes of your companions begin to take on a wicked glint. One night, when asleep in your tent, you catch Frye and Stitcher arguing. \n\n\n“It’s not right,” Stitcher says. “We’re not perfect, aye, but we’re not fucking bandits either.” \n\n\n“I’ll not escort Crowley’s murderer anywhere. We know the Winter estate is somewhere in Seffonshire, and that’s got to be where he’s stashed the gold. We finish this bastard off here, and help ourselves to as generous a reward as we please.” \n\n\nYou hear the rage in Stitcher’s voice. “I won’t support this, Frye. I’ve followed you this far, but I won’t let you murder the lordling.” \n\n\nYou burst from the tent, skull in hand. “You’re not fucking killing me!” you snarl. \n\n\nFrye draws his pistols and turns. “You weren’t supposed to hear that,” he says. You’re in a true standoff, now; you with the skull brandished, him with two pistols leveled at your head. Either could end the other in an instant. \n\n\nStitcher draws her mace, and steps away from the both of you. The air shimmers as she charges the head with divine vengeance. “Calm down, both of you.” \n\n\n“I’m not letting you treacherous fucking mercenaries do this!” you hiss. “Your insane friend tried to kill me!” \n\n\n“You butchered Crowley in the night!” Frye yells. His fingers tighten on the trigger. Violence feels inevitable. \n\n\n“Fuck you!” you yell, as you dive into the dirt. Frye’s first shot misses, and the second tears through your shoulder. You scream as you fire a searing beam of negative energy into his skull. A perfect circle opens up in his head, and his spill onto his armour. Stitcher wails in grief, a guttural sound that chills your heart. \n\n\n“He made me do that!” you say uneasily as you back up. Tor emerges from his tent, harpoon in hand. “Stay the fuck away from me,” you warn. \n\n\n“You killed Frye, you traitorous worm!” Tor shouts. He hurls his harpoon, but you deflect it with a well-placed burst of wind. Stitcher charges, but you hurl her against a tree with dizzying force. You strike her harder than you mean to, and her spine snaps in half. You turn to Tor, who is charging you with the fury of a lion. \n\n\nBefore his gargantuan fingers wrap around your throat, you set his clothes aflame with a wave of your hand, and dive into the dirt. He stumbles towards you, but collapses into a smouldering wreck before he has the chance to reach you. \n\n\nYou wonder where John Boy is. As you turn, he looses a single bolt from the underbrush. It hits you directly in the eye, piercing your brain and jutting three inches out the back of your head. You topple to the forest floor, twitching.\n","page 25":"The reassuring weight of your grandfather’s skull in your palm grants you a sense of reassurance. \n\n\n“You want me to follow you?” \n\n\nHe nods. \n\n\nThe two of you trek wordlessly into the field. He walks well ahead of you, ignoring the comforting circle of light cast by your torch. He leads you in silence for what feels like a good few miles, before you come to the ruins of an old house. \n\n\nIt was clearly a pleasant home in the days before the Grim Harvest. There are shattered planters in the front yard. A rusted shovel-head sits in the ground, its shaft having long rotted away. Someone was gardening. \n\n\nThe door is wrought iron and bears the Lion of House Winter. Crowley rips it off its hinges with ease, then stands aside and motions you enter. You waver for a moment, skeptical as to his intentions. He sharply raps his fingers against his thigh-plate, and you enter the house. \n\n\nThe smell of mould fills your nose. The second story of the house has crumbled into the first, leaving a tangled mess of timber planks that must be navigated. You step around, looking around for whatever reason Crowley sent you here. Your boot raps against something heavy and metal on the floor. You stoop over with the torch and see a heavy metal circle, five or six feet in diameter, set into the floor. It’s finely engraved,  but the exact details of the inscription are obscured by a heavy plank, which is wedged under a pile of debris.\n\n\n“Crowley, can you get this?” you ask. No response. Grimacing, you grab the plank and strain to lift it. It snaps in two. The debris shifts ominously. You look at the metal circle. It resembles a manhole cover, but made of fine materials. It bears the sigil of your family. There’s a small depression in the middle. Almost instinctively, you press your signet ring into it. A mechanism clicks. An ancient mechanism grinds as the circular door slides to one side, revealing the stone staircase below. \n\n\nAs you descend into the darkness, your grandfather’s skull takes a breath. \n\n\nYou walk down the stone steps. You hold the torch as close to your body as you can get it; a protective talisman against the consuming darkness. Each step disturbs the ancient layer of dust that pervades the chamber. Beyond you, the mechanism grinds as the door slides back into place. Someone went to great pains to keep this place a secret. \n\n\nYou cautiously step off the stairs and enter a carved stone chamber. As you do, a half-dozen sconced torches on the wall ignite. You survey the room, and see two passages on either side; one leading left, the other leading right. Pushed up against one wall is an oak bookshelf coated in a thick layer of dust. Next to it is a leather armchair with a smoking pipe on the arm, resting in an ancient ashtray. When was the last time anyone smoked tobacco? \n\n\nYou approach the bookshelf and blow dust off the ancient spines. It’s a shockingly well-stocked magical library, containing the kind of texts you had to have smuggled into the University. Practical necromancy, soul transference, and forbidden daemonological texts of every kind. You pull a random volume off the shelf: Practical Doloromancy. It’s one half-anatomy textbook and one-half spellbook, instructing the reader on the most efficient ways to inflict agony on a combatant. You tuck it into your pack, for later, along with two randomly chosen books off the shelf.\n\n\nYou walk down the right-hand passage. You come to another chamber, smaller than the first. This is clearly a bedroom of some kind. The hard stone floor is covered in soft fur rugs. There’s a fireplace in the wall, connected to some kind of elaborate venting system carved into the wall. The centre of the room is occupied by a large bed, covered with furs and quilts of all kinds. There’s a pair of slippers on the floor. Whoever lived here valued comfort. \n\n\nThere’s a leatherbound book with yellowed pages left on the bedside table. You open it and leaf through the pages. It’s a scientific log, detailing an iterative process in some kind of experiments over a period of years. Much of it is faded beyond legibility. \n\n\n \n\nDay ninety —\n\n\nThose fools have killed the world. It’s no matter. My experiments continue. The golem can drop supplies down the chute for as long as he can get them. Lost a third subject, today. Peasant girl. The mutagens were too much and she underwent spontaneous rapid mutation. Had to burst her brain. Note to self: perform survey of most muscular subjects. Maybe the plowman? \n\n\n \n\nDay one-hundred-thirty —\n\n\nHeard a loud crash today. The estate must have finally caved in. Curious; what could be making the timbers rot so quickly? Perhaps an ambient necrotizing field effect. Or termites. With each experiment, I grow closer to making the ideal soldier. Father Leofric, that damnable paragon of honour, lasted for three days. He was the strongest yet, and the most lucid. He broke containment and I had to magically induct his nerves for a full minute for him to fall unconscious. \n\n\n \n\nDay two hundred —\n\n\nI am dying. It matters not. A sudden cough came on me in the previous month. Now I cough blood. I feel weak. But my experiment is complete. I have created the perfect man. Strong, fast, nigh-unkillable. He has survived lacerations, burns and every poison I could brew. He is as strong as I could make him. \n\n\nIn the end, the only one to survive was one of my great and noble house’s loyal knights. Sir Crowley of Ashtenford. His rage is insane and constant. He no longer sleeps, eats, or speaks, but instead struggles against his confines tirelessly. He is alone in the holding cells; all the other subjects have long expired. I will leave him in the dark. When his mind is broken, I can use my magic to rebuild it anew. If I live that long.  He will serve the House admirably for when we reclaim our destiny. \n\n\nOnly a member of our noble family can cl\n\n\nThe rest is stained in blood and illegible. You flip through the remainder of the diary, but the pages are empty.\n\n\nYou tuck the diary into your bag and leave the bedroom. From the antechamber, there’s only one other unexplored passage. You follow it. As you walk, you think of the colossal amount of work required to dig this bunker out. You reach a fork in the tunnel. An oil-painted portrait overlooks you, bearing the likeness of some distant ancestor. It looks a little like you. \n\n\nYou arbitrarily pick a direction and walk left. You come into a small alchemist’s workshop, complete with racks of test tubes, burners and bubblers. A leather chair with straps dominates the centre of the room, the kind used by asylum doctors and barber-surgeons. Above the chair is a brass arm, sporting a hand-like appendage on one end with a half-dozen protruding needles. Dried blood covers almost every surface of the room. \n\n\nExiting the laboratory, you briefly investigate the other room. It’s easily the largest room in the facility, housing twenty wire-frame beds. Drilled into the stone ceiling is a gargantuan iron drum, fitted with twenty rubber hoses that snake along the floor to the beds. \n\n\n“Was this how he fed them?” you murmur. \n\n\nYou’re satisfied with your investigation, and believe that the bunker has no more to offer you. It’s time to head to the surface. \n\n\nYou ascend the stairs back to the surface, arriving back at the familiar metal door. The first spark of panic ignites in your breast as you realize that you cannot use your ring to open it from down here. You place a hand against the wall to steady yourself as your head spins and your breath goes short, and you hear a satisfying click. The door mechanism begins to grind, and the way opens before you. You breathe a sigh of relief. \n\n\nOutside the ruined house, Crowley is waiting for you. \n\n\n“Did you want me to see that?” you ask, staring at the armoured giant.\n\n\nHe nods. \n\n\n“An ancestor of mine did this to you?” \n\n\nHe nods. \n\n\n“How long ago was that?” \n\n\nHe shrugs.\n\n\n“And that’s why you can’t speak, and why you hate magic.” \n\n\nHe nods yes to both questions. \n\n\n“Why haven’t you killed me yet, in that case?” \n\n\nHe shrugs. You chuckle. \n\n\n“Fair enough. Shall we head back to the camp?” \n\n\nHe nods.\n","page 69":"You take your grandfather’s skull off your belt. With a sharp breath of concentration, you focus on the creature’s membranous sack. You squint your eyes and grunt in exertion as you try to rend it open. Your efforts are rewarded with an inhuman squeal as the sack breaks. fluid spills all over the creature’s back as a half-dozen people spill out. \n\n\nThe creature turns towards you, and begins to lurch to your position. With a determined scream, you wrench its head from its body. It keeps coming. You sever one limb, then another, methodically hacking and chopping at the creature until at last it falls to the ground, seeping ichor into the dead soil. \n\n\nYou approach the hapless victims who lay gasping in the soil. You don’t recognize any of them. \n\n\nYou walk up to a middle-aged man with a ginger beard, long hair, and one eye. The man lays gasping for air. Each cough discharges more viscous fluid from his lungs.  He’s wearing tattered cloth armour, with a gargantuan longsword slung over his back. \n\n\n“What is this place?” you ask. \n\n\n“Give me a — “ he raises one finger in the air, like a shushing librarian, and violently coughs. \n\n\nYou offer him a sip of water from your canteen. He greedily gulps at it. “Thanks,” he says. \n\n\n“Pay me back by telling me what the fuck is going on here,” you answer. \n\n\n“I wish I knew. Couple days ago, me and a couple mates broke into this sorcerer’s library with the hopes of making off with some valuables. Walked up to this funny black rock; glass-looking thing, on a big pedestal. Next thing I know —” \n\n\n“You’re here.” \n\n\n“Aye. Same thing happen to you, I reckon?” \n\n\n“Something like it. My compatriots and I were told to investigate the lair of a monster, and we found one of the glass stones you mentioned.” \n\n\nHe shoulders his sword and begins to walk. You follow. “Everyone I’ve met in this blasted place has a similar story. Those things must be the way through.” \n\n\n“I bet if we could find one, we could find our way back.” \n\n\n“I’m sure we can. I’ve seen those things use them.” \n\n\n“The big spiders?” \n\n\n“Ah, I see you haven’t met our hosts yet. No lad, not the spiders. The wicked fucking devils who inhabit that evil city.” \n","page 28":"You charge as a group. Frye lets out a battle cry and others take it up, joining their voices together in a chorus of rage. As you pass the crest of the hill, the Donkeys come into view. \n\n\nThe beasts’ name conjured quaint pastoral images of grazing animals that could not be further from the reality. The Donkeys stand as tall as a man. They wear crudely fashioned armour out of bits of metal and leather, and festoon themselves with gruesome fetishes made out of human body parts. Their legs are covered in hair and end in hooves. They have the heads of their animal namesakes, but their teeth are yellow and bloodied. Their trousers are all open, exposing their gargantuan genitals. \n\n\nThey shriek and bray as you charge, raising their crudely fashioned picks and clubs in defiance. There are twelve of them and six of you. As your formation slams into the mob of braying devils, you hope that One-Eye Frye and his Fighting Men were worth the silver. \n\n\nThe world instantly becomes an insane tapestry of violence and sound. Two gunshots resound right next to your head as Frye hits a Donkey in both eyes, killing it instantly and spattering its comrades in gore. They shirk from the loud noise, producing just enough of an opportunity for Tor to hurl his harpoon directly into one of their necks. A Donkey seizes him from behind as it tries to slash his throat with a dagger fashioned from an old bone. He bites down hard on its arm, before pulling on its ears so hard that they come off. It stumbles backwards, clutching its face.  \n\n\nYou watch as Tor begins the laborious process of ripping a Donkey’s jaw in half, captivated by the violence. As its jaw pops and cracks, its rotten teeth begin to shoot out of its mouth. You’re ripped out of the reverie as something grabs you by the hair and starts dragging you away into the grass. You try to twist and look behind you, and see a Donkey squealing with delight as it drags you away from the melee. You reach for the skull and whisper a few words, before tossing it into the grass and covering your ears. Your grandfather’s jaws open and begin to scream, a wail so mournful and loud that the Donkey releases you and falls to its knees. The spell wears off in an instant, so you snatch the skull up and point it at the Donkey. It lunges at you, but not before you scorch every nerve in its body. For a durationless instant, it stares at you with wide eyes filled with hatred and lust. Then its brain boils and cooked cerebral matter comes shooting out of its eyes. \n\n\nYou turn around and realize you’ve missed most of the fight. Three Donkeys are fleeing further into the foothills; you watch as a crossbow bolt pierces one of their necks, and the creature falls to the ground impotently clutching at its throat. Its comrades leave it to bleed to death. \n\n\nStitcher roars jubilantly as she brings her mace down hard into a Donkey’s skull. The force of the blow is so great that its eyes pop out. It stumbles away in confusion, not realizing that it is already dead. \n\n\nFrye stands over the last survivor with a boot on its neck. Its shrieks are piteous and defeated, that of an animal caught in a trap. He forcibly turns its head aside, and shoves the barrel of a pistol into its ear. Its sad wailing is interrupted by the crack of the gunshot that empties the contents of its head into the dead grass. \n\n\n“The day is won!” Frye declares, thrusting his pistol into the air. Brain matter drips down his sleeve. “Now we drink!” \n","page 27":"Two days later, you break free from the countryside, leaving behind old fences and ruined farmhouses for miles of dead scrub. A jovial mood settles over the party. \n\n\n“Did I ever tell you the story of how I fought a lion?” Tor asks as you walk. \n\n\n“I don’t believe you have,” you say.\n\n\n“It was long ago, back in the sands of my homeland. My father had taken me and my brothers hunting. We found an old wagon, overturned. It was long looted, except for one thing. An intact barrel of Alfaretti Red, maker’s mark and all.” \n\n\nFrye whistles. “What I wouldn’t give to have a taste of that.” \n\n\n“So that night, my father, my brothers and I got piss drunk. And when you’re piss drunk, you have to piss. So I left our campsite, and after I had gotten my cock out, I heard a roar from behind me.” \n\n\n“I’ve never known a big cat to growl when it stalks its prey,” John Boy interjects. \n\n\n“You’ve only known weak mainlander cats, then, woodsman. In my homeland, lions are as big as horses and roar like trumpeteers! So I whirled around, cock in hand, ready to face this beast. I’ve faced down many monsters, my friends, but this was unlike anything I’d ever seen. It’s teeth were as sharp as swords, and its paws as big as my head. Its breath was as harsh as dragon-flame, and its mane was shaggier than Stitcher’s cunt.” \n\n\n“Oi!” Stitcher yells.\n\n\n“So what did you do?” you ask, masking your smile. \n\n\n“I did the only thing a man can do. I punched the beast square in the nose, my cock still dangling in the night air.” \n\n\n“It’s a miracle you survived,” Frye says gravely. You can see the smile tugging at the corner of his lips. \n\n\n“It was. The beast tucked tail and ran, leaving me the victor.” \n\n\nA low horn echoes across the plains. It’s joined by another, and another, and another, until a tuneless symphony echoes across the dead scrubland. Tor and John Boy dive into the grass, Stitcher and Frye a second later. Crowley tackles you into the ground. \n\n\n“Wh— “ Crowley clamps a hand over your mouth. Frye turns to you to raise a finger to his lips. You can see the whites of his eyes. \n\n\nStitcher crawls over to you on her belly and presses her lips to your ear. “Donkeys.” \n\n\nYou nod, and Crowley releases you. John Boy slithers forward on his stomach, crossbow and hood drawn. He draws a spyglass from his pack and stares through it a moment, before returning the spyglass. He crawls back at painstaking speeds. \n\n\nHe holds up ten fingers, then three. Thirteen. He glances to Frye, and cocks his head inquisitively, as if to say: your call. \n\n\nFrye nods, then crawls over to you and presses his lips against your ear as he whispers: “Listen well, lad. We’re outnumbered but Donkeys are fucking cowards. We’re going to hit them hard and fast and disperse the raiding party. Stick to me like glue, you understand? Like glue.” \n\n\nYou nod. \n\n\n“One more thing. Don’t let them take you. Better for you to die fast, understand?” \n\n\nYou nod once more. \n\n\nFrye rises to a crouch, drawing both his pistols. Tor readies his harpoon. Stitcher opens her holy book and gives her mace a few experimental swings. John Boy checks the sight on his crossbow, then draws a knife and places it within his teeth. You draw the skull from your belt and stare into your grandfather’s bejewelled eyes; it stares back, expressionless. \n\n\nOver the hill, you hear inhuman brays and snorts, accompanied by occasional bouts of devilish laughter.\n","page 60":"As you enter, you notice a thick coating of dust.  You spend a few moments wandering through the mansion. You pass through a sitting room; next to the armchair lies a half-smoked cigar and an open book. You idly flip through the pages, only to find them stuck together. Has this book been resting for years? \n\n\nYou continue wandering. Lion tapestries hang from the walls. You find it odd, to see the sigil of your family displayed so openly. It reminds you of your childhood, when your father  still instructed you in the hermetic traditions. Your grandfather’s teeth begin to chatter at your belt, as if overcome by familiarity. \n\n\nYou wander through a few more rooms. The whole of the mansion seems as if it was abandoned in the middle of a perfectly normal day. As you walk through the dining hall, you notice that the impressive table is entirely furnished with plates, cutlery, and drinking goblets. A bottle of wine sits, still corked, in the middle of the table. \n\n\nYou contemplate this mystery as you head downstairs to the cellar. Going off hazy childhood memories, you roll an oak cask aside, revealing a concealed mechanism within a brick. You insert your signet ring, and the brick depresses into the wall. A section of wall swings open, revealing the hidden  treasury inside. \n\n\nGold ingots are stacked to the ceiling. They are all coated in a thick layer of dust, which spills out to greet you when you open the door. Each ingot is stamped with the lion of House Winter. You grab four ingots, balance them on your forearm against your chest, and walk back up the stairs to the front door. \n\n\nYou exit the house, and hand the ingots to Frye. “Payment for a job well-done.” \n\n\nHis eyes widen. “That’s a fair bit more than we agreed upon, lad.” \n\n\nYou shrug. “The journey was more difficult than I imagined.” \n\n\n“Aye, it was,” Stitcher says, approaching the both of you. She takes a gold ingot in a gauntleted hand, and turns it over. “Still, you were a fine traveling companion.” \n\n\nJohn Boy is seated on the ground with Tor. He snaps his fingers in front of the man’s eyes, prompting the giant to flinch in surprise. He nods approvingly. “Still in shock. Will recover.” \n\n\n“Glad to hear,” you say. You turn your eyes to Frye. “What’s next for One-Eye Frye and his Fighting Men?” \n\n\n“Well, we’re down a man. And we’ve a score to settle with that bastard d’Harcourt. Think we’ll try to link back up with Crowley, and mount that devil’s head on a pike.” \n\n\n“Think Crowley’s still alive?” \n\n\nFrye snorts. “I doubt anything could kill that big bastard. What’s next for Lord Winter?” \n\n\n“I need to settle my affairs here,” you notice Stitcher’s face darken. “Then, I might begin my studies again. I’ve learned so much of magic, though, it seems almost pointless.” \n\n\n“Don’t do it,” Stitcher blurts. “No offence, lordling, but it seems like everything to do with House Winter is best avoided.” \n\n\n“What would you have me do instead?” \n\n\nFrye shrugs. “You could always come along with us. A man well-practiced in the occult is a valuable asset.” \n\n\nYou ponder this, for a moment. \n","page 62":"You shake your head. “I’m where I should be,” you say. You close the door on them, before they have time to try and convince you otherwise. Leaning against the door, you expect to hear a knock. It never arrives. \n\n\nYou unclip your grandfather’s skull from your belt and stare into his garnet eyes. His jaw is opening and closing rhythmically. The only sound in the house is the faint scraping of his teeth. His garnet eyes seem to glint more than usual. \n\n\nYou walk up the stairs. You have a faint memory of Uncle Jack’s study being located on the second floor. You remember being a child, clinging to your mother’s legs as you watched your father and uncle argue. These memories are fresh in your mind as you approach the study. As you walk down the hall to the study, you notice that the long carpet on the floor is the same as when you were a child. You were always perplexed by the intricacy of the symbols, and the fact that the weaver had painstakingly woven mathematical formulae into the rug. \n\n\nYou enter the study. The walls are full of artwork that disquiets the mind. The room is dominated by your uncle’s gargantuan desk. He was always enormously proud of it. “Family relic, that’s what it is,” you remember him saying. Atop the desk is a brass cube with one face removed, revealing its complex clockwork innards. There’s a large circular receptacle resting on the cube. \n\n\nBefore fiddling with the box, you first pick up a note from the desk. \n\n\nNephew, \n\n\nYou’ve come so far.  In crossing this barren waste, you have already shown the strength of our family. You have but one task remaining. Lay your grandfather to rest on the box, so that he may rest, as I do now. Then, and only then, go downstairs to the vault and claim what is yours. You remember how to get into the vault, don’t you? \n\n\nLove, \n\n\nYour Uncle Jack \n\n\nYou smile as you read the words. Strange as he was, your memories of your Uncle Jack are fond; his moustache tickling your cheek when he kissed you as a child; him sending you forbidden magic via courier, so that you could excel over your peers; him teaching you how to read the Glyphs of Harm, so you could always defend yourself. \n\n\nYou place the skull on the box without a second thought. As you do, you scarcely feel the poisoned needle slide into your hand. You fall backwards into a sea of nothingness. \n","page 61":"You nod. On some level, this seems insane to you. However, you cannot deny the truth of Stitcher’s words; everything you know about your family seems to suggest that something dreadful might be awaiting you in your Uncle Jack’s study. “Alright,” you say. “I’ll come with you.” \n\n\nStitcher and Frye smile. John Boy grunts in approval. “One last thing,” you say. “There’s a generous amount of gold in our family vault. Would be a shame for it to go to waste.” \n\n\n“Stitcher, help the lad lighten his load of finery,” Frye commands. \n\n\n“With pleasure,” she says. You spend some minutes hauling gold ingots up the stairs. In total, you take five gold ingots. You are loath to leave the rest, but more than one ingot per person would make an overland journey impossible. \n\n\nYou spend the next few days laying low in an inn in Seffonshire. Every night, in the adjacent room, you can hear Stitcher’s ministrations, as she tries to restore some measure of Tor’s shattered mind.\n\n\nOn the fifth day, Stitcher deems him fit for travel. You leave for the city gates the next morning. \n\n\nYou walk through the early morning with your companions. The city is stirring from sleep. You pass a fishmonger wheeling his cart to the market, followed by a half dozen large rats. A feral dog eyes you curiously as you walk. \n\n\n“When did we arrive in Seffonshire?” Tor asks. \n\n\n“A few days ago. You were catatonic, so we’ve been pimping you out for five copper a piece.” \n\n\nHe snorts. You reach the city gates, again. \n\n\n“Was everything to your liking, Lord Winter?” the serjeant asks. \n\n\n“It was, yes.” \n\n\n“Good. Do you expect to return to the city, my lord?” \n\n\n“No,” you watch the serjeant try to conceal his obvious relief. The gate opens, and you and your companions leave. The open road stretches out before you once more. As you walk, Frye stops you. \n\n\n“Had something made for you, with the gold we pilfered from your family,” he says. \n\n\n“Let’s see it,” you say. \n\n\n“Near as I can figure, an adventurer needs a walking stick,” he says. He pulls a walking stick off, that had been cinched to his pack. “It’s a fine thing, really. Hickory. Forty two-inches. And you can mount that evil fucking skull of yours on the top.” \n\n\nYou take the walking stick from his hands, and sure enough, your grandfather’s preserved skull neatly screws onto the top. You point it at the horizon, and loose an experimental arc of lightning at the ground. It works just as well as holding the skull in your hands. \n\n\nIt satisfyingly impacts the ground as you walk. You cinch your pack and shoulder it, marching into an uncertain future. \n","page 20":"You awaken suddenly to an armoured gauntlet clamped over your mouth. Before you open your eyes, you know who it is. You reach for your skull but Crowley produces it from his belt, and waves it in front of your face while shaking his head. \n\n\nYou stare at his armoured face. He shakes his head as if to say don’t scream, and then takes a hand off your mouth. He jerks his head to the flap of your tent. Follow me. \n\n\n \n","page 64":"You remember the old times, before the People put crops into the ground. You remember when nights were cold and beasts preyed upon men. You remember how fire would scare the wolves, but not the One-Who-Walks-At-Night. No. The only thing that would stop him was magic. The font of creation itself. When men used spear and arrow, you used the power of the stars. They mocked you, at first. Now, you are the village’s protector and king, and no one mocks you. \n\n\n*** \n\n\nYou are a mighty king. Your father overthrew the previous king, after years of planning. While others know the ways of magic, your family’s bloodline has always been the strongest. Your father was a giant of a man, who dismembered a whole phalanx of terrified troops with the might of the cosmos. \n\n\nHe was also a warrior. In the end, when a knife was driven into his back, no one was surprised. You will not die the same way. You have gathered all of the wise women and warlocks you could find, and given them refuge in your keep. There, they will learn the secret ways; the ways of life and death. You will teach these ways to your son. This way, your family will always be secure. \n\n\n*** \n\n\nYou are a man of science. Your whole life has been spent continuing the Great Work; the ancient project of your forebears. Every man of House Winter must do his part. The world is in flames, and the screams of the dying echo down into your bunker. It matters not. The work continues, as it always has. Your golem can deliver you supplies. \n\n\nYou will die down here, away from the sun. You have made your peace with this. You are devoted to creating the perfect soldier; a beast of a man, nigh unkillable, who will serve House Winter for generations to come. \n\n\n \n\n*** \n\n\n \n\nYou are Jack Winter. The Great Work is almost complete, you can feel it in your bones. Your brother’s son, your nephew, is only five years old, but is already a prodigious user of magic. For his birthday, you presented him with the polished skull of his grandfather; he knows it only as a magical fetish, and is ignorant of his true purpose. \n\n\nYour brother does not understand. He grows reluctant, every day. It’s understandable, you suppose; no man wants to sacrifice his child. You stand outside his bedroom. It is a trivial matter to release an infected rat, loaded with the most virulent plagues you could conjure. You hear his wife scream from within. It’s grim work, but family must come first. \n\n\n \n\n*** \n\n\n \n\nYou are all these men, and more. You are the culmination of the most powerful bloodline of occultists ever to walk the earth. You are a terrible secret, passed from father to son since time immemorial.  As your heart stops, thousands of souls enter your body, filling you with unimaginable strength. Arcane power courses through your veins. You are dead, but you are immortal. \n\n\nYou are a lich. As you rise into the sky, surrounded by a pestilential mist, your dreadful arrival is heralded by the cawing of crows. You can see townsfolk dropping to their knees. Good. They are the first to serve, but they will not be the last. \n\n\nYour reign has just begun.\n","page 0":"Your fifth candle of the night burns low on your desk. The flame flickers in the cool breeze blowing in through the open window. Outside, you can hear a drunk man singing. On the floor, a half dozen books lay open. Some are taken from the University library, and some darker ones come from your own personal collection.\n\n\n A boy with curly hair, a pretty face, and a dull personality lays face down in your bed. He’s snoring. Already, your interest in him has dwindled into nothingness. You hold a letter from your uncle Jack in your hands, with a broken wax seal depicting the crest of your family. \n\n\nNephew,\n\n\nI hope this letter finds you well. Last week, I ascended Chapel Mount and lit a candle in your parents’ name. Such a terrible tragedy, for them both to take ill so young. \n\n\nI trust your studies at the University are progressing well? You are a man of House Winter, after all; I would expect that you are at least as good as your professors, now. \n\n\nI’m writing to let you know that I’ve taken ill, and I expect to die shortly. Do not mourn me, for eternal life awaits me. \n\n\nYour inheritance is waiting for you at the family estate in Seffonshire. I trust you remember it? You spent so many of your childhood years running through the halls.  The journey is perilous and long. You must hire hardy men to reach your destination. \n\n\nOur suffering in this life is great but it pales in comparison to our reward. \n\n\nLove, \n\n\nYour Uncle Jack.\n\n\nThis is the third time you’ve read it. The words are rich with the promise of adventure, leaving a thrill in your chest each time you read them. You glance at the signet ring on your right hand. The lion stares at you with cool dignity. \n\n\nIn your dreams, you wander through impossible vistas in the shadowed days of antiquity. \n"}