{
  "page 33": "Ardora kissed the hand of her beloved Flora, who promptly blushed and hid her face.\n\n\"Meara,\" Flora called softly to Ardora.\n\nMeara was Ardora\u0027s human name.\n\n\"Don\u0027t weep. I can\u0027t stand when you weep, my dearest,\" Ardora whispered against Flora\u0027s skin.\n\nFlora managed to smile since her father had been killed.\n\n\"You weep far more than I,\" Flora responded.\n\nDespond and Athena would pay for this war.\n\nBut for then, Ardora kept Flora company. Soon, Ardora pressed her lips against Flora\u0027s and they lost each other in those silk sheets of Ardora\u0027s bed.\n\nIt felt natural that Ardora admit to Flora who she really was. The other Gods would be upset, but Ardora knew for certain this Flora was bright and beautiful and deserved the world.\n\n\"What have you done?\" Despond hissed when Ardora arrived back at her domain.\n\n\"Leave my domain at once,\" Ardora said.\n\n\"You keep playing with these humans and you\u0027re bound to cause trouble.\"\n\n\"I have caused trouble?\" Ardora shouted. \"You took the lives of thousands of people! And for what? Some frivolous argument with Athena!\"\n\n\"But I have never once told a human anything about myself, about us.\"\n\n\"Perhaps you should, Despond. We are to care for Edol\u0027s beings. You don\u0027t even care for yourself.\"\n\nArdora froze half of Despond\u0027s body in this disagreement. Irene had to heal him, would have scolded these two had she not felt upset for each of them.\n\nHumans were pesky, but lovable.\n\nHumans were also mortal.\n",
  "page 77": "Spring was simple in the past. There were many types of animals and plants, but they were only a few compared the the millions that existed later on.\n\nSome of which Edol created, but Irene poured much of her heart into her own new creations.\n\nOberon insisted she keep record of all these new creatures, but Irene said they were only to exist. There did not have to be a reason or record they did.\n\nOberon had never thought of life that way before. Edol created living things as if Earth was merely a system, as if it was a duty he placed upon himself.\n\nBut Irene created for joy. She wanted something soft to hold when Oberon was not there, so she created deer.\n\nWhen Irene wanted something sturdy and thick-skinned so that it might live in the cold, she created this enormous mammal that could swim in water.\n\nA mammal that swims? inquired Oberon.\n\n\"Yes. Why must they be contained to land? They are large and deserve to swim freely.\"\n\nThey danced in the water like Irene danced in the air. They were mesmerizing to Oberon, but not as mesmerizing as Irene.\n\nOberon knew better than to keep records, but he did remember every new thing Irene created.\n\nAnd she had fallen asleep in his arms. Irene rarely slept, but she was very peaceful and beautiful when she did.\n\nBut she was always beautiful to Oberon.\n\nOberon did not sleep. He felt no reason to. But now that he had no souls to sever, what else was he to do?\n",
  "page 32": "Good does not exist without evil.\n\nDespond was not evil. Despond knew he was not evil. Oberon knew Despond was not evil.\n\nYet there was always a thought in Despond\u0027s mind that perhaps he was. If Ardora was so kind and good, then he must have been the opposite.\n\nIrene cared for them both. Irene\u0027s love knew no bounds, even if Ardora\u0027s did.\n\nIrene and Despond were in her domain one afternoon. She was healing the scars Ardora struck across his arms.\n\nAnd every touch formed a flower against Despond\u0027s skin. Ardora would pluck them and set them into his hair.\n\nBut he refused to smile at her.\n\n\"This isn\u0027t fair,\" Despond said.\n\n\"You two will always clash,\" Irene said.\n\n\"Edol favors her.\"\n\n\"Edol favors no one,\" Irene tried.\n\n\"Yes he does, Irene. He favors those humans. He favors Ardora and he favors you. It\u0027s obvious.\"\n\nIrene was silent, healed the rest of Despond\u0027s arm. His flesh turned red again and he sighed in relief.\n\n\"I\u0027m sorry,\" he said.\n\n\"No. You will say what you will. Edol is mysterious, and it is often frustrating. If I were you I would be upset as well,\" Irene said.\n\nIrene stared at Despond lovingly, even if he always held a frown.\n\n\"Do you think I\u0027m evil?\" Despond asked.\n\nIrene looked at him sideways.\n\n\"Of course not,\" she said. \"I love you. And I love Ardora. Neither of you are good nor evil. You are as complicated as the humans you despise.\"\n\nDespond huffed, turned away. He shook the flowers from his hair but said, \"Thank you, Irene.\"\n\nShe kissed his cheek, tangled flower seeds in his hair so they would grow back later.\n\nDespond was created when Irene watched Oberon take the soul of a human child. It upset her so that she wept for three days.\n\nDespond had appeared at Edol\u0027s feet with tears in his eyes.\n",
  "page 76": "Oberon visited Irene\u0027s Domain.\n\nThere were gems in the flowers and sprinkled all along the ground.\n\nAnd it was lively and beautiful as always. Birds chirped at Oberon as if to greet him.\n\nBut Irene was nowhere to be found.\n\nHe sat upon the edge of the fountain that trickled water into the clear pond beneath it.\n\nIrene, he called. My lap is cold, perhaps you could come soothe this issue.\n\nBut Irene did not appear.\n\nIrene, Oberon said again. She had been bringing Spring to Earth, but it never took her this long. And besides, she would drop everything for Oberon anyway.\n\nOberon grew anxious as he called once more.\n\nHis Goddess finally appeared. She seemed a lighter shade of green than usual.\n\n\"Oh Oberon,\" she said.\n\nShe rushed towards him, kissed him again and again as if they had been apart for centuries.\n\nIrene did indeed slip into his lap, but she was saddened.\n\nWhat is wrong? Oberon asked. He moved his hands through her hair, which did not float as high as it usually did.\n\nTears fell from Irene\u0027s eyes as she stared at him. Her lips trembled as if words she was forbidden to say desired to escape them.\n\nIrene, said Oberon, put his hand on her face.\n\nShe held his hand that held her.\n\n\"Not here, come. Come with me.\"\n\nShe pressed her lips against the side of his head as she spoke.\n\nOberon understood, took Irene in his arms and they travelled to his domain.\n\nIrene refused to leave his arms as he sat upon his throne.\n\nShe pulled him close and said, \"Edol knows about the humans\u0027 souls.\"\n\nIt was inevitable, Oberon said.\n\n\"I have reason to believe he is behind this, Oberon. He knew all along. And he didn\u0027t do anything to stop it.\"\n\nOberon shifted, clutched the arm of his throne. Darkness seeped from his cloak and along the floor.\n\n\"I watched him destroy an entire galaxy. He told me not to tell anyone, but I had to tell you.\"\n\nIrene pressed her face deep into Oberon\u0027s robes. Oberon held her, contemplated what this meant for the Gods.\n\nAs she cried, the tears rolled down the fabric, sprouted dark seedlings between the stones of Oberon\u0027s Domain.\n",
  "page 35": "Good does not exist without evil.\n\nDespond was not evil. Despond knew he was not evil. Oberon knew Despond was not evil.\n\nYet there was always a thought in Despond\u0027s mind that perhaps he was. If Ardora was so kind and good, then he must have been the opposite.\n\nIrene cared for them both. Irene\u0027s love knew no bounds, even if Ardora\u0027s did.\n\nIrene and Despond were in her domain one afternoon. She was healing the scars Ardora struck across his arms.\n\nAnd every touch formed a flower against Despond\u0027s skin. Ardora would pluck them and set them into his hair.\n\nBut he refused to smile at her.\n\n\"This isn\u0027t fair,\" Despond said.\n\n\"You two will always clash,\" Irene said.\n\n\"Edol favors her.\"\n\n\"Edol favors no one,\" Irene tried.\n\n\"Yes he does, Irene. He favors those humans. He favors Ardora and he favors you. It\u0027s obvious.\"\n\nIrene was silent, healed the rest of Despond\u0027s arm. His flesh turned red again and he sighed in relief.\n\n\"I\u0027m sorry,\" he said.\n\n\"No. You will say what you will. Edol is mysterious, and it is often frustrating. If I were you I would be upset as well,\" Irene said.\n\nIrene stared at Despond lovingly, even if he always held a frown.\n\n\"Do you think I\u0027m evil?\" Despond asked.\n\nIrene looked at him sideways.\n\n\"Of course not,\" she said. \"I love you. And I love Ardora. Neither of you are good nor evil. You are as complicated as the humans you despise.\"\n\nDespond huffed, turned away. He shook the flowers from his hair but said, \"Thank you, Irene.\"\n\nShe kissed his cheek, tangled flower seeds in his hair so they would grow back later.\n\nDespond was created when Irene watched Oberon take the soul of a human child. It upset her so that she wept for three days.\n\nDespond had appeared at Edol\u0027s feet with tears in his eyes.\n",
  "page 79": "Mira wandered into Despond\u0027s Domain one day, for his was close to hers and she must have missed a step.\n\nDespond was started, shot a bolt of fire at her before he realized who she was.\n\nMira seemed unfazed. The fire struck her but did no harm.\n\n\"What are you doing here?\" Despond demanded.\n\n\"I\u0027m Mira. You must be Despond. I did not mean to come here but I\u0027m glad I finally get to meet you,\" Mira said.\n\nShe smiled but Despond scowled.\n\n\"You are that Goddess Athena created,\" Despond said.\n\n\"Yes, but I would like to be known for more than that.\"\n\n\"You have Irene\u0027s beauty,\" Despond said. \"But I wonder what Oberon has given you.\"\n\nDespond didn\u0027t have to wonder for long. Mira was direct and did not understand Despond\u0027s tone of voice.\n\n\"Me too,\" Mira said.\n\n\"Do you have any powers?\" Despond asked.\n\n\"The humans have no souls. That is because Edol took them all,\" Mira said.\n\nDespond was silent, stunned.\n\n\"What?\"\n\n\"I don\u0027t know what my powers are. But I do know I have callings. And I answer them,\" she said, then quickly added, \"like how I stole that child. I knew I had to, but I didn\u0027t know why. But now it has worked out well.\"\n\nDespond immediately summoned Athena, told Mira to tell Athena what she told him.\n\nAthena was surprised as well, but also excited. This meant chaos.\n\n\"Little Goddess of Peace,\" Athena said. \"I don\u0027t believe you are of Peace at all.\"\n\nMira was confused.\n",
  "page 34": "\"I sense something in you, Zacharie\" Despond said.\n\nZacharie sat up, pressed his fists against the table.\n\n\"I\u0027m not some pretty boy like you,\" Zacharie whispered.\n\n\"I merely asked why you are so sad,\" Despond said calmly.\n\nZacharie\u0027s eyes flickered between Desponds before he said, \"My father was killed in the war. My mother and my sister are lost without him. I have to look after them, but I am young. I do not have my father\u0027s skills.\"\n\nZacharie was shocked these words fell from his mouth, but Despond had his ways.\n\nAnd suddenly, Despond felt incredibly guilty.\n\nIt had just been a small fight between Athena and him. Yet he killed thousands of humans, including this man\u0027s father.\n\n\"I\u0027m sorry,\" Despond said, but he seemed to not only apologize to this young man.\n\n\"May I buy you another drink?\"\n\nIt seemed insulting.\n\n\"You can buy me three, Pretty Boy,\" said Zacharie. \"Maybe I\u0027ll stop feeling so sad then, as you put it.\"\n\nDespond was taken by Zacharie\u0027s authority, immediately ordered three more drinks.\n\nAnd Despond found himself taken in other ways by this Zacharie as well. None of which he would ever admit to Ardora, or any of the other Gods for that matter.\n\nDespond began to realize why Ardora cared for these humans so much. They were enjoyable. They were intelligent and witty. And some were very handsome.\n\nOberon discovered Despond\u0027s guilty pleasures when he severed Zacharie\u0027s soul from his body years and years afterward.\n\nOberon had never seen Despond weep. Despond had never seen himself weep, yet he wept for this golden-haired human when Zacharie died.\n\n\"He will be in the stars,\" Despond whispered.\n\nCertainly, assured Oberon, for eternity. In peace.\n\nPeace is what Despond often sought yet rarely found.\n",
  "page 78": "The rabbit named Nicolai Foo-Foo bounced around Oberon\u0027s Domain and chewed on the sparse grass.\n\nIrene was scolding Oberon, saying she couldn\u0027t keep the grass growing if he refused to water it.\n\nHe said, Nicolai prefers parsley. Perhaps you ought to plant some of that instead.\n\nBut that was just an excuse so that Irene would turn away from Oberon and bend over to plant it.\n\nHe snapped his fingers and the grass all turned to dust.\n\nIrene looked over her shoulder at him but she couldn\u0027t keep a mean face.\n\nSo she bent over and planted parsley instead.\n\nOberon could have watched Irene plant parsley until the Hells froze over.\n\nIrene fetched human wine and smoking pipes for Oberon to try. She said the humans turned fermented fruit into wine to create delicious, alcoholic conconctions.\n\nThis is peculiar, Oberon said as he tasted it.\n\nHe did not so much care for the taste but he humored Irene.\n\nBut the smoke was miserable and he said, Why would any human do this? Now this is vile.\n\n\"They make that with plants. It might be vile, but these humans are very clever with their resources. They use all these things I create for them. The animals they use right down to the bone. They\u0027re very intelligent,\" Irene cooed.\n\nOberon pulled her close and kissed her. At this time, Oberon was not all that fascinated with humans yet, although Irene was beautiful even when she swooned over these creatures.\n\nBut what now? Oberon thought as Irene rested in his lap. Will my lively Irene ever return?\n\nHe touched her hair, tangled it around his fingers.\n\nThis was all Edol\u0027s fault.\n",
  "page 37": "The night was indeed peaceful on Earth. The Spring rains finally gave way to the stars that glittered in that black sky.\n\nThis was a time before the humans polluted the sky with their own light. The stars above seemed taken aback, decided to shine less and less in the following years.\n\nBut humans had existed for a few thousand years as Irene and Oberon walked through bushy plains in North America.\n\nShe held his hand tightly in her own, pointed at the stars Edol had created, and their names and how far they were from this planet Earth.\n\nOberon cared only for one star Edol had created, and she was walking beside him, and as she walked flowers sprouted in her footsteps. And as she touched him, vines grew up his arms and bloomed.\n\nHe knew all the stars in the universe, their locations and their names, but he told Irene he did not, so that she would go on and on with that sweet voice of hers.\n\nHe said, I always thought humans were peculiar, spending their time staring up at orbs of light that are certainly not as spectacular as they seem, but from here they are almost magical.\n\n\"Most things are magical,\" Irene said.\n\nOberon felt the only thing that was magical was the warmth of love for this Goddess inside his chest.\n\n\"Don\u0027t stare at me like that,\" Irene teased.\n\nShe leapt from her feet, danced through the air and lit these vast grasslands with tiny orbs of light like the ones in the sky. They were insects that flittered through the air, called to one-another with their own light, of all things.\n\nOberon was not fond of insects, but again, he knew these were almost magical.\n\nAnd if Irene found anything magical, Oberon was sure to as well.\n",
  "page 36": "The night was indeed peaceful on Earth. The Spring rains finally gave way to the stars that glittered in that black sky.\n\nThis was a time before the humans polluted the sky with their own light. The stars above seemed taken aback, decided to shine less and less in the following years.\n\nBut humans had existed for a few thousand years as Irene and Oberon walked through bushy plains in North America.\n\nShe held his hand tightly in her own, pointed at the stars Edol had created, and their names and how far they were from this planet Earth.\n\nOberon cared only for one star Edol had created, and she was walking beside him, and as she walked flowers sprouted in her footsteps. And as she touched him, vines grew up his arms and bloomed.\n\nHe knew all the stars in the universe, their locations and their names, but he told Irene he did not, so that she would go on and on with that sweet voice of hers.\n\nHe said, I always thought humans were peculiar, spending their time staring up at orbs of light that are certainly not as spectacular as they seem, but from here they are almost magical.\n\n\"Most things are magical,\" Irene said.\n\nOberon felt the only thing that was magical was the warmth of love for this Goddess inside his chest.\n\n\"Don\u0027t stare at me like that,\" Irene teased.\n\nShe leapt from her feet, danced through the air and lit these vast grasslands with tiny orbs of light like the ones in the sky. They were insects that flittered through the air, called to one-another with their own light, of all things.\n\nOberon was not fond of insects, but again, he knew these were almost magical.\n\nAnd if Irene found anything magical, Oberon was sure to as well.\n",
  "page 39": "Irene stepped into this stone house behind Oberon.\n\nOberon barely fit through the small doors. His scythe appeared in his hand as a mother and father held their dead child in their arms.\n\nIrene had not understood at first. She had watched Oberon take the souls of humans before, but not a child\u0027s.\n\n\"Oberon,\" Irene gasped, but he raised his scythe and split the child\u0027s soul from her body.\n\nIrene had dashed forward, reached and touched the child\u0027s forehead.\n\nWhen she did she formed a crown of lilies around the child\u0027s head.\n\nIrene, said Oberon in surprise.\n\nThe parents gasped and the mother wept.\n\nIrene looked back up at Oberon, who had to take her in his arms as she wept as well.\n\n\"What is your name?\" Edol asked.\n\nDespond sat before him, his eyes wide with tears.\n\n\"I am Despond,\" Despond said.\n\n\"Hello, Despond,\" Edol said.\n\nWhen Edol pulled Despond to his feet, Despond burned Edol\u0027s hands with fire.\n\nEdol was not surprised, smiled kindly at Despond.\n\nWith his other hand, Edol brushed the tears from Despond\u0027s cheeks. They dripped away in beads of light.\n\nEdol said, \"I\u0027ve been expecting you, Despond. It was only a matter of time. But my poor, dearest Irene. . .\"\n\nOberon remained in the stars for three days to console Irene, even if it meant his work would later be overwhelming.\n\nWhen he first met Despond, Oberon asked, Why does Irene feel this way? I\u0027ve never seen her like this before.\n\nDespond said, \"She is mourning like the humans mourn their dead.\"\n\nOberon had not felt sadness before that moment, before watching Irene mourn.\n",
  "page 38": "Irene had found a baby rabbit on Earth. She held it tightly in her hands, brought it to Oberon\u0027s Domain.\n\nThe rabbit was grey with white markings and long, floppy ears. It was curled close to itself in Irene\u0027s palms.\n\nOberon said, It is a rabbit.\n\nIrene said, \"Yes. His mother died. He was the only baby she had.\"\n\nSuch is life, said Oberon.\n\n\"What shall we name him?\"\n\nWell, he is very strong, surviving this far. He needs a strong name as well. Like Nicolai.\n\nIrene giggled. \"That name is bigger than he is! Why not Foo-Foo?\"\n\nFoo-Foo? said Oberon.\n\n\"It\u0027s cute, Oberon.\"\n\nIt may be, but rabbits are often meals for foxes and wolves. Nicolai shall not face the same fate.\n\nIrene smiled and kissed Oberon\u0027s cheek.\n\n\"Nicolai Foo-Foo,\" she said.\n\nNow that is preposterous.\n\n\"You\u0027re impossible, Oberon.\"\n\nI am not impossible, merely inevitable.\n\nOberon was growing keen with humor, because humor meant Irene would laugh. And all the birds she created could never laugh the sweet sound she could.\n\nNicolai was a sturdy rabbit and Oberon kept him with him in his robe.\n\nThe rabbit would later jump from Oberon\u0027s shoulders when Oberon was severing souls.\n\nNicolai, Oberon would call. And the rabbit would come running. He was more like a dog, this Nicolai. It must have been Irene\u0027s magic.\n\nOberon admired this rabbit.\n",
  "page 71": "Athena turned to look at Mira.\n\nMira was taller than Athena and had long white hair that flittered around her. She had the presence of Oberon but the face of Athena.\n\nMira\u0027s skin glowed too, and from her back she sprouted her large, white wings.\n\nAthena was far more intimidated now, stepped back from Mira.\n\n\"Why are you here?\" Athena demanded.\n\n\"I had to rescue that child,\" said Mira.\n\nWhile Athena shouted, Mira spoke softly and clearly.\n\nAthena looked Mira up and down, refused to believe she could have created a God as soft yet bright as this one.\n\nMira seemed to read Athena\u0027s thoughts. She said, \"You and Oberon created me. And for that, I am thankful. Yet I am very lost and confused. The only thing I know for certain is that my name is Mira.\"\n\nMira tried to muster a smile for Athena. But Athena was offended, sulked back and deeper into Irene\u0027s Domain.\n\n\"That\u0027s not possible. What do you do?\" Athena asked.\n\n\"I don\u0027t know,\" said the Goddess with angel wings.\n\nShe said, \"I don\u0027t mean to frighten you, Athena.\"\n\n\"I\u0027m not frightened,\" hissed Athena.\n\nAthena vanished, returned to her own domain.\n\nMira stood, alone, in Irene\u0027s Domain.\n\nShe went along and vanquished all the pests Athena had put there. It seemed like her calling.\n\nShe had not met Irene, but tucked glittering gems in the petals of Irene\u0027s flowers.\n\nAs the morning light struck the tall windows within Irene\u0027s Domain, not only did those gems shimmer, but so did this new Goddess.\n",
  "page 70": "Oberon visited Irene\u0027s Domain.\n\nThere were gems in the flowers and sprinkled all along the ground.\n\nAnd it was lively and beautiful as always. Birds chirped at Oberon as if to greet him.\n\nBut Irene was nowhere to be found.\n\nHe sat upon the edge of the fountain that trickled water into the clear pond beneath it.\n\nIrene, he called. My lap is cold, perhaps you could come soothe this issue.\n\nBut Irene did not appear.\n\nIrene, Oberon said again. She had been bringing Spring to Earth, but it never took her this long. And besides, she would drop everything for Oberon anyway.\n\nOberon grew anxious as he called once more.\n\nHis Goddess finally appeared. She seemed a lighter shade of green than usual.\n\n\"Oh Oberon,\" she said.\n\nShe rushed towards him, kissed him again and again as if they had been apart for centuries.\n\nIrene did indeed slip into his lap, but she was saddened.\n\nWhat is wrong? Oberon asked. He moved his hands through her hair, which did not float as high as it usually did.\n\nTears fell from Irene\u0027s eyes as she stared at him. Her lips trembled as if words she was forbidden to say desired to escape them.\n\nIrene, said Oberon, put his hand on her face.\n\nShe held his hand that held her.\n\n\"Not here, come. Come with me.\"\n\nShe pressed her lips against the side of his head as she spoke.\n\nOberon understood, took Irene in his arms and they travelled to his domain.\n\nIrene refused to leave his arms as he sat upon his throne.\n\nShe pulled him close and said, \"Edol knows about the humans\u0027 souls.\"\n\nIt was inevitable, Oberon said.\n\n\"I have reason to believe he is behind this, Oberon. He knew all along. And he didn\u0027t do anything to stop it.\"\n\nOberon shifted, clutched the arm of his throne. Darkness seeped from his cloak and along the floor.\n\n\"I watched him destroy an entire galaxy. He told me not to tell anyone, but I had to tell you.\"\n\nIrene pressed her face deep into Oberon\u0027s robes. Oberon held her, contemplated what this meant for the Gods.\n\nAs she cried, the tears rolled down the fabric, sprouted dark seedlings between the stones of Oberon\u0027s Domain.\n",
  "page 73": "You have wings, Oberon noted as he, Mira and the child rested in her domain.\n\nMira was still frightful, not only of the daunting Oberon who loomed close with darkness in his cloak.\n\nBut she said, \"I do. Do the other Gods have wings?\"\n\nNo.\n\nHer wings extended high above her, flittered and glittered in the wind as if Edol himself enchanted them with his own touch of light.\n\nBut she only had these wings when she was not on Earth, for Oberon did not recall seeing them before.\n\nYou must be the creation of Athena and I, said Oberon. You look like her. I am curious to know what I gave you.\n\nMira\u0027s eyes widened at Oberon.\n\n\"Was that Athena?\" she asked.\n\nYes. Don\u0027t be frightened of her. She creates War. Yet, she created you.\n\nThe child cooed from her sleep. Mira quickly moved to the child\u0027s side, basked in her peaceful slumber.\n\n\"I\u0027m sorry. I shouldn\u0027t have taken her. You must return her, Oberon.\"\n\nAnd then it occurred to Oberon.\n\nMira was the Goddess of Peace.\n\nI will, he said, even if he was fearful of returning a human child.\n\n\"You will?\" Mira said.\n\nYes, and you should meet Athena, and Edol for that matter.\n\n\"I have already met Edol. But I will certainly find Athena.\"\n\nBe wary. You are like Irene. You are calm and kind. Athena is neither of those things.\n\nMira was taken by the compliment, but she assumed she was only calm and kind because of this God of Death.\n\n\"I will. Thank you, Oberon.\"\n\nThe stars and space are limitless. Be careful. I have lost Ardora out there many times.\n\n\"Of course.\"\n\nOberon saw Mira off which a wave of his hand, before he brought down both of them to carry the child.\n",
  "page 72": "Oberon took up the child in his arms.\n\nShe awakened and stared at him with large blue eyes. And from her little head were two red braids, tied with blue ribbons that now threatened to fall from her hair.\n\nShe was silent, looked up at Oberon with amazement he only witnessed from Irene.\n\n\"Wolf,\" she said.\n\nHello, Bunni, Oberon greeted. It has been awhile. My, how you have grown.\n\nShe laughed at him and his funny voice.\n\nIt was like a chiming bell, her laughing.\n\nMira looked on at Oberon with similiar wonder before he began to step up and back towards Earth.\n\nBunni was a good child, spoke in full, coherent sentences but was still mindless enough that she desired to know what was beneath Oberon\u0027s hood.\n\nThere is nothing there besides an old skeleton, my dear, he said.\n\nBut Bunni grasped the edges of his cloak, pulled it down from his head.\n\nShe was not at all fearful of this old skeleton. Instead, she poked the holes of his eyesockets and touched his bumpy teeth.\n\nNow now, Bunni, that is rude. You did not even ask. I would have shown you if you asked.\n\nBunni grinned and said, \"I\u0027m sorry.\"\n\nDon\u0027t apologize now. You are curious, Bunni. Make sure you stay that way.\n\nThe two arrived at Bunni\u0027s mother\u0027s apartment. There gathered her family, weeping for the loss of their beloved, but also for her missing child.\n\n\"She\u0027s been gone for weeks,\" exclaimed one older woman.\n\n\"She\u0027s dead, I know it. It is all we have left of Alayane and she\u0027s dead,\" said another.\n\nBunni appeared on the doorsteps, spread her arms open for her grandmother to hold her.\n\nOberon loomed near until Bunni was found.\n\nHe pulled his hood back over his head and said, Good day, Bunni.\n\nThe child did not comprehend the loss of her mother until some time later. And Oberon felt a deep sadness in his chest the day Bunni wept.\n",
  "page 31": "Irene stepped into this stone house behind Oberon.\n\nOberon barely fit through the small doors. His scythe appeared in his hand as a mother and father held their dead child in their arms.\n\nIrene had not understood at first. She had watched Oberon take the souls of humans before, but not a child\u0027s.\n\n\"Oberon,\" Irene gasped, but he raised his scythe and split the child\u0027s soul from her body.\n\nIrene had dashed forward, reached and touched the child\u0027s forehead.\n\nWhen she did she formed a crown of lilies around the child\u0027s head.\n\nIrene, said Oberon in surprise.\n\nThe parents gasped and the mother wept.\n\nIrene looked back up at Oberon, who had to take her in his arms as she wept as well.\n\n\"What is your name?\" Edol asked.\n\nDespond sat before him, his eyes wide with tears.\n\n\"I am Despond,\" Despond said.\n\n\"Hello, Despond,\" Edol said.\n\nWhen Edol pulled Despond to his feet, Despond burned Edol\u0027s hands with fire.\n\nEdol was not surprised, smiled kindly at Despond.\n\nWith his other hand, Edol brushed the tears from Despond\u0027s cheeks. They dripped away in beads of light.\n\nEdol said, \"I\u0027ve been expecting you, Despond. It was only a matter of time. But my poor, dearest Irene. . .\"\n\nOberon remained in the stars for three days to console Irene, even if it meant his work would later be overwhelming.\n\nWhen he first met Despond, Oberon asked, Why does Irene feel this way? I\u0027ve never seen her like this before.\n\nDespond said, \"She is mourning like the humans mourn their dead.\"\n\nOberon had not felt sadness before that moment, before watching Irene mourn.\n",
  "page 75": "Oberon visited Irene\u0027s Domain.\n\nThere were gems in the flowers and sprinkled all along the ground.\n\nAnd it was lively and beautiful as always. Birds chirped at Oberon as if to greet him.\n\nBut Irene was nowhere to be found.\n\nHe sat upon the edge of the fountain that trickled water into the clear pond beneath it.\n\nIrene, he called. My lap is cold, perhaps you could come soothe this issue.\n\nBut Irene did not appear.\n\nIrene, Oberon said again. She had been bringing Spring to Earth, but it never took her this long. And besides, she would drop everything for Oberon anyway.\n\nOberon grew anxious as he called once more.\n\nHis Goddess finally appeared. She seemed a lighter shade of green than usual.\n\n\"Oh Oberon,\" she said.\n\nShe rushed towards him, kissed him again and again as if they had been apart for centuries.\n\nIrene did indeed slip into his lap, but she was saddened.\n\nWhat is wrong? Oberon asked. He moved his hands through her hair, which did not float as high as it usually did.\n\nTears fell from Irene\u0027s eyes as she stared at him. Her lips trembled as if words she was forbidden to say desired to escape them.\n\nIrene, said Oberon, put his hand on her face.\n\nShe held his hand that held her.\n\n\"Not here, come. Come with me.\"\n\nShe pressed her lips against the side of his head as she spoke.\n\nOberon understood, took Irene in his arms and they travelled to his domain.\n\nIrene refused to leave his arms as he sat upon his throne.\n\nShe pulled him close and said, \"Edol knows about the humans\u0027 souls.\"\n\nIt was inevitable, Oberon said.\n\n\"I have reason to believe he is behind this, Oberon. He knew all along. And he didn\u0027t do anything to stop it.\"\n\nOberon shifted, clutched the arm of his throne. Darkness seeped from his cloak and along the floor.\n\n\"I watched him destroy an entire galaxy. He told me not to tell anyone, but I had to tell you.\"\n\nIrene pressed her face deep into Oberon\u0027s robes. Oberon held her, contemplated what this meant for the Gods.\n\nAs she cried, the tears rolled down the fabric, sprouted dark seedlings between the stones of Oberon\u0027s Domain.\n",
  "page 30": "\"I sense something in you, Zacharie\" Despond said.\n\nZacharie sat up, pressed his fists against the table.\n\n\"I\u0027m not some pretty boy like you,\" Zacharie whispered.\n\n\"I merely asked why you are so sad,\" Despond said calmly.\n\nZacharie\u0027s eyes flickered between Desponds before he said, \"My father was killed in the war. My mother and my sister are lost without him. I have to look after them, but I am young. I do not have my father\u0027s skills.\"\n\nZacharie was shocked these words fell from his mouth, but Despond had his ways.\n\nAnd suddenly, Despond felt incredibly guilty.\n\nIt had just been a small fight between Athena and him. Yet he killed thousands of humans, including this man\u0027s father.\n\n\"I\u0027m sorry,\" Despond said, but he seemed to not only apologize to this young man.\n\n\"May I buy you another drink?\"\n\nIt seemed insulting.\n\n\"You can buy me three, Pretty Boy,\" said Zacharie. \"Maybe I\u0027ll stop feeling so sad then, as you put it.\"\n\nDespond was taken by Zacharie\u0027s authority, immediately ordered three more drinks.\n\nAnd Despond found himself taken in other ways by this Zacharie as well. None of which he would ever admit to Ardora, or any of the other Gods for that matter.\n\nDespond began to realize why Ardora cared for these humans so much. They were enjoyable. They were intelligent and witty. And some were very handsome.\n\nOberon discovered Despond\u0027s guilty pleasures when he severed Zacharie\u0027s soul from his body years and years afterward.\n\nOberon had never seen Despond weep. Despond had never seen himself weep, yet he wept for this golden-haired human when Zacharie died.\n\n\"He will be in the stars,\" Despond whispered.\n\nCertainly, assured Oberon, for eternity. In peace.\n\nPeace is what Despond often sought yet rarely found.\n",
  "page 74": "Irene had brought on Spring yet again on the far side of the Earth. She walked through the humans\u0027 crops and blessed them.\n\nBut her fingers trembled as she bloomed flowers and created the rabbits that ran the fields.\n\nShe could not take her mind from Edol, and how he destroyed that galaxy and threatened her.\n\nBut most importantly, Edol knew these humans were losing their souls, yet did nothing to protect them.\n\nIs he tired of humans like he grew tired of that galaxy? Irene thought.\n\nDespond felt his heart beat as Irene fell to tears in that crop field. But he did not know the reason why.\n\nArdora had tears fall from her face, freeze and then shatter as they hit the ground. But she did not know the reason why.\n\nOberon sensed something strange not only on Earth. He did not know the reason why.\n\nMira appeared at Irene\u0027s side, placed a gentle hand upon her back.\n\nIrene turned and looked at the Goddess. Mira managed a small smile for her.\n\n\"Hello,\" Mira said. \"I am Mira. You must be Irene. Why are you crying?\"\n\nIrene was taken aback, but knew that this Goddess with shining white hair was not human at all.\n\nIrene quickly wiped the tears from her eyes.\n\n\"Hello Mira,\" Irene said. \"You must be our new Goddess.\"\n\n\"I am. Why are you crying?\" Mira asked.\n\nIrene was silent, stood to her legs with some trouble.\n\n\"Spring is a busy time for me. I am just overwhelmed,\" Irene lied.\n\n\"I know you don\u0027t know me very well, but I would prefer you did not lie to me, Irene,\" Mira said.\n\n\"Ah, you are very sharp,\" Irene said.\n\n\"Not particularly. What is wrong?\"\n\nIrene was speechless.\n\n\"A lot of things,\" Irene said.\n",
  "page 44": "Irene looked up at the God of Death with large, wonderous eyes.\n\nIt was true Irene fell in love with him far before he fell in love with her.\n\nBut it was not difficult for Oberon. Edol insisted these human females were of the utmost beauty, but the only being Oberon found that was of the utmost beauty was this Goddess of Spring.\n\nAnd at first Oberon was skeptical, merely because Irene was just another creation of Edol.\n\nIrene gave Oberon that white rose when they met.\n\nTheir following conversation went:\n\nThank you, Oberon said. You are very kind. You have incredible powers. Use them well.\n\nIrene was taken by that compliment.\n\nShe brushed some of her wild red hair out of her face. She would touch the locks and they would float away.\n\n\"That is very kind of you to say, Oberon.\"\n\nHis name was sweet on her lips.\n\nShe smiled and Oberon was also taken.\n\nEdol appeared.\n\n\"Sage Edol,\" Irene said.\n\nOberon did not look at him, could not take his gaze from this green-skinned beauty.\n\nAnd Edol was very aware of Irene\u0027s beauty.\n\n\"Spring is to begin soon,\" Edol told her. \"You have a lot of work ahead of you, my dear, but you are very capable.\"\n\n\"I love Earth,\" Irene said.\n\n\"As do I,\" Edol said and smiled.\n\nEdol turned to Oberon, said, \"Why don\u0027t you take Irene to Earth. She has a lot to learn, and you are very knowledgable, Oberon.\"\n\nEdol had never complimented Oberon before.\n\nGladly, Oberon said.\n\nOberon reached out his hand, said, Do not be afraid of my hands. I am just an old skeleton.\n\n\"Why would I ever be afraid?\" Irene asked.\n\nEdol would later regret asking Oberon to take Irene to Earth. Their love that bloomed was a power Edol did not fully comprehend. And when Edol did not comprehend something, it was bound to be trouble.\n",
  "page 88": "Ardora finally managed to convince Oberon to return to his domain.\n\nBut now his domain was cold and dead without the touches of his beloved Irene.\n\nArdora replanted the white roses around Oberon\u0027s fountain, said to him, \"We will never forget her, Oberon.\"\n\nOberon stared on at those shimmering flowers as Ardora kissed his head.\n\nAnd when she kissed him, there formed a new Goddess before them.\n\nA childlike Goddess with skin that was green like Irene\u0027s.\n\nThis Goddess had Ardora\u0027s long green hair but the big blue eyes of Irene, of which looked on at Oberon with the same affection Irene had looked upon him with when they first met.\n\nOberon was surprised.\n\nIrene, he said.\n\n\"My name is Vida,\" the Goddess said. She had a soft, kind smile.\n\nAnd in her little hands she had flower seeds. They fell onto the ground and began to sprout.\n\nArdora lovingly gasped.\n\nHello, Vida, Oberon greeted, although still shocked. I am Oberon.\n\n\"Will you be my friend, Oberon?\" Vida asked him.\n\nOf course. I shall be your friend forever if you so desire, Vida.\n\n\"I would like that very much.\"\n\nArdora felt her heart swell, even if there still existed a hole within it for some time. And Oberon had a hole in his heart that never quite healed, but this new Goddess Vida tried her damnest to fill it at every waking moment.\n\nAnd Mira enchanted Nicolai Foo-Foo so that he might never die, so he bounced around Vida and made her laugh, which was like beautiful bells to Oberon.\n",
  "page 43": "Oberon found himself admiring a small town on the far side of Earth.\n\nThe humans that walked these cobblestone streets were kind. They smiled and said Hello to one-another. The merchants sold fresh fruits and the stores were lively in these Winter months.\n\nHe was not on Earth to sever souls at that moment. He enjoyed humans and their societies quite a lot, and learning about them was enjoyable.\n\nOberon would have never admitted anything of the sort before he met Irene.\n\nA child held the hand of her mother, stared up at Oberon with wide eyes.\n\nOberon had walked on, but the child turned and looked at him. Her gaze was steady, full of glittering wonder that children tend to have.\n\nOberon paused in his steps, caught the intense gaze of this little girl.\n\nHe raised his hand, waved to her as humans do.\n\nShe waved back and giggled.\n\nOberon was astounded. He looked around at the other humans, but none did see him.\n\nThe girl\u0027s mother pulled her along, asked, \"What are you looking at, dear?\"\n\nOberon appeared at the girl\u0027s side. She had light hair tied with blue ribbons and a little matching dress.\n\nOberon found her cute, especially with the toothless smile she gave him.\n\nHello there, he said.\n\n\"Hello!\" she replied.\n\n\"Bunni, who are you talking to?\" asked her mother.\n\nThis girl\u0027s name was Bunni. It was fitting. Her braids looked like rabbit ears.\n\n\"Big wolf,\" she said.\n\n\"A wolf? You\u0027re so silly, Bunni.\"\n\nHer mother swept her up in her arms, pressed a kiss against her red cheeks and she giggled.\n\nBunni waved at him over her mother\u0027s shoulder.\n\nOberon said, Goodbye, Bunni.\n\n\"Children can see you?\" Irene asked.\n\nShe was in his lap, tucking violets into his robes as they relaxed at his domain.\n\nNo, they usually cannot, Oberon said. But this girl, she did.\n\n\"Magical,\" Irene cooed.\n\nIndeed.\n",
  "page 87": "As Edol died, Mira turned from white to gold.\n\nThey had scattered from Edol\u0027s Domain as it began to collapse, found themselves in the stars watching Mira change color.\n\nShe was like young star.\n\nDespond watched with amazement. Athena had actually feared this was chaos even she could not withstand.\n\nMira looked at her hands now turned golden like Edol\u0027s.\n\n\"Mira,\" Despond said, \"you must be our new Sage.\"\n\nMira was not ready for any such responsiblity, but she knew deep in her heart she was meant to be.\n\n\"What does this mean?\" she asked.\n\n\"You must answer that yourself, Little Goddess,\" said Athena.\n\n\"The humans,\" Mira said.\n\nAthena and Despond looked at each other.\n\nMira said, \"We must return the humans\u0027 souls back to them. Immediately!\"\n\nShe grasped the arms of Athena and Despond, brought them to Earth to fix the disaster Edol had caused.\n\nAnd these three Gods, of War, of Despair and of Peace, returned to Earth to deliever the humans\u0027 souls back to them, where these souls rightfully belonged. And where they would not be touched again in any case of enraged, godly jealousy.\n\nAnd for once, Athena and Despond found themselves not so much causing trouble, but fixing trouble.\n\nDespond had seperated himself from these pitiful creatures since his loss of his beloved Zacharie, but found a new hope and joy within humans watching them venture into Heaven.\n\nAthena had yet to be convinced these humans were as worthwhile, but did enjoy sending them to the Hells.\n\nAnd Mira looked on at her work and found that perhaps she belonged here on Earth as well, as not a God to humans, but as a friend.\n",
  "page 46": "Ardora had tears in her eyes, stared at Despond before she vanished.\n\n\"She can\u0027t treat me like this,\" Despond told Irene before he left as well.\n\nAthena had been looking between Ardora and Despond, basking in their delicious feuding. She turned and looked at Oberon and Irene.\n\nIrene was frustrated. Her hands were fists and her hair fell on her shoulders.\n\nThose two, mused Oberon.\n\n\"You go and find Ardora. I\u0027ll speak to Despond,\" Irene told Oberon.\n\n\"The humans,\" said Athena.\n\nI have more important matters to attend to than consoling Ardora, Oberon told Irene.\n\nBut he only said such a thing because he was terrible at consoling Ardora.\n\n\"We need to solve this issue. That is our duty, Oberon,\" Irene scolded.\n\nShe stood tall, kissed him and said, \"Ardora admires you and she will listen. Go on and speak to her.\"\n\nOberon took Irene\u0027s hand and pressed a kiss into her skin.\n\nAnd Despond loves you, perhaps even more than I do.\n\nIrene smiled.\n\nAnd Athena felt awkward sitting there before these two.\n\nOberon turned to her and said, You busy yourself, Athena. If you cause any trouble you will be hearing from me.\n\nAnd if you dare tell Edol about any of this, I assure you the consequences will be severe.\n\n\"Yes, Oberon,\" Athena said, but the thought of punishment was almost exciting to the troublemaking Goddess.\n\nIrene slipped away through the ground and Oberon lifted his scythe.\n\n\"I simply must find the culprit of this thievery,\" mused Athena.\n\nCausing such celestial chaos was Athena\u0027s purpose. This was fascinating, but upsetting.\n",
  "page 45": "Ardora had tears in her eyes, stared at Despond before she vanished.\n\n\"She can\u0027t treat me like this,\" Despond told Irene before he left as well.\n\nAthena had been looking between Ardora and Despond, basking in their delicious feuding. She turned and looked at Oberon and Irene.\n\nIrene was frustrated. Her hands were fists and her hair fell on her shoulders.\n\nThose two, mused Oberon.\n\n\"You go and find Ardora. I\u0027ll speak to Despond,\" Irene told Oberon.\n\n\"The humans,\" said Athena.\n\nI have more important matters to attend to than consoling Ardora, Oberon told Irene.\n\nBut he only said such a thing because he was terrible at consoling Ardora.\n\n\"We need to solve this issue. That is our duty, Oberon,\" Irene scolded.\n\nShe stood tall, kissed him and said, \"Ardora admires you and she will listen. Go on and speak to her.\"\n\nOberon took Irene\u0027s hand and pressed a kiss into her skin.\n\nAnd Despond loves you, perhaps even more than I do.\n\nIrene smiled.\n\nAnd Athena felt awkward sitting there before these two.\n\nOberon turned to her and said, You busy yourself, Athena. If you cause any trouble you will be hearing from me.\n\nAnd if you dare tell Edol about any of this, I assure you the consequences will be severe.\n\n\"Yes, Oberon,\" Athena said, but the thought of punishment was almost exciting to the troublemaking Goddess.\n\nIrene slipped away through the ground and Oberon lifted his scythe.\n\n\"I simply must find the culprit of this thievery,\" mused Athena.\n\nCausing such celestial chaos was Athena\u0027s purpose. This was fascinating, but upsetting.\n",
  "page 89": "Ardora finally managed to convince Oberon to return to his domain.\n\nBut now his domain was cold and dead without the touches of his beloved Irene.\n\nArdora replanted the white roses around Oberon\u0027s fountain, said to him, \"We will never forget her, Oberon.\"\n\nOberon stared on at those shimmering flowers as Ardora kissed his head.\n\nAnd when she kissed him, there formed a new Goddess before them.\n\nA childlike Goddess with skin that was green like Irene\u0027s.\n\nThis Goddess had Ardora\u0027s long green hair but the big blue eyes of Irene, of which looked on at Oberon with the same affection Irene had looked upon him with when they first met.\n\nOberon was surprised.\n\nIrene, he said.\n\n\"My name is Vida,\" the Goddess said. She had a soft, kind smile.\n\nAnd in her little hands she had flower seeds. They fell onto the ground and began to sprout.\n\nArdora lovingly gasped.\n\nHello, Vida, Oberon greeted, although still shocked. I am Oberon.\n\n\"Will you be my friend, Oberon?\" Vida asked him.\n\nOf course. I shall be your friend forever if you so desire, Vida.\n\n\"I would like that very much.\"\n\nArdora felt her heart swell, even if there still existed a hole within it for some time. And Oberon had a hole in his heart that never quite healed, but this new Goddess Vida tried her damnest to fill it at every waking moment.\n\nAnd Mira enchanted Nicolai Foo-Foo so that he might never die, so he bounced around Vida and made her laugh, which was like beautiful bells to Oberon.\n",
  "page 48": "Ardora was not at her domain.\n\nOberon looked into the stars and called, Ardora, would you like to speak with me?\n\nThere was silence.\n\nHe travelled to Earth.\n\nShe was not in Flora\u0027s old home. She was not in the Arctic. She was not even in the fifth or sixth skies.\n\nArdora, called Oberon once more.\n\n\"Why would Edol ever create these wonderful beings, then take them away from us?\"\n\nArdora.\n\nShe was not on Earth. She travelled to a faraway star, sat on the top with her legs tucked close to herself.\n\nHer hair floated through space, led Oberon to her.\n\nMay I join you? he asked.\n\n\"You may always,\" Ardora said.\n\nHe sat down beside her, looked off into the vast distance of space and time.\n\n\"I\u0027m sorry for acting like this,\" Ardora said. \"I really have been investigating the humans. But my mind and my heart are elsewhere.\"\n\nI assumed as much, Oberon said.\n\n\"I don\u0027t understand how you can take souls like you do. It\u0027s heartbreaking.\"\n\nIndeed.\n\n\"I could never do that.\"\n\nArdora rested her head on her knees. When her palms touched the star below her she turned it blue.\n\nThat is alright, Oberon said, because you are not here to sever souls. You are here to bring joy to humans.\n\nArdora slipped her hand into Oberon\u0027s.\n\nOberon felt a coolness wash through his arm.\n\nYour beloved Flora is resting peacefully, Oberon said.\n\nAt that, a cold tear dripped from Ardora\u0027s eye.\n\nShe let her head rest against Oberon\u0027s shoulder.\n\nHe raised his other, raised his scythe into space and sliced a hole into Heaven.\n\nEdol would berate him for doing such a thing, but Ardora deserved to see Flora one last time.\n\nStars appeared all around them with each of Ardora\u0027s heartbeats.\n",
  "page 47": "Ardora had tears in her eyes, stared at Despond before she vanished.\n\n\"She can\u0027t treat me like this,\" Despond told Irene before he left as well.\n\nAthena had been looking between Ardora and Despond, basking in their delicious feuding. She turned and looked at Oberon and Irene.\n\nIrene was frustrated. Her hands were fists and her hair fell on her shoulders.\n\nThose two, mused Oberon.\n\n\"You go and find Ardora. I\u0027ll speak to Despond,\" Irene told Oberon.\n\n\"The humans,\" said Athena.\n\nI have more important matters to attend to than consoling Ardora, Oberon told Irene.\n\nBut he only said such a thing because he was terrible at consoling Ardora.\n\n\"We need to solve this issue. That is our duty, Oberon,\" Irene scolded.\n\nShe stood tall, kissed him and said, \"Ardora admires you and she will listen. Go on and speak to her.\"\n\nOberon took Irene\u0027s hand and pressed a kiss into her skin.\n\nAnd Despond loves you, perhaps even more than I do.\n\nIrene smiled.\n\nAnd Athena felt awkward sitting there before these two.\n\nOberon turned to her and said, You busy yourself, Athena. If you cause any trouble you will be hearing from me.\n\nAnd if you dare tell Edol about any of this, I assure you the consequences will be severe.\n\n\"Yes, Oberon,\" Athena said, but the thought of punishment was almost exciting to the troublemaking Goddess.\n\nIrene slipped away through the ground and Oberon lifted his scythe.\n\n\"I simply must find the culprit of this thievery,\" mused Athena.\n\nCausing such celestial chaos was Athena\u0027s purpose. This was fascinating, but upsetting.\n",
  "page 49": "Despond was simple to find because he left a trail of fire in his wake.\n\nIrene found him striking stars in space and turning them red with his touch.\n\n\"Despond,\" called Irene.\n\nHe did not look at her, turned to a small planet and set it afire.\n\nShe drifted towards him, put a hand on his shoulder.\n\nHe was hot to the touch.\n\nBut he trembled, and when he looked over his shoulder at Irene, there were tears dripping from his eyes. His face was so hot they immediately evaporated.\n\n\"My love,\" Irene said.\n\nDespond was silent, allowed Irene to hold his head and shoulders close to her.\n\n\"I fell in love with a human, Irene. I loved a human, Irene. But now he\u0027s dead, Irene.\"\n\nIrene had never known such a thing. And if Oberon knew, he never told her.\n\n\"Despond, oh Despond. I\u0027m sorry. It\u0027s terrible. It\u0027s miserable. I know. I watch my creations die every year.\"\n\n\"Why would Edol create these humans when they simply die?\" Despond pleaded.\n\nHe held Irene close to him, wept into her hair.\n\nWith every tear, peppers would bloom, fall away and drift through the endless space.\n\nIrene did not know the answer to that.\n\nAt that moment, Irene felt as if she did not know anything.\n\nWhy was Edol so merciless like this?\n\nShe ushered Despond at least back to his domain.\n\nIrene planted prickly cactus and bloomed them all around Despond\u0027s Domain.\n\nDespond sat and watched her. He admired her gentle touch of life.\n\n\"I feel like I can only destroy,\" he said to her.\n\nShe formed something in her palms, opened them to Despond.\n\nIt was a baby bird. A yellow-eyed hawk.\n\nDespond took it as gently as he could. It chirped softly in his hands.\n\n\"What does this mean?\" he asked.\n\n\"I think you have powers unknown to even yourself, Despond,\" Irene told him. \"I have faith you can raise this little bird into something strong and powerful, just like you.\"\n\nIrene smiled at Despond, who was rather taken by this twittering creature.\n\n\"Thank you, Irene.\"\n\n\"Always, my love.\"\n",
  "page 80": "Ardora felt a sadness within her heart. It weighed down within her even as she played with the humans.\n\nShe thought Despond must have been behind this, but she hadn\u0027t seen him on Earth since they fought.\n\nAnd now there was a new Goddess running about, one of which Ardora had not even met yet.\n\nNeedless to say, Ardora was anxious and sad and knowing her precious humans had no souls was crippling.\n\nFemale humans gathered around her and kissed and touched her and she them, but nothing could rid her of these intense feelings.\n\nWhen a cold tear slipped down her face, Ardora excused herself and travelled to the stars.\n\nShe paced around her domain before she felt the pull of harsh emotions somewhere else among the stars.\n\nShe stood just outside Edol\u0027s Domain, listened closely.\n\nShe felt Edol\u0027s heart beat wildly. She felt his hot anger and she had to take her fingers from the door lest she burn them.\n\nAs she walked along Edol\u0027s Domain, she froze the marble floor. The water sizzled and evaporated.\n\nHe had struck a bolt of golden light through the tall windows. They shattered and fell and cut his skin.\n\n\"Edol,\" Ardora called.\n\nEdol turned sharply. His eyes were golden before they rested on Ardora, then they faded.\n\n\"Ardora,\" he said.\n\n\"What\u0027s wrong?\" Ardora asked.\n\nEdol stuttered for words.\n\n\"It\u0027s nothing. Nothing, Ardora. What are you doing here?\"\n\n\"I felt your anger.\"\n\nEdol should have known. He should have left the galaxy before he was upset.\n\n\"Are you alright?\" Ardora pleaded.\n\nEdol felt frustrated. Ardora was just another creation of Irene and Oberon\u0027s love and she was miserable for him to bear any longer.\n\n\"Yes. Leave me be,\" he said.\n\nBut Ardora did not have a chance to say another word. He vanished her back to her domain.\n\nArdora knew something was wrong.\n",
  "page 82": "Edol was going mad.\n\nHe thought that if humans had no souls, there would be nothing for Oberon to sever.\n\nOberon shouldn\u0027t have been severing anything for the past several months, yet he still found joy in these humans. He still found joy parading around on Earth with Irene.\n\nOberon had defied his creation, and as did Irene.\n\nEdol thought Despond would have been the last God, yet there existed Athena and now Mira.\n\nOberon was too powerful, and with Irene beside him, tangled around him with all her love, they could be unstoppable.\n\nSo Edol had to stop them. But taking the humans\u0027 souls did not work.\n\nHe told Irene to stay on Earth, yet she defied him.\n\nAnd even Edol did not know what Mira could do. She had gold light like he did.\n\nEdol shattered the windows of his domain, sent Ardora away as she witnessed him.\n\nAnd he knew Ardora would never keep quiet.\n\nSo he slipped into his tall gold throne, looked on at the Earth below him.\n\nPerhaps he would have to kill Earth like he had before. Perhaps he would have to destroy this entire galaxy as well.\n\nAnd it was all because of Irene.\n\nIt was all because of Oberon.\n\nEdol was intensely jealous of Oberon. He had always been jealous. Oberon found joy in life even when Edol didn\u0027t.\n\nOberon found love and even accepted that he had no more souls to sever. He was satisfied. Perhaps he was even happy that he had more time to spend with Irene.\n\nAnd Irene, the Goddess of Spring, of Life and Rebirth, found her joy in the dark robes of Oberon.\n\nShe was supposed to fall in love with Edol.\n\nEdol knew a Goddess of Life would enjoy him much more than the God of Death.\n\nYet Edol peered into Oberon\u0027s Domain, saw Irene sleeping in Oberon\u0027s arms. With each of her soft, contented breaths flowers bloomed in the dark and despaired domain.\n\nIt was impossible.\n\nIt should have been impossible.\n",
  "page 81": "Ardora felt a sadness within her heart. It weighed down within her even as she played with the humans.\n\nShe thought Despond must have been behind this, but she hadn\u0027t seen him on Earth since they fought.\n\nAnd now there was a new Goddess running about, one of which Ardora had not even met yet.\n\nNeedless to say, Ardora was anxious and sad and knowing her precious humans had no souls was crippling.\n\nFemale humans gathered around her and kissed and touched her and she them, but nothing could rid her of these intense feelings.\n\nWhen a cold tear slipped down her face, Ardora excused herself and travelled to the stars.\n\nShe paced around her domain before she felt the pull of harsh emotions somewhere else among the stars.\n\nShe stood just outside Edol\u0027s Domain, listened closely.\n\nShe felt Edol\u0027s heart beat wildly. She felt his hot anger and she had to take her fingers from the door lest she burn them.\n\nAs she walked along Edol\u0027s Domain, she froze the marble floor. The water sizzled and evaporated.\n\nHe had struck a bolt of golden light through the tall windows. They shattered and fell and cut his skin.\n\n\"Edol,\" Ardora called.\n\nEdol turned sharply. His eyes were golden before they rested on Ardora, then they faded.\n\n\"Ardora,\" he said.\n\n\"What\u0027s wrong?\" Ardora asked.\n\nEdol stuttered for words.\n\n\"It\u0027s nothing. Nothing, Ardora. What are you doing here?\"\n\n\"I felt your anger.\"\n\nEdol should have known. He should have left the galaxy before he was upset.\n\n\"Are you alright?\" Ardora pleaded.\n\nEdol felt frustrated. Ardora was just another creation of Irene and Oberon\u0027s love and she was miserable for him to bear any longer.\n\n\"Yes. Leave me be,\" he said.\n\nBut Ardora did not have a chance to say another word. He vanished her back to her domain.\n\nArdora knew something was wrong.\n",
  "page 40": "The night was indeed peaceful on Earth. The Spring rains finally gave way to the stars that glittered in that black sky.\n\nThis was a time before the humans polluted the sky with their own light. The stars above seemed taken aback, decided to shine less and less in the following years.\n\nBut humans had existed for a few thousand years as Irene and Oberon walked through bushy plains in North America.\n\nShe held his hand tightly in her own, pointed at the stars Edol had created, and their names and how far they were from this planet Earth.\n\nOberon cared only for one star Edol had created, and she was walking beside him, and as she walked flowers sprouted in her footsteps. And as she touched him, vines grew up his arms and bloomed.\n\nHe knew all the stars in the universe, their locations and their names, but he told Irene he did not, so that she would go on and on with that sweet voice of hers.\n\nHe said, I always thought humans were peculiar, spending their time staring up at orbs of light that are certainly not as spectacular as they seem, but from here they are almost magical.\n\n\"Most things are magical,\" Irene said.\n\nOberon felt the only thing that was magical was the warmth of love for this Goddess inside his chest.\n\n\"Don\u0027t stare at me like that,\" Irene teased.\n\nShe leapt from her feet, danced through the air and lit these vast grasslands with tiny orbs of light like the ones in the sky. They were insects that flittered through the air, called to one-another with their own light, of all things.\n\nOberon was not fond of insects, but again, he knew these were almost magical.\n\nAnd if Irene found anything magical, Oberon was sure to as well.\n",
  "page 84": "Irene was awakened when the doors of Oberon\u0027s Domain crashed open with the fury of three angered Gods and one who simply agreed to follow.\n\n\"Edol knew that the humans were losing their souls,\" Athena said.\n\nIrene looked at Oberon before she stood from his lap.\n\n\"We know,\" Irene said to the Gods.\n\n\"What are we to do?\" Asked Ardora.\n\n\"We should have never trusted Edol,\" said Despond.\n\n\"Oberon should smite Edol,\" offered Athena.\n\n\"I sense the worst is yet to come,\" said Mira.\n\nThe Gods fell silent and looked at Mira.\n\nOberon stood and then everyone\u0027s gazes turned to him.\n\nI will speak to Edol, Oberon said.\n\n\"You can\u0027t. He\u0027s irrational and too powerful,\" Irene interjected.\n\nWe must find a solution to this problem. And if that means I have to face Edol\u0027s wrath, I will, Oberon said.\n\nIrene\u0027s eyes flickered over Oberon with love and fear.\n\nHe went and slipped his hand into Irene\u0027s, faced the other Gods.\n\nYou all are best to leave. Go far away and hide.\n\n\"The humans,\" Ardora said.\n\nIrene held Oberon\u0027s hand close to herself. She said, \"Oberon.\"\n\nHe swept Irene up in his arms and kissed her.\n\nArdora was about to weep but her heart also flittered.\n\nDespond felt the warmth of these two Gods, even if he did not appreciate it.\n\nAthena was bored.\n\nAnd Mira was impassioned much like Ardora.\n\nGo, now. Leave this galaxy for now. I will try to protect the humans, but Edol is unpredictable.\n\nIrene was hesitant to leave Oberon\u0027s side.\n\nEach of the Gods vanished one by one. Mira nodded at Oberon and Irene before she left as well.\n\nOberon looked to Irene, leaned down on a knee before her.\n\nShe was weeping.\n\nI love you, Irene.\n\n\"Don\u0027t speak to me like that, as if you\u0027re going to die,\" she pleaded.\n\nHe held her hands in his own.\n\nI assure you, as long as you exist, my love, I am unstoppable.\n\n\"Oberon! I love you!\" Irene said.\n\nBut as she went to hold him, he vanished her, sent her far away, to the farthest reaches of the universe.\n\nOberon stood, felt his heart heavy in his ribcage, and went to speak to Edol.\n",
  "page 83": "Irene was awakened when the doors of Oberon\u0027s Domain crashed open with the fury of three angered Gods and one who simply agreed to follow.\n\n\"Edol knew that the humans were losing their souls,\" Athena said.\n\nIrene looked at Oberon before she stood from his lap.\n\n\"We know,\" Irene said to the Gods.\n\n\"What are we to do?\" Asked Ardora.\n\n\"We should have never trusted Edol,\" said Despond.\n\n\"Oberon should smite Edol,\" offered Athena.\n\n\"I sense the worst is yet to come,\" said Mira.\n\nThe Gods fell silent and looked at Mira.\n\nOberon stood and then everyone\u0027s gazes turned to him.\n\nI will speak to Edol, Oberon said.\n\n\"You can\u0027t. He\u0027s irrational and too powerful,\" Irene interjected.\n\nWe must find a solution to this problem. And if that means I have to face Edol\u0027s wrath, I will, Oberon said.\n\nIrene\u0027s eyes flickered over Oberon with love and fear.\n\nHe went and slipped his hand into Irene\u0027s, faced the other Gods.\n\nYou all are best to leave. Go far away and hide.\n\n\"The humans,\" Ardora said.\n\nIrene held Oberon\u0027s hand close to herself. She said, \"Oberon.\"\n\nHe swept Irene up in his arms and kissed her.\n\nArdora was about to weep but her heart also flittered.\n\nDespond felt the warmth of these two Gods, even if he did not appreciate it.\n\nAthena was bored.\n\nAnd Mira was impassioned much like Ardora.\n\nGo, now. Leave this galaxy for now. I will try to protect the humans, but Edol is unpredictable.\n\nIrene was hesitant to leave Oberon\u0027s side.\n\nEach of the Gods vanished one by one. Mira nodded at Oberon and Irene before she left as well.\n\nOberon looked to Irene, leaned down on a knee before her.\n\nShe was weeping.\n\nI love you, Irene.\n\n\"Don\u0027t speak to me like that, as if you\u0027re going to die,\" she pleaded.\n\nHe held her hands in his own.\n\nI assure you, as long as you exist, my love, I am unstoppable.\n\n\"Oberon! I love you!\" Irene said.\n\nBut as she went to hold him, he vanished her, sent her far away, to the farthest reaches of the universe.\n\nOberon stood, felt his heart heavy in his ribcage, and went to speak to Edol.\n",
  "page 42": "Ardora had always been emotional. It was part of her nature.\n\nDespond had always been calculating. It was part of his nature.\n\nThey clashed. And often.\n\nThey clashed like the humans on Earth did. They had different ideals, different desires. Ardora could not fathom how Despond was so despaired with an Earth like this to explore. Despond could not fathom how Ardora was always so forgiving of these sinful humans.\n\nDespond collected scars on his human form from Ardora.\n\nHe said, \"You\u0027re not supposed to use your powers in your human form.\"\n\nArdora just threw sharp icicles at him.\n\nBut for a short time at the beginning of their Godships, Ardora and Despond quite admired each other.\n\nArdora was older than Despond but she found him handsome and clever.\n\nDespond thought Ardora was prettier than even Irene and he admired her willpower.\n\nBut Ardora became upset one rainy day on Earth, when Despond set an entire human village on fire.\n\nHe did not so much start it himself. He simply, accidentally, knocked a torch from its place, blew its flames higher and higher until the humans started running and weeping.\n\n\"What have you done?\" demanded Ardora.\n\n\"Just a bit of fun, Ardora,\" Despond assured her.\n\nIt was at that moment Ardora suddenly did not know this newly-created Despond to be who she thought he was.\n\nShe watched her precious humans weep as they lost their homes in this raging fire. She implored Irene to bring in rain, but it helped these wooden homes little.\n\nWith a fist of ice, she struck Despond\u0027s face, scarred his human form for the rest of his existence.\n\nAthena appeared at Edol\u0027s feet.\n\nEdol knew it was only a matter of time, but he was surprised nonetheless.\n\n\"Hello,\" he said to this new Goddess.\n\nShe was shy, peered up at him with eyes like Despond\u0027s but wild red hair like Irene\u0027s.\n\nAnd she had the body of Ardora all the while.\n\n\"You must be Athena,\" Edol tried.\n\nAthena looked over her shoulder, down to Earth and saw Ardora and Despond fight for the first time.\n\nAnd she laughed.\n",
  "page 86": "\"You have come here to vanquish me,\" Edol said.\n\nThe God of Life and Creation stood by the shattered windows of his domain, gazed down upon the prosperous Earth of his own doing.\n\nWhat you have done to the humans is sinful, unforgivable, Oberon said.\n\n\"It was only a matter of time. Heaven is limited, and so are the Hells. They prefer so much to be there on Earth, so let them be there forever.\"\n\nEdol\u0027s eyes were golden, peered over at Oberon through broken eyeglasses.\n\nEdol said, \"Let them be there so that Ardora or Irene might cherish them forever. That is what they desire. That is what Irene desires. But I wouldn\u0027t know. She desires you and only you, after all.\"\n\nThis is about Irene, noted Oberon.\n\nOberon crept closer, floated along the floor. Edol\u0027s golden rays extended towards Oberon, as if to warn him.\n\nAnother entire universe flashed into existence as Edol struck a bolt of light into Oberon\u0027s chest.\n\nOberon recoiled. His robes were set afire but he quickly put them out.\n\nHe summoned his scythe, raised it above his head and brought it down over Edol\u0027s head.\n\nThe scythe sliced Edol in two. And with Oberon\u0027s strike, many, many stars exploded into black holes in the distance.\n\nBut Edol was unaffected. He pulled himself back together and shot bolt after bolt of the hideous golden light at Oberon.\n\nThis is useless, hissed Oberon.\n\nOberon\u0027s darkness crept up his scythe as he brought it down upon Edol once more. But it was no use. Neither of them could be destroyed.\n\nBut Oberon, in a fury, kept slicing at Edol, forced him backwards towards the wall where the glass panes were broken.\n\n\"Oberon!\" called a voice.\n\nEdol was now more a mass of light than a man, slithered back together as Oberon turned to see who called for him.\n\nIrene.\n\nShe raised her arms. Vines tangled up and all around Edol\u0027s Domain. They grasped at Edol\u0027s limbs, restrained him.\n\nDespond followed suit, blew fire at Edol\u0027s mass.\n\nAnd soon Ardora froze his light.\n\nBut none of this was any use.\n\nEdol reformed, tore from Irene\u0027s vines and broke free from the ice.\n\nHe snapped his fingers and Irene appeared beside him.\n\n\"I cannot kill you,\" Edol declared, \"but I can kill that of which means the most to you.\"\n\nEdol took Irene by the arm, and in an instant drove his fist through her chest.\n\nShe gasped. Oberon shouted.\n\nIrene collapsed as her skin and bones began to flake away like a wilted flower.\n\nOberon was stunned and furious. He felt the fury of all the Gods combined, and now fear that he had lost his true love.\n\nEverything turned dark. The stars all around Earth faded into nothing. Earth eventually faded into nothing.\n\nThere was just Edol and Oberon, like it had been at the creation of the universe.\n\nOberon lifted his mighty scythe, powered by will and fear and unfathomable anger.\n\nThe cries of Irene fell silent and the crack of Edol\u0027s golden bones and the tearing of his golden skin was the only thing anyone heard for one second.\n\nEdol vanished into dust and shattered Oberon\u0027s scythe as he died.\n\nEdol\u0027s Domain began to collapse. Oberon took Irene in his arms and forgot about the other Gods.\n\n~~~\n\nAnd then they were on Earth. Oberon held the wilting Irene in his arms, cradled her, begged her to stay.\n\n\"Oberon,\" she said. Her eyes had turned white. Vines seeped from beneath the soil and entrapped her limbs, and Oberon as well.\n\nShe reached up to touch his face, pressed her fingers beneath that dark cloak.\n\nYou mustn\u0027t, whispered Oberon.\n\n\"I love you, Oberon,\" Irene said. \"I always loved you. I think you\u0027re perfect.\"\n\nBut her words faded and so did she.\n\nHer skin kept flaking away until there was nothing left of her. Until Oberon held nothing left of her but white roses in his palms.\n\nAnd in her wake, Irene left a bountiful forest that stretched far along the near side of Earth.\n\nOberon wept. Oberon felt a deep sadness he had never felt before.\n\nHe remained still for several days before Ardora finally found him.\n\nShe placed a gentle hand upon his shoulder, before collapsing around him as she held him.\n\nAnd Oberon turned and held Ardora as well. His tears were endless. As were Ardora\u0027s.\n\nBut as each of Oberon\u0027s tears fell onto the Earthly floor, they sprouted the white roses.\n",
  "page 41": "Irene looked up at the God of Death with large, wonderous eyes.\n\nIt was true Irene fell in love with him far before he fell in love with her.\n\nBut it was not difficult for Oberon. Edol insisted these human females were of the utmost beauty, but the only being Oberon found that was of the utmost beauty was this Goddess of Spring.\n\nAnd at first Oberon was skeptical, merely because Irene was just another creation of Edol.\n\nIrene gave Oberon that white rose when they met.\n\nTheir following conversation went:\n\nThank you, Oberon said. You are very kind. You have incredible powers. Use them well.\n\nIrene was taken by that compliment.\n\nShe brushed some of her wild red hair out of her face. She would touch the locks and they would float away.\n\n\"That is very kind of you to say, Oberon.\"\n\nHis name was sweet on her lips.\n\nShe smiled and Oberon was also taken.\n\nEdol appeared.\n\n\"Sage Edol,\" Irene said.\n\nOberon did not look at him, could not take his gaze from this green-skinned beauty.\n\nAnd Edol was very aware of Irene\u0027s beauty.\n\n\"Spring is to begin soon,\" Edol told her. \"You have a lot of work ahead of you, my dear, but you are very capable.\"\n\n\"I love Earth,\" Irene said.\n\n\"As do I,\" Edol said and smiled.\n\nEdol turned to Oberon, said, \"Why don\u0027t you take Irene to Earth. She has a lot to learn, and you are very knowledgable, Oberon.\"\n\nEdol had never complimented Oberon before.\n\nGladly, Oberon said.\n\nOberon reached out his hand, said, Do not be afraid of my hands. I am just an old skeleton.\n\n\"Why would I ever be afraid?\" Irene asked.\n\nEdol would later regret asking Oberon to take Irene to Earth. Their love that bloomed was a power Edol did not fully comprehend. And when Edol did not comprehend something, it was bound to be trouble.\n",
  "page 85": "Irene was awakened when the doors of Oberon\u0027s Domain crashed open with the fury of three angered Gods and one who simply agreed to follow.\n\n\"Edol knew that the humans were losing their souls,\" Athena said.\n\nIrene looked at Oberon before she stood from his lap.\n\n\"We know,\" Irene said to the Gods.\n\n\"What are we to do?\" Asked Ardora.\n\n\"We should have never trusted Edol,\" said Despond.\n\n\"Oberon should smite Edol,\" offered Athena.\n\n\"I sense the worst is yet to come,\" said Mira.\n\nThe Gods fell silent and looked at Mira.\n\nOberon stood and then everyone\u0027s gazes turned to him.\n\nI will speak to Edol, Oberon said.\n\n\"You can\u0027t. He\u0027s irrational and too powerful,\" Irene interjected.\n\nWe must find a solution to this problem. And if that means I have to face Edol\u0027s wrath, I will, Oberon said.\n\nIrene\u0027s eyes flickered over Oberon with love and fear.\n\nHe went and slipped his hand into Irene\u0027s, faced the other Gods.\n\nYou all are best to leave. Go far away and hide.\n\n\"The humans,\" Ardora said.\n\nIrene held Oberon\u0027s hand close to herself. She said, \"Oberon.\"\n\nHe swept Irene up in his arms and kissed her.\n\nArdora was about to weep but her heart also flittered.\n\nDespond felt the warmth of these two Gods, even if he did not appreciate it.\n\nAthena was bored.\n\nAnd Mira was impassioned much like Ardora.\n\nGo, now. Leave this galaxy for now. I will try to protect the humans, but Edol is unpredictable.\n\nIrene was hesitant to leave Oberon\u0027s side.\n\nEach of the Gods vanished one by one. Mira nodded at Oberon and Irene before she left as well.\n\nOberon looked to Irene, leaned down on a knee before her.\n\nShe was weeping.\n\nI love you, Irene.\n\n\"Don\u0027t speak to me like that, as if you\u0027re going to die,\" she pleaded.\n\nHe held her hands in his own.\n\nI assure you, as long as you exist, my love, I am unstoppable.\n\n\"Oberon! I love you!\" Irene said.\n\nBut as she went to hold him, he vanished her, sent her far away, to the farthest reaches of the universe.\n\nOberon stood, felt his heart heavy in his ribcage, and went to speak to Edol.\n",
  "page 6": "Irene finished her decorating of Oberon\u0027s Domain when the large doors creaked open behind her.\n\nShe almost called, \"Oberon!\" but this was not at all Oberon.\n\nSage Edol was the creator of Earth and everything. He formed Earth\u0027s mountains with his hands. He carved the rivers and oceans as he walked. And with his breath he created the clouds that drifted in the sky, and the sun of which they obstructed.\n\n\"Edol,\" Irene said.\n\n\"What are you doing here in Oberon\u0027s Domain, Irene?\" he questioned.\n\nIt was very obvious, but Edol was always harsh.\n\n\"I was decorating. Oberon likes when I do this,\" Irene told him.\n\n\"You should be on Earth. Spring will be here soon,\" said Edol.\n\nOberon placed his hand on Edol\u0027s shoulder, burned away the silk fabric of Edol\u0027s golden robe.\n\nIt is beautiful, Irene, said Oberon to Irene.\n\nAnd to Edol Oberon said, You do not have permission to visit my domain, Edol. I ask you kindly to leave.\n\nEdol had golden skin and long, white hair and glasses that Oberon thought only made him seem intelligent.\n\nAnd Edol pressed those glasses back against his face.\n\n\"You should return to Earth soon,\" insisted Edol to Irene.\n\n\"Yes, Edol.\"\n\nLeave my domain, demanded Oberon.\n\nEdol vanished and in his wake left golden rays of sun.\n\nOberon stomped those away.\n",
  "page 19": "It was when Sage Edol struck Oberon across the head with a bolt of light that the universe was created.\n\nOberon had since despised Edol, for reasons extending beyond just a bruise.\n\nBut the universe itself was well worth the headache. Oberon severed the first souls of the first beings, until there came a time when Edol was creating too many living things.\n\nThere were several other Gods of Death whom severed the souls of each their species. Oberon took to humans, especially once he met Irene.\n\nEdol created Irene when the planet became rich in all kinds of these lifeforms.\n\nShe was the Goddess of Spring and Life.\n\nWhile Oberon appeared at each human\u0027s death, Irene appeared at each human\u0027s birth.\n\n\"Hello! I am Irene,\" said Irene to Oberon when they first met. She had pretty blue eyes like the sky above Earth.\n\nHello Irene, I am Oberon, said Oberon to Irene.\n\n\"May I give you a gift?\" she asked.\n\nOberon had never received a gift before.\n\nA gift? he said.\n\nShe formed a white rose in her hands, presented it to the God of Death.\n\nStunning, he said.\n\nAnd so was the rose.\n\nOberon and Irene first kissed atop a hill somewhere in the vast deserts of Earth. When they kissed, Ardora appeared in the stars.\n\nEdol was surprised. He discovered Oberon and Irene were not only exceptionally powerful themselves, but so was their love.\n\nThis was naturally problematic.\n",
  "page 5": "Irene was a small Goddess with skin as green as the plants she grew and hair red with the love she had for Oberon.\n\nHer feet padded along the ground and flowers sprouted from between the stones.\n\nShe always had an animal companion or several by her side and adored the humans Edol created.\n\nBut above all, she adored Oberon.\n\nShe was sure no other God saw her slip into Oberon\u0027s Domain.\n\nHe was still at Earth, gave Irene ample time for her to fill his domain with flowers and birds.\n\nThey would wilt and fade after time, but that only meant Irene could do this all again the following days.\n\nShe touched the walls and vines grew there. She stepped and below her feet corn sprouted. She dipped her hands into Oberon\u0027s fountain and formed fish and frogs. She reached through the air and birds landed upon her shoulders.\n\nAnd she stepped back, admired her work. Oberon would scold her every time for this, but they both knew he enjoyed her gifts very much.\n\nAnd Irene was fascinated with Oberon\u0027s powers. She could only give life, and he could only take.\n\nThat is why he always took her gifts. It was inevitable he did.\n\nIrene moved her fingers through her long flowing hair. Atop her head appeared white roses.\n\nWhite roses were Oberon\u0027s favorite.\n",
  "page 18": "Humans had strange faces of all types and spoke strange languages of all types.\n\nIrene held Oberon\u0027s hand tightly in her own, seemed to usher him along through the deserts of Earth.\n\nThe first human civilizations appeared in the deserts where the weather was mostly mild other than the stinging rays of the Sun.\n\nOberon was fond of the darkness, and likewise Irene was fond of the light.\n\nIn the light, Oberon noticed, Irene\u0027s red hair would glitter and float through the air. When in darkness, her hair would sink and turn dull.\n\nShe is a rose, thought Oberon.\n\nOberon later removed the ceiling of his dark domain.\n\n\"Why would you do that?\" Ardora had asked.\n\nI admire the light, Oberon replied.\n\nBut they both knew he instead rather admired Irene.\n\n\"Look at how beautiful they are,\" cooed Irene as she and Oberon watched dark-skinned humans bring water from the rivers back to their stone homes.\n\nShe leaned down and touched that water, blessed the crops that floated atop it.\n\nThey are fascinating if anything, said Oberon.\n\n\"They are just as intelligent as you or I,\" Irene mused. \"They speak languages I\u0027m still trying to learn, but they say the same things as we do. It\u0027s incredible.\"\n\nOberon had never found too many things on Earth incredible. Most things on Earth were tainted in some way by Edol, even the humans themselves.\n\nBut watching Irene\u0027s eyes illuminate with wonder at these humans brought a new admiration of them to Oberon.\n\nIrene followed Oberon to one stone home that sat upon a hill.\n\nI sense a soul, said Oberon softly to Irene.\n\n\"May I come with you?\"\n\nYou may come with me wherever I go, my love, Oberon said. But this might upset you.\n",
  "page 8": "Despond sunk back to his domain. It was within the inner circle of Earth, where the core was hot and smoky and more comfortable than Ardora\u0027s fortress of ice.\n\nHe preferred the warmth like she preferred the cold.\n\nHe touched his face. Ardora had froze his skin with her ice strikes. She was perpetually ill-tempered and it often seemed like Despond was the only God willing to listen to her.\n\nShe had those humans. Those humans loved her.\n\nNo one loves me, thought Despond.\n\nDespond was the God of Despair. His creation was unfair. He was not particularly despaired himself, but he had not a soul who cared for him like those humans cared for Ardora, or like Irene cared for Oberon.\n\nEdol was fond of Despond, but Edol wasn\u0027t often around this Earth he so adored.\n\nOberon appeared in Despond\u0027s Domain.\n\nDespond was startled, sat up from his silk cushions atop the magma floor.\n\nYour face, inquired Oberon.\n\n\"I know. Ardora is upset with me. I\u0027m staying here until she cools down.\"\n\nDespond smiled but Oberon did not understand jokes.\n\nYou cannot stay here forever, especially when humans are dying without their souls, said Oberon.\n\nDespond was surprised at such a statement.\n\n\"Without their souls?\" Despond asked.\n\nYes. Do you have anything to do with this?\n\n\"Tsk! Not at all. I\u0027m not fond of humans and I especially don\u0027t care enough to take their souls.\"\n\nOberon loomed closer Despond. His long robes caught fire as he stepped along the magma but they did not burn.\n\nIf I discover you had anything to do with this, warned Oberon.\n\n\"You know I respect you, Oberon. I would never do such a thing. If anyone is behind this, it is Ardora. She adores those pesky humans enough that she just might be behind this thievery.\"\n\nOberon vanished and Despond huffed at his leaving.\n\n\"Farewell.\"\n",
  "page 7": "Ardora sent a bolt of ice at Despond\u0027s face.\n\nDespond had been laughing until Ardora shouted.\n\nThese two Gods were brother and sister. Ardora was the Goddess of Love.\n\n\"Enough of you!\" she shouted. Icicles dripped from her fingertips and she marched towards Despond as if she was going to kill him.\n\nShe had long, green hair that whipped through the air and around her and blue skin that shimmered with ice. She wore a blue silk scarves in the presence of others but often nothing at all.\n\n\"All you do is make my precious humans miserable!\" Ardora shouted.\n\nDespond had collapsed to the ground.\n\nHis hair was red, and as was his skin. But when Ardora struck him he turned purple.\n\nHe did not fire back at Ardora, lest he feel the wrath of Edol.\n\nAnd it was unfair. Ardora bullied him often, yet all he could do was shield his face.\n\nAnd so he did.\n\n\"Ardora! Enough!\" he cried.\n\n\"Go back to the Hells where you belong!\" she cried.\n\nHe huffed and against Edol\u0027s demands, he breathed flames at Ardora\u0027s feet, scorching her and turning her purple as well.\n\nShe reached to strike him from above, but he vanished into ash before he could.\n\n\"Bastard,\" Ardora said.\n\n\"You two,\" mused Athena.\n\n\"Athena,\" said Ardora.\n\nArdora floated back to the ground. Her feet stung and she winced.\n\n\"He doesn\u0027t often fire back at you. You should punish him for that,\" Athena said.\n\n\"Get out of my domain,\" warned Ardora.\n\n\"There is a thief of souls running about,\" Athena told her. \"Humans are dying but remaining on Earth.\"\n\n\"What? My darlings?\"\n\n\"Indeed. The circumstances are peculiar. I\u0027m going to tell Edol. He deserves to know.\"\n\nYou will not, called a voice. Oberon\u0027s voice.\n",
  "page 2": "Oberon travelled to Earth.\n\nHe was exceptionally fond of Earth and its inhabitants, especially when Edol created Irene to look after all these living things.\n\nAnd only living things they were to Oberon until Irene said one soft day, \"They have personalities and voices all their own. All of them. From the smallest flower to the tallest elephant.\"\n\nElephant? Oberon asked.\n\n\"Oh yes. The funny names humans give animals,\" Irene giggled.\n\nThat laugh was charming. And so were these funny humans.\n\nNone did see the tall and foreboding Oberon walk their streets. He was invisible to them until they died.\n\nAnd he searched for lost humans until another died.\n\nAn apartment in a Central City. A man hung himself.\n\nThis world and all it has to offer, mused Oberon, yet they choose death instead.\n\nOberon was fond of himself, but could not fathom that humans were as well.\n\nIrene was fond of him. Irene was perhaps the only living thing fond of him.\n\nHe sliced this man\u0027s soul free from his body.\n\nBut when he lifted that terrifying scythe of his, there was no soul to sever.\n\nThe rope finally snapped and the the wooden beam over the man\u0027s head gave way before his neck did.\n\nThe man pulled himself from his body, looked over his body silently.\n\nThen the man turned to Oberon.\n\nThere was no fear in his dark eyes. This had been a very thoughtful death.\n\nGood morning, said Oberon.\n\n\"Are you the Grim Reaper?\" asked the man in a thick, northern accent.\n\nThat is one of my names, said Oberon.\n\n\"Afterlife, huh?\" the man mused.\n\nI regret to inform you that your soul has been stolen, Oberon regrettably informed the man.\n\n\"What?\"\n\nHumans are quizzical, thought Oberon.\n\nOberon explained, You will not have an afterlife. Your soul is gone. Your soul has been stolen.\n\n\"What?\" tried the man again in disbelief.\n",
  "page 1": "Irene told the Goddess Athena about the matter.\n\n\"Missing souls?\" Athena asked.\n\n\"Yes. Oberon went to Earth to search, but we don\u0027t understand. This shouldn\u0027t be possible,\" Irene said.\n\n\"Edol\u0027s Earth is a place I still have yet to fully understand myself,\" admitted Athena. \"But I will search at once.\"\n\n\"Do not tell Edol about this. Oberon has already upset him. If he discovers his precious humans are walking about without souls, he might just strike Oberon dead.\"\n\nThe two sighed at the joke.\n\nAthena touched Irene\u0027s shoulder.\n\n\"I won\u0027t,\" Athena assured Irene.\n\n\"Thank you.\"\n\nAthena stepped down to Earth. She cast away her armor for a form-fitting yet conservative gown.\n\nEarth had since become rather grey after the war. The air was darkened with smoke as the humans filled their chimneys with wood and fire.\n\nAthena did not take notice of nature as much as Irene did, and was instead rather fascinated by the new technologies of this new human age.\n\nOf course, the countries, as the humans called them, on the far side suffered worse from the war than these countries did.\n\nAnd what of war now, thought Athena. She would have no place in this human age of peace.\n\nShe would have to take to growing plants like Irene, and at that thought she scowled.\n\nShe walked the streets of one small village before travelling to another. Then she travelled to a city somewhere on the near side of Earth.\n\nIt was lively and beautiful.\n\nAthena watched one man strike another right on the streets. They were drunk.\n",
  "page 4": "Irene was a small Goddess with skin as green as the plants she grew and hair red with the love she had for Oberon.\n\nHer feet padded along the ground and flowers sprouted from between the stones.\n\nShe always had an animal companion or several by her side and adored the humans Edol created.\n\nBut above all, she adored Oberon.\n\nShe was sure no other God saw her slip into Oberon\u0027s Domain.\n\nHe was still at Earth, gave Irene ample time for her to fill his domain with flowers and birds.\n\nThey would wilt and fade after time, but that only meant Irene could do this all again the following days.\n\nShe touched the walls and vines grew there. She stepped and below her feet corn sprouted. She dipped her hands into Oberon\u0027s fountain and formed fish and frogs. She reached through the air and birds landed upon her shoulders.\n\nAnd she stepped back, admired her work. Oberon would scold her every time for this, but they both knew he enjoyed her gifts very much.\n\nAnd Irene was fascinated with Oberon\u0027s powers. She could only give life, and he could only take.\n\nThat is why he always took her gifts. It was inevitable he did.\n\nIrene moved her fingers through her long flowing hair. Atop her head appeared white roses.\n\nWhite roses were Oberon\u0027s favorite.\n",
  "page 3": "The Goddess Athena inquired as to why these men were fighting.\n\nThe man who grasped the collar of the other shouted, \"Non-a yer business, woman!\"\n\nThe other had a nose that had since been smashed inward. Blood dripped from his face and his eyes were swollen.\n\nHumans are cruel and merciless, Athena thought.\n\nShe watched the man die before them. The other must have sobered up, gasped and dashed away.\n\nAthena searched for a soul in this dead man.\n\nHe had none.\n\nAs he pulled out of his body, he stared at Athena.\n\n\"You allowed this to happen,\" said the man to Athena.\n\n\"I\u0027m sorry,\" said Athena.\n\nThe man wandered in the direction of the other.\n\nIt was true. Humans were dying without souls.\n\n\"This must be the work of Oberon,\" Athena mused.\n\nAthena was mischievous in this way. She knew very well Oberon would never commit such a sinful act.\n\nShe would tell Edol immediately.\n\nThe Goddess Athena did no right or wrong. It was the Gods Ardora and Despond who did right and wrong.\n\nAthena was merely playful, especially when this Earth had potential crimes to commit.\n\nShe returned to the stars, searched for Edol.\n",
  "page 11": "It was when Sage Edol struck Oberon across the head with a bolt of light that the universe was created.\n\nOberon had since despised Edol, for reasons extending beyond just a bruise.\n\nBut the universe itself was well worth the headache. Oberon severed the first souls of the first beings, until there came a time when Edol was creating too many living things.\n\nThere were several other Gods of Death whom severed the souls of each their species. Oberon took to humans, especially once he met Irene.\n\nEdol created Irene when the planet became rich in all kinds of these lifeforms.\n\nShe was the Goddess of Spring and Life.\n\nWhile Oberon appeared at each human\u0027s death, Irene appeared at each human\u0027s birth.\n\n\"Hello! I am Irene,\" said Irene to Oberon when they first met. She had pretty blue eyes like the sky above Earth.\n\nHello Irene, I am Oberon, said Oberon to Irene.\n\n\"May I give you a gift?\" she asked.\n\nOberon had never received a gift before.\n\nA gift? he said.\n\nShe formed a white rose in her hands, presented it to the God of Death.\n\nStunning, he said.\n\nAnd so was the rose.\n\nOberon and Irene first kissed atop a hill somewhere in the vast deserts of Earth. When they kissed, Ardora appeared in the stars.\n\nEdol was surprised. He discovered Oberon and Irene were not only exceptionally powerful themselves, but so was their love.\n\nThis was naturally problematic.\n",
  "page 55": "Athena electrified an arrow and shot at this white-haired Goddess.\n\nOberon shouted at Athena, but the arrow landed in the Goddess\u0027 shoulder before it turned to dust and faded away.\n\nThis Goddess looked over her pale shoulder at Athena, held the weeping child close to her.\n\n\"You caused this,\" the Goddess whispered, but her voice was so soft and light she was hardly heard.\n\nBut Oberon did hear, reached out towards this Goddess to pacify her.\n\nBut as he touched her shoulder, he recoiled as a flash of light burned his hand.\n\nShe had Athena\u0027s powers.\n\n\"Tell us who you are!\" shouted the startled Athena.\n\nBut the Goddess pulled the child close and broke open a seam in the ground, faded in an instant into the Earth, much like Oberon could.\n\nOberon vanished.\n\nAthena looked on at the dead mother, her child gone and taken by an unknown Goddess.\n\nAn unknown Goddess of electricty and light like Athena.\n\n\"You humans,\" hissed Athena at the mother.\n\nThe crowd did not seem to notice the child had vanished. Sirens rang in the distance and soon enough the weeping of hundreds of humans was suddenly unbearable to the Goddess of War.\n\nAthena returned to her domain, collapsed upon her velvet sofa.\n",
  "page 10": "Irene finished her decorating of Oberon\u0027s Domain when the large doors creaked open behind her.\n\nShe almost called, \"Oberon!\" but this was not at all Oberon.\n\nSage Edol was the creator of Earth and everything. He formed Earth\u0027s mountains with his hands. He carved the rivers and oceans as he walked. And with his breath he created the clouds that drifted in the sky, and the sun of which they obstructed.\n\n\"Edol,\" Irene said.\n\n\"What are you doing here in Oberon\u0027s Domain, Irene?\" he questioned.\n\nIt was very obvious, but Edol was always harsh.\n\n\"I was decorating. Oberon likes when I do this,\" Irene told him.\n\n\"You should be on Earth. Spring will be here soon,\" said Edol.\n\nOberon placed his hand on Edol\u0027s shoulder, burned away the silk fabric of Edol\u0027s golden robe.\n\nIt is beautiful, Irene, said Oberon to Irene.\n\nAnd to Edol Oberon said, You do not have permission to visit my domain, Edol. I ask you kindly to leave.\n\nEdol had golden skin and long, white hair and glasses that Oberon thought only made him seem intelligent.\n\nAnd Edol pressed those glasses back against his face.\n\n\"You should return to Earth soon,\" insisted Edol to Irene.\n\n\"Yes, Edol.\"\n\nLeave my domain, demanded Oberon.\n\nEdol vanished and in his wake left golden rays of sun.\n\nOberon stomped those away.\n",
  "page 54": "Athena crept along one of the tall human buildings. She liked to dance along the wires above the city. She assumed the humans used these to communicate with one another from great distances apart.\n\nWhen Athena swooped down to look closely at a mother and her child, she cut the wire with her blade. The wire was alive and landed in a puddle on the wet ground.\n\nThese humans were fascinating. They used means of electricity to communicate, yet the electricity itself was dangerous.\n\nAthena saw this mother holding a little girl, walked towards the puddle.\n\nAthena was basking in the inevitability when Oberon appeared and threw her against the brick wall of one of the human buildings.\n\nWhat are you doing? hissed Oberon.\n\nHe sliced the topmost part of the wire so that it fell and died.\n\nAthena\u0027s eyes were wide, frightened, yet she wanted to feel Oberon\u0027s wrath.\n\n\"I was watching the inevitable,\" Athena whispered.\n\nYou are forbidden to toil in the lives of these humans, Oberon said.\n\nOberon\u0027s words were dark and deep and terrifying. From beneath his cloak a darkness spread.\n\nBut Athena seemed indifferent.\n\n\"That is why I am here, Oberon. I know my place. And you should know yours,\" she said.\n\nAthena grinned wildly.\n\nThe wire was dead but the mother fell. With her last strength, she held that little girl in her arms, protected her little head from that wet ground.\n\nOberon rushed to her side. Athena took notice of his affections towards humans.\n\n\"Her heart simply stopped beating,\" Athena whispered.\n\nOberon was livid with Athena. The child in her mother\u0027s arms began to weep, looked at Oberon with large eyes.\n\nBoth Athena and Oberon were startled when a Goddess appeared beside them.\n\nAthena was atonished, watched this white-haired Goddess take the child in her arms.\n\nHumans around them began to shout, point at the collapsed mother. But some continued on, must have not heard the stinging cries of the little girl.\n\nOberon severed the mother\u0027s soul, but there was no soul to sever.\n\nThere was no thief.\n\nUnless this Goddess was the Soul Thief.\n\nBut if she was, she hardly looked like one.\n",
  "page 13": "Athena vanished.\n\n\"She\u0027s miserable. She\u0027s always causing trouble down on Earth,\" Ardora said.\n\nArdora was wary of Oberon. They did not speak often, even if Ardora was the child of Oberon and Irene\u0027s love.\n\nArdora did not understand how her existence came to be from the God of Death.\n\nThe thought of death was frightful to Ardora. Despond was everything she was not, but the thought of death was even more petrifying.\n\nBut she was respectful of Oberon, invited him to sit.\n\nHe did.\n\n\"Good morning, Oberon. I don\u0027t see you often,\" Ardora said.\n\nHer face was beautiful. Her eyelashes were long and her lips plump. She rivalled Irene in this way, but Oberon would never admit such a thing.\n\nGood morning, Ardora, said Oberon. That is true. I am too busy.\n\n\"And I have not seen Irene as of late either. Is she preparing for Spring?\"\n\nYes, she always is. There is always a new flower or tree. The squirrels are repopulating at an alarming speed as well.\n\nArdora laughed even if Oberon was confused as to why.\n\nI assume you have heard about what is happening on Earth, Oberon inquired.\n\n\"Yes. I don\u0027t know how this could happen. My loves don\u0027t deserve this.\"\n\nIce formed on Ardora\u0027s palms. She said, \"It\u0027s upsetting. I\u0027m incredibly upset.\"\n\nAs am I. I implore you to go to Earth and invesigate this matter. You are comforting to humans, Oberon said.\n\nArdora smiled and her smile was striking.\n\n\"Humans are comforting to me,\" she said. \"I will immediately.\"\n\nDo not tell Edol about this.\n\n\"I would never.\"\n\nThank you, Ardora.\n\nArdora nodded, stepped towards Oberon and placed a kiss on his head.\n\nOberon was very taken, shooed Ardora away with a hand.\n\nGet on, he scolded.\n\nArdora smiled again, disappeared to Earth through a waterfall.\n\nOberon looked at his palm and found a white rose.\n",
  "page 57": "Athena crept along one of the tall human buildings. She liked to dance along the wires above the city. She assumed the humans used these to communicate with one another from great distances apart.\n\nWhen Athena swooped down to look closely at a mother and her child, she cut the wire with her blade. The wire was alive and landed in a puddle on the wet ground.\n\nThese humans were fascinating. They used means of electricity to communicate, yet the electricity itself was dangerous.\n\nAthena saw this mother holding a little girl, walked towards the puddle.\n\nAthena was basking in the inevitability when Oberon appeared and threw her against the brick wall of one of the human buildings.\n\nWhat are you doing? hissed Oberon.\n\nHe sliced the topmost part of the wire so that it fell and died.\n\nAthena\u0027s eyes were wide, frightened, yet she wanted to feel Oberon\u0027s wrath.\n\n\"I was watching the inevitable,\" Athena whispered.\n\nYou are forbidden to toil in the lives of these humans, Oberon said.\n\nOberon\u0027s words were dark and deep and terrifying. From beneath his cloak a darkness spread.\n\nBut Athena seemed indifferent.\n\n\"That is why I am here, Oberon. I know my place. And you should know yours,\" she said.\n\nAthena grinned wildly.\n\nThe wire was dead but the mother fell. With her last strength, she held that little girl in her arms, protected her little head from that wet ground.\n\nOberon rushed to her side. Athena took notice of his affections towards humans.\n\n\"Her heart simply stopped beating,\" Athena whispered.\n\nOberon was livid with Athena. The child in her mother\u0027s arms began to weep, looked at Oberon with large eyes.\n\nBoth Athena and Oberon were startled when a Goddess appeared beside them.\n\nAthena was atonished, watched this white-haired Goddess take the child in her arms.\n\nHumans around them began to shout, point at the collapsed mother. But some continued on, must have not heard the stinging cries of the little girl.\n\nOberon severed the mother\u0027s soul, but there was no soul to sever.\n\nThere was no thief.\n\nUnless this Goddess was the Soul Thief.\n\nBut if she was, she hardly looked like one.\n",
  "page 12": "Earth was a passion project for Sage Edol.\n\nHe created the universe, but in all its vastness it was still seemed strangely empty.\n\nOberon hadn\u0027t minded the emptiness, spent most of his time travelling to stars, slicing them through their cores and leaving blackholes in his wake.\n\nBut Edol was pressing atoms together in more and more intricate ways.\n\nAnd suddenly he formed one living thing, a small ameba that carried its own life, and with it, was able to form more of itself. Humans later called this DNA.\n\nBut humans did not form until much later.\n\nOberon admired the dinosaurs until Edol struck all those dead with a meteor. That was a busy day. And then he admired the furry mammals that existed thereafter.\n\nBut soon those died as well. It seemed Edol was trying again and again to create some perfect being.\n\nOberon argued that Edol was too prideful, said that while Edol thought all his beings were perfect but killed them anyway.\n\nOberon did not admire life like Edol did, but it seemed neither did Edol for some time.\n\nBut the furry mammals became smaller, then they resorted to walking on two feet.\n\nThey act like us, Oberon said one calm afternoon.\n\n\"Indeed,\" said Edol. \"Just as I planned.\"\n\nOberon was suspicious of such a statement.\n\nOberon knew well Edol never planned a thing.\n\nBut it almost seemed like he did plan these two-footed mammals.\n\nHumans emerged. They stood tall and spoke simplistic words. And Edol was sure that the female humans were beautiful, so that their species could carry on.\n\nOberon did not find them beautiful. The dinosaurs had been strong and mighty and cruel. These humans had flesh that easily bruised and bled, and their bones were weak and breakable.\n\n\"Perfect,\" Edol had said. But Oberon said no such thing until Irene was created.\n",
  "page 56": "Who are you? Oberon asked.\n\nShe was white-haired and white-skinned, this Goddess who held tightly the child in her arms.\n\nShe had met Oberon\u0027s gaze before Athena shot her with an arrow. But the arrow did nothing but shatter and turn to dust.\n\nThe Goddess winced, looked at Athena and said, \"You caused this.\"\n\n\"Who are you?\" demanded Athena.\n\nOberon reached for this Goddess, recoiled when her light burned his palm.\n\nAnd suddenly, this Goddess struck a crack in the ground, sank deep into the Earth and vanished.\n\nThis Goddess had the powers of both Athena and Oberon.\n\nAnd Athena watched Oberon vanish to find Edol.\n\nEdol was not at his domain. Edol was not even among the stars.\n\nOberon did not mind that a new Goddess appeared, but he did mind that she carried a child with her, into parts of the universe no human was to see.\n\nEdol, demanded Oberon.\n\nHe raised his scythe and split the marble floor of Edol\u0027s Domain in two. If anything, Edol would be upset Oberon did such a thing and rush to berate him.\n\nBut Edol was gone.\n\nIrene appeared by Oberon\u0027s side.\n\n\"Oberon, what is happening?\"\n\nThere is a Goddess running about with a human child, Irene, Oberon said.\n\n\"Athena?\"\n\nNo, no. A new Goddess. She was created by Athena and I. And I cannot find Edol.\n\n\"Edol went to another galaxy for awhile,\" Irene said.\n\nThe darkness within Oberon\u0027s cloak flickered and crept along the floor.\n\nAt a time like this? Oberon hissed.\n\nIrene touched his shoulder and immediately the darkness dissipated.\n\n\"I will go search for Edol. You find this Goddess,\" Irene said.\n\nOberon would regret agreeing to such a mission.\n",
  "page 15": "Oberon had all the words in the world yet had none to describe holding Irene close and kissing her in the desert sands beneath a starry night that long, long time ago.\n\nShe had laughed. He remembered this clearly. She put her arms around him, smiled at him.\n\nCactus formed at her feet, sprouted red flowers from their prickly heads. Mice ran around these two Gods and laughed and glittering beetles decorated Irene\u0027s hair.\n\nOberon loathed Edol, but knew for certain his own hardships were well worth the reward that was Irene. She was worth this Earth and stars and the miserable sight of Edol\u0027s wrinkled face every day.\n\nOberon placed his boney fingers against Irene\u0027s cheek. She took them and kissed them, brought a warmth to them Oberon had never felt before.\n\nIn fact, Oberon had not felt a warmth like this at all. Edol might have created the Sun, but the Sun did not touch Oberon\u0027s heart like Irene and her touch along his fingers.\n\nOberon had difficulty understanding the nuances of humans, often even of his fellow Gods. But it was plainly obvious Irene was begging to be kissed at that moment. Her lips were pursed and her eyes slipped closed.\n\nAnd so they kissed. It was no longer their sweetest kiss, because they kissed again and again thereafter, and each was much more spectacular than the previous.\n\nArdora told Oberon she was the Goddess of Love and Emotion.\n\nOberon inquired as to why he felt a beating heart in his chest when he was sure he had none.\n\n\"You are in love,\" Ardora cooed.\n",
  "page 59": "The child\u0027s weeping grew silent as Mira held her close. The child listened to Mira\u0027s raging heartbeat as they fell through the crevice Mira had struck through Earth.\n\nMira had shimmering white hair and white skin. She had large angelic wings that extended as she left Earth. They moved aside rocks and boulders as she descended to her domain.\n\nAnd she indeed did descend, like Oberon when he desired to return to his domain. But she had light and electricity in her palms, much like Athena.\n\nMira did not know why she existed. She had just met Sage Edol when an overwhelming force compelled her to take this child.\n\nAnd she set this child down upon a pillow in her stone domain before she realized what she had done.\n\nThe child was now asleep, seemed lulled by Mira\u0027s calm aura, even if Mira did not feel calm at all.\n\nShe brought her fingers to her long, smooth hair and grasped the locks.\n\n\"Oh no. I\u0027ve done something wrong. I\u0027ve done something terribly wrong,\" she whispered.\n\nMira had little idea of what she had done wrong exactly, but she knew that she was a Goddess, and this sleeping child was human. And human children were perhaps not meant to be in Gods\u0027 Domains.\n\nMira was the Goddess of Peace and Tranquility, and for a Goddess of Peace and Tranquility, she was not so good at her work.\n\nShe slipped into her stone throne, anxiously gazed upon this child with red hair and a soft, snoozing face. She felt the child\u0027s small breaths and it seemed to calm her.\n\n\"Why am I here?\" Mira asked herself.\n\nI would like to know the same, Oberon said.\n\nMira gasped, looked over to see the tall and daunting Oberon standing beside her.\n\n\"I\u0027m sorry,\" she stuttered.\n\nShe stood from her throne. Her wings flapped and pulled her from the ground.\n\nOberon looked between Mira\u0027s fantastic wings and the child who rested.\n\nMy name is Oberon.\n\n\"Are you a God?\" she asked.\n\nI am, Oberon said. And so are you.\n\n\"My name is Mira,\" said Mira.\n\nIt is a pleasure to meet you, Mira.\n",
  "page 9": "Despond sunk back to his domain. It was within the inner circle of Earth, where the core was hot and smoky and more comfortable than Ardora\u0027s fortress of ice.\n\nHe preferred the warmth like she preferred the cold.\n\nHe touched his face. Ardora had froze his skin with her ice strikes. She was perpetually ill-tempered and it often seemed like Despond was the only God willing to listen to her.\n\nShe had those humans. Those humans loved her.\n\nNo one loves me, thought Despond.\n\nDespond was the God of Despair. His creation was unfair. He was not particularly despaired himself, but he had not a soul who cared for him like those humans cared for Ardora, or like Irene cared for Oberon.\n\nEdol was fond of Despond, but Edol wasn\u0027t often around this Earth he so adored.\n\nOberon appeared in Despond\u0027s Domain.\n\nDespond was startled, sat up from his silk cushions atop the magma floor.\n\nYour face, inquired Oberon.\n\n\"I know. Ardora is upset with me. I\u0027m staying here until she cools down.\"\n\nDespond smiled but Oberon did not understand jokes.\n\nYou cannot stay here forever, especially when humans are dying without their souls, said Oberon.\n\nDespond was surprised at such a statement.\n\n\"Without their souls?\" Despond asked.\n\nYes. Do you have anything to do with this?\n\n\"Tsk! Not at all. I\u0027m not fond of humans and I especially don\u0027t care enough to take their souls.\"\n\nOberon loomed closer Despond. His long robes caught fire as he stepped along the magma but they did not burn.\n\nIf I discover you had anything to do with this, warned Oberon.\n\n\"You know I respect you, Oberon. I would never do such a thing. If anyone is behind this, it is Ardora. She adores those pesky humans enough that she just might be behind this thievery.\"\n\nOberon vanished and Despond huffed at his leaving.\n\n\"Farewell.\"\n",
  "page 14": "Ardora sent a bolt of ice at Despond\u0027s face.\n\nDespond had been laughing until Ardora shouted.\n\nThese two Gods were brother and sister. Ardora was the Goddess of Love.\n\n\"Enough of you!\" she shouted. Icicles dripped from her fingertips and she marched towards Despond as if she was going to kill him.\n\nShe had long, green hair that whipped through the air and around her and blue skin that shimmered with ice. She wore a blue silk scarves in the presence of others but often nothing at all.\n\n\"All you do is make my precious humans miserable!\" Ardora shouted.\n\nDespond had collapsed to the ground.\n\nHis hair was red, and as was his skin. But when Ardora struck him he turned purple.\n\nHe did not fire back at Ardora, lest he feel the wrath of Edol.\n\nAnd it was unfair. Ardora bullied him often, yet all he could do was shield his face.\n\nAnd so he did.\n\n\"Ardora! Enough!\" he cried.\n\n\"Go back to the Hells where you belong!\" she cried.\n\nHe huffed and against Edol\u0027s demands, he breathed flames at Ardora\u0027s feet, scorching her and turning her purple as well.\n\nShe reached to strike him from above, but he vanished into ash before he could.\n\n\"Bastard,\" Ardora said.\n\n\"You two,\" mused Athena.\n\n\"Athena,\" said Ardora.\n\nArdora floated back to the ground. Her feet stung and she winced.\n\n\"He doesn\u0027t often fire back at you. You should punish him for that,\" Athena said.\n\n\"Get out of my domain,\" warned Ardora.\n\n\"There is a thief of souls running about,\" Athena told her. \"Humans are dying but remaining on Earth.\"\n\n\"What? My darlings?\"\n\n\"Indeed. The circumstances are peculiar. I\u0027m going to tell Edol. He deserves to know.\"\n\nYou will not, called a voice. Oberon\u0027s voice.\n",
  "page 58": "Athena said, \"Who is she?\"\n\nA being of light and dark. A being with long white hair unlike anything Athena had ever seen. What was there left which needed its own Goddess?\n\nAthena beckoned Despond, who appeared with a baby bird upon his shoulder.\n\n\"What is that?\" Athena asked him.\n\n\"A bird. Irene gave him to me. His name is Faulkner.\"\n\nDespond seemed charmed by this little bird, spoke its name lovingly.\n\nIrene had never gifted anything to me, Athena thought.\n\n\"There is a new Goddess,\" Athena said.\n\n\"What?\"\n\n\"Indeed. She is unpenetrable by my arrows. Despond, no one is unpenetrable to my arrows!\"\n\nAthena\u0027s hair was curled and wild, flew up in different directions as she spoke. Her eyes lit up gold with anger.\n\nDespond was startled.\n\n\"What is her name?\" he asked.\n\n\"I don\u0027t know. She vanished into the Earth. I need you to go and find her.\"\n\n\"I\u0027m too busy for such a frivolous matter,\" Despond said, pet the bird in his hands. \"I\u0027m sure we will meet this Goddess in time.\"\n\nBut Athena refused to wait, disappeared and went to look for Irene.\n\nIrene was not there but her domain was ever lovely and lively. Athena touched Irene\u0027s flowers and animals and spread invasive creatures as she walked.\n\nBugs ate the flowers and predatory birds ate those bugs. Irene\u0027s Domain would be overwhelmed in time.\n\nAthena was furious for reasons beyond even herself, at this Goddess and at Irene.\n\nAthena shouted, \"You little Goddess, come speak to me! Tell me who you are!\"\n\n\"My name is Mira. You must be Athena,\" called a soft, familiar voice.\n",
  "page 17": "Irene was breathtaking as she danced through time and space, created stars with a touch of her hand.\n\nOberon felt old in her nimble presence. He almost lost her in the vast cosmos until she slowed to meet him.\n\nShe floated before him, leaned in close to kiss him.\n\nWhen they kissed, another galaxy exploded with stars.\n\nOberon felt as he was an exploded galaxy.\n\nAnd Irene was his universe.\n\n\"Create a blackhole for me,\" she insisted. \"I want to see it. It\u0027s incredible, watching you.\"\n\nIt is incredible watching you, my love, Oberon said.\n\nIrene blushed, held Oberon\u0027s arm as he sliced through the core of a dead star with his other.\n\nThe star exploded and expanded. The light lit Irene\u0027s face before the entire mass collapsed in on itself.\n\n\"Creating stars is beautiful,\" mused Irene, \"but as is this. An endless void of time and space, powerful enough to capture anything.\"\n\nIrene, said Oberon.\n\nShe turned away from that void. Her eyes twinkled even if it was now dark.\n\nI fear you must be nothing more than a blackhole yourself, for you have captured me completely.\n\n\"Oberon,\" sighed Irene.\n\nShe kissed him for that.\n",
  "page 16": "Irene was breathtaking as she danced through time and space, created stars with a touch of her hand.\n\nOberon felt old in her nimble presence. He almost lost her in the vast cosmos until she slowed to meet him.\n\nShe floated before him, leaned in close to kiss him.\n\nWhen they kissed, another galaxy exploded with stars.\n\nOberon felt as he was an exploded galaxy.\n\nAnd Irene was his universe.\n\n\"Create a blackhole for me,\" she insisted. \"I want to see it. It\u0027s incredible, watching you.\"\n\nIt is incredible watching you, my love, Oberon said.\n\nIrene blushed, held Oberon\u0027s arm as he sliced through the core of a dead star with his other.\n\nThe star exploded and expanded. The light lit Irene\u0027s face before the entire mass collapsed in on itself.\n\n\"Creating stars is beautiful,\" mused Irene, \"but as is this. An endless void of time and space, powerful enough to capture anything.\"\n\nIrene, said Oberon.\n\nShe turned away from that void. Her eyes twinkled even if it was now dark.\n\nI fear you must be nothing more than a blackhole yourself, for you have captured me completely.\n\n\"Oberon,\" sighed Irene.\n\nShe kissed him for that.\n",
  "page 90": "\"And that is why the sun rises and sets every day,\" Bunni\u0027s grandmother told her.\n\nBunni was deeply unsatisfied with this story.\n\n\"But what about Oberon?\" she asked. \"Is he happy? Doesn\u0027t losing the love of his life still upset him? And do we finally have our souls back, Nana?\"\n\n\"Bunny you are far too inquisitive,\" Nana laughed. \"It\u0027s just a story.\"\n\n\"It\u0027s just a story,\" Bunni said.\n\nBut Bunni knew better.\n\n\"Indeed. Now get some sleep. If you wake up early enough you might see Mira pulling up the sun,\" Nana said.\n\nNana kissed Bunni\u0027s forehead and turned off the lights.\n\nBunni knew Mira didn\u0027t pull up the sun. And Bunni knew Oberon was still greatly devastated. And sometimes Bunni feared Nana\u0027s soul hadn\u0027t been returned yet.\n\nShe crept out of bed and pulled open the window.\n\nShe peered out at the starry night sky, looked around to see if Oberon was nearby collecting any souls.\n\nAlas, there was nothing, and no one to believe her anyway. But Bunni was sure the Wolf in the dark cloak was still out there somewhere, and beside him his daughter Vida laughing and creating life.\n\nIt is very late, Bunni, why are you not asleep?\n\nThe End.\n",
  "page 92": "\n",
  "page 51": "Athena crept along one of the tall human buildings. She liked to dance along the wires above the city. She assumed the humans used these to communicate with one another from great distances apart.\n\nWhen Athena swooped down to look closely at a mother and her child, she cut the wire with her blade. The wire was alive and landed in a puddle on the wet ground.\n\nThese humans were fascinating. They used means of electricity to communicate, yet the electricity itself was dangerous.\n\nAthena saw this mother holding a little girl, walked towards the puddle.\n\nAthena was basking in the inevitability when Oberon appeared and threw her against the brick wall of one of the human buildings.\n\nWhat are you doing? hissed Oberon.\n\nHe sliced the topmost part of the wire so that it fell and died.\n\nAthena\u0027s eyes were wide, frightened, yet she wanted to feel Oberon\u0027s wrath.\n\n\"I was watching the inevitable,\" Athena whispered.\n\nYou are forbidden to toil in the lives of these humans, Oberon said.\n\nOberon\u0027s words were dark and deep and terrifying. From beneath his cloak a darkness spread.\n\nBut Athena seemed indifferent.\n\n\"That is why I am here, Oberon. I know my place. And you should know yours,\" she said.\n\nAthena grinned wildly.\n\nThe wire was dead but the mother fell. With her last strength, she held that little girl in her arms, protected her little head from that wet ground.\n\nOberon rushed to her side. Athena took notice of his affections towards humans.\n\n\"Her heart simply stopped beating,\" Athena whispered.\n\nOberon was livid with Athena. The child in her mother\u0027s arms began to weep, looked at Oberon with large eyes.\n\nBoth Athena and Oberon were startled when a Goddess appeared beside them.\n\nAthena was atonished, watched this white-haired Goddess take the child in her arms.\n\nHumans around them began to shout, point at the collapsed mother. But some continued on, must have not heard the stinging cries of the little girl.\n\nOberon severed the mother\u0027s soul, but there was no soul to sever.\n\nThere was no thief.\n\nUnless this Goddess was the Soul Thief.\n\nBut if she was, she hardly looked like one.\n",
  "page 50": "\"Irene likes you,\" Edol told Oberon one day.\n\nOberon turned and looked at Edol, almost surprised by his words.\n\nThat much is obvious, Oberon said.\n\n\"Yet you are oblivious to her,\" Edol said.\n\nPardon?\n\n\"She is taken by you, Oberon. Can\u0027t you see?\"\n\nOberon had not seen. Irene had been just another God to him. She tended to the lifeforms Edol willed into existence, but she did have her own charm about her.\n\nAnd Oberon realized perhaps he was taken by her as well.\n\nIrene and Oberon spent many a day in Oberon\u0027s Domain. They spent many other days walking the Earth together.\n\nOberon admired how much Irene knew about all these living creatures. Irene admired how Oberon could take them away.\n\nEdol could see and predict all, but was surprised when these two fell in love.\n\nOberon said, Do you suppose she likes flowers?\n\nEdol said, \"That\u0027s silly, Oberon. Of course she does.\"\n\nOberon said, Of course she does.\n\nOberon could not create flowers. He could not create anything. He was a being of death and only death.\n\nHe was alone in his domain another day, focused on a single seedling Irene had gifted him.\n\nIt rested in his boney palm.\n\nWith his other, he clenched his scythe, tried with all his might to will this seed to sprout.\n\nNo such luck.\n\nOberon sighed.\n\nIrene was elegant and powerful. Sprouting seeds was the least of her worries, yet Oberon struggled with this simple task.\n\nOberon was certain he was in love when he realized he could not sprout this seed.\n\nIrene was everything he was not, and that was exceptionally attractive to him.\n\nOberon had a difficult time with personal nuances.\n\nHe whispered, Irene, won\u0027t you join me? I am unable to sprout flowers for you, but my love for you is otherwise limitless.\n\nAnd she was there, before him. Her body was nude and humanlike. Her wild, red hair sprouted in every direction, unlike Oberon\u0027s seed.\n\nHe stood, came close to her. His presence was intimidating, and the small Goddess looked up at him with eyes full of love.\n\n\"I am unable to kill. That is what I love about you, Oberon,\" she said.\n",
  "page 94": "I do not understand, said Oberon.\n\n\"Where are they coming from? Where are their souls?\" inquired Irene, who quickly moved beneath Oberon\u0027s arm for comfort.\n\nIrene was upset. The flowers in her red hair wilted at the sight before them.\n\nHumans were dying, but they were not dying at all. They were walking Earth without souls. They walked Earth in bodies whose souls had been stolen. They were vagrant and confused.\n\nAnd so were these two Gods.\n\n\"Oberon,\" insisted Irene.\n\nI have never witnessed anything like this before, admitted Oberon.\n\n\"But you must know. You know the location of every soul in and out of Earth.\"\n\nIndeed. That is what makes this so mysterious.\n\n\"We will have to tell Edol about this.\"\n\nNot him, snarled Oberon, as if he could. Oberon\u0027s voice was always low and monotone but Irene found it charming.\n\nOberon turned and left Irene\u0027s side. His dark robes followed behind him without a sound.\n\nIrene quickly followed as well. Each wilted flower fell from her hair, landed upon the stone floor beneath them and turned to dust.\n\nA thief, said Oberon.\n\n\"Perhaps,\" said Irene.\n\nInform Athena of this, but she shall not tell Edol. Have her visit Earth and investigate. As will I. I have souls to reap before this thief can.\n\n\"Be safe,\" insisted Irene.\n\nShe kissed him, tucked a white rose into his boney hands.\n\nYou should not warn me, my love, Oberon said. You should warn those who dare steal from me.\n",
  "page 53": "Unlike Oberon, Irene was subtle in her affections.\n\nShe fetched Oberon flowers and brought him small, fluffy animals. Butterflies always flittered about her and it was as if Edol had enchanted her skin with the light of the Sun itself.\n\nAnd she glowed in the presence of Oberon.\n\n\"They dance like this,\" Irene said, mimicked the human\u0027s ritual dances.\n\nShe said, \"And the music is wonderful. They bang on these large drums, they stomp their feet in time. They think it brings on good weather. So I humor them.\"\n\nIrene smiled, stomped about in Oberon\u0027s Domain.\n\nOberon thought she was so elegant and beautiful, even when she mimicked these barbaric dances.\n\n\"You should dance with me, Oberon,\" Irene said.\n\nOberon raised a hand and called from his throne, I am no good at dancing. You should dance again for me.\n\nIrene blushed as he motioned her to continue on.\n\n\"It\u0027s not all that difficult, Oberon,\" she insisted.\n\nI am enjoying myself just fine, Oberon said.\n\nIrene grew a shade darker.\n\n\"Oberon,\" she said.\n\nShe put out her hands to him, left the ground and floated towards him.\n\nShe beckoned him from his large stone throne, pulled him to his feet.\n\n\"Just one dance,\" she said.\n\nHave you not crops to grow, or animals to birth? Oberon asked.\n\n\"I am always sure I have time for you, Oberon,\" Irene said, and she almost regretted it.\n\nThat is not a proper work ethic, Oberon said.\n\n\"Oberon, you make my heart sing like the humans do,\" Irene whispered.\n\nAre you insulting me?\n\nIrene giggled.\n\n\"No, Oberon. That\u0027s a good thing.\"\n\nA good thing, Oberon whispered.\n\nThey were close. Oberon refused to dance.\n\nAnd when Irene found her eyes lost in the darkness of Oberon\u0027s cloak, she pulled herself away.\n\n\"You must dance. I won\u0027t be satisfied until you do.\"\n\nOberon was naive, but he was still smart. He said, I simply cannot leave you unsatisfied, can I?\n\nAt this, Irene\u0027s skin grew yet another shade darker.\n\n\"Oberon. . .\"\n",
  "page 52": "Athena crept along one of the tall human buildings. She liked to dance along the wires above the city. She assumed the humans used these to communicate with one another from great distances apart.\n\nWhen Athena swooped down to look closely at a mother and her child, she cut the wire with her blade. The wire was alive and landed in a puddle on the wet ground.\n\nThese humans were fascinating. They used means of electricity to communicate, yet the electricity itself was dangerous.\n\nAthena saw this mother holding a little girl, walked towards the puddle.\n\nAthena was basking in the inevitability when Oberon appeared and threw her against the brick wall of one of the human buildings.\n\nWhat are you doing? hissed Oberon.\n\nHe sliced the topmost part of the wire so that it fell and died.\n\nAthena\u0027s eyes were wide, frightened, yet she wanted to feel Oberon\u0027s wrath.\n\n\"I was watching the inevitable,\" Athena whispered.\n\nYou are forbidden to toil in the lives of these humans, Oberon said.\n\nOberon\u0027s words were dark and deep and terrifying. From beneath his cloak a darkness spread.\n\nBut Athena seemed indifferent.\n\n\"That is why I am here, Oberon. I know my place. And you should know yours,\" she said.\n\nAthena grinned wildly.\n\nThe wire was dead but the mother fell. With her last strength, she held that little girl in her arms, protected her little head from that wet ground.\n\nOberon rushed to her side. Athena took notice of his affections towards humans.\n\n\"Her heart simply stopped beating,\" Athena whispered.\n\nOberon was livid with Athena. The child in her mother\u0027s arms began to weep, looked at Oberon with large eyes.\n\nBoth Athena and Oberon were startled when a Goddess appeared beside them.\n\nAthena was atonished, watched this white-haired Goddess take the child in her arms.\n\nHumans around them began to shout, point at the collapsed mother. But some continued on, must have not heard the stinging cries of the little girl.\n\nOberon severed the mother\u0027s soul, but there was no soul to sever.\n\nThere was no thief.\n\nUnless this Goddess was the Soul Thief.\n\nBut if she was, she hardly looked like one.\n",
  "page 29": "\"What are you doing?\" Despond snarled at Athena.\n\nAthena merely grinned, charged her army forward in attack.\n\nWhen Despond went to pierce her armor with his javelin, she vanished.\nAs did the army behind her. The sound of metal armor striking the ground echoed across the lands.\n\nWhen Despond turned to look at his own army, they were mostly dead.\n\nMen were still with arrows through their skulls. Some wept and some were on the verge of death. Those of the latter Despond struck with bolts of fire, as to kindly end their suffering.\n\nOberon berated both Despond and Athena for this unecessary war. Several thousand humans died.\n\nOberon\u0027s day had been long and busy.\n\nAthena never had an army at all and was not upset by Oberon\u0027s words. She was the Goddess of War.\n\nDespond later struck her with fire and scarred her human form for this mindless battle.\n\nAnd Despond was still wary of Athena. He found pleasure in the torture of corrupt humans, but Athena was simply ruthless.\n\nBut Athena did not strive for death. She just adored chaos.\n\nAnd Ardora loathed both Despond and Athena, for her human lover\u0027s father was killed in this war.\n\nArdora wept for her lover, Flora, and for Flora\u0027s father.\n",
  "page 22": "Humans had strange faces of all types and spoke strange languages of all types.\n\nIrene held Oberon\u0027s hand tightly in her own, seemed to usher him along through the deserts of Earth.\n\nThe first human civilizations appeared in the deserts where the weather was mostly mild other than the stinging rays of the Sun.\n\nOberon was fond of the darkness, and likewise Irene was fond of the light.\n\nIn the light, Oberon noticed, Irene\u0027s red hair would glitter and float through the air. When in darkness, her hair would sink and turn dull.\n\nShe is a rose, thought Oberon.\n\nOberon later removed the ceiling of his dark domain.\n\n\"Why would you do that?\" Ardora had asked.\n\nI admire the light, Oberon replied.\n\nBut they both knew he instead rather admired Irene.\n\n\"Look at how beautiful they are,\" cooed Irene as she and Oberon watched dark-skinned humans bring water from the rivers back to their stone homes.\n\nShe leaned down and touched that water, blessed the crops that floated atop it.\n\nThey are fascinating if anything, said Oberon.\n\n\"They are just as intelligent as you or I,\" Irene mused. \"They speak languages I\u0027m still trying to learn, but they say the same things as we do. It\u0027s incredible.\"\n\nOberon had never found too many things on Earth incredible. Most things on Earth were tainted in some way by Edol, even the humans themselves.\n\nBut watching Irene\u0027s eyes illuminate with wonder at these humans brought a new admiration of them to Oberon.\n\nIrene followed Oberon to one stone home that sat upon a hill.\n\nI sense a soul, said Oberon softly to Irene.\n\n\"May I come with you?\"\n\nYou may come with me wherever I go, my love, Oberon said. But this might upset you.\n",
  "page 66": "You have wings, Oberon noted as he, Mira and the child rested in her domain.\n\nMira was still frightful, not only of the daunting Oberon who loomed close with darkness in his cloak.\n\nBut she said, \"I do. Do the other Gods have wings?\"\n\nNo.\n\nHer wings extended high above her, flittered and glittered in the wind as if Edol himself enchanted them with his own touch of light.\n\nBut she only had these wings when she was not on Earth, for Oberon did not recall seeing them before.\n\nYou must be the creation of Athena and I, said Oberon. You look like her. I am curious to know what I gave you.\n\nMira\u0027s eyes widened at Oberon.\n\n\"Was that Athena?\" she asked.\n\nYes. Don\u0027t be frightened of her. She creates War. Yet, she created you.\n\nThe child cooed from her sleep. Mira quickly moved to the child\u0027s side, basked in her peaceful slumber.\n\n\"I\u0027m sorry. I shouldn\u0027t have taken her. You must return her, Oberon.\"\n\nAnd then it occurred to Oberon.\n\nMira was the Goddess of Peace.\n\nI will, he said, even if he was fearful of returning a human child.\n\n\"You will?\" Mira said.\n\nYes, and you should meet Athena, and Edol for that matter.\n\n\"I have already met Edol. But I will certainly find Athena.\"\n\nBe wary. You are like Irene. You are calm and kind. Athena is neither of those things.\n\nMira was taken by the compliment, but she assumed she was only calm and kind because of this God of Death.\n\n\"I will. Thank you, Oberon.\"\n\nThe stars and space are limitless. Be careful. I have lost Ardora out there many times.\n\n\"Of course.\"\n\nOberon saw Mira off which a wave of his hand, before he brought down both of them to carry the child.\n",
  "page 21": "Irene was breathtaking as she danced through time and space, created stars with a touch of her hand.\n\nOberon felt old in her nimble presence. He almost lost her in the vast cosmos until she slowed to meet him.\n\nShe floated before him, leaned in close to kiss him.\n\nWhen they kissed, another galaxy exploded with stars.\n\nOberon felt as he was an exploded galaxy.\n\nAnd Irene was his universe.\n\n\"Create a blackhole for me,\" she insisted. \"I want to see it. It\u0027s incredible, watching you.\"\n\nIt is incredible watching you, my love, Oberon said.\n\nIrene blushed, held Oberon\u0027s arm as he sliced through the core of a dead star with his other.\n\nThe star exploded and expanded. The light lit Irene\u0027s face before the entire mass collapsed in on itself.\n\n\"Creating stars is beautiful,\" mused Irene, \"but as is this. An endless void of time and space, powerful enough to capture anything.\"\n\nIrene, said Oberon.\n\nShe turned away from that void. Her eyes twinkled even if it was now dark.\n\nI fear you must be nothing more than a blackhole yourself, for you have captured me completely.\n\n\"Oberon,\" sighed Irene.\n\nShe kissed him for that.\n",
  "page 65": "You have wings, Oberon noted as he, Mira and the child rested in her domain.\n\nMira was still frightful, not only of the daunting Oberon who loomed close with darkness in his cloak.\n\nBut she said, \"I do. Do the other Gods have wings?\"\n\nNo.\n\nHer wings extended high above her, flittered and glittered in the wind as if Edol himself enchanted them with his own touch of light.\n\nBut she only had these wings when she was not on Earth, for Oberon did not recall seeing them before.\n\nYou must be the creation of Athena and I, said Oberon. You look like her. I am curious to know what I gave you.\n\nMira\u0027s eyes widened at Oberon.\n\n\"Was that Athena?\" she asked.\n\nYes. Don\u0027t be frightened of her. She creates War. Yet, she created you.\n\nThe child cooed from her sleep. Mira quickly moved to the child\u0027s side, basked in her peaceful slumber.\n\n\"I\u0027m sorry. I shouldn\u0027t have taken her. You must return her, Oberon.\"\n\nAnd then it occurred to Oberon.\n\nMira was the Goddess of Peace.\n\nI will, he said, even if he was fearful of returning a human child.\n\n\"You will?\" Mira said.\n\nYes, and you should meet Athena, and Edol for that matter.\n\n\"I have already met Edol. But I will certainly find Athena.\"\n\nBe wary. You are like Irene. You are calm and kind. Athena is neither of those things.\n\nMira was taken by the compliment, but she assumed she was only calm and kind because of this God of Death.\n\n\"I will. Thank you, Oberon.\"\n\nThe stars and space are limitless. Be careful. I have lost Ardora out there many times.\n\n\"Of course.\"\n\nOberon saw Mira off which a wave of his hand, before he brought down both of them to carry the child.\n",
  "page 24": "Athena brushed Ardora\u0027s leg as she sat down beside her.\n\nDespond sat across from Ardora, leaned back heavily and crossed his arms. His face had thawed but his grimace had not.\n\nArdora had been trying to meditate when Irene and Oberon stepped through the grand doors.\n\n\"You all have been informed about the matter at hand,\" Irene began.\n\nArdora immediately wept and Despond was suddenly interested.\n\n\"What does this mean for humans?\" Despond asked.\n\n\"It means they cannot pass on to Heaven or the Hells. It means there will be wandering souls on Earth until the end of time,\" Irene said.\n\nArdora sobbed.\n\nArdora, Oberon said.\n\n\"I\u0027m sorry,\" wept Ardora. \"But these humans mean so much to me. Who will I play with now?\"\n\nDespond huffed. Athena looked between them and hid her smile.\n\n\"I think we should tell Edol,\" Athena interrupted.\n\nNo one will tell Edol, Oberon said.\n\n\"Are you afraid of what he might do?\" Athena asked.\n\nNo, but you all should be.\n\nThere was silence.\n\n\"Who has the power to steal souls?\" Despond mused.\n\n\"No one but us,\" Irene said.\n\nShe was on the arm of Oberon, clasped his hand in her own. This gesture seemed to calm Ardora. Until she was no longer calm.\n\nFor Ardora said to Despond, \"Stealing souls is the kind of wicked sin Despond would commit!\"\n\nDespond sat up, pressed his hands against the wooden table.\n\n\"Why would I ever care about the souls of these pesky humans?\" Despond asked.\n\n\"You care about them just as much as I do,\" Ardora argued.\n\n\"Oh you do, Despond, don\u0027t you?\" Athena pressed.\n\n\"What about that man, Despond? You were with him until the day he died. You wanted to keep his soul for your own.\"\n\nTears ran from Ardora\u0027s eyes, dripped onto the table and turned to ice.\n\n\"Ardora,\" Irene called softly.\n\nIt had been not a man, but a woman for Ardora. She was not only upset for the loss of all these human\u0027s souls, but one in particular.\n",
  "page 68": "At the beginning, Mira spent much of her time exploring Earth like new Gods tend to do. She noticed that Edol poured a lot of care and passion into these humans.\n\nThe small ones were particularly joyful to watch. While the big humans toiled about at their jobs and watching other humans on flickering screens, these small humans preferred to be outside and playing.\n\nThe children on the far side of Earth often played in the large grassy fields Irene had cultivated. The children on the near side of Earth dashed through the stone streets and called Tag! But no matter from where they came, they were all amused by simple objects and created their own tools and toys.\n\nMira found them clever, how they built these minature forts and houses, and how easily they slipped into games as if they were other humans altogether.\n\nMira deeply desired to play with them, and it was the day some children on the stone streets built a fort in an alleyway she decided to join them.\n\nSo she created her human form.\n\nAnd Mira\u0027s human form was one of these young humans with long black hair done up like the women of the time.\n\nShe called herself Mira.\n\n\"May I play with you?\" she asked the children.\n\nThat was a silly question, Mira discovered, because all Mira had to do to play was have her own sword. That was, two pieces of wood bound together by nails.\n\nIt was fascinating. These children were fascinating.\n\nMira enjoyed herself for quite some time. She realized why the other gods admired these beings so much, especially the small ones.\n",
  "page 23": "Humans had strange faces of all types and spoke strange languages of all types.\n\nIrene held Oberon\u0027s hand tightly in her own, seemed to usher him along through the deserts of Earth.\n\nThe first human civilizations appeared in the deserts where the weather was mostly mild other than the stinging rays of the Sun.\n\nOberon was fond of the darkness, and likewise Irene was fond of the light.\n\nIn the light, Oberon noticed, Irene\u0027s red hair would glitter and float through the air. When in darkness, her hair would sink and turn dull.\n\nShe is a rose, thought Oberon.\n\nOberon later removed the ceiling of his dark domain.\n\n\"Why would you do that?\" Ardora had asked.\n\nI admire the light, Oberon replied.\n\nBut they both knew he instead rather admired Irene.\n\n\"Look at how beautiful they are,\" cooed Irene as she and Oberon watched dark-skinned humans bring water from the rivers back to their stone homes.\n\nShe leaned down and touched that water, blessed the crops that floated atop it.\n\nThey are fascinating if anything, said Oberon.\n\n\"They are just as intelligent as you or I,\" Irene mused. \"They speak languages I\u0027m still trying to learn, but they say the same things as we do. It\u0027s incredible.\"\n\nOberon had never found too many things on Earth incredible. Most things on Earth were tainted in some way by Edol, even the humans themselves.\n\nBut watching Irene\u0027s eyes illuminate with wonder at these humans brought a new admiration of them to Oberon.\n\nIrene followed Oberon to one stone home that sat upon a hill.\n\nI sense a soul, said Oberon softly to Irene.\n\n\"May I come with you?\"\n\nYou may come with me wherever I go, my love, Oberon said. But this might upset you.\n",
  "page 67": "Irene felt suddenly wary of Edol.\n\n\"Don\u0027t look at me like that,\" Edol said.\n\nIrene moved her eyes but said, \"Edol, these humans are wandering Earth alone and confused. They can\u0027t reach Heaven or the Hells. Every time I visit there are more and more lost spirits. It\u0027s unbearable.\"\n\nShe said, \"Oberon hasn\u0027t severed a soul in months, Edol. That is what he is supposed to do, Edol.\"\n\nEdol looked at her. His eyes glossed over with golden rays.\n\nIrene cowered.\n\n\"There you are speaking about Oberon again. He is all you ever speak about. You have a duty on Earth, Irene, yet I always find you two meandering about with one-another.\"\n\n\"Edol,\" gasped Irene.\n\n\"I created you to look over this world. You are the Goddess of Life, Irene. He is your opposite. By all means, you two should not have fell in love. It wasn\u0027t supposed to be you and him.\"\n\nThe galaxy behind Edol faded. He forged meteors with his fingers and sent them spiralling towards planets.\n\nIrene watched with terror in her eyes as Edol destroy these planets she had just touched with her own powers.\n\n\"You are not to tell anyone about this,\" Edol hissed. \"Return to Earth and work there. Forget about the humans for now.\"\n\nIrene disppeared in fear, back to Earth.\n\nEdol took a breath. The golden rays in his eyes and fingers faded.\n\nHe pressed his hand against his face, realized what he had done.\n",
  "page 26": "Despond was often agitated with humans. They were weak and horrid to look at.\n\nBut perhaps he was rather upset these humans admired Ardora so much.\n\nWhen Despond walked Earth, he looked similiar to Ardora\u0027s human form, with white skin and brown hair. He was handsomer than humans and he took pride in that.\n\nBut some humans were simply handsome, and that could not be argued.\n\nEspecially once Despond found himself in a small tavern in a kingdom on the far, watery side of Earth.\n\nA group of men terrorized the keep, reach and groped the girls who served them and shouted and carried on.\n\nDespond was naturally drawn to them.\n\nHe walked by, intended on creating a scene.\n\nOne of the men shouted, \"Pretty boy!\"\n\nDespond turned with a smile on his face.\n\nBut he saw one of the young men.\n\nBlond hair and green eyes. He had fair skin and a hard jaw.\n\nDespond felt a deep sadness within this particular man.\n\n\"Soldiers have seized the brothel across the way,\" Despond said, raised his hand towards the doors. \"The girls are running. You all best catch them.\"\n\nWhether it was godly persuasion or mere lust, the men all dashed out those doors. Soldiers began seizing the brothel across the way.\n\nDespond preferred convenience.\n\nBut that blonde-haired, sullen man remained. He looked at Despond.\n\nDespond sat down, ordered a drink for himself.\n\n\"Who are you?\" the man asked. He had a thick accent that most of these humans did.\n\n\"Peterus,\" said Despond. He looked away. This young man was exceedingly handsome. Despond wouldn\u0027t be caught dead admiring a human.\n\nDespond asked, \"And yours?\"\n\n\"Zacharie.\"\n\n\"What ails you, Zacharie?\"\n\n\"Pardon?\"\n\nPerhaps this was too forward. If only Ardora was here, thought Despond. She knew very well how to speak to these creatures.\n\nAnd if creatures they were, Despond found himself attracted to creatures.\n\nPeculiar.\n\nEspecially the feeling in Despond\u0027s gut.\n",
  "page 25": "Edol\u0027s golden eyes were wide at the sight of the nude humanoid before him. But he knew she was a God. She formed ice with her hands.\n\nArdora\u0027s eyes were red with fiery emotions, even if her skin was blue. And the stone floor upon which she sat froze at her touch.\n\n\"Who are you?\" Edol asked her.\n\n\"I am Ardora,\" she said, and that was the only thing she knew for certain.\n\nEdol gave her his hand, lifted her to her feet. She was graceful and her limbs were slender. Her hair flowed much like Irene\u0027s, through the air as if the air was instead water.\n\nEdol quite liked Ardora, and even Despond when he appeared. But Edol did not realize Oberon and Irene were strong enough to create beings all their own.\n\nArdora appeared alongside the earliest humans. And she adored these humans with all her heart. But it was not for some several thousand years before she met a woman she adored even more than the rest.\n\nWhen she walked alongside humans, Ardora had the appearance of a light-skinned, brown-haired human. But no godly power could remove her beauty.\n\nThis woman she adored was the daughter of two hardworking parents. They lived in a stone house near a kingdom on the far side of Earth. Her father was a cobbler and her mother worked hard taking care of the home and family.\n\nHer name was Flora, and Ardora had never met a human as beautiful and distinct as this Flora.\n",
  "page 69": "Oberon took up the child in his arms.\n\nShe awakened and stared at him with large blue eyes. And from her little head were two red braids, tied with blue ribbons that now threatened to fall from her hair.\n\nShe was silent, looked up at Oberon with amazement he only witnessed from Irene.\n\n\"Wolf,\" she said.\n\nHello, Bunni, Oberon greeted. It has been awhile. My, how you have grown.\n\nShe laughed at him and his funny voice.\n\nIt was like a chiming bell, her laughing.\n\nMira looked on at Oberon with similiar wonder before he began to step up and back towards Earth.\n\nBunni was a good child, spoke in full, coherent sentences but was still mindless enough that she desired to know what was beneath Oberon\u0027s hood.\n\nThere is nothing there besides an old skeleton, my dear, he said.\n\nBut Bunni grasped the edges of his cloak, pulled it down from his head.\n\nShe was not at all fearful of this old skeleton. Instead, she poked the holes of his eyesockets and touched his bumpy teeth.\n\nNow now, Bunni, that is rude. You did not even ask. I would have shown you if you asked.\n\nBunni grinned and said, \"I\u0027m sorry.\"\n\nDon\u0027t apologize now. You are curious, Bunni. Make sure you stay that way.\n\nThe two arrived at Bunni\u0027s mother\u0027s apartment. There gathered her family, weeping for the loss of their beloved, but also for her missing child.\n\n\"She\u0027s been gone for weeks,\" exclaimed one older woman.\n\n\"She\u0027s dead, I know it. It is all we have left of Alayane and she\u0027s dead,\" said another.\n\nBunni appeared on the doorsteps, spread her arms open for her grandmother to hold her.\n\nOberon loomed near until Bunni was found.\n\nHe pulled his hood back over his head and said, Good day, Bunni.\n\nThe child did not comprehend the loss of her mother until some time later. And Oberon felt a deep sadness in his chest the day Bunni wept.\n",
  "page 28": "\"What are you doing?\" Despond snarled at Athena.\n\nAthena merely grinned, charged her army forward in attack.\n\nWhen Despond went to pierce her armor with his javelin, she vanished.\nAs did the army behind her. The sound of metal armor striking the ground echoed across the lands.\n\nWhen Despond turned to look at his own army, they were mostly dead.\n\nMen were still with arrows through their skulls. Some wept and some were on the verge of death. Those of the latter Despond struck with bolts of fire, as to kindly end their suffering.\n\nOberon berated both Despond and Athena for this unecessary war. Several thousand humans died.\n\nOberon\u0027s day had been long and busy.\n\nAthena never had an army at all and was not upset by Oberon\u0027s words. She was the Goddess of War.\n\nDespond later struck her with fire and scarred her human form for this mindless battle.\n\nAnd Despond was still wary of Athena. He found pleasure in the torture of corrupt humans, but Athena was simply ruthless.\n\nBut Athena did not strive for death. She just adored chaos.\n\nAnd Ardora loathed both Despond and Athena, for her human lover\u0027s father was killed in this war.\n\nArdora wept for her lover, Flora, and for Flora\u0027s father.\n",
  "page 27": "Ardora kissed the hand of her beloved Flora, who promptly blushed and hid her face.\n\n\"Meara,\" Flora called softly to Ardora.\n\nMeara was Ardora\u0027s human name.\n\n\"Don\u0027t weep. I can\u0027t stand when you weep, my dearest,\" Ardora whispered against Flora\u0027s skin.\n\nFlora managed to smile since her father had been killed.\n\n\"You weep far more than I,\" Flora responded.\n\nDespond and Athena would pay for this war.\n\nBut for then, Ardora kept Flora company. Soon, Ardora pressed her lips against Flora\u0027s and they lost each other in those silk sheets of Ardora\u0027s bed.\n\nIt felt natural that Ardora admit to Flora who she really was. The other Gods would be upset, but Ardora knew for certain this Flora was bright and beautiful and deserved the world.\n\n\"What have you done?\" Despond hissed when Ardora arrived back at her domain.\n\n\"Leave my domain at once,\" Ardora said.\n\n\"You keep playing with these humans and you\u0027re bound to cause trouble.\"\n\n\"I have caused trouble?\" Ardora shouted. \"You took the lives of thousands of people! And for what? Some frivolous argument with Athena!\"\n\n\"But I have never once told a human anything about myself, about us.\"\n\n\"Perhaps you should, Despond. We are to care for Edol\u0027s beings. You don\u0027t even care for yourself.\"\n\nArdora froze half of Despond\u0027s body in this disagreement. Irene had to heal him, would have scolded these two had she not felt upset for each of them.\n\nHumans were pesky, but lovable.\n\nHumans were also mortal.\n",
  "page 60": "The child\u0027s weeping grew silent as Mira held her close. The child listened to Mira\u0027s raging heartbeat as they fell through the crevice Mira had struck through Earth.\n\nMira had shimmering white hair and white skin. She had large angelic wings that extended as she left Earth. They moved aside rocks and boulders as she descended to her domain.\n\nAnd she indeed did descend, like Oberon when he desired to return to his domain. But she had light and electricity in her palms, much like Athena.\n\nMira did not know why she existed. She had just met Sage Edol when an overwhelming force compelled her to take this child.\n\nAnd she set this child down upon a pillow in her stone domain before she realized what she had done.\n\nThe child was now asleep, seemed lulled by Mira\u0027s calm aura, even if Mira did not feel calm at all.\n\nShe brought her fingers to her long, smooth hair and grasped the locks.\n\n\"Oh no. I\u0027ve done something wrong. I\u0027ve done something terribly wrong,\" she whispered.\n\nMira had little idea of what she had done wrong exactly, but she knew that she was a Goddess, and this sleeping child was human. And human children were perhaps not meant to be in Gods\u0027 Domains.\n\nMira was the Goddess of Peace and Tranquility, and for a Goddess of Peace and Tranquility, she was not so good at her work.\n\nShe slipped into her stone throne, anxiously gazed upon this child with red hair and a soft, snoozing face. She felt the child\u0027s small breaths and it seemed to calm her.\n\n\"Why am I here?\" Mira asked herself.\n\nI would like to know the same, Oberon said.\n\nMira gasped, looked over to see the tall and daunting Oberon standing beside her.\n\n\"I\u0027m sorry,\" she stuttered.\n\nShe stood from her throne. Her wings flapped and pulled her from the ground.\n\nOberon looked between Mira\u0027s fantastic wings and the child who rested.\n\nMy name is Oberon.\n\n\"Are you a God?\" she asked.\n\nI am, Oberon said. And so are you.\n\n\"My name is Mira,\" said Mira.\n\nIt is a pleasure to meet you, Mira.\n",
  "page 62": "Athena turned to look at Mira.\n\nMira was taller than Athena and had long white hair that flittered around her. She had the presence of Oberon but the face of Athena.\n\nMira\u0027s skin glowed too, and from her back she sprouted her large, white wings.\n\nAthena was far more intimidated now, stepped back from Mira.\n\n\"Why are you here?\" Athena demanded.\n\n\"I had to rescue that child,\" said Mira.\n\nWhile Athena shouted, Mira spoke softly and clearly.\n\nAthena looked Mira up and down, refused to believe she could have created a God as soft yet bright as this one.\n\nMira seemed to read Athena\u0027s thoughts. She said, \"You and Oberon created me. And for that, I am thankful. Yet I am very lost and confused. The only thing I know for certain is that my name is Mira.\"\n\nMira tried to muster a smile for Athena. But Athena was offended, sulked back and deeper into Irene\u0027s Domain.\n\n\"That\u0027s not possible. What do you do?\" Athena asked.\n\n\"I don\u0027t know,\" said the Goddess with angel wings.\n\nShe said, \"I don\u0027t mean to frighten you, Athena.\"\n\n\"I\u0027m not frightened,\" hissed Athena.\n\nAthena vanished, returned to her own domain.\n\nMira stood, alone, in Irene\u0027s Domain.\n\nShe went along and vanquished all the pests Athena had put there. It seemed like her calling.\n\nShe had not met Irene, but tucked glittering gems in the petals of Irene\u0027s flowers.\n\nAs the morning light struck the tall windows within Irene\u0027s Domain, not only did those gems shimmer, but so did this new Goddess.\n",
  "page 61": "Irene walked through the stars at a brisk pace.\n\nOberon would not approve, but Irene was going to tell Edol what was happening to the human souls. After, that was, telling Edol a new Goddess had kidnapped a human child.\n\nIrene felt her heart race in her chest. As she walked, planets began to bloom with luscious forests. When she returned later, the planets had formed their own skies.\n\nEdol struck through one galaxy with a force great enough to explode it and everything within it.\n\nHe had not realized the delicate Irene was behind him, watching him.\n\n\"Edol,\" she said.\n\nStars exploded in every direction as Edol turned and looked at Irene.\n\nHe had expected Oberon.\n\n\"Irene,\" he said.\n\n\"What are you doing?\" she asked.\n\nEdol could not hide himself, admitted, \"It was my first attempt at creating a galaxy. I thought I\u0027d destroy it before it became too troublesome.\"\n\n\"I didn\u0027t think you destroyed anything,\" Irene said.\n\nEdol smiled softly, said, \"These humans took many trials and errors.\"\n\n\"There is a new Goddess, Edol. But I assume you know.\"\n\n\"Yes. Her name is Mira.\"\n\n\"She has stolen a human child and we are unable to find her,\" Irene said.\n\nEdol shifted. His golden robes flittered through space.\n\n\"These new Gods are just becoming more and more problematic,\" he said.\n\nIrene didn\u0027t believe that was true. She was as confused as Mira when she was created too. But Irene dared not to speak back to Edol.\n\n\"There is an unknown force stealing souls from the humans,\" Irene said.\n\nEdol was silent, watched the galaxy he destroyed crumble to pieces.\n\n\"I know,\" he said.\n\n\"You do?\" Irene asked.\n\nHer hair flickered upwards. If she stood on Earth, vines would have formed around her feet.\n\n\"I know everything, my dear.\"\n\n\"Why haven\u0027t you done anything?\"\n\n\"I was curious as to what would happen.\"\n",
  "page 20": "Earth was a passion project for Sage Edol.\n\nHe created the universe, but in all its vastness it was still seemed strangely empty.\n\nOberon hadn\u0027t minded the emptiness, spent most of his time travelling to stars, slicing them through their cores and leaving blackholes in his wake.\n\nBut Edol was pressing atoms together in more and more intricate ways.\n\nAnd suddenly he formed one living thing, a small ameba that carried its own life, and with it, was able to form more of itself. Humans later called this DNA.\n\nBut humans did not form until much later.\n\nOberon admired the dinosaurs until Edol struck all those dead with a meteor. That was a busy day. And then he admired the furry mammals that existed thereafter.\n\nBut soon those died as well. It seemed Edol was trying again and again to create some perfect being.\n\nOberon argued that Edol was too prideful, said that while Edol thought all his beings were perfect but killed them anyway.\n\nOberon did not admire life like Edol did, but it seemed neither did Edol for some time.\n\nBut the furry mammals became smaller, then they resorted to walking on two feet.\n\nThey act like us, Oberon said one calm afternoon.\n\n\"Indeed,\" said Edol. \"Just as I planned.\"\n\nOberon was suspicious of such a statement.\n\nOberon knew well Edol never planned a thing.\n\nBut it almost seemed like he did plan these two-footed mammals.\n\nHumans emerged. They stood tall and spoke simplistic words. And Edol was sure that the female humans were beautiful, so that their species could carry on.\n\nOberon did not find them beautiful. The dinosaurs had been strong and mighty and cruel. These humans had flesh that easily bruised and bled, and their bones were weak and breakable.\n\n\"Perfect,\" Edol had said. But Oberon said no such thing until Irene was created.\n",
  "page 64": "Oberon took up the child in his arms.\n\nShe awakened and stared at him with large blue eyes. And from her little head were two red braids, tied with blue ribbons that now threatened to fall from her hair.\n\nShe was silent, looked up at Oberon with amazement he only witnessed from Irene.\n\n\"Wolf,\" she said.\n\nHello, Bunni, Oberon greeted. It has been awhile. My, how you have grown.\n\nShe laughed at him and his funny voice.\n\nIt was like a chiming bell, her laughing.\n\nMira looked on at Oberon with similiar wonder before he began to step up and back towards Earth.\n\nBunni was a good child, spoke in full, coherent sentences but was still mindless enough that she desired to know what was beneath Oberon\u0027s hood.\n\nThere is nothing there besides an old skeleton, my dear, he said.\n\nBut Bunni grasped the edges of his cloak, pulled it down from his head.\n\nShe was not at all fearful of this old skeleton. Instead, she poked the holes of his eyesockets and touched his bumpy teeth.\n\nNow now, Bunni, that is rude. You did not even ask. I would have shown you if you asked.\n\nBunni grinned and said, \"I\u0027m sorry.\"\n\nDon\u0027t apologize now. You are curious, Bunni. Make sure you stay that way.\n\nThe two arrived at Bunni\u0027s mother\u0027s apartment. There gathered her family, weeping for the loss of their beloved, but also for her missing child.\n\n\"She\u0027s been gone for weeks,\" exclaimed one older woman.\n\n\"She\u0027s dead, I know it. It is all we have left of Alayane and she\u0027s dead,\" said another.\n\nBunni appeared on the doorsteps, spread her arms open for her grandmother to hold her.\n\nOberon loomed near until Bunni was found.\n\nHe pulled his hood back over his head and said, Good day, Bunni.\n\nThe child did not comprehend the loss of her mother until some time later. And Oberon felt a deep sadness in his chest the day Bunni wept.\n",
  "page 63": "Oberon took up the child in his arms.\n\nShe awakened and stared at him with large blue eyes. And from her little head were two red braids, tied with blue ribbons that now threatened to fall from her hair.\n\nShe was silent, looked up at Oberon with amazement he only witnessed from Irene.\n\n\"Wolf,\" she said.\n\nHello, Bunni, Oberon greeted. It has been awhile. My, how you have grown.\n\nShe laughed at him and his funny voice.\n\nIt was like a chiming bell, her laughing.\n\nMira looked on at Oberon with similiar wonder before he began to step up and back towards Earth.\n\nBunni was a good child, spoke in full, coherent sentences but was still mindless enough that she desired to know what was beneath Oberon\u0027s hood.\n\nThere is nothing there besides an old skeleton, my dear, he said.\n\nBut Bunni grasped the edges of his cloak, pulled it down from his head.\n\nShe was not at all fearful of this old skeleton. Instead, she poked the holes of his eyesockets and touched his bumpy teeth.\n\nNow now, Bunni, that is rude. You did not even ask. I would have shown you if you asked.\n\nBunni grinned and said, \"I\u0027m sorry.\"\n\nDon\u0027t apologize now. You are curious, Bunni. Make sure you stay that way.\n\nThe two arrived at Bunni\u0027s mother\u0027s apartment. There gathered her family, weeping for the loss of their beloved, but also for her missing child.\n\n\"She\u0027s been gone for weeks,\" exclaimed one older woman.\n\n\"She\u0027s dead, I know it. It is all we have left of Alayane and she\u0027s dead,\" said another.\n\nBunni appeared on the doorsteps, spread her arms open for her grandmother to hold her.\n\nOberon loomed near until Bunni was found.\n\nHe pulled his hood back over his head and said, Good day, Bunni.\n\nThe child did not comprehend the loss of her mother until some time later. And Oberon felt a deep sadness in his chest the day Bunni wept.\n",
  "page 0": "I do not understand, said Oberon.\n\n\"Where are they coming from? Where are their souls?\" inquired Irene, who quickly moved beneath Oberon\u0027s arm for comfort.\n\nIrene was upset. The flowers in her red hair wilted at the sight before them.\n\nHumans were dying, but they were not dying at all. They were walking Earth without souls. They walked Earth in bodies whose souls had been stolen. They were vagrant and confused.\n\nAnd so were these two Gods.\n\n\"Oberon,\" insisted Irene.\n\nI have never witnessed anything like this before, admitted Oberon.\n\n\"But you must know. You know the location of every soul in and out of Earth.\"\n\nIndeed. That is what makes this so mysterious.\n\n\"We will have to tell Edol about this.\"\n\nNot him, snarled Oberon, as if he could. Oberon\u0027s voice was always low and monotone but Irene found it charming.\n\nOberon turned and left Irene\u0027s side. His dark robes followed behind him without a sound.\n\nIrene quickly followed as well. Each wilted flower fell from her hair, landed upon the stone floor beneath them and turned to dust.\n\nA thief, said Oberon.\n\n\"Perhaps,\" said Irene.\n\nInform Athena of this, but she shall not tell Edol. Have her visit Earth and investigate. As will I. I have souls to reap before this thief can.\n\n\"Be safe,\" insisted Irene.\n\nShe kissed him, tucked a white rose into his boney hands.\n\nYou should not warn me, my love, Oberon said. You should warn those who dare steal from me.\n"
}