{"page 125":"You decide to take this opportunity to indulge in job benefits liberally. By two hours in you’ve put a major dent in the alcohol supply. You’re barely even concentrating on your job; you’re too busy drinking up everything. People are starting to get angry.\n\n“Hey fuckin’ bartender! We wanted some beers!”\n“Yeah? Well (hic!) That’s tough shit ‘cause there ain’t no more. (Hic!) No wait…Here! Serve your fuckin’ self!” you say giving them the beer spigot hose.\n\nActually at this point you’re not even doing a half assed job; you’re just goofing off on “company” time.\n\nBy the time Tina gets on stage, you’re passed out. She’s not pleased. One of the reasons why she wanted you to work here is so you could be closer and appreciate what she does. You can’t very well do that lying on the floor creating a drool puddle.\n\nAt the end of the night she drags you outside and then takes your truck keys. You’re not really awake, but you hear her say:\n\n“You can walk home motherfucker!” and then hear the click clack of high heels walking off.\n“Hmm um…thank you.” You mumble and fall back to your drunken slumber in the parking lot.\n","page 124":"Well, you suppose you can at least make the effort, Tina will just pitch a bitch at you, if you get plastered and you don’t feel like hearing it. Nothing stopping you from taking little drinks in-between though.\n\nAs the night goes on, the initial beer rush slows a bit since the patrons are more interested in the tits. However there are always those few that insist on drinking at the damn bar rather than drool up front like a normal person. These types always seem to want to talk to the bar tender too. How lucky for you that you have not one, but two of these people trying to talk to you.\n\nNo getting away from it, they’re demanding alcohol, and they’re going to tell you their sorry life story anyway, might as well pick which one. You’re already feeling a little buzzed from the beer too by now, so you’re in that “professor mode” and feeling a little talkative yourself.\n\nThere’s the little nervous guy who looks like he wants to talk, but looks scared of you. He watches the strippers in absolute fascination, but keeps making himself look away and turning back to you.\n\nThen there’s the big trucker looking type who’s drinking a lot more and watching the strippers pretty intently too, you’re surprised he isn’t up closer, but he looks like he wants to ask you something.\n\nYou finish drinking another beer and try to figure out which one is going to annoy you less.\n","page 127":"You move over towards the nervous guy wondering what the fuck his problem is.\n\n“Hey buddy, what the fuck is your problem?” you ask.\n“Oh…I…um…I don’t know. I just…”\n“Goddammit boy spit it the fuck out!”\n“Well I don’t feel like I should be here you know? Like what I’m doing is wrong and unclean.”\n“Oh fer fuck’s sake, you one of those religious types?”\n“Um, well…”\n“Fuck son! Lookin’ at titties is completely natural! Ain’t nuthin’ sinful about it! Way I figure if’n God didn’t want us to love titties he would’ve made us all fuckin’ queers!”\n“You…might be right, but I just have these urges…”\n“Well of course you got fuckin’ urges boy! You’re a MAN! Start actin’ like one!”\n“Um, so you sayin’ I should act on these urges that I have?”\n“Dammit, squeegee out yer fuckin’ ears jackass! Of course that’s what I’m sayin’!”\n“So should I try to get with…um one of the strippers then?”\n\nShit this pussy asks a lot of fuckin’ questions, and just your luck, now he’s distracting you from Tina’s act that’s just started.\n","page 128":"You move over to the trucker since you figure he’ll talk less. As you get closer you notice something slightly odd about him. He’s pretty clean shaven for a trucker type first of all. He sports a mullet similar to yours, but still there’s something not right here.\n\n“Damn, what I wouldn’t give to eat her pussy out.” The trucker says. “She’s turning me on.”\n“That at fact? I’m surprised you ain’t up there tipping her then.”\n“Nah, just money getting thrown away. I’d rather spend it on this here Scotch, at least there’s a pay off afterwards.” He says taking a drink.\n“Ha ha ha! Now that’s something I can identify with!” you say taking another drink as well.\n“Sides, I’m gonna just go up and talk to her after the show.”\n“Heh. Good luck with that.”\n\nSuddenly Tina comes out on stage to do her little act. The trucker seems to forget all about the last girl who was up on stage, as his eyes bug out of his head.\n\n“Holy shit…no THAT’S the one I want…”\n“You and everyone else, but you’ll be lookin’ and not touchin’ that one. She’s mine.”\n“Yours? How the fuck did that happen?”\n“I gotta a big dick okay? What the hell difference does it make to you? You ain’t gonna be puttin’ yours anywhere near her.”\n“I wouldn’t anyway, seein’ as I don’t have one.”\n\nIt takes you awhile to get that one.\n“Hold on, what the fuck did you just say?”\nWell maybe more than awhile.\n\n“I said I don’t have a dick to put near her! I’m a woman! Couldn’t you tell?”\n“Not really.”\n“Well, I am, an’ I got a proposal for you. How about you talk your girlfriend into a threeway? We wouldn’t be fucking of course, but we could double team your girlfriend at the same time.”\n“WHAT?! Ugh! Fuck no!”\n“Why? I thought you guys liked it when two girls got it on.”\n“Yeah maybe if you were fuckin’ as hot as Tina! But you fuckin’ look like me! If I wanna see myself fuckin’ Tina I’ll invest in a mirror! Second of all Tina’s not into that shit!”\n“Nonsense, all girls got that tendency in them and I’d like to unleash Tina’s tendencies.”\n“Okay that’s it. Ain’t fuckin’ happening. So just get that out of your mind right now and take your butch ass outta here.”\n“You gonna make me bitch? What’s the matter, you afraid she might like it?”\n\nBefore you can retort, Tina has finished her act and comes up to you.\n\n“So did you see my act, or were you too busy drinking?”\n“Hey I saw your act baby, an’ you made my fuckin’ pussy wet! How about you lick it dry?”\n“EXCUSE ME?” Tina says.”\n“Wrong thing to say Butchie!” you say and punch the trucker in the face. You then jump over the bar and proceed to beat her even more, she puts up a good fight though and even gets in a couple of good blows, particularly to your nut sack, but that alone isn’t enough to take you out. All your years living with Tina, has resulted in many a crotch kick, you’re used to it.\nUltimately after kicking her ass you throw her outside where she runs off to get back in her big diesel truck and drives off.\n\n“Goddamn.” You say catching your breath.\n“Wow, you nearly got your ass kicked by a girl.” Tina says.\n“Shut up.”\n“Well it’s nice to see you’re willing to beat up any gender that comes on to me now.”\n“She wanted some weird three-way.”\n“Hmm, and I’ll just bet if the woman looked more like me, you probably would’ve tried to talk me into it.”\n“Nah, I know you’re not into that, or done anything like that.”\n“Huh, the hell I haven’t. Before I met you I experimented a few times with a couple of my friends. I didn’t like it though, that’s why I stuck with guys.”\n“What?! You never told me that! Um…tell me more.”\n“See and that’s WHY I never told you that before! You get excited enough as it is around me, I tell you this shit and you’ll have a perpetual hard on.”\n\nThat night when you get home you pester Tina so much to elaborate on her “experimentation” that she finally has enough of your shit and makes you sleep on the couch. You end up having some interesting dreams at least.\n","page 77":"That fucker Dan is libel to rat out that YOU slightly helped him in this failed attempt at theft so you figure you’d better do something. You go in the shop and then come back out, saying that you can’t find the phone.\n“What the fuck Mel, its right by my office!”\n“Is that on the left or the right?”\n“It’s on the left!”\n“Now is that by the table or…”\n“GAH! I’ll fuckin’ do it! Shit you’re a fuckin’ idiot! (COUGH!) Just keep an eye out on him!”\nAs soon as Jim goes back in the shop, you rush over to Dan.\n“Dan, you think your other leg is good enough to work a gas peddle?”\n“Agh! What? I’m in fuckin’ pain!”\n“I’m tryin’ to help your dumb ass, now are you good enough to drive a car?”\n“I think so.”\n“Okay, I’m gonna get you to the car, Jim’s fixed it already. I trust you know how to hotwire it. And quit your fucking moaning, you’re gonna call attention to us!”\nYou drag Dan over to the car and shove him in it. Well that’s lucky, the keys were still left in the car. You give Dan your wrench.\n“Okay now fuckin’ hit me with it.”\n“What?!”\n“Just fuckin’ do it! Just remember, you fuckin’ owe me a BIG one!”\nDan nods and smacks you in the face with the wrench and drives off. Jim comes wheeling out and sees you on the sidewalk.\n\n“WHAT THE (COUGH! COUGH!) FUCK HAPPENED!?”\n“Ah shit, I was standing over Dan and the motherfucker managed to grab my wrench and smack me in the face with it.” You say holding on to your face.\n“You, you, (COUGH! COUGH!)” Jim can’t even complete his sentence. Just then the out of towner comes back with girlfriend.\n“MY CAR! Where the hell is my car?!!?”\n\nAt this point everyone starts arguing; the sheriff finally comes and is in a foul mood. He ends up running you ALL in for disturbing the peace and puts a warrant out on Dan. You wait in the cell until Tina comes down to bail you out. She doesn’t say anything to you. In fact she doesn’t say anything to you in the truck either. You can’t take the silence anymore when you get home though.\n\n“Alright! Come on! Let me have it! I know you want to! Call me every fuckin’ name in the book!”\n“What? I’ve bailed you out of jail before. It’s not even worth me yelling about anymore, besides you did something constructive today. Dan came by the club, talking about owing you. He said something about selling a car to Hector, and getting a bunch of money for it. He didn’t tell me exactly what happened, but I’m sure what you two were involved in was probably shady with him having hole in his leg and me having to bail you out of jail. But I’m willing to over look it since he handed me this.”\nTina flashes a big wad of bills, your eyes light up and you grab at it, but Tina moves it away.\n“Uh un. That’s not your reward there cowboy. THIS is your reward.” Tiny jumps and wraps her legs around you.\n\nYou take it from there.\n","page 76":"You go back inside and call what passes for police around here, and manage to catch them in the rare moment when they aren’t eating donuts. They come over pretty quickly and take Dan away. You assume he’ll go to a hospital first, but you never know in this county. Soon, the “tourist” and his girlfriend come back just in time for this little event to be finished. They pay Jim the outrageous amount of money he charges and leave. The rest of the day is uneventful, until you ask for an advance in your pay at the end of the day.\n\n“(COUGH!) You’re fuckin’ shittin’ me right? That junkie friend of yours ended up breaking the TV he stole when I shot him! I gotta spend time fixing it again! Time is money! Not to mention I still dunno if (COUGH!) I fuckin’ trust you! As a matter of fact I don’t want you fucking working here anyway, if those are the type people you hang out with!”\n\nYou’re not really surprised by all of this.\n“I don’t need this fuckin’ job anyway!” you say as you walk out the door. “And by the way, you lost that war!”\n“WHAT! WHAT! Why you, fuckin’…” you hear Jim yell as you rush into your truck. Some more gunshots are fired as you drive off.\n\nYou go straight home, pissed off, and what’s worse there’s nothing alcoholic to drink. You stew for awhile until you get the bright idea to take the various beer cans on the ground and pour the residue into a dirty glass and add water. It tastes like warm horse piss, you immediately spit it out. Tina comes home to see what you’re doing and laughs.\n\n“You really are fuckin’ hopeless you know that?”\n“Shut up and come here, I need to put my tongue on something that tastes good.” You say still spitting out the beer.\n","page 70":"You don’t feel like having to deal with this fucker again if that hose should break before he gets out of town, so you decide to reinforce it. You back in and get the appropriate material only to be met by Juan; Hector’s younger brother.\n\n“Hey Mel, when did choo get a new car man? Shit how can you afford it, with your out of work ass?”\n“It’s not mine Juan, and I’m working for Jim now.”\n“Oh, so Jim said it was okay for you to work on his car?” Juan asks inquisitively.\n“It’s not his either, its some fuckin’ prissy ass out of towner’s.” You say.\n\nJuan suddenly gets a little perturbed.\n“Hold up Esse. You sayin’ you doin’ work on an out of towners car without Hector’s say so?”\n“Yeah so? You fuckers don’t have a monopoly you know! What the fuck, you think you’re the Escobar Cartel?”\nJuan steps up to you and looks up at you.\n“You betta watch cho’ mouth Esse! You gonna get cut talkin’ shit like dat!”\n“Stand up when you talk to me!” you laugh.\nJuan pushes you and brandishes a knife. “You still laughin’ you redneck motherfucker?”\nYou grip your wrench tightly “As much as I’d like to indulge your Tony Montana fantasies, I didn’t even want to fix the fuckin’ car. I told these out of towners to go take it to your brother’s place. It was Jim’s idea, so if you got a problem, go fuckin’ talk with him! But if you wanna get your fuckin’ teeth knocked out I can happily oblige.”\n\nJuan wants to fight, but decides against it, instead he storms into Jim’s place. Soon you hear gun shots and Juan comes running back out the door. Juan runs and ducks as bullets come whizzing out of the store. You find a safe place to be and see Jim come wheeling out of the store.\n“FUCKIN’ Immigrants! I fought for this goddamn country! (COUGH!) I’ll do what the fuck I want!” he shouts and reloads his rifle. You know he’s just scaring Juan, because if he wanted to hit him, he could’ve. After everything quiets back down, you go back to working on the car. Steve and Susan come back and look in horror to the fresh bullet holes in the side of their vehicle.\n“All finished!” you say.\n“What…what…happened!?”\n“Oh, those. Damn. Well I could fix those too if you like; it might take awhile, but…”\n“NO! We’re going! Here!” Steve shoves a bunch of money in your hand and he and his girlfriend drive off.\nYou’re guessing Jim’s probably still pissed off, and dealing with a heavily armed pissed off vet isn’t something you really want to deal with right now. So you decide to head to the bar with your earnings. You get drunk as usual and don’t get home until the ungodly hours of the morning. You don’t even make it to the door of your trailer. You pass out on the broken couch in front of it and wake up with a spring embedded in your ass and a stray dog pissing on your leg. You see Tina just shaking her head at you from the window.\n","page 73":"“Oh alright, but just ONE fuckin’ thing! So make sure you can get something for it.”\n“Thanks Mel!” Dan goes over and quickly assesses that the small color TV will suit his needs.\n“Hey genius, now how are you going to get it out of here? Jim’s right outside you know.”\n“Yeah, but he’s busy with a car I saw him working on.”\nYou got back to work as Dan tries to compose himself so as not to appear obvious when he exits.\n“What going on here?!” Mei Mei says as she suddenly appears out of nowhere! It doesn’t take long for her to assess the situation. “You stealing stuff! JIIIIIIIIIIIM!”\n\nDan immediately breaks for the door. You hear Jim yell “Hey stop, you stealing motherfucker!” and a couple of shots are fired, followed by some screams and then a loud crash. You rush outside and see Jim getting ready to waste Dan, who’s begging for mercy at this point, he’s already been twice shot in the leg.\n“NO! Don’t kill me! (Sob!)” Dan screams.\n“Whoa! Hold on there! You got him Jim! Let’s let the police handle this now, I’ll call them.”\n“This pissant was trying to steal from me! He deserves to die! And why the hell weren’t you stopping him?! Unless you were in on this! (COUGH!) That why you wanted a job? To be the guy on the inside, while your junkie friend ripped me off?!” he points the gun at you!\n“What?! Fuck no! I was working in there, and then Dan just grabbed something off the table! I couldn’t react fast enough! Come on Jim, you don’t need to fuckin’ kill him, think about all the shit that’s gonna happen to him in jail. I say he’ll be a bitch within the week.”\nJim looks at you apprehensively, but puts his gun away.\n“Well I reckon that WOULD be a fate worse than death. Alright go call the (COUGH!) sheriff.”\n","page 74":"“NO! I said! Now take your junkie ass else where!” you say.\n“Aw come on Mel.”\nSuddenly you hear yelling outside.\n“Fuck you, ya goddamn uptight motherfucker! (COUGH!) I bet you’re a fuckin’ liberal too!”\nWell it looks like Jim’s made friends with his customers.\n\n“You wanna play with me boy? I’ll play witcha! (COUGH!) This is a piece of shit car anyway!”\n\nThis is followed by some gun shots, and screams. You look outside and see Jim shooting the hell out of the car.\n“What’s going on?” you ask.\n“Ah he pissed me off.” Jim says, Dan comes walking out of the store.\n“So what’s going on?”\n“Jim got pissed off.”\n“Oh okay, well see ya later.”\n\nDan walks of in a pretty big hurry, you know something’s up. Jim knows immediately the next time he looks in his register.\n\n“Motherfucker! Someone ripped me off! (COUGH! COUGH!) I know who it was too; it was fuckin’ Dan! (COUGH!)” Jim’s excited state causes him to start clutching his chest, and fall out of his chair. Mei Mei comes down wondering what’s going on, and sees Jim on the floor. She becomes hysterical.\n“OH NO JIIIIIIIM! What you do to him?!!”\n“I didn’t do anything!”\n“You did something to upset! You go now! White trash hillbilly!”\n\n“Fine! I didn’t like working here anyway! If he makes it, tell him he owes me money for one day’s worth of work!” you say and walk out of the place. You see that the visitors never came back for their car. Left the keys in it too. It only has a few bullet holes in it. Hell those give it character! Sure would be a shame to just leave it there…\nYou quickly bring your truck around and get some chains out of it and hook the car up to your truck and put the car in neutral. The car ends up smashing into the back of your truck a couple times (especially after you stop at the liquor store for some liquid refreshments) but you eventually get it back to the trailer park. You spend the rest of the day sitting in it and listening to Rockabilly on the radio. When Tina gets home she’s wondering whose car it is.\n\n“Hey Mel, who’s convertible is this?”\n“It’s ours baby, now let’s christen it by fucking in the back seat.”\n","page 130":"“(Sigh) Yeah, sure, fine, whatever! Just leave me the fuck alone with your fuckin’ questions! And don’t fuck with the one that’s on stage right now because that’s MY girlfriend. I catch you attempting anything with her an’ you’re gonna be in a world of hurt! Got me?” you say looking in his eye emphasizing the threat.\n“Oh…of course! No, I won’t mess with her. Actually there’s another one I had my eye on, the one who was dressed like a hooker…” the little guy says seeming lost in thought\n“Boy, you’re too fuckin’ vague.”\n“Nevermind, you’ve been very helpful.” He says and walks out the door very quickly.\n\nYou shake your head, at the little freak and go back to watching Tina strip, damn! You fucking missed most of it! You spend the rest of the night tending the bar and drinking. Fuck talking to people, no matter how much they want to.\n\nWhen its time to leave, you and Tina enter the parking lot and head towards your truck. She’s bitching at you for drinking when you weren’t supposed to, but that’s interrupted by a scream.\n\n“What the fuck?” you say.\n“That sounded like Brandy! She might be in trouble!”\n“She probably just…” you begin to give an excuse not to check it out, but now you hear more screams, this time of help.\nYou and Tina rush over to where the screams are coming from, holy shit, its that little freak trying to fulfill his “urges” with Brandy!\n\n“What the shit?” you say, as he immediately turns around whipping out the biggest fucking blade you’ve ever fuckin’ seen and holds it to Brandy’s throat.\n“Don’t you fuckin’ try to stop me! You told me to do this! You said it was okay!”\n“You sick motherfucker, I never told you that! You misunderstood what the fuck I said!” you try to approach him but he backs off with Brandy who’s in absolute terror as the knife is held closer to her throat.\n\n“Back off or I’ll cut this bitch’s throat! I gotta do this! I gotta!”\n\nHe’s nervous and his hand is shaking, but still firmly in control. Normally you might be quick enough to take the knife out of his hand, but given your alcohol consumption, your reflexes aren’t really as sharp as they could be.\n\nOf course as it turns out, you don’t need to make that decision, as you suddenly hear a gunshot, causing you to duck instantly. When you look around, you see the rapist lying on the pavement with his brains leaking out of his head. Brandy’s still in shock and is just standing still with blood splattered on her. And coming behind you, is Tina holding a smoking gun.\n\n“Well, choke my chicken! Where the hell did you get that?”\n“You, ya dipshit! I keep it in my purse! You gave it to me last year for my birthday! Don’t you remember? Of course not, you were drunk at the time. I remember being pissed, since I wanted those earrings, but I guess this is really is the gift that keeps giving.” Tina says.\n\nThe situation is a pretty cut and dry clear case of self defense (Or close to it) so nobody’s charged. Vigilantism has a proud tradition in this town anyway. You however have learned your lesson, next time concentrate more on drinking and less on giving advice.\n","page 131":"You can’t help but laugh in his desperate face.\n“Ha ha ha! Get with one of those girls boy? Are you crazy? You ain’t got a chance! They’re strippers, they don’t want you! Shit most of them are lezzies anyway!”\n“Yeah, but you just said…”\n“I know what I just said son, but you ain’t payin’ attention! You can’t get with one of those girls…wait, you rich?”\n“Um…no.”\n“Well you can’t get with one of them! Only thing those girls care about is money an’ even then they’d only be with you for your money! No, you gotta getcher yourself a regular woman. Well maybe in your case a little less than regular. And what I mean by that is fat. I’m sorry to break it to ya, but I reckon that’s the only kind you’re gonna get. But that’s okay too! I mean fat women I hear are easier to please an’ shit. I mean that’s what I heard anyway, since I’d never fuck one of those sows. But a man like yourself can’t afford to be choosey. Gotta get it where ya can.” You take another drink, after passing this sagely advice along to your now speechless patron. You see Tina coming up to you, looking as sexy and as pissed off as usual.\n\n“Well did you even SEE my act, or were you too busy drinking?”\n“Goddammit woman, you were wiggling your ass and shaking your tits up there on stage in front of fuckin’ bright lights! How the fuck wouldn’t I have been able to seen it? You were great baby.” You say taking another drink. This remark seems to please Tina, and she kisses you over the bar and walks back to the changing room.\nYou watch her ass as she walks away.\n“Boy Howdy! Goddamn I’m gonna fuck me some of that tonight! My dick’s about to drill a hole right through this fucking bar.” You say, as the man looks at you in amazement.\n\n“You…but…but YOU! You got a stripper girlfriend!”\n“Eh? Well yeah, I said you can’t get one, never said I couldn’t!”\n“But you’re no fucking prize!” the man says starting to get angry. “Why can you get a sexy girl and I can’t? Argh! STUPID FUCKING BITCHES! I HATE ALL OF THEM!”\n“You need some meds or something?”\n“FUCK YOU! FUCK YOU!” The man screams and breaks a bottle over your head.\n“Argh shit!” you say and fall to the floor. He leaps over the bar brandishing the biggest blade you’ve ever seen. You manage to give him a kick before he can pounce on you, which allows you time to grab the bar’s shotgun. Upon realizing the man brought a knife to a gun fight, he leaps back over the bar as you rack the gun back ready to do major damage with it.\n\nNothing like shooting a shotgun when you’re tipsy though, in your effort to blast a hole in his ass you successfully blast holes in the walls of the place, causing people to start ducking for cover. The man attempts to back track as the exit door suddenly explodes into splinters in front of him. This is followed by his leg exploding into unrecognizable gore underneath him.\n\n“ARRRRRRGH!!! NO! AGGGGH!” he yells grabbing on to the bloody mess that was once his leg.\n“Hot damn! Got that sombitch! Woowhee!” you shout, and step from behind the bar moving towards the man, as the rest of the crowd hides wondering what you’re going to do next.\n\nYou point the shotgun as you stand over him; he tries to beg for his life. You pull the trigger. CLICK!\n\n“Well, well, looks like it was your lucky day mammy rammer.” You say. “But I guess I owe you this, goodnight dickhead!” you add smacking him in the head with the butt of a gun, knocking him unconscious.\n\nTina comes up to you.\n“While I know from our toilet your aim isn’t the best, but fuck couldn’t have gotten him in one shot? Look at this place! They’re gonna make me pay for this and probably fire you! Shit, you better get to the clinic and get that looked at.”\n\nYou spend the rest of the night at the clinic getting your head sewed up, and go home passing out from a combination of the booze you drank and the morphine they used on you. You sleep through the entire next day.\n\nSo in other words, back to normal.\n","page 112":"“Ah fuck it, Tina I’ll be a bouncer, I don’t feel like having to deal with people barking fucking orders at me.” You say. Tina looks relieved; she probably figured you’d end up drinking more than you served if you were bartending. (And she’s probably right)\n\n“Okay honey, just stand by the door then, weed out anyone who looks like they’re going to cause trouble, and if someone tries to get too grabby with one of the girls, come in like the riot squad and throw their asses out. You also collect the door fee.”\n“Sounds good to me.”\n“I have to get ready for my show now baby. Hey! This will be the first time you’ve ever seen it!”\n“What the hell are you talking about? You’ve strip teased for me tons of times, don’t you remember our first date?”\n”Yeah, but you’ve never seen me at work! I’m really proud of MY dance; I bring something different than all those other skanks. This is so exciting! I feel like we’re really sharing something new! I’m so happy you’ve decided to work here!”\n\nTina kisses you and then runs off like a humming bird in heat. This is getting really weird; you’ve NEVER seen Tina like this! She hasn’t bitched at you once the moment you agreed to work here! That’s gotta be some kind of record. You briefly entertain the idea that your Tina was abducted by space aliens and replaced by one of their own in some attempt to create a hybrid offspring to take over earth.\n\n“Hey fuck face! You gonna let me in or what? I got fuckin’ money over here that I wanna spend on some bitch! An’ I don’t wanna spend the night lookin’ at your ugly hillbilly ass!” a young man shouts from behind the velvet rope.\n\nWell back to reality…\n","page 114":"You size up the young man; he doesn’t even look like he’s from around here, looks like he’s some fuckin’ lame ass rich frat boy from the university in the city. Probably down here “slumming”. You can’t stand these arrogant bastards on principal, how nice it will be to fuck with one of them with legitimate authority!\n\n“Way to piss me off college boy, you ain’t getting in this fuckin’ place now. Take your frat ass home and don’t bother coming back ever, because you’re on my fuckin’ shit list.”\n“What?! You, you can’t do that! I’m a fuckin’ paying customer! You have to let me in you dumb redneck!”\n“Wrong again college boy! I have full discretion on who’s allowed in. And I have determined your hostile attitude towards me is an indication that you will be a potential trouble maker and a threat to the ladies, thus I shall bar your entry to this establishment…or in redneck terms you ain’t gettin’ in motherfucker!”\n“Fuck you, you fucking piece of trailer trash!”\nAt this point you get right in his face, so close that he has no choice but to have his olfactory senses assaulted by your breath.\n“You call me one more name boy, an’ me an’ you are gonna go round ‘an round. Now insult me once more, that’s all I fuckin’ ask. I fuckin’ dare you.” He turns a bit pale at your challenge. He backs off and leaves.\n“Yeah that’s what I thought.” You say and start collecting money from the other customers that were waiting behind him.\n\nBy making an example of that fucktard, you don’t really have anymore problems with customers. Later, Tina’s act is about to start, you’ve never seen her actually work so you are curious, besides seeing her running around naked always puts you in a good mood. A sleazy looking announcer comes out.\n\n“And now, for one of our more popular acts here, you may have been turned down by the cheerleaders when you went to high school, but I guarantee this is one who won’t turn you down! She brings a whole new meaning to the word Head Cheerleader and will certainly raise your spirits! Dig deep into your pockets guys and give up some money so she can go on the class field trip, because here comes Tina!”\n\nWhen Tina comes out she’s now dressed in a cheerleader outfit, similar to the one you first met her in, when she noticed you were checking out her ass at the local pizza joint. The only difference is its black and white and she’s wearing fishnet stocking and stiletto heels with it. You’ve instantly got an erection hard enough to drive fuckin’ nails with. She starts doing her dance as soon as the song starts blasting through the speakers.\nIts “Cherry Pie” by Warrant. That brings back memories.\n\nShe must’ve specifically requested that song, it was appropriately playing on the radio when you were eating out her pussy for the very first time. (Sigh) The memories…\n","page 113":"The lure of working around all forms of alcohol is too great to resist!\n\n“Shit, I’ll be a bartender, how hard can it be? Not like anyone is gonna drink any fancy girlie drinks that need to be mixed with fruit an’ shit.”\n“Hmmm, well alright, but remember, you’re suppose to be serving drinks NOT getting fucking plowed! Try to keep that in mind!” Tina says with a frown and walks off.\n\nYou look at the well stocked bar, and grab a beer for starters. Break open the can and drink deeply. AHHH! That hit the spot!\n\n“Hey bartender! Three beers!” you suddenly hear, by some patrons coming up to the bar.\n\nGoddammit some dickheads always have to ruin your fun.\n","page 116":"You watch her work the crowd as she slinks across stage removing clothing; she’s got the entire room in an uproar. Strangely she doesn’t even need to get off stage to do this; she’s completely teasing their cocks with minimal effort on her part. They’re tossing money at her and shoving it in her G-string like she was a vending machine. Shit you didn’t realize until THIS moment that you are one lucky sonofabitch. You’re the envy of every guy in here. You come to the sudden conclusion that you should start appreciating her more. Of course this enlightened new outlook is now accompanied by an over protective streak that just kicked into overdrive. You see all these guys shouting shit at her and grabbing at her and you begin to get angry…\n\nYou immediately break a chair across one guy’s back and break a bottle over another one’s head before anyone can react to what’s going on. What ultimately results is a bar room brawl in which the sheriff and company have to come in and break up and close the place down for a cooling off period. Tina bails you out of jail, but isn’t very happy with you.\n\n“What the hell was that all about?! I’m fuckin’ stripper, you can’t be kicking everyone’s ass just because you’re overly jealous bastard! You’ve gotten fired by the way, which is just as well since I’d be out of a job, if you’d continue to work there! You got anything to say for making me lose work and nearly getting me fired as well?”\n“Um…I liked your act. I never realized how lucky I am you chose to be with me. I’m sorry for the trouble I caused darlin” You reply, not knowing what else to say.\nTina’s frown slowly turns into a semi-smile.\n“Oh Mel.”\n\nTina forgives you in a more physical way when you get home.\n\nYep, she’s a good un’.\n","page 115":"You size up the college frat boy. Fuckin’ rich bitch. Normally you’d kick his ass, but this being a real job and all, you probably shouldn’t, at least not yet. That doesn’t mean you can’t shake him down though.\n\n“Okay college boy you wanna try to solve your sexual preference issues by looking at titties, be my guest, but its gonna cost you five hundred dollars to get in.”\n“WHAT!? I’m not paying that!”\n“Well I’m afraid it’s back to gay internet porn for you then.”\n”Shut the fuck up! I’m not gay!”\n“You sound awfully defensive about that…”\n“Fuck you! Look the entrance fee is fifty bucks! I know that because I’ve been here before!”\n“Well some things have changed ‘round here. Inflation. You know, shit happens. So what’s it gonna be, you wanna see some titties or you gonna go jerk off to Thick Sticks magazine?”\n“Arrgh! Here! Fine! I don’t give a shit! I have more money than you’ll ever see in your entire trailer park existence! Take it! Take it!” the frat boy says throwing the money at you. “And I’m not fucking gay!” he screams and enters the main strip room.\n\nActually that was more fun than kicking his ass! You pocket the $450 feeling quite pleased with yourself. Of course you can’t do that with anyone else since most of them are locals and barely have enough money to shove in the strippers. Later you notice that its time for your girlfriend to start dancing, you also notice college boy has been getting louder and drunker as the night has been going on.\n\n“WOHOO! Yeah! Fuckin’ take it off baby!”\n\nNot much different from everyone else, but he bears watching. As Tina collects the money shoved at her, college boy gets a little grabby to the point he won’t let her go…\n\n“Come on bitch! Gimme a fuckin’ lap dance you fuckin’ hillbilly whore!”\n\nWell that would be your cue…\n","page 117":"There’s no way you can wait until you get home before shoving your one eyed monster into Tina’s ass, you gotta do it NOW! When she looks over in your direction, you make a dirty gesture to her and point to yourself and the door. She immediately gets the message and nods, licking her lips to emphasize the point.\n\nYou immediately leave, and head towards your truck. This’ll be just like the first time you and her consummated your…well love I suppose, for each other. You thought you were just deflowering another virgin (Of course THAT joke was on you since she hadn’t been a virgin since she was in middle school as it turned out) but instead you fell in love or as close as you can get. Tina also felt that night when you fucked her in your truck was the most special night of her life. Never before had a guy at least made the effort to make sure her head wasn’t slamming against the door handle during the heat of passion. How could she not fall in love with you?\n\nYou actually feel a little bit…what’s the word? Emotional? It’ll be like reliving that moment, but without worrying over whether her age was just a number or just a quick way to get your ass thrown in jail.\n\nYes this probably would’ve been a beautiful night of past lustful re-enactment had that fucktard you threw out of the club earlier hadn’t showed up.\n\n“Hey Night Ranger! Where the fuck you think you’re going? Yeah that’s right, I got my friends with me, and they didn’t appreciate you treating me like you did.”\n“Yeah, well I’m sure they comforted you in that secret fag brother way, now you college boys better not fuck with me right now I got something more important to take care of and I guarantee you do NOT want me to be distracted from it.”\n“Bwak bwak! Sounds like you’re a redneck chicken shit!”\n“Me? You’re the pussy who had to bring his friends along with him. Now this is the last chance bitch boys, either leave me the fuck alone or be prepared for an’ ass whoopin’ so bad that even your great grand children will be feelin’ it, and that’s assuming you and your “life partners” can pay some crack whore to carry your seed for heroin money.”\n\nWell you couldn’t have expected that comment not to go without results…\n\nA fight ensues, but of course you being, a rough an’ tough Alpha male, you have no problem dispatching the Betas at hand, plus there was the fact that you were super pissed that they interrupted what was going to be a great sexual encounter with Tina, now, you’re hot, you’re sweaty and you’re covered in blood. And you haven’t even fucked Tina yet!\n\nYou get to your truck, leaving the frat brothers on the ground to ponder their poor judgment and Tina’s already there waiting for you.\n\n“Took you long enough! Hey, you got blood on you.”\n“What the fuck? Didn’t you see me fighting those idiots in the parking lot?”\n“Yeah so?\n“So you didn’t feel it necessary to at least help me out?”\n“You looked like you had everything under control. Besides I know you, you get completely focused and don’t want anyone to disturb you. Come on are we gonna fuck now stud or what?”\n\nWell, she’s got a point there. You turn Tina around, bend her over and get down to business right there in the parking lot in between your truck and another car, but due to your earlier expended energy, it’s not the magical re-enactment of your first date that it could’ve been. (More like your second date)\n\nBut then again kicking some dickheads’ asses and then fucking your girlfriend in the parking lot of her strip club, is good enough.\n","page 88":"Well it’s not people, but it sounds like the next best thing.\n\n“Okay bring on the swine cause I’m about to slice me a pig and slice him thick!”\n“Well hold on there killer! I’m glad to see your enthusiasm, but yer gonna have to take up the killin’ manner with Junior.”\n“What?”\n“Tarnation Mel! You DO remember Junior right? He’s a little slow but a good boy an’ a hard worker. He’s not much for the conversation, but he sho’ knows how to kill dem pigs, I’ll tell ya what! Got a natural talent fer it but he gets a little over protective of his nitch.”\n“So why do you want me to help at all then?”\n“Well that boy spends TOO much time in that there slaughter house. He ain’t been home fer days! His momma’s worried about him an’ I have to admit I am too. I figure if you can give him a break from the pig killin’ for awhile, maybe he’ll actually come visit us on his own accord. Okay then, the pig I’ll leave you to it.”\n\nWonderful Clem has left you to deal with a retard armed with butcher tools with a love for killing. You approach the small slaughter house. You can hear the sounds of squealing pigs either being killed or awaiting their impending doom. Flies buzz all around and the smell of death is enduring here. As soon as you step in, you feel cold and your boots feel the squishiness of guts on the floor blood is everywhere. Pigs run back and forth in their pens frantically trying to escape, except for one big fat one all by himself in the back that’s sleeping peacefully. (Or maybe it’s dead, you can’t tell from here)\nA big deformed man looks up from his recent kill and directs his attention immediately on you.\n“WHO YOU?” he asks gripping his meat cleaver. This could only be Junior.\n“I’m your cousin Mel, easy there. Your dad sent me to help.”\n“NO HELP! I KILL GOOD!”\n“He knows that, but he says you’re overworked, and you should have some help. He’s worried about you.”\nJunior looks at you for a minute and then speaks.\n“YOU WANT KILL OR CHOP UP?”\n","page 87":"“Well I guess feeding the pigs is simple enough. I’ll do that.” You say.\n“Haw haw! YOU think so? Those pigs get pretty excited when hungry and when dem hogs start eatin’ they ain’t too particular! A full grown pig can eat an entire human body. Seen it happen lotsa times. Well you’ll learn soon enough. I got some other work to do, so the food’s over there in that wheel barrow and there’s the hogs, I’ll leave you to it.”\n“Why the big ass wheel barrow of rotten vegetables? I figured I’d just needed to throw a bucket of slop in there.”\n“Hey maybe at other farms they don’t give no never mind to what and how they feed their hogs, but here we make sure our hogs get the best food possible, plus that “slop” you’re referring to tends to mix in with the mud and shit. And while the pigs don’t care, we’re tryin’ to get a higher quality diet for them so when we split ‘em open we got some prime meat and not infected meat.”\n\nClem leaves and you go over to the humongous wheel barrow of pig food, which consists mainly of hot rotten vegetable matter that stinks really bad. You’re having a hard time pushing the damn heavy thing, with you gagging ever five seconds from the smell. You eventually get to the pig pen, where the pigs instinctively start crowding near the fence where you’re located. Clem wasn’t joking; they’re practically breaking the fence down to get to the food.\n\nYou start throwing the rotten food in there, when all of a sudden a voice calls out to you.\n“You’re doin’ that wrong y’know. Want me to show you how?”\n\nYou turn to see a young woman dressed in cut off jeans that might as well be a denim g string and a tied top that’s barely keeping her tits in. This CAN’T be Bertha, this must be Suzy! Clem’s daughter!\n\nWow, it HAS been a long time since you seen her…\n","page 89":"“Well killin’ is why I’m here Junior.”\nJunior hands you a heavy sledge hammer.\n“Sonofabitch this is heavy.”\n“YOU SMASH PIGGIES IN HEAD GOOD! BRAINS COME LEAKING OUT EARS!”\n“Um, okay.”\n“GET PIGGY FOR YOU!” Junior goes to a holding pen and drags a pig out to you, he holds it as it tries to get away.\n“SMASH!”\nYou slowly lift the hammer up and bring it down onto the pig’s head. You don’t quite kill it though, now it’s squirming and twitching. Junior is upset.\n“YOU NOT DO IT RIGHT! YOU CRUEL! IT IN PAIN! KILL IT!”\nYou smash it in the head again, and again and again. It finally stops moving. Junior grabs the hammer from you.\n“YOU NOT KNOW HOW TO DO IT! ONE SMASH ONE KILL! NO PAIN!”\n“Well fuck, the hammer’s fuckin’ heavy as shit! I was havin’ a hard time lifting the fucking thing, I couldn’t get enough swing power behind it. I’m not as fuckin’ big as you!”\nJunior can barely comprehend what you’re trying to say, but some of it seems to have gotten through.\n“OK YOU TOO WEAK TO KILL. NOT STRONG LIKE JUNIOR. MAYBE YOU SHOULD PUT ON DRESS LIKE SISTER SUZY!”\n","page 80":"“Petrov! I’m not here to fight! I’m sorry I called you a communist. I know you Russians…”\n“I not Russian you ignorant backwood hillbilly! I Roslakian! I HATE fucking Russians! They shit! They can all get fucked in ass with big dick! Like the homosexuals no?”\n“Erm, yeah. Okay Petrov.”\n“So! What you want fucker of mothers?”\n\nYou can barely contain your laughter of Petrov’s complete annihilation of English swearing.\n“Well I was just wondering what kind of shop you were running here, I’m looking for a job.”\n“Ah you want job? Yes yes yes! I have what you need in back! Wait….you not cop are you?”\n\nYou’re a little confused by what exactly is going on, but it would appear everything here isn’t exactly on the up and up.\n“Petrov, do I look like a goddamn cop?”\n“I do not know! You ignorant redneck Americans all look alike to me. I see the Cops TV show! I know you set up and fuck people in ass with plunger! Just like back in Old Country!”\n“Look I’m not a fuckin’ cop! I just want to work here.”\nPetrov gives you a different look.\n“Oh! Oh, OH! I sorry my friend, my English is not very good. I misunderstand.”\n“No shit.”\n“So you want work here, okay I could use big strong man like you here. You stay here in front and when people come in store, direct them to back. If they give trouble, beat shit out of them! Yes?”\n“Okay. But isn’t this a repair shop?”\n“Hahahahahahaha! You did not know? You most certainly are not cop. No, my friend! This only look like repair shop! Actually is… what is the correct term in English….ah yes! House of Whores!”\n\nWell you found out why Petrov’s is so popular…\n","page 81":"“Hey comrade it’s a fuckin’ free country! I can go where the fuck I want!”\n“Not here! Unless you have business! You have no business here! You get hell out of my shop! This fuckin’ private property!”\n“I want something fixed ya dumb Russian bastard!”\n“I not fixing anything of yours! You take to that fuckin’ cripple piece of shit Jim! He fix! And I not Russian I Roslakian, get the fuck out of shop tardfuck!\n“Its fucktard ya dipshit. Shit you’ve been in this fuckin’ country long enough, ya oughta at least know how to fuckin’ swear! You can’t fuckin’ adapt. No wonder you lost the cold war.”\n“Fuck you! I hold university degree! I was financial planner in old country!”\n“Well that explains the reasons for your part of the world bein’ in economic shit then.”\n“You pissing me off! GET OUT!” Petrov says then pushes you.\n\nWell that did it. He laid a hand on you, so you proceed to escalate to nuclear war. Your scuffle with Petrov attracts a lot of noise. Some very pale women come out from the back of the store.\n“What going on Petrov? Is this another customer?” one of them asks.\n“Get back to room Anastasia! All of you!” Petrov shouts. He now looks worried. You seemed to have discovered why his place is so popular now. He’s running a whore house in back. He panics and runs for something in a nearby drawer, you tackle him before he can reach it though. You reach into the drawer instead and pull out some pistol with weird writing on it.\n\n“I trust these work the same way here as they do back in the old county eh comrade?” you say pointing it at him.\n\nPetrov and his pale ladies are all taken into custody and you’re cheered for stopping the “Secret Soviet Invasion” this pisses Jim off something fierce, feeling he was once again cheated out of glory that was his. Being a town hero allows you to get alcohol for free, meaning there’s no need to get a job anymore since that was all you ever spent your money on anyway. Tina still rags on you about being a lazy bastard, but doesn’t do anything.\n\nShe IS getting to fuck a hero after all…\n","page 84":"Well this is a pretty easy job you think, just direct some lonely losers to the back and kick ass if they step out of line. Petrov actually isn’t too bad either, other than his continued murder of the English language; he’s become slightly friendlier to you.\n\nWould’ve been a nice set up too, had Big Jim not called the cops on the place. Since you never came back, he thought Petrov must’ve done something to you, listed you as missing in action and decided more drastic actions needed to be taken. When the sheriff arrived he had all his boys armed and ready for some sort of showdown, but of course when they raided the place all they found were a bunch of Johns, whores and you. (Somehow Petrov evaded capture) You’re placed in the foul smelling holding cell. You attempt to get Tina to bail you out, but she gets pissed off at you instead.\n\n“You fuckin’ moron! You can’t be a bouncer at my strip club to be closer to me, but you can be one at some second rate whore house? What, were you getting paid in blowjobs by the skanks there? Fuck you Mel! Rot in fuckin’ jail!” she says and storms off. Others in the cell snicker to themselves as you scowl at them and prepare for a night of sleeping on a hard bench trying to ignore the piss smell that pervades the cell.\n\nNo pussy, no beer, and you’re in jail. Today fucking sucked.\n","page 83":"“Hey Petrov, I gotta leave for a split second, I’ll be right back!”\n“Very well, but hurry up. Customers be here soon, and I have hard time working as greeter and looker after of girls in back… Anastasia! Make sure you have on nurse outfit on!”\n\nYou hurry out the door and go report to Jim. He seems a little less mad though.\n\n“Is that all? Here I thought people were taking their broken shit to him, but it turns out they aren’t and business is just slow. He’s just running a whore house right?”\n“Well as far as I know, he’s not repairing anything in there.”\n“Fuck it then, its not cutting into my business. Nuthin’ wrong with whores. Hell it even sounds down right capitalist. Glad to see not all those (COUGH!) ex-soviets are still trying to cling to the old commie ways. Makes me proud that I killed all (COUGH!) those red bastards in the war. I knew we were fuckin’ right! Well here’s your money.” Jim says and hands over some cash.\n\nWith your new found wealth you decide to go buy your favorite alcoholic beverage, which would include anything that you can get a lot of for cheap, and head home. You proceed to get loaded and watch bad science fiction with women dressed in latex space suits. Tina comes home and begins the interrogation.\n\n“So did you get a job today?”\n“Yeah! (hic!) I had to do some James Bond shit for Big Jim. He thought Petrov was running a repair shop, but it turns out (hic!) he was just running a whore house! Hahaha! (hic!)”\n“What?! That’s not fucking funny! No wonder there’s been less people coming into the strip club! Those cheap commie whores have been taking all our business! Fuck that. That shit ain’t flying. Gimme that!” Tina takes the bottle of liquor from your hand, and your truck keys.\n“Where you goin’ baby?”\n“I’m gonna fuckin’ firebomb that commie cathouse!” Tina says and slams the door.\n“Hey (hic!) pick up some more beer on the way back!”\n","page 121":"You immediately wade through the crowd of horny morons and grab frat boy by the scruff of the neck, like a dirty stray cat. He immediately let’s go of Tina. As you drag him out, he attempts to struggle, but his lack of coordination due to the alcohol only results in him flailing about helplessly like a little girl. You throw him on the ground outside, at which point he stumbles to get up.\n\n“Hey what’s you’re problem motherfucker?! I’m just tryin’ to get a fuckin’ lap dance!”\n“Yeah well not from her and not today! Now you best just get your rich boy ass outta here, before I forget that I’m not suppose to kill you.”\n“You fuckin’ ignorant redneck! I payed good money to get in there! You can’t treat me this way! I got lawyers! I’ll sue this place! And I’ll have you thrown in jail for assault and battery!”\n“You done boy? Good, because I haven’t battered you.”\nYou immediately punch him in the face taking him down for the count.\n“Now I’ve battered you bitch.” You say and spit on his unconscious body before going back into the club.\n\nUnfortunately during your absence the rest of the club seems to have gone into testosterone overdrive, you see Tina and couple of other strippers have taken to beating back the animals with chairs.\n\n“MEL! Get your ass in here NOW!” you hear Tina scream.\n\nThere’s too many of them so you come up with an idea. You grab some bourbon by the bar (And take a swig, you just realized you haven’t had drink today) and begin pouring it on one of the tables and the floor, you then light it on fire.\n\nThis sudden act of arson has caught the attention of all involved which results in then running around like chickens with their heads cut off until the dumb shits realize they should be running to the exit. One moron tries to put the fire out by dumping more whiskey on it, which only makes it worse. Luckily Tina and the rest of the girls run out the back exit. You meet up with Tina outside as the strip club goes up in flames.\n\n“You stupid fucker! What the hell did you do that for? Now where am I supposed to work?” Tina shouts at you.\n“Beer and Breasts over on the other side of town?” you say.\n“Yeah right! I wouldn’t make the same amount of money there! You really fuckin’ screwed the pooch on this one you asshole!”\n“Oh fuck, I was trying to save your cock teasing ass! Besides after I kicked the shit out the frat boy, he probably would’ve sued the place anyway, now he won’t be able too.”\n“And that makes everything okay? Great, now I gotta get up early and drive down to Beer and Breasts to apply there before all the other out of work sluts here do! You can forget about any pussy tonight!”\n\nNo pussy, and only one drink of alcohol. Geez today sucked…well at least you kicked someone’s ass.\n","page 120":"Goddamn right kick his ass! Like there was any other fucking choice?\n\nYou immediately wade through the crowd of horny bastards and punch the date rapist in training in the back of his head; he immediately lets her go and falls to the ground.\n“Mel!” Tina shouts as the crowd backs off.\nYou kick him a couple of times in the stomach, as he gasps for air, you pick him up like a rag doll and slam his head into the table, causing a gash that bleeds profusely. You then proceed to beat his face in. He seems to be trying to say something like “Stop.” Or “please” but its coming out garbled due to the blood and teeth floating around in his mouth. Doesn’t matter since you aren’t listening anyway.\n\n“MEL! Stop you’re going to kill him!” Tina screams and tries to pull you away.\n\nErm…too late.\n\nOrdinarily beating a man to death in front of several witnesses in a public place would result in severe legal trouble, but things work a little different in small towns…\nFirst thing you do is threaten every guy there that saw what happened that they better not say shit. Most of them are either too afraid of you or don’t care at all. College boy wasn’t even a local. He was one of those rich city folk that acted like an arrogant fuck, talking down to everyone. He isn’t very sympathetic. Hell it’s amazing he didn’t get killed sooner. The strippers didn’t care for him either so no problems there. The only one who you are concerned about is the DJ since he’s not exactly a good ‘ol boy. However, it seems he’s been zonked out on XTC the whole time this happened, so he isn’t even aware he’s even on earth, let alone what’s happened.\n\nWell it’s still YOUR mess, so the clean up is still your problem, but a trip to the nearby woods and a shovel takes care of that. You don’t get home until the morning where Tina’s been worrying about you. You tell her to relax and fall asleep on the bed\n\nAnd the whole event passes without incident. You don’t work at the strip club anymore though. (The owner felt you’re too “volatile”) There’s some others college boys that come looking for there friend, but the sheriff doesn’t put too much time into looking for some damn rich kid. They all oughta stay outta the town anyway. Don’t need those types around causing trouble.\n\nAnd life continues as normal for you. (Though Tina’s a little more enamored with you now by the fact you killed a man for her)\n\nIsn’t life in a small town wonderful?\n","page 6":"You leave the trailer, there ain’t no way you’re gonna listen to her bitch at you, but you’ll be damned if you’re going to get a real job! You decide to go over to your “friend” Dan’s trailer. Maybe he’s got some scam going on that you can get in on, make some money, and get Tina off your ass for awhile.\nYou knock on the door, and Dan almost opens it immediately. He’s obviously high already, he’s still got white powder on his nose.\n“Oh hey Mel! What’s going on? You want some toot? Want some snoot? Want some speed? Huh? Huh? Huh? Huh?” he rattles off while hitting you in the shoulder.\n“Shut the fuck up!” you say slapping him. “Shit Dan, you’re fuckin’ hopeless. Anyway, Tina’s bitchin’ at me to get a job an’ seeing as I don’t want to do any real work, I was wondering if you got anything going on, but I can see that you’re in no condition to do anything.”\n“Are you fuckin’ kiddin’ me Mel? Hell I feel like I can do fifty things right now! I was just gonna go down to Big Jim’s and try to rip him off, you could come help me do that!”\n“Dan, you’re gonna get your brains blown out like thatt, you better cancel that plan. Even I’m not gonna try to rip off a crazy, heavily armed, pissed off Vietnam vet.”\n“Well maybe we could try a different place, but I was thinking…”\n“You were? Will wonders ever fuckin’ cease? Well spit it out!”\n“Well you know ol’ Sam runs his meth lab from his trailer right?”\n“I guess you’d know better than I would, bein’ the junkie an’ all.”\n“Well he says he needs some help keeping his more excitable customers in line.”\n“What the fuck kind of drug dealer is he? Shouldn’t he just have shot anyone giving him problems?”\n“No, no, no! Sam’s a peaceful guy, he doesn’t really want any trouble, he’s only in the drug game because he doesn’t want a real job either, but he has a hard time dealing with the less glamorous lifestyle of the drug game.”\n“There’s a glamorous side? He lives in a fuckin’ trailer park like the rest of us. The guy’s not fuckin’ Tony Montana!”\n“Well anyway, he said he needed some help with crowd control, so we could go do that.”\n“Hmmm, I think what you mean is I’LL help with crowd control and YOU’LL be ripping him off while he isn’t looking.” You say cutting through the bullshit.\n“Well yeah, something like that.”\n","page 19":"“Aw come on Joe, what about that time I helped throw out those angry road workers?”\n“You were the fucker that got ‘em mad in the first place!”\n“Okay how about that time I kept your wife from finding out that you were cheating on her with another woman?”\n“You dipshit, you fucking gave me away by telling your girlfriend Tina who then later told my fucking wife!”\n”Hey now that wasn’t my fault, your mistress tried to steal Tina’s act at the strip club. The bitch had it coming.”\n“Mel, you’re not exactly convincing me here as to why I should allow you to sponge beer from me.”\n\nDesperate times come for desperate measures, and your not afraid to go that extra step.\n\n“Alright how about I NOT expose that particular bit of information about you, and you KNOW what I’m talking about Joe.”\nThe rest of the bar patrons suddenly stop and listen more intently. Joe looks at you with more intensity.\n“Shit Mel, that’s not fuckin’ fair! You can’t hold that over me forever!”\n“I can and I will! Now line ‘em up Joe! One Bourbon, one Scotch, one beer! Ha ha!”\n\nJoe grudgingly starts pouring you drinks; you can feel the hatred though.\n\nYou spend the rest of the night whooping it up with the rest of the drunks, eventually you get into a stupid argument with one of the barflies.\n\n“An (hic!) I’m tellin’ you! That (hic!) General fuckin’ Lee was my goddamn (hic!) great great great (hic!)….great….(hic!) grandfather!” you say proudly.\n“You’re fulla sh (hic!) fulla shit Mel! He probably was a fuckin’ Yankee! Har har har har!”\n“You better (hic!) fuckin’ take that fuckin’ (hic!) back!” you warn.\n“Oh okay there Mel! (hic!) Wouldn’t want you to (hic!) get all General Sherman on us! (hic!) ha ha ha!”\n\nThere’s NO WAY you can let that insult pass! You immediately punch the bastard out, and he goes down like a two dollar whore on Friday night. While you stand over your opponent and laughing at the fact that he’s lying in an unconscious heap, Joe has had enough of you.\n\n“Alright Mel, you’ve worn out your fuckin’ welcome here, go the fuck home!”\n","page 145":"Well, he’s not going to shut up until you help him and you don’t feel like hearing Tina bitching at you for not bringing in any money, so…\n\n“Alright, alright shut the fuck up! Where is he?”\n“He hopped under that table.”\n\nYou look around and grab the box from Bobby and try to sneak up on the frog. You attempt to lunge at it, but it deftly leaps out your way as you smash your head again against the table. In your dazed state the frog jumps in your face, and then flicks his tongue at you mockingly, before hopping off again.\n\n“Why you miserable little fucking… BUG SNIPER!” you shout in frustration. You end up chasing the little green bastard all over the house until you finally trap him in the closet.\n“Get him out! I have to put him back in the box!” Bobby whines.\n“No! Leave it the fuck in there! I ain’t risking chasing it all over the damn place again! You can get him out later when I’m far, far away from this fuckin’ place!” you say and grab yourself another beer. You go back to watching the game, but Bobby still won’t leave you alone, and is now asking you countless questions about what you’re watching.\n\nYou know how to put an end to this…\n\n“Hey kid wanna beer?”\n“What?”\n“Well if you’re gonna be a big boy and watching the game, you gotta drink beer!”\n“But Mommy says I’m not old enough.”\n\nYou find it weird that she has no problems with leaving her kid with a complete stranger though.\n\n“Nonsense! Here ya go! Drink! It’s never too early to start! That’s what my dad always said…um when he was sober that is.” You then hand Bobby some beer.\n\nWell it doesn’t take long for little Bobby to start feeling pretty good, a couple more beers later and he’s out like a light on the sofa, leaving you in peace for the remainder of the night. When his mother gets home you collect your money and leave.\n\nYou get home and Tina’s already there. You flash the money you made at her in an “I told you so.” kind of way. She’s unimpressed by your antics, but since you did gooder, you’re allowed to fuck her.\n\nAnd really that’s all that’s important.\n","page 5":"You have no desire to go get a job, but you decide you\u0027d better make the effort. Tina suggests that you could go to Billy Ray\u0027s Burgers since he\u0027s always hiring, but you\u0027re loathed to work in that shithole.\n\nMaybe you should try the Big Jim\u0027s Repair Shop, though you don\u0027t really want to work for that miserable bastard either.\n\nYour cousin Clem always said you could help him with his Pig Farm, but you\u0027re not sure if you want to put up with his wife. You already have to deal with one bitch at home, you don\u0027t feel like dealing with one at work too.\n\nSpeaking of which, Tina also suggests that they need a new bouncer at her strip club, Kitty City. Wow, working with your girlfriend, joy joy joy...\n\nOf course there\u0027s always odd jobs you could do around the trailer park and pick up metal scraps to sell to the junkyard, the problem there is trying to make enough money doing it to appease Tina.\n","page 144":"You go to the refrigerator, grab all the beer you can and then head towards the front door.\n“Where are you gowing?”\n“Fuck this, kid. You’re on your own. I didn’t sign up to be a fuckin’ zoo keeper.” You say and leave.\n\nYou go home and drink yourself into a stupor as usual. Tina gets home and sighs, she decides to go straight to bed, but before she does, you ask her a ground breaking question.\n\n“Hey (hic!) baby! You ever want (hic!) kids?”\n“Are you fuckin’ kidding me? Fuck no! I’d be the one doing all the fucking work! What the hell would you do? Teach the kid how to be a lazy slob who drinks all fuckin’ day?”\n“(Hic!) Okay one less thing for me to (hic!) worry ‘bout.”\n","page 8":"Well it’s not much better than Billy’s, but at least you won’t have to put up with teenage co-workers.\n\nYou head over to Jim’s and enter his dank, dark repair shop. A large American Flag adorns the wall right along side a Confederate one. Various weapons are mounted on the walls, probably already loaded and fully functional. Johnny Cash can be heard faintly in the shop and the place reeks of WD-40, smoke and fused metal. Jim doesn’t repair shit so much as he just fiddles with it until it somehow works. You hear the squeaking of wheels and see a billow of smoke…”Big” Jim comes from out from his office and there he is, in all his legless, chain smoking, wheelchair glory.\n\n“Goddammit Mel, what the fuck do you want?” he shouts at you.\n“I want a fucking job, you mean old bastard! Why the hell is it so empty in here?”\n“That fucking commie bastard Petrov down the street opened up a repair place down the street, so people are going there now! Can you fucking believe that shit? I’m a fucking (COUGH COUGH!) war hero!”\n“Yeah, well maybe if this place didn’t look like a fucking dungeon, people might want to actually come in here.”\n“Motherfucker I spent a year in a fucking tiger pit with no goddamn sunlight, my eyes never got accustomed to bright light after that! I’d like to see how long you would’ve lasted in the bush against Charlie!” Jim says wheeling up to you and poking you in the chest.\n“What going on down there!?” you hear a higher pitched voice come from the upstairs living area of the shop.\n“Nevermind Mei Mei! Go back to your fuckin’ cleaning!”\n“Fuck you, you legless American pig!”\n“I bet you wished you hadn’t saved her from that village now, eh? So I guess with business being slow, you aren’t hiring?”\n“Thing aren’t that bad, and as much as I’m loathed to admit I could use some help and you just might come in handy. You can either help me repair shit around here, or (COUGH!) perhaps you’d like to go on a little mission for me.”\n","page 7":"You head to that shithole of a place called Billy Ray’s Burgers. The place stinks like a combination of rotting old road kill that’s been sitting in the sun for two days and bad flowery air freshener that is failing miserably to cover the previously mentioned smell. The place should’ve been closed down years ago, but people can’t seem to get enough of rat meat. You enter and head for the counter.\n\n“Hey zit face, where the fuck’s that fat ass Billy Ray?” you shout at some teen working at the register.\n“Erm I dunno dude.” he says nervously.\n“You’re fucking more useless than tits on a bull boy! Are you what passes as management material?”\n“Mel what the fuck do you want? Stop harassing my employees.” Billy Ray says coming in. Billy Ray looks like a walking slab of lard that makes up the majority of his own burgers. You have no idea why people want to work for this fat ass so bad, let alone how he even gets jailbait to fawn all over him. Perhaps he has some mutant ability to control people’s minds.\n\n“Gimme a fuckin’ job in this shithole!” you say.\n“Heh heh! Tina’s on your non-working ass again eh? Well you’re in luck, I got some positions available, but first you have to fill out these forms. Billy Ray gives you a shitload of paper work to fill out.\n\n“What?! You fuckin’ know me! Why the hell do I have to waste my time filling out stupid ass forms?”\n“Rules are rules, Mel.” Billy Ray says.\n","page 2":"As you get up, you see Tina enter the room, she\u0027s just got out of the shower and looks fucking hot with her skimpy bathrobe on that barely covers her ass. You got a big pink boner that\u0027s standing as high as your fucking mullet just looking at her.\n\nYou certainly lucked out when you managed to snag the ex-head cheerleader of Oakwood High. And its really a good thing she turned 18 soon after you fucked her. There\u0027s still laws in this state against 30 year olds engaging in that sort of behavior if he hasn\u0027t married her or at least is her cousin.\n\nYou go up and start groping her chest and attempt to kiss her, she slaps you away.\n\n\"What the fuck are you doing? I ain\u0027t in the mood for that shit! I just took a fucking shower and I don\u0027t feel like taking another one after your smelly ass lays on top of me!\"\n\"Well fuck, you can be on top then.\"\n\"Yeah like I was last night, doing all the fucking work as usual! You ain\u0027t getting shit until you get a fucking job!\"\n","page 149":"There’s no way you’re going to cut some back yard that probably hasn’t been cut in decades, and suffer the damn creatures probably living in it now. You pick the garage.\n\n“Okay, you go and clean everything out of there, and put everything in bags for the garbage man to come pick up. Now scoot scoot!” the old lady says and closes the door.\n\nYou go to the garage beside the house where you see a ton of trash bags have been conveniently left for you. You slide the big garage door open and see a mountain of items in a big heap. Some of the stuff looks like its been here for over fifty years. You still have cats giving you the evil eye.\n\nYou begin to dig through the pile of trash and throwing it in the bags. Its dull, mindless work, until you come across something shiny…\n\n“Shitfire! Its gold!” you say to yourself.\n\nIt’s a golden candle stick to be precise. You know a pawn shop that would pay a lot of money for this! You look around and don’t’ see anybody passing by; you ponder if you should just take off.\n","page 1":"Might as well start the day off with a good liquid breakfast! You go to the fridge and don\u0027t see any form of alcoholic beverage.\n\n\"Where the fuck is the beer?!\"\n\"Your alcoholic ass drank all of it last night! Drink the goddamn milk instead!\"\n\nYou grumble and begin to drink the milk and promptly puke it up in the sink when it comes out in gray clumps.\n\n\"FUCK! No fuckin\u0027 beer, expired milk, don\u0027t you ever go shopping?\"\n\"You\u0027re not fuckin\u0027 crippled, why don\u0027t you go do it!?\" Tina says walking into the kitchen.\n\n\"Because I\u0027M too busy looking for a fuckin\u0027 job all the time that\u0027s why!\" you say and then shove your tongue in her mouth.\n\"EWWWWWW! Your breath stinks like rotten milk! At least brush your teeth before doing that! God you\u0027re a fucking dick!\"\n\"Oh you know you like it!\" you say grabbing her ass. Tina leaves your hand there, but it doesn\u0027t stop her from yelling at you some more.\n\n\"You better be getting a job today! I\u0027m sick of being the only one who works in this trailer, while YOU stay up all night and sleep all damn day!\"\n\"Since when is shaking your tits and ass while strangers throw money at you work?\"\n\"Fuck you! MY stripping pays the bills! You better start pulling your weight around here, I\u0027m serious!\"\n\"Yeah, yeah.\" you say.\n","page 148":"Well at least you know what lies ahead of you with cutting the grass. That is until you see the fucking jungle that’s her backyard. The grass is so high you couldn’t cut this with a lawnmower even if you’d had the forethought to bring the one you don’t have. There’s a wicked looking scythe nearby though, which is what you’re going to have to use to cut this mess down.\n\nYou grab the scythe as more little furry beasts watch your every move. You begin to swing, putting a dent in the overgrowth, and covering yourself in cut grass. Still, you’re already getting a sore back and you’re not even half way done, not to mention the creatures you’ve been stirring up aren’t too pleased about you destroying their home. Spiders, small snakes and other venomous creatures have bitten you many times, fortunately the damage you’ve done to yourself with alcohol over the years, makes you pretty much immune to their poison.\n\nStill, you aren’t feeling too swift at this point, you’re about to take a break and sit down, when again you feel the piecing eyes of the cats watching you again.\n","page 4":"You get up for awhile then go back to sleep on the couch after kicking the potato chip bags onto the floor.\n\n\"Mel, I know you aren\u0027t going back to fucking sleep! I told your ass to get the fuck up!\" Tina shouts.\n\"Goddammit Tina its a fucking weekend, there ain\u0027t no places hiring today.\"\n\nTina can\u0027t believe that even YOU would say something so obviously wrong and idiotic.\n\n\"Mel, if you don\u0027t get your lazy ass up and go look for a job this fucking minute, there WILL be consequences for disobeying me!\"\n","page 3":"The stench you\u0027re giving off is even too much for you, so you go to what passes for a bathroom in your trailer.\n\n\"Goddamn it Tina, why the fuck is your underwear all over the fucking place!?\" you say as your nearly strangle yourself walking into one of the clothes lines hanging in the room.\n\"How else am I suppose to dry them? The last time I hung them out to dry outside some fucking pervert stole them!\"\n\nYou fight your way through the lines and get into the shower. Unfortunately Tina has already used up all the hot water so you freeze your dick off attempting to wash yourself. Then its apparent that she\u0027s used up all the towels as well, so you make do and dry off with her underwear. Then finally you take a giant shit in the toilet, clogging it up.\n\n\"Hey Mel, open up I gotta use the bathroom and I left my tampons in there!\" Tina says.\n\"All yours!\" you come out and say with a big grin and smacking her ass.\n\nTina takes one look at the bathroom and says \"EWWWWWWW! You nasty inconsiderate fucker! You used my underwear to dry your body with and left a big stinking turd in the toilet! Ugh! The health department would have to clean this up!\"\n\"Hey you used up all the fucking hot water and didn\u0027t leave any towels!\"\n\"You stupid asshole, you ever think to look in the cabinet here instead of using my underwear?\" Tina says opening it up displaying tons of towels.\n\n\"Well you still used up all the hot water!\" you say.\n\"You better go find a job today after pulling this shit! I\u0027m tired of having to support us on my good looks! I\u0027m out there busting my ass dancing while you fucking goof off all fucking day getting drunk with your low life friends!\"\n\"Yeah, yeah\" you say.\n","page 11":"“Aw hell Tina, I don’t need no regular job! There’s plenty o’ jobs I can do for people around the trailer park an’ hell there’s always metal shit lying around that I could collect an’ take to scrapyard!”\n“Way to reach for those stars Mel. NO! You can’t make a living doing that shit!”\n“The hell I can’t! Sides’ it’s still bringing in money.”\n“Yeah, enough to buy more beer! (Sigh) Why do I even fuckin’ bother? Oh fuck it; at least you’re doing something, but you better at least bring in enough money for this months rent!”\n“Yeah, yeah.” You say and leave.\n\nAs you scratch your ass and look out at the trailer park wasteland that you live in you ponder your next move. You wonder whether you should help any of these motherfuckers here at all. None of them have ever helped you, let alone even like you. Not to mention you’ll have to put up with their bullshit. At least collecting scrap metal doesn’t require you to deal with anyone else, but the question whether or not you’ll even collect enough shit to make more than a few bucks, plus there’s gas money you’re actually spending in order to drive your truck around looking for scrap.\n\nAnd you can’t do both, its far too late in the day now for that, even if you were so inclined to do so.\n","page 99":"“Okay go ahead.” You say. Hey anything that’s results in you not doing any work is fine by you. Suzy smiles at you and takes the rotten food from your hand. She “accidently” drops some of it, and then bends over to pick it up...\n\n“Goddamn. The girl certainly grew up in a fuckin’ hurry.” You say to yourself quietly. She notices you noticing the view and proceeds to the hogs where she climbs up on the fence and begins to do some sort of weird movements that catch their attention. They begin to settle down and just watch her moving like some sort of fuckin’ acrobat on the fence railing. She rubs the rotten food up and down her body and begins moaning. She now has YOUR attention as well. You and the pigs are hypnotically entranced by Suzy’s display. Then she throws the food in the pen, jumps off the fence and begins throwing more food in, without the pigs getting all excited.\n\n“See cousin Mel? You just gotta know how to treat them.” She says with a smile. You gotta admit that’s the first time you’ve ever seen something like THAT before.\n“Well that was certainly interesting.”\nSuzy shrugs. “Meh, I do that all the time. I have a hard time relieving the boredom of this hog heaven. I wished I lived in a big city like you!”\n“Eh contrary to popular belief I don’t live in fuckin’ Dallas!”\n“Whatever, anything would be better than is boonies shit. (Sigh) I want to do things you know? With people!”\n“That’s funny, I can’t stand doing things with people”\n“Well maybe you’re not doing the right things with the right people.” Suzy says getting closer to you.\n“Yeah I guess.” You reply barely being able to keep your eyes on her face.\n“I remember you though; you visited a couple times when I was little. I remember how I tried to sit on your lap and you pushed me off. I bet you wouldn’t be that mean to me now, would you?” Suzy says doing her best to try to look innocent.\n“Dunno, the day’s not over.” You say in an attempt to deflect her advances, she only seems more enticed by your bad ass attitude though.\n“So Cousin Mel is there anything ELSE you’d like to know about this dull farm?” she says approaching you.\n“Erm yeah, so now that they’re fed, what else should I do?”\n“Well, there are more pigs you know, so you could go feed them too, or you could help me in the barn.”\n\nYou’re starting to have some very filthy thoughts, which are just wrong on SO many levels…\n","page 10":"The instant you say you’ll work at the strip club, Tina’s eyes light up. She immediately hugs you and starts kissing on you.\n“Oh Mel! We’ll be working at the same place! That means we’ll be spending more time together! We’ll be able to see each other all the time now!”\n\nTina says this as if it’s a good thing; then again she’s showering you with a lot of affection, so maybe it is… of course her blowing you in the truck as you were driving there might not have been such a good idea (Although it SEEMED like a good idea at the time!), since you lose fucking control of it at “happy time” and nearly hit a blind child. Fortunately you manage to swerve and merely graze some fat fuck and run over a cat.\n\nWhen you and Tina arrive at the club, the place isn’t very full, but it’s still early. Old Motley Crew songs blast throughout the place along with various other great heavy metal hair bands of the 80s, even though the DJ looks like he was born in the ass end of that wonderful era when mullets were praised and not scorned. Just looking at the skinny young punk’s shitty Fem \u0026 Em dyed blond hair cut makes you sick and all his fucking face piercing leaves you shaking your head wondering about the youth of today. You don’t even want to comment about his pants sagging half off his ass.\n\nSpeaking of the youth of today, Tina comes back from talking to the owner of the place. She says they actually have two job openings now. Apparently the bartender was fired for jerking off on the job. The crazy fucker started whacking it right then and there. Needless to say that’s not someone they wanted handling the drinks.\n\nWell you don’t know shit about bartending, but you have been around alcohol all your life! Should certainly qualify you to some degree. The bouncer job is still available of course if you want something less “intellectually” stimulating.\n","page 13":"“Come on baby, my dick ain’t gonna suck itself.”\n“Yeah well I ain’t doin’ it either right now.”\n“Dammit I got NEEDS woman! What the fuck do you want me to do? Go in the bathroom and jack off?”\n“Wouldn’t be the first time.”\n\"Just give it up already; you know you want my massive man missile inside you as much as I do.” You say making a bad attempt at seduction.\n“Massive Man…? Where the hell do you come up with this shit? You actually think that’s gonna make me wet?”\n“No, but this will.”\nYou quickly go over to your CD player and shove in “Night Ranger’s Greatest Hits” and cue up “Sister Christian”.\n\n“Remember this baby? When I first brought you here and we first fucked? An’ how I bent you over that kitchen table and you said you never felt like that before?”\n“Yeah, because there was fucking dried bread crumbs embedded in my tits afterwards.”\n“Aw come on honey, you know you had fun…it was a special time for both of us.”\n“Well, you did carry me over to the bed later.”\n“Of course, because you’re sexier than Jenna Jameson and Traci Lords combined. You’re so fuckin’ small, an’ firm, an’ tight…” You begin to kiss her, and she responds appropriately, the music seems to be working too\n“Mmmm, I like it when you sweet talk me like that.” She says grinding up against you.\n“You know what else is sweet? Your pussy juices. Baby your juices are sweet enough to kill a diabetic!”\n“OH MEL! Take me now!” she screams jumping on you and pulling you onto the bed at the same time!\n\nYou and Tina immediately strip off each other’s clothing and begin to engage in red hot redneck love. You begin munching on her rug so good that you would put lesbian gym teacher to shame. Tina returns the favor by slobbering on your dick like it was a fuckin’ meat lollipop and she was trying to get to the center without biting. You being the gentleman that you are decide not to give her a protein shake today and instead turn her around and start ramming her from behind like an insane Panamanian mental patient that’s been locked up in solitary confinement for thirty years. She’s loving every minute of it. She feels like some farm animal being violated by a curious young farm boy who is experimenting with interspecies sex for the first time. She begins to switch positions with a movement so quick that you don’t even realize it until, she’s got her big tits in your face and is looking downward at you as her pussy envelops your dick in an up and down manner. God she’s so fuckin’ flexible, you\u0027re spinning her on your dick like a fucking little toy. As the vibrations in both of your bodies rival those of earthquake tremors, you and her suddenly climax, let out a yell of ecstasy and collapse on the bed together.\n“Oh Mel. Shit. That was fucking wonderful.” She says panting and attempts to cuddle with you.\n“Zzzzzzzzzz…” you reply, but you don’t push her away mainly since you’re in a deep sleep already.\n\nLater Tina goes to work and lets you sleep. You wake up later and waste the day watching sports, porn, and predictable sitcoms.\n\nCongratulations, your cocksmanship has allowed you to avoid getting a job!\n","page 12":"You have no desire to go get a job, but you decide you\u0027d better make the effort. Tina suggests that you could go to Billy Ray\u0027s Burgers since he\u0027s always hiring, but you\u0027re loathed to work in that shithole.\n\nMaybe you should try the Big Jim\u0027s Repair Shop, though you don\u0027t really want to work for that miserable bastard either.\n\nYour cousin Clem always said you could help him with his Pig Farm, but you\u0027re not sure if you want to put up with his wife. You already have to deal with one bitch at home, you don\u0027t feel like dealing with one at work too.\n\nSpeaking of which, Tina also suggests that they need a new bouncer at her strip club, Kitty City. Wow, working with your girlfriend, joy joy joy...\n\nOf course there\u0027s always odd jobs you could do around the trailer park and pick up metal scraps to sell to the junkyard, the problem there is trying to make enough money doing it to appease Tina.\n","page 15":"Well one sure way of getting you to do something, is telling you NOT to do it. You leave the trailer to go get drunk with your low life friends. You’re not gonna let Tina tell you what you can and can’t do! Of course there are two problems with this act of rebellion.\n\nFirst of all you don’t have any money, at least not enough to get suitably drunk. The second thing is, the lowlifes you know aren’t actually your friends so much as they’re just dregs of society that hang out at the bar all day. Still that’s not going to stop you from attempting to get them to buy you beer.\n\nYou drive over to Joe’s Bar, it’s not much, but its one of the few places that you’re still allowed at. You walk in and The Rolling Stones are playing on the jukebox, there’s a boxing match on the TV, and the place is devoid hope. Ah, you love this place!\n\n“Mel, get your broke ass outta here!” Joe yells when he sees you.\n“Fuck Joe, what the hell’s your problem? You on the rag or some shit?”\n“Ha ha. My problem is when you come in here, you don’t pay for shit! You’ve run up a fuckin’ tab, that you haven’t paid still!”\n\n“Har har har har!” the barflies start to laugh in unison.\n\nWell you better start doing some convincing if you want to stay here.\n","page 9":"You don’t particularly care for Clem, let alone his fat bitch wife Bertha, but if you have to work, might as well be for family. You get in your truck and prepare yourself for a family reunion of sorts. On your way there, you just realized you’ll have to put up with his retard son and his bratty daughter as well. Fuck! Well it’s been awhile since you’ve seen them, so maybe his daughter isn’t a brat anymore; of course his son is most likely still a retard.\n\nYou eventually get to Clem’s pig farm. Clem sees you and greets you with a bear crushing hug. He’s dressed in overalls and boots. He REEKS of month old pig shit and entrails and is covered in them as well.\n\n“Well howdy there Cousin Mel! What brings you out to these parts?”\n“Holy fuck Clem!” you say pushing him off of you. “You ever hear of a fuckin’ bath?”\n“Har har! Same ol’ citified Mel! That trailer park got you spoiled, with that indoor plummin’ I’ll tell you what! You still with that pretty li’l girl?”\n“Who, Tina? Yeah.”\n“Yeah, she is sweeeeeet! Too little for me though. I like that Y’know me I likes ‘em big. More cushin’ for the pushin’! Har Har Har!” Clem slaps you on the back at this point\n“Yeah, that’s great Clem, hey look you got something for me to do? I need a fuckin’ job.”\n“That a fact son? Well you are family and kin folk should always stick together. I got plenty of chores for you to do on this here farm. Question is, are you ready to do some work? Cause this ain’t like that BIG city you live in where you get dem dere lunch breaks.”\n“Yeah, I got it.”\n“Alright then, just so you know. So what do you want to do? You can go feed the hogs, or if yer got the stomach fer it, you can go slaughter the hogs.\n“Is there any job that doesn’t involve pigs?”\n“Haw Haw Haw! You got an interestin’ sense of humor there Mel! I always liked that about ya!” Clem laughs and slaps you on the back again.\n","page 14":"You have no desire to go get a job, but you decide you\u0027d better make the effort. Tina suggests that you could go to Billy Ray\u0027s Burgers since he\u0027s always hiring, but you\u0027re loathed to work in that shithole.\n\nMaybe you should try the Big Jim\u0027s Repair Shop, though you don\u0027t really want to work for that miserable bastard either.\n\nYour cousin Clem always said you could help him with his Pig Farm, but you\u0027re not sure if you want to put up with his wife. You already have to deal with one bitch at home, you don\u0027t feel like dealing with one at work too.\n\nSpeaking of which, Tina also suggests that they need a new bouncer at her strip club, Kitty City. Wow, working with your girlfriend, joy joy joy...\n\nOf course there\u0027s always odd jobs you could do around the trailer park and pick up metal scraps to sell to the junkyard, the problem there is trying to make enough money doing it to appease Tina.\n","page 17":"You know that was just idiotic. You could’ve at least made the appearance that you were going to get a job. You go through this argument all the time with her, it’s your routine. Tina probably wasn’t even expecting you’d look for a job, let alone keep one.\n\nHowever, just directly and openly disobeying her breaks that comfortable routine. She decides to break her routine of putting up with your shit. While you’re asleep Tina takes what little belongings you own and throws them outside in your truck, she then drives the truck in the middle of trailer park and sets it on fire and calmly re-enters the trailer.\n\nYou\u0027re awaken by the explosion and immediately go out to check.\n\nWhen you see your truck up in flame you try to rush back in your trailer to ask Tina what the hell is going on, but she\u0027s locked you out.\n\n\"TINA! Unlock the fuckin\u0027 door! Someone blew up my goddamn truck!\"\n\"No shit, sherlock! Maybe you can go get a job as a fuckin\u0027 dick, lord knows you\u0027ve got tons of experience! Now get the fuck outta here!\"\n\"TINA! Open this fuckin\u0027 door! If you don\u0027t I\u0027m gonna tear it off the fuckin\u0027 hinges!\"\n\nYou hear a click, and see Tina pointing your own shotgun at you from a window.\n\n\"If you don\u0027t get the fuck outta here, I\u0027m gonna release a slug that\u0027s gonna tear you a new asshole!\"\n\nYou have no choice but to back off. You make your way out of the trailer park as onlookers laugh and cook marshmallows by your still burning truck. You have no idea where to go. You don\u0027t even have a truck to sleep in.\n\nYou end up wandering the streets and eventually fall asleep by some garbage cans, like the trash you are.\n","page 16":"You have no desire to go get a job, but you decide you\u0027d better make the effort. Tina suggests that you could go to Billy Ray\u0027s Burgers since he\u0027s always hiring, but you\u0027re loathed to work in that shithole.\n\nMaybe you should try the Big Jim\u0027s Repair Shop, though you don\u0027t really want to work for that miserable bastard either.\n\nYour cousin Clem always said you could help him with his Pig Farm, but you\u0027re not sure if you want to put up with his wife. You already have to deal with one bitch at home, you don\u0027t feel like dealing with one at work too.\n\nSpeaking of which, Tina also suggests that they need a new bouncer at her strip club, Kitty City. Wow, working with your girlfriend, joy joy joy...\n\nOf course there\u0027s always odd jobs you could do around the trailer park and pick up metal scraps to sell to the junkyard, the problem there is trying to make enough money doing it to appease Tina.\n","page 91":"You make it a policy not to fight with overly strong retards with large hammers in their hands. You laugh it off.\n\n“Ha ha, hey Junior how about I bring you the pigs and you kill them then?”\n“OK! JUNIOR LIKE KILLIN’ BETTER ANYWAY.”\n\nYou and Junior switch places and things seem to work out better. It goes pretty quickly as well. You and Junior are done in no time.\n\n“THIS FIRST TIME FINISHED EARLY! YOU HELP GOOD.”\n“Well that’s why Clem hired me.”\nJunior wanders off; he apparently is heading towards the regular house. Looks like you got Junior to finally go home. You go find Clem; he’s overjoyed and gives you a bear hug.\n“Fuckin’ Christ, get the hell off me!”\n“Sorry Mel, it’s just dammit, I never thought he’d ever leave that place! His momma will be so happy to see ‘im! Here! Take this money! You earned it! Come back tomorrow! We always got more pigs!”\n“Yeah, I’ll do that Clem.” You say dismissively and get in your truck and drive off.\n\nYou go and pick up beer, cigarettes and porno magazines before you go back to your trailer. Tina comes home and sees you engaging in all three, still smelling of pig slaughter.\n\n“Well I can only guess you made some cash today, since you never stole any money out of my purse to buy all that shit. So what does Clem have you doing at the pig farm? It smells awful whatever the fuck it is, you killing the fucking things?”\n“Nah, just an assistant.”\n","page 90":"“Well you seem to be doing a good job at the killin’ bit, so I guess I’ll chop ‘em up. What do I do exactly?”\n“TAKE THIS! SPLIT PIGGIES OPEN AND REMOVE STUFF INSIDE!” Junior says handing you his big cleaver.\n“Erm Okay, but where do I throw away the stuff?”\n“NOT THROW AWAY! JUST PUT ASIDE! USE INSIDES FOR OTHER FOOD! SORT LATER!” Junior points agitatedly to a big table full of guts and other pig organs.\n“PUT REST OF PIGGY UP ON HOOKS!” Junior then points to some porkers on some wicked looking meat hooks.\n\nYou begin on the nearest dead pig and start slicing and hacking away, as Junior continues to bash the brains out of another pig. You’re still working on your first pig and Junior’s already killed five of them.\n\n“YOU TOO SLOW! LAZY!” Junior says getting agitated again that the bodies aren’t being chopped up as fast as he’s killing them.\n“Hey you got the easy job! Chopping these motherfuckers up takes more fuckin’ time than splitting their skulls open!”\nJunior didn’t quite make out all you said, but got the basic idea of it.\n“HM! YOU NEED TECH HELP ‘CAUSE YOU SLOW AND LAZY…HERE USE THIS!” Junior hands you a chainsaw, you look at the big stainless steel rotary blade in wonder. It’s almost like an extension of your dick.\n“Oh shit. Fuck yeah! This is what I’m talkin’ about!” you say and power up the chainsaw and begin carving up the swine and getting totally into it, until Junior starts to get irritated yet again.\n“YOU SLOPPY! YOU PAY ATTENTION! YOU CUTTIN’ UP PIGGY WRONG! RUINING MEAT!”\n\nJunior’s REALLY getting on your nerves at this point…\n","page 92":"“Oh fuck off retard! I’m not the fuckin’ facially deformed waste of flesh whose only talent is killing things that are just slightly less intelligent than him!”\nJunior didn’t quite catch all of what you said, but your hostile tone and the word “retard” was enough to trigger his rage.\n\n“NOT RETARD! JUST DIFFERENT! AAAAAGHH!” Junior screams and swings his hammer at you. You jump out of the way and run out of the door. Junior crashes through the door with his hammer, breaking it down completely. He’s in full pursuit of you.\n\nAs you run towards the truck, you run into Clem.\n“Well he’s out of the slaughter house, now get this big fucker off of me!” you say running past him, Clem sees Junior and attempts to stop him, but Junior’s too mad! He pushes his own Dad aside and continues after you! You run to your truck and know Junior’s behind you still and then you hear a gun shot. You turn around and see Junior on the ground holding on to his bloody leg wailing. Clem’s wife Bertha waddles over holding a smoking pistol.\n“Damn, thanks Bertha. I thought you hated me though.”\n“I do, and I was aiming for you! I know you were probably the one upset my boy!” Bertha goes over to check on Junior and begins cradling him. Clem comes walking up.\n“Shit Mel, why the hell you get him riled up like that?”\n“Me? I didn’t do shit! He’s the one trying to kill me!”\n“Yeah? Well he ain’t the only one!” Bertha shouts.\n“I think you better just leave Mel, I’m sorry to say, but you just ain’t welcome here no more. Stir up too much contro-versy you do.”\n“Oh fuck it then; I can’t stand this fuckin’ fucked up family anyway.”\n\nYou get in your truck angry as hell and drive home. No fuckin’ beer at home either to calm yourself down with, you attempt to compensate by smoking the left over cigarette butts on the floor, but its just not the same thing. Tina comes home, sees you pissed off and immediately lays down the law.\n“Alright here’s the deal, I know you’re pissed off, but don’t think you’re gonna be fucking me all damn night to get out your aggression. You got two hours to do what you gotta do and then I’m fuckin’ goin’ to bed!” Tina says.\n","page 95":"“Alright, alright! Fuck.” You say and start cutting a little cleaner, and scooping out the entrails. You figure you’ll let Junior put the damn things on the hooks since you aren’t about to break your back lifting these things. They’re too high for you to reach anyway.\n\nYou and Junior work with the squealing of pigs and the buzz of the chainsaw being the only sounds in the place. Junior makes no more comments to you other than a strange humming sound he seems to be muttering to himself. Suddenly after he kills his last pig he stops humming and heads into a back room and closes the door. You continue to cut up the pigs he killed. Of course with the chainsaw you’re done quicker than you normally would be. There aren’t any more pigs in here either save the big fat one that’s in the back pen. It hasn’t moved the whole time you’ve been here. You suspect it’s already dead. It does look kind of old. Well time to chop it up.\n\nYou enter the pen and rev up the chainsaw again. Man this pig is an ugly one; he’s only got one eye. You wonder how he got to be so old since the pigs around here are usually killed soon after they reach a certain age. You stop wondering when the other eye opens up!\n\n“GWWWEEEE!” The pig squeals and charges at you! You’re caught off guard and drop the chainsaw! It catches the side of the pig causing a wound, but doesn’t slow it from ramming you in the nuts, tossing you out of the pen. You go flying to back of the wall. Junior comes out of the back room with some weird pig mask on.\n\n“WHAT…” Junior looks over at the large pig which is lying down now squealing in pain. “YOU TRY HURT PET PIGGY!”\nYou hold your crotch in pain and slowly get up, “What the fuck? How the hell was I supposed to know? Ah shit my nuts!”\n“RAAAGH!” Junior shouts and picks something up in the back room he’s in. You hear the buzz of a saw…\n\n“Oh fuck!” You begin to run and Junior isn’t too far behind. You see Clem and run towards him.\n“Your son’s gone completely fuckin’ hog wild! Get the fuck outta here Clem!”\n\nClem attempts to stop Junior, thinking he’ll halt for him, but he’s met with a saw blade to the head! You just barely get to your truck and drive off but not before the side of it catches a long blade gash on it. He chases you for awhile, but eventually you lose him. You get to your trailer and start getting out your guns just in case, but you calm down a bit when you watch the news later.\n\n“…this is Arnold from WHIC News, and I’m in one of our choppers where I’ve just witnessed a big man with a large object, possibly a chainsaw, chasing what looks to be a small scantily clad woman. There looks to be two other bodies on the ground, one male and one grotesquely immense woman, either that its an abnormally large pig, in any case we have informed the police about…”\n\nTina comes home.\n“Well, I had a shitty day at work. What happened with you?”\n“Oh, I may have inadvertently caused a few less chairs at the dinner table for my next family reunion. Three to be exact…”\n\n“…OH MY GOD! Oh the humanity!” the news caster remarks.\n\n“…no wait make that four.”\n","page 96":"“Will you leave me the fuck alone? I know what the hell I’m doin’!” going back to chopping up the pig.\n“NO YOU DON’T!” Junior says and starts heading towards you.\n“Look you… oh shit!” you say turning around, but you accidentally hit Junior with the chainsaw!\n“AARRRGH!” Junior falls on the ground holding his stomach.\n“Shit, shit! Hold on I’ll get help!” you shout and go running to look for Clem.\n\nWhen you find Clem you tell him that Junior hurt himself really bad with the chainsaw, he gets very worried.\n“You just left him there!? You dumb shit!”\n“What the fuck, I ain’t a doctor! I figured you’d know what to do!”\n“Yeah, we gotta get him the hell outta there! He’s been killin’ pigs all his life; you got any idea what they’ll do to him now that they sense he’s vulnerable? They’ll kill him!”\n“What? You can’t be serious! Besides the pens are locked!”\n\nRegardless you and Clem run back to the slaughter house and are welcomed by a grisly site. Pen doors are broken off the hinges, and pigs are ripping Junior’s now lifeless body apart and gobbling it down. They look in your direction…\n\n“Just back away slowly Mel.” Clem says, as you both back off. Clem locks the door.\n“Aw shit, no. I dunno what I’m gonna tell Bertha!”\n“If I’d known they’d do that Clem…”\n“No, no it’s alright, it was an accident. It was bound to happen with as much time as Junior spent in there. (Sigh) This is really gonna hurt business though, Junior was really good at the job. Hey you don’t wanna take over do ya?”\n“No.” you say decisively. “So what about those pigs in there?”\n“Oh I’ll probably wait until night when they’re fast asleep and go in with my shot gun and kill ‘em all. No point in taking chances. The buckshot’s gonna ruin the meat though. Damn I’m takin a hit on this; I don’t think I can pay you. Shit, don’t take this the wrong way, but I should fuckin’ sue you, but I know you ain’t got nuthin!”\n\nYou can tell Clem’s getting madder, so you take this opportunity to leave before he changes his mind. You drive home thinking how lucky you were. You dodged a manslaughter charge AND a lawsuit. You only wish you had some money to celebrate appropriately. You decide to press your luck more and steal some beer out of the liquor store. Actually you just drink it right there in the store. Fortunately the store owner is more annoyed than angry and just throws you out instead of calling the cops. The joke’s on him though you managed to sneak out a bottle of Johnny Walker!\n\nBy the time Tina gets home, you’re feeling pretty good and wearing nothing but your underwear as Lynyrd Skynyrd plays loudly in the background.\n\n“Turn that fuckin’ shit down! So what’s the fuckin’ celebration? Or are you just getting’ blitzed again for no particular reason?”\nYou go up to Tina and begin grabbing on to her, and rubbing up against her in an obviously horny manner.\n“Baby, I just avoided three strikes and now I wanna hit a home fuckin’ run. Woo hoo!”\n","page 150":"“Fuck this, I’m taking a break for a little while.” You say and go sit down on the creaky back steps. The cats are annoyed that you’re sitting in an area they consider theirs. One of them begins to hiss at you, while a couple of more “talkative” ones meow at you in a disgruntled tone.\n\n“Fuck off furballs!” you say and begin shooing them away, all this does is anger them further. One sneaks up and bites the back of your leg. You attempt to back kick it, but it runs off before you can. Another cat jumps at your face, you just barely dodge it. You can see other cats coming out of the woodwork ready to pounce on you like a bunch of mini-tigers.\n\nYou slowly back off, still holding the scythe. You then run back to the trailer park as quickly as you can. The old crazy cat lady comes out of her house cackling again.\n\n“Hehehehehehehe! You can’t escape my pretties! My babies will harass you where ever you are in this town! Hehehehehehe!”\n\nWhen you get home you bar the door and get out your guns ready for an impeding cat attack. Tina gets really pissed off when you won’t let her in immediately when she gets home.\n\n“Mel open this goddamn door! I’m fuckin’ tired!”\n\nYou quickly let her in and slam the door and re-barricade it.\n\n“What the hell’s got you paranoid?”\n“That crazy cat bitch has got her army of evil cats after me! I’m gonna gun down the little bastards when they attack!”\n“What the fuck, are you smoking crack now? You better not be, because I’ll tolerate your drinking, but I ain’t putting up with drugs..”\n“I ain’t taking fuckin’ drugs! I haven’t even had a drink today!”\n“Then Mel, you have just lost your fuckin’ mind. You’re as crazy as that cat lady. I’m tired and going to bed but tomorrow you better knock this shit off, because I’m not living with you this way either.”\n\nTina goes off to bed, but you stay up all night waiting for an attack that never comes. Eventually you fall asleep in the wee hours of the morning and wake up in the middle of next day. Nothing happened. You were worried over nothing. Here you were thinking a bunch of cats were trying to get revenge and you’re fine. You go outside to get some fresh air. You step off the trailer stair and SQUISH…\n\nCat shit.\n","page 151":"You’re determined to get this over and done with so you can get back home and leave this fucking creepy place. You persevere on, ignoring the bugs, ignoring the snakes, and ignoring the cats. This single minded attitude that you usually save for sex and beer seems to also work well with work too! You’re finished a lot sooner than you expect. You’re covered in bites and grass and you still feel woozy, but you’re done. Even the cats aren’t staring at you anymore, and are engaging in usual feline behavior of sleeping, sitting and licking themselves.\n\nYou stagger back to the front door and ring the door bell again, the old lady answers.\n\n“Ah yes! My kitties told me you did a good job! That backyard hasn’t been cut in years! Hehehehe! Here’s your pay. You come back in another twenty years to do it again! We’ll still be here! Hehehehehehe!” the old lady says and then slams the door.\n\nYou can’t believe she just gave you five hundred dollars though. You wish you could get excited, but you’re extremely exhausted. You barely make it to your trailer. Once there, you collapse on the bed. When Tina gets home she’s unusually frisky, but once again you’re unfortunately too tired. However, she’s really surprised to hear you say something that she never thought would come out of your mouth…\n\n“Not tonight baby, I’m too tired from working.”\n","page 154":"You take off like a thief in the night with your find. You immediately get back to your trailer and get in your truck to drive to the pawn shop. When you get there, Dale sees you and rolls his eyes.\n\n“Mel, you better not be trying to sell me broken VCRs again, because I’m in no mood for it today.”\n“Will you fuckin’ forget about that already? Look at what I got! You’re gonna fuckin’ shit your pants! Solid gold motherfucker!” you say and slam the candlestick on his counter.\n\nDale\u0027s eyes widen, but he looks suspicious.\n\n“Mel where’d you get this? Did you spray paint this gold?”\n“I ain’t bullshittin’ man! I found it at that crazy ol’ cat lady’s house when I was cleaning out her garage!”\n“Hmmm, well that does make me more inclined to believe your scamming ass. She’s been living there for years; I wouldn’t be surprised if she had more shit like this in her house. Wait you didn’t fuckin’ steal this did you?”\n“What the fuck? I just told you I found it in her garage! She told me to throw everything out! And since when the hell do you have a conscience Dale? Would it fuckin’ matter if I had stolen it?”\n“No I guess not. Okay well I guess I’ll give ya two hundred for it.”\n“Fuck off Dale, I know its worth more than that.”\n“You ain’t gonna get a better price anywhere else Mel.”\n“The hell I can’t. Look I know you’re gonna make a fortune off of this, so you better give me a better figure than that, or else I go home and melt this down to make jewelry for Tina.”\n“Alright, five hundred, but that’s it.”\n“I’ll take it, and I’ll take that rifle with the scope you got on the wall back there too! I could use another one; it’s getting near hunting season.”\n\nYou come home with a new gun and a shit load of money, your quick side trip to the liquor store also allows you to come home with enough beer to last you through the night. You practice shooting your new rifle at some wrecked car in the trailer park until Tina comes home.\n\n“Well someone got a new toy to play with.” She says.\n“Yeah, now get inside and get naked baby, I want to play with my old toy now.”\n\nNow you’d think that line would get you bitched at and locked out of the trailer, but you just can’t lose today. Who says you need a job to get by in life?\n","page 134":"Well you go door to door to every trailer like a damn transient asking if they need anything done, only getting doors slammed in your face, people telling you to fuck off or getting hit on by cross dressers. Actually this would be easier if you didn’t live in trailer park that was paved with fucking gravel. It’s not like you can offer to mow their lawn. And it’s not winter so you can’t offer to shovel snow. And trailers don’t have gutters to clean…\n\nDid you even think this through? Of course not!\n\nOkay there IS something you can do, you can either drive to some real neighborhood in town and try to ask people for something to do there, (good luck with that) or there’s an old lady that lives in a rickety house nearby the trailer park, which means you wouldn’t have to go too far and she’s probably got tons of things for you to do. Of course she’s crazier than a shithouse rat though. Or cat rather. She has like one hundred of the fluffy bastards.\n","page 29":"Well he could still come in handy as a look out you figure.\n“Alright, I’m gonna go get a few things, and then we can go figure out what house we should break into.”\n“Actually I got an idea about that! There’s this house over on Apache Drive that’s empty right now, and has lots of stuff in it.”\n“Really? Well that certainly makes things a lot easier with a specific target in mind. Why the fuck didn’t you mention it in the first place?”\n“Um, um, uh, I dunno. I just thought about it just now.”\n“Idiot.” You say shaking your head.\n\nYou go and grab your pistol, a bag, and your Leatherman tool set and get ready for your criminal endeavor. You and Dan drive to Apache Drive where Dan points out the house. It certainly doesn’t look like much, but you’ll soon know what lies inside. Dan suggests going around back, and you follow him, where he mentions the back door has a simple lock. You easily pick it and get inside.\n\nYou start looking around, but Dan directs you to go upstairs. Dan seems to know an awful lot about this place.\n\n“Alright Dan, whose place is this?”\n“Huh?”\n“You know too much about this place, you knew where it was at, nobody was home, and the entire lay out. You obviously have been here before. So whose is it?”\n“Um, this guy I know.”\n“What guy Dan?”\n“This guy that sells crack to me sometimes…wait don’t get mad!”\n“Dan, we’re fucking ripping off a drug dealer’s house? Oh fuck, you really got us in the shit this time! FUCK!”\n“No its okay! I mean nobody’s here!”\n“Yeah and why is that exactly?”\n“He doesn’t do his business here, he does it else where, but he has parties here every now and then, so that’s how come I know where everything’s at. Mel, he’s got a lot of money stashed here, we’ll hit the jackpot!”\n\nDan’s ambition is bigger than his brain. Drug dealers who get ripped off and then find out about it have a tendency to get mighty upset about it.\n","page 136":"You ain’t wasting gas money so you go to the nearest neighborhood and look for the shittiest house that you can find and go see what they want done.\n\nYou knock on the door and little kid answers it.\n\n“Who you?”\n“I’m the fuckin’ muffin man you little shit. Your parents home?”\n“Pawents? You mean mommy?”\n“Well yeah who else would the fuck I be talkin’ bout?”\n“There lots of men come see mommy. Did you mean them too?”\n“Uh, no kid. Well if yer Mom isn’t too busy, tell her there’s someone to see her.”\n“MOMMY! THERE’S ANOTHER DADDY HERE TO SEE YOU!”\n\nA very worn woman with a cigarette in her mouth comes to the door.\n“Who the fuck are you? I don’t remember ever meeting you before. Did Dale refer you here to me? I told that sick fuck that I don’t do that shit! So you better get your golden shower ass out of here!”\n“Golden..? I don’t wanna know. Look I’m tryin’ to find some work to do, so if you need something done around your house I’ll do it for money.”\n“Ha ha ha! Sounds like my slogan! Well I could use a break today. Some me time, a chance to hussle up some new customers. So I’ll tell ya what, you do what I got lined up and I’ll pay ya three hundred.”\n“Are you serious? Three fuckin’ hundred?”\n“Yep, what? You think I can’t afford it? Shit I probably could buy an’ sell your ass.”\n“Yeah, yeah, I can tell by this fuckin’ PALACE you live in, so what do you need done?”\n“Look after my brat while I’m gone for today.”\n\nWell that’s really nice parenting. Leaving her kid with a complete stranger while she goes whoring around. Child protective services would have a field day. However, you need the money, and you’re not a pervert so it’s not really a concern of yours. Your concern is more along the lines of whether you want to put up with the little shit.\n","page 135":"Reach for those stars…\n\nYou start out looking for metal in the trailer park. You don’t find much. Apparently the other jobless bums who live here got a head start on you. You put what little you’ve found in the back of your truck and decide where to go next.\n\nYou could try driving to the abandoned warehouse district of the town. Lots of derelict buildings there, you probably could find enough metal to get by. Of course it’s a known haven for that kind of scavenger hunt sort of thing. You better be prepared for trouble.\n\nThere’s also driving around on the dirt roads in the nearby wilderness, people often dump stuff out there, but it’s more of a risk of finding enough to make money.\n","page 138":"“Alright, I’ll look after him, how long you gonna be gone for? Better not be all fuckin’ night cause I ain’t stayin’ here forever!”\n“I’ll be out as long as I want, an’ if you want that money you’ll stick around ‘till I get back! I ain’t gonna be gone all night though, I gotta early day tomorrow, thus the need for me to have some time just for fun.”\n“Don’t you normally do that everyday?”\n“Alright wise ass that’s enough outta you! That ain’t fun that’s fuckin’ WORK! Anyway enough of this shit, I’m gonna leave, BOBBY! Getcher ass in here! This man’s…what’s your name?”\n“Mel.”\n“Mel’s gonna look after ya.” The woman says and then leaves.\n\nBobby picks his nose and looks at you in confusion. You make your way to the refrigerator and look for beer. Jackpot. Now to waste time by sitting on your ass and watching TV. Unfortunately Bobby seems to feel the need to play twenty questions with you.\n\n“Why is the sky bwue?”\n“Don’t know.”\n“Where did Mommy go?”\n“Don’t care.”\n“Where do babies come fwom?”\n“Christ shut the fuck up; I’m tryin’ to watch the game! Don’t you have some friends to fuckin’ play with?”\n“You wanna see my fwog?”\n\nWell there’s a couple ways you could approach this situation.\n","page 137":"You head over to the crazy old cat lady’s house. The house looks like it belongs in a horror movie. All kinds of cats watch you approach the house. You almost can feel the hatred from the little furry fuckers. Its almost as if they sense your unkindness to felines in the past. You knock on the door and ring the door bell.\n\nTen minutes later the old bat finally answers the door, only opening it half way with three sturdy looking chains still connecting it.\n\n“Agh! Go away! I hate you Mormon bastards!” she says.\n“Do I look like a fuckin’ Mormon? I’m here looking for work to do.”\n“Hmmm, you look familiar; you live over in that trailer park nearby don’t you?”\n“How would you know? You never leave the fuckin’ house!”\n“Ah but my kitties! I see through them! They see for me! I know everything about this town, thanks to my pets! Hehehehehehe!” she begins to cackle.\n\n“Uh yeah, so you got anything for me to do that you can pay me for, or are you just going to indulge in more insanity?”\n“Oh yes! I have things for you to do! You may go out back and cut the grass or you can clean the garage, you will be paid well if you do a good job. Remember, I’ll know! My friends will be watching! Hehehehe!”\n","page 139":"There’s no way you’re going to look after anyone’s little monster, you decline.\n\n“Well get the fuck outta here and stop wasting my time then!” the woman yells as you feel the all too familiar door slam in your face.\n\nYou don’t have too much luck with the rest of the block either. So far the best offer you get is some sick fuck wanting you to shit on his chest. After punching his lights out, you finally get someone that wants you to clean their gutters\n\nIt’s an unpleasant job. You spend the remainder of the day on the roof pulling out matted leaves, sludge and by the droppings what seems to be an elephant’s nest. You’re still doing it when gets dark, which later results in you falling off the ladder and twisting your ankle badly.\n\n“ARGH! SHIT!” you yell.\n\nThe owner comes out to see what’s happened. You immediately start ranting at him.\n\n“My ankle is fucked! And it happened on your property! I’m suing the shit outta you!”\n“Stop lying, you trailer park piece of shit! You ain’t scaring me! Now get back and finish doing your job!”\n“Fuck you! My ankle’s twisted! I can’t see shit now that’s dark anyway! You better have a good lawyer because I won’t be living in a trailer too much longer!”\n\nThe owner’s still angry at you, but your insistence on suing him, causes him to wonder if your claims do have some sort of legal merit (Weak though they may be) so he decides to play it safe, just like you thought he would.\n\n“Oh fuck it; I don’t want your redneck ass lying here driving down my property value! Here take this, and get the fuck off my property!”\n\nYou take the wad of money and limp back to your truck. You drive to the liquor store and pick up some much needed alcohol to try to dull the pain of your ankle which doesn’t really work too well. Later when you get home, you spend the rest of the night drunk on the couch and in pain. Tina dumps an ice pack on your foot and goes to bed.\n\nAs you start drifting off into your alcoholic slumber, it occurs to you that you should’ve just faked the injury from the beginning of that job and saved yourself a lot of hassle.\n","page 22":"“Alright alright I’m tired of hangin (hic) out with you losers any (hic!) way. An’ remember, don’t (hic!) fuck with me ag (hic!) again!” you say and stumble out the door.\n\nYou drive home…barely. You nearly crash the truck into the front of your trailer, and you don’t even make it to the couch let alone the bed. Tina wakes up just in time to see you collapse on the floor.\n\n“Amazing, you managed to still get drunk even though you had no money at all, if only you put as much effort into getting a job.”\n“Getting drunk is my job baby.” You say and pass out.\n","page 23":"“Oh fuck off (hic!) Joe! Why don’t (hic!) you (hic!) piss your adult (hic!) diapers else where (hic!) you incont (hic!) incont (hic!) you pissy motherfucker!”\n\nWith this secret unleashed, you have unleashed Joe’s anger as the bar patron start looking at Joe in a whole new light. At first he’s very quiet, and then he suddenly grabs his shotgun!\n\n“You’re dead now asshole!” he yells and shoots at you.\n\nYou barely manage to duck, the other bar customers scatter to hide as well. You run and hide all over the bar as he attempts to end your life. When he stops to reload, you take the opportunity to run out of the place and get in your truck. You hear a back tail light exploding as you drive off. You get home relatively okay, since this life and death situation has sobered you up somewhat.\n\nYou get home a little shaken, Tina wakes up wondering what’s going on.\n\n“What the hell’s wrong with you? You’re acting jittery like your ass is on fire.”\n“I nearly got fuckin’ shot tonight!”\n“Well what the hell do you expect? You get drunk and end up pissing people off. You learn anything from this?”\n“Yeah, fuck the bars, I’m just gonna get drunk at home from now on.”\n","page 28":"“Alright let’s go to Sam’s, I don’t feel like moving too far.”\n”Cool! Let’s go.”\n“Hold on let me get something.”\n\nYou go back to your trailer and grab your pistol. If you’re gonna be keeping meth heads in line, you better be prepared. You and Dan then proceed over to Sam’s trailer. It’s a little bigger, and it’s relatively isolated from the rest of the trailers. It’s covered with various graffiti, most of it obscene words about various people. “Mel is a dickhead” seems to be a common theme though and you’ll be sure to inform Tina that apparently she performs sex acts on donkeys. You can see junkies wandering around outside the trailer in a dazed state, when they come out, they’re noticeably in a much more alert. There’s smoke coming out of the open windows, if the cops ever came down to this shitty trailer park, it would be pretty obvious what the fuck’s going on around here.\n\n“Heeeey…you got twenty dollars man?” some junkie asks you.\n“No! And stop fuckin’ touching me!” you reply and shove him to the ground.\n“Hey handsome how about I take you ‘round back and suck your dick, for ten dollars?” a female junkie asks.\n“Mel, you should take that offer man!”\n“Uh no, Dan. I don’t need to catch AIDS that fuckin’ badly. An’ get away from me, ya fuckin’ junkie whore!”\n\nAfter wading through the living dead you manage to knock on the door, at which point Sam opens it and smoke comes billowing out. He’s wearing a gask mask of some sort.\n\n“Will you fuckers calm down? I’m only one fuckin’ man, wait your fuckin’ turn!” Sam says in a muffled tone.\n“(Cough) (Cough) Shit. We’re not here for drugs; Dan said you needed help with crowd control.”\n“Oh? What’s your name? You take meth or any kind of drugs at all?”\n“Mel, and fuck no, why deal with all the fuckin’ junkies, when I can just go down to the liquor store, buy beer and get wasted by myself?”\n“Ha ha! Okay you’re in. Dan you are fuckin’ NOT!”\n“What!?”\n“I don’t fuckin’ trust your ass; you’ll end up stealing my shit!”\n”Sam what the hell’s up with you? You used to be a laid back guy.”\n“Yeah well this fuckin’ business is starting to change that way of thinking. I don’t like it either, but you fuckers take advantage of kindness, and I’m not getting beaten up and robbed again! No, I’m gonna start being fuckin’ ruthless motherfucker just like everyone else!”\n“But…but…”\n“No fuckin’ buts, you stay outside with the rest of your kind! Mel here’s a mask, come on in.”\n\nYou put on the mask and go inside. Sam walks over to his lab table and starts talking.\n\n“Okay Mel, you ask these junkies how much they want, you take their money, give it to me, I give you the drugs and you give it to them. Now nobody has to even enter this fuckin’ place and I don’t have to get up every five seconds. If one of those drug addicts gets out of line you know what to do. Sound simple?”\n“Sounds simple to me.”\n\nYou step outside and already your first customer addresses you aggressively.\n\n“I need the stuff man! I need it! Ya gotta give me it right now!” he says grabbing your arm vigorously.\n","page 27":"“Nah, I don’t feel like keeping a bunch of crackheads in line.”\n“Okay so let’s go to the liquor store and rob the place.” Dan says.\n“Goddammit Dan, if you were any dumber, you’d have to wear a fuckin’ helmet, you tryin’ to get caught? We ain’t leaving fuckin’ town dipshit, so don’t you think it would be better if robbed a place with nobody around to possibly identify us?”\n“Damn Mel, I never thought of that!”\n“No shit.”\n“Well okay then let’s start breaking into these trailers.”\n\nDan hasn’t quite got the idea of this yet.\n\n“I meant a fucking HOUSE, fucktard!”\n“That’s an even better idea!”\n“Yeah, it looks like I’m coming up with all of them.”\n\nAt this point you’re wondering if you should even bother taking Dan with you.\n","page 20":"Your attempt to convince these barflies to help you out is met with more laughter. This soon escalates into threats, and after punching a few of them, they all manage to give you the bum’s rush and throw you out. Joke’s on them though, you managed to steal a couple of their wallets in the ensuing scuffle.\n\nYou take out all the money and head down to the liquor store, and buy yourself all the friends you need, Jack Daniels, Jim Beam, and Johnny Walker. You then go back home and have a party with all of them.\n\nAnd as usual when Tina comes home she has to clean up after you and your “friends”.\n","page 0":"\"Mel, get the fuck up you lazy motherfucker!\"\n\nArrgh! That\u0027s your girlfriend Tina. Its only 1:00 PM and she\u0027s screaming at you to get up. Probably wants you to get a job.\n\n\"Alright! Jesus fucking Christ woman, get off my fucking ass!\" you shout back, holding your head.\n\nAs you get up crushed beer cans roll off your body. You realize you passed out the night before on the kitchen floor of the trailer. Empty bottles of Wild Turkey and Jack Daniels lie strewn about the floor along with a pile of cigarette butts.\n\nWhew! You must\u0027ve really been partying hard last night! You smell like ass and vomit!\n","page 141":"Little Bobby has annoyed the shit out countless horny 40 year old men who want to fuck his Mom, despite all their efforts to ignore him and concentrate on her. What chance have you got?\n\nWell at first you think you’re gotten rid of the little shit, with your harsh words, but little Bobby’s heard worse from his Mom, so that doesn’t have any effect. Instead he comes back with a box.\n\n“Wanna see what’s inside? Wanna see what’s inside? Wanna see what’s inside?”\n“No, I sa…” before you can reply to Bobby’s repetitive whine, he opens the box anyway, and out comes the biggest, fattest frog you’ve ever seen leaping into your lap.\n“Agh! My nuts!” you shout in surprise.\nIt startles you so much; you end up jumping backwards from your sitting position, over the couch and falling on your head to the floor. The frog at this point has leaped away again and is hopping all over the place.\n\n“My fwog! My fwog! You gotta help me catch it!” Bobby yells.\n\nAs you get up and rub your head, you begin to wonder if this is all worth it.\n","page 142":"You are suddenly reminded of the age old classic of hide and go seek minus the seeking part…\n\n“Hey Bobby, you know how to play hide and go seek right?”\n“Yeah!” Bobby says excitedly.\n“Okay well you go hide, and I’ll go find you, and remember DON’T come out of your hiding spot until I find you! Okay?”\n“Okay!” He shouts and runs off.\n\nYou have an uneventful and peaceful day of watching TV and drinking beer and forget about Bobby until his mother comes home.\n\n“Where’s Bobby?” she asks.\nYou suddenly remember that’s who you were supposed to be looking after! You quickly think of an excuse…\n\n“I dunno.” You say.\n\n“What the fuck do you mean, you don’t know?!!!? You were supposed to look after Bobby!! I’m gonna have your ass thrown in jail if you don’t find him pronto!”\n“Oh yeah? Well you’ll be in a jail cell right beside me bitch! You’re the unfit mother who left her brat with a complete stranger! So don’t fucking threaten me!”\n\nJust then Bobby appears, he’s covered in garbage and smells terrible. Small maggots fall off of his head.\n\n“Mommy? Mel told me to hide and he never finded me!”\n\nYou immediately start laughing.\n\n“There he is, where’s my money?”\n“Fuck you! He’s fucking covered in trash and stinking up the place! I’m gonna have to give him a bath before the smell starts clinging to the walls!”\n“Well consider it mother/son bonding time! So you gonna pay me or what?”\n“You ain’t getting shit! Get the hell outta my house you fucking loser!”\n“Oh fuck it then.” You say grabbing the remaining beer and leave.\n\nAfter side swiping a couple of mail boxes on the way home, you eventually get there and stumble in. Tina’s already asleep. You get into bed next to her and clumsily attempt to grope her. This results in her slapping you away as you pass out and roll off the bed.\n","page 167":"“Fuck that, I’m not sitting around waiting for one the other dickheads around here to come waltzing by in the hopes they have something worth stealing. I know what to look for, aluminum, brass, stuff like that, not that normal iron shit. And I know this building has got it! I can sense it!” you point to the building nearby.\n“How do you know?”\n“Cause I got fuckin’ instinct! That’s why! Besides it used to hold plumbing supplies, now come on!”\n\nYou enter the building, looks like its been gutted of everything long ago, but of course most of these dumb asses never think to look past the first floor, let alone the basement. Which is where you’re heading.\n\nYou head down the stairs, with Dan following close behind, you start looking around, and you see some regular iron piping lying on the ground. You tell Dan to start gathering all of those up and find a box to shove them in for easier movement. You explore some more as Dan goes about doing that, and it appears you were correct to search here. You find some boxes of brass valves and piping. You put those aside with the iron you found. You and Dan figure you’ve found a good enough haul and start loading the stuff into the back of your pick up truck. Nobody around, good. You certainly found a lot of stuff down in the basement and you didn’t even explore all of it.\n","page 168":"“Alright, I guess that makes sense.”\n“Okay, but we should probably should drive around a bit rather than just camping out in one area though.” Dan says\n\nYou begin driving around telling Dan to shut the fuck up every now and then and to keep his eyes peeled. About an hour passes and you still haven’t found anyone, you get pissed off and stop the truck.\n\n“Alright, fuck this.”\n“What? Why’d you stop?”\n“You got fuckin’ gas money? I’m not driving around wasting gas fuckhead! I’m parking right here, and someone better show up soon.”\n“Why the hell are you getting mad at me for?”\n“Because this was your bright idea!”\n”Me? I’m not the one who wanted to do this shit! I was gonna try to rip off that old miserable bastard Big Jim today!”\n”Ha ha! Then you’re fuckin’ lucky that I brought you with me, cause Jim woulda drilled several holes in your ass! You dipshit, you don’t rob from some crazy heavily armed Viet Nam vet!”\n“Fuck you Mel! What the hell would you know about it? You ain’t riskin’ your ass stealing everyday! You’re sitting at home sponging off your girlfriend Tina!”\n”And since when does stealing make you a valuable member of society?”\n”Hey at least I don’t pretend to be somethin’ I’m not!”\n“Yes you fuckin’ do! You’re acting like you’re some hardcore criminal, when all you fuckin’ are is a pathetic junkie who’s only stealing to support his fuckin’ habit!”\n“Fuck you, you goddamn drunk! You ain’t no better than me!”\n“The fuck I ain’t! Now shut the hell up and…”\n“That’s it! I’m sick of you telling me what to do Mel!” Dan yells and punches you in the face. He might’ve done some damage, if he wasn’t so puny.\n“Dan, that was the wrong fuckin’ move!” You slam his head into the dashboard, and then throw him out of the truck, and then drive off for home leaving him to ponder his poor judgment.\n\nWell this was a squandered day; you ended up wasting gas money and spent the entire time arguing with Dan’s junkie ass. You only have yourselves to blame, after all you listened to his grand plan. When Tina gets home she yells at you for being a no good bum as usual, you take it all in stride, still it’s a lot more annoying when you aren’t drunk enough to basically ignore her nagging.\n\nYou end up having to sleep on the couch which you do while watching an infomercial of “Girls Gone Apeshit.”\n","page 33":"You quickly open the window and prepare to make a hasty getaway, you look down, you’re on the second floor and while it’s not exactly a death drop, you could still fuck yourself up, if you land wrong. You prepare to leap out the window, especially when you hear some foot steps coming up the stairs. You jump and land on your feet and feel that nerve pain shooting through them that’s usually associated with landing hard.\n\n“AH shit!” you say, trying to stifle your voice. As you start running away to your truck, you hear a crash behind you. You turn to see Dan, who’s landed all wrong! His moaning is then followed by a yelling coming from the upstairs window.\n\n“MOTHERFUCKER! You try to rip me off eh? I got you now bitch!” a figure says and runs from the window presumably to get his gun and finish off Dan.\n\nWell there’s only one thing to do. You immediately run back to the house and go through the back door which is still open, you see the dealer reaching for his front door with a shotgun in hand and you open fire!\n\nThree shots to his back. He never knew what hit him. He slumps lifelessly to the ground.\nYou immediately run back out to Dan, pick his ass up and get in the truck and drive off.\n\n“Mel, you fuckin’ saved my life!”\n“I fuckin’ saved MY life! If I hadn’t gone back for you and killed the dealer, he’d probably woulda came after me next! Plus I wouldn’t have gotten all that money we stole.”\n“He’s fuckin’ dead? Aw shit!”\n“Relax! There wasn’t anyone around, and even if there was, ain’t nobody gonna say shit. Besides, you think the sheriff gives a fuck about a dead drug dealer? We’ll be fine.”\n“No it’s not that, he was the cheapest crack dealer I knew! Now I gotta buy my crack from someone else at a higher price!”\nYou just shake your head.\n\nYou divide the money up at your place, taking most of it since you DID save Dan’s life. Dan leaves with his lot to go get suitably wasted. You do too, by ordering a keg to be delivered straight to the trailer. Tina comes home to see you indulging in one of your favorite past times.\n\n“Well I see you made something today. How’d you manage to make enough money to get a keg delivered here?”\n“(Hic!) Never (Hic!) ask me ‘bout my (Hic!) business Tina.” You reply.\n","page 32":"“Fuck this, I’m not getting involved in this shit, I got enough people wanting to kill me, I don’t need another. If you got any brain cells left, you’ll do the same.” You say.\n“Damn Mel, I thought you were supposed to have fuckin’ balls, what the hell, Tina got ‘em in her purse today?”\n“Dan, I’m gonna ignore that, ‘cause the shit you’re gonna be in, is gonna be much worse than anything I could do to you.” You reply and leave.\n\nYou get back in your truck and drive off, just in time to see a van pull in front of the house Dan’s still inside.\n\n“Fuckin’ idiot.” You say as you drive back home.\n\nYou spend the rest of the day in a slightly heightened state of alert. You walk around armed and looking out the window of your trailer, until Tina gets home.\n\n“What’s going on?”\n“That fucktard Dan took me to rob some drug dealer’s house.”\n“So did you?”\n“No, no, I left immediately when I found out, but the dealer was coming home just as I was leaving, I don’t know what the hell happened to Dan.”\n“Funny you should mention that, since he came to the club. I thought he was shoving a lot of money in my G-String tonight.”\n“Sonofabitch, he managed to get away with it!”\n“Uh, I dunno about that, later two guys came in and practically dragged him off. They didn’t look like they were going to take him place good either.”\n“Shit, well I can’t say I didn’t warn him. Heh heh, looks like I got some of the money after all though.”\n“Excuse me? That money he shoved in my underwear belongs to me! The only one who did any work today as usual! I’m sure you might want to keep an eye out just in case Dan tried to save his own worthless life by implicating you, so I think you’d do well by staying on the couch tonight, wouldn’t want to tire you out.”\n\nAnd that was Tina’s subtle way of saying, “You ain’t getting my money OR my pussy tonight, you lazy motherfucker.”\n\nOh well at least you’re not lying in five different pieces like Dan is right now.\n","page 34":"Well it’s a big closet…the both of you could probably fit inside.\n\n“Dan get in the closet!”\n”What?”\n“Get in the fuckin’ closet! Shit ya oughta be used to being in it by now! Move!”\nYou shove Dan in the closet and get in it with him, and close the door.\n“Hey what the hell was that suppose to mean Mel?” Dan asks, suddenly getting the “joke.”\n“Quiet!” you say as you hear foot steps coming up the stairs.\n\nThe plan is when the dealer opens up the closet; you’re going to shoot him in the face, a simple plan, but an effective one.\n\nYou hear the footsteps coming into the bedroom, and you tighten the grip on your pistol in anticipation. You see a figure moving around from the keyhole of the door. Then nothing happens. The figure leaves, and soon you hear the front door slam. He’s left.\n\nYou and Dan breathe a sigh of relief and exit the closet.\n\n“Fuck, that was close! Okay I also know where he keeps his drug stash…”\n“NO! We’re getting the fuck outta here right now! I came for the money; you steal his drugs on your own!”\n\nDan looks a bit disappointed, but leaves with you. When you get home you divide the money up, then Dan leaves to probably go buy crack from the same guy he just ripped off.\n\nYou buy beer, cigarettes and porn to keep you occupied for the rest of the day, then Tina comes home and she keeps you occupied for the rest of the night.\n","page 39":"“Get get the fuck off of me!” you yell and proceed to pistol whip the poor sonofabitch, until he collapses in a heap on the ground. The rest of the junkies get a little scared and proceed to back away from the trailer. You make so much noise that Sam comes over to see what the hell’s going on.\n\n“What the hell are you doing?! I said keep them in line, not kill them! How the hell am I supposed to make any money that way?”\n“You’re selling them crystal meth and you’re worried about them living?”\n“You know damn well what I meant! Fuck man, at this rate you’ll scare them off and they’ll go buy somewhere else. I can’t have this Mel.”\n“What? Weren’t you the one bitching about becoming a ruthless drug dealer?”\n“Yeah, but I dunno, this seems a little excessive now…”\n“Oh fuck this, you wishy washy bastard, call me when you make up your fuckin’ mind, I don’t need some wannabe telling me what to fuckin’ do.” You say and leave.\n\nYou spend the rest of the day not doing anything constructive other than attempting to get drunk off the cough syrup in the medicine cabinet. Doesn’t quite have the same effect of course but considering its more than two years old, you do end up feeling quite different and on the floor asleep. When Tina comes home she makes to correct assumption that you wasted the day again drinking mind altering liquids.\n","page 31":"Well no sense in backing out now, if you’re gonna do something incredibly stupid, might as well do it all the way. You and Dan head upstairs.\n\n“Alright Dan, where the hell does he keep his money?”\n“In his bedroom, in a safe.”\n“What the hell Dan, do I look like a fuckin’ safe cracker? How are we supposed to get the damn thing open?”\n“Its cool man! I know the combination!”\n\nYou and Dan enter the room and Dan immediately goes over to a closet and starts to open a safe that lies inside of it. You look out the window and take the opportunity to ask another question.\n\n“Dan if you knew all this shit already, why the hell didn’t you just do this, yourself?”\n“I dunno, I always felt like I might need someone else around, just in case something went wrong.”\n“Yeah, like the fuckin’ dealer coming home! I just saw someone pull up in a fuckin’ van!”\n”Aaagh! That’s him! We gotta get the hell outta here!” Dan says and starts grabbing all the money and throwing it in the bag.\n“Shhh! Calm the fuck down! I hear the door opening.”\n“Oh shit, oh shit, oh shit! I knew this was a bad idea!” Dan continues to whine.\n“Yeah, you really screwed the pooch on this one.” you add, trying to figure out what to do next.\n","page 30":"“To hell with this, I’m gonna do this shit by myself.” You say and leave Dan standing around with a dumb look on his face.\n\nYou grab your pistol, a bag and your Leatherman Tool Kit and drive off in search of a house to rob. You drive around until you notice a house that appears to be empty; you go knock on the door and ring the doorbell. No answer. Good enough for you.\n\nYou head around the back and pick the lock. Success. You creep around the house looking for something of value. Nothing so far, you do however find the biggest Mastiff you’ve ever seen. It sees you, and growls before running towards you. You attempt to shoot the damn thing, but it’s already upon you, and your pistol goes flying out of your hand. Fortunately you manage to block it from ripping your throat out by giving it your forearm instead. \n\nWhile it attempts to bite through to the bone, you manage to put your thumb in its eye, gouging it out. It reels back and howls in pain, at which point you grab your gun. The Mastiff starts ripping into your leg.\n\nYou shoot the Mastiff in the head, at this close range you can’t miss. It falls over dead, releasing its vice grip on your leg. You however are a fucking mess. You drag your ass back to your truck and barely drive yourself to the clinic, where you call Tina at a pay phone inside to come down to see you.\n\nTina’s pissed off, she not only had to miss work, she also had to pay for all the stitches you had to get. When you get home, she continues to bitch at you, for your stupidity. You don’t mind though, the morphine they gave you drowns her out better than alcohol.\n","page 170":"You decide to get out while you’re ahead. You and Dan go to the scrap yard where you make a decent amount of money, of course you have to split it with Dan, but you manage to intimidate him into not taking as much.\n\nYou both then go your separate ways; he spends his money on crack, while you spend it on beer. He stays up all night using a cheese grater trying to get the “bugs” off of him, while you end up passing out and sleeping for the remainder of it on the floor. The whore who he’s fucking this week ends up stealing what little money he has left to go out and buy crack for herself and blow the dealer while she’s at it, while your lovely Tina gently relieves you of what money you have left while you’re asleep to put towards bills, so you don’t waste it on more foolishness.\n\nMeh, different strokes…\n","page 171":"You tell Dan that you should take one more look around and then leave.\n\nYou re-enter the basement, but go a little further this time, the floor underneath is getting a little less safe. Dan says there probably isn’t anything else here and you should leave since the disturbance you’ve been causing has been attracting some mighty big rats, and the roaches aren’t too small either. But you feel like there’s something else that you’re missing, and that’s when you see it, a golden faucet, lying all by its lonesome on a table. The only problem is the floor is pretty much rotten looking, it’s barely supporting weight of the table by the looks of it, if you went over there, you might fall through. Dan refuses to go any further which is just as well. You however have to try…\n\nYou slowly begin to creep across; you gaze at the golden faucet in wonder and rub your chin…you grab it. Nothing happens.\n\n“Piece of fuckin’ cake.” You say back to Dan who smiles and laughs.\n\nSuddenly the floor starts to crumble! You jump forward the avoid falling into the depths, and keep running as the floor disintegrates underneath your feet. All this commotion causes the rats to attack, and Dan shoot a couple times at a nearby pack before fleeing as well. Unfortunately he accidentally shoots a weakened support column and now the ceiling is crumbling as well as the floor below.\n\nYou continue to run and leap, as annoyed mutant cockroaches spit whatever they’re fucking spitting at you. You feel some of it burning through your clothes though. You manage to avoid the ceiling from crashing on you, but the floor is still giving you problems, especially since part of it in front of you gives way forcing you to stop briefly. Dan is on the other side.\n\n“It’s a big jump; you’re not going to clear it completely! Throw the faucet! You’ll need both hands to hold on to the side, I’ll pull you up!”\n“Fuck you, you’ll run off with it!”\n“No I won’t! You got the truck keys! Come on those rats are getting closer!”\n\nYou’re hesitant, but you throw it. Dan catches it.\n\n“Sorry Mel, but you should’ve remembered I can hotwire a vehicle!” he says and runs off.\n“MOTHERFUCKER!” you yell. The rats are closing in; you got no choice, but to make a jump for it. You take a short running leap and apparently you’re in better shape than you thought. You make it, though you scramble quickly to get up as your legs dangle over the side and the rest of the floor starts falling apart. You also quickly pick up the baseball cap that fell off your head after you jumped.\n\nYou just barely manage to make it back up the stairs and run out the door you came in, only to almost trip over Dan’s body.\n\n“Mel, ya gotta help me! One of those roaches had attached themselves to pant leg and bit me! I crushed the little fucker, but I don’t feel so good, it’s like the venom is paralyzing me or something. Shit…”\n“Paralyzed eh? Well you won’t be able to stop me from taking this back then, you treacherous bastard! And if live through the damn night, don’t let me catch you hanging around the trailer park again, or I’ll fucking kick your nuts so damn hard, you’re gonna need a dentist to give you your next hernia check!” you say and get in your truck as quickly as possible as angry and savage scrap collectors start showing up suddenly to stop you from taking what they consider rightfully their claim. You give them all the finger out the window as you make your good escape.\n\nYou make a sizable amount of money at the scrap yard seeing as you don’t need to share it now. As for the faucet, you decide to keep it as a symbol of your adventurous victory and install it at your own place, proudly displaying as if it was in a museum.\n\nTina thinks it really makes the place look classy and decides you deserve a more carnal reward.\n\nWell you survived a life and death situation, got the money and fucked the girl. A happy end, just like in the movies!\n\nRoll credits!\n","page 155":"You wonder if there are more things you might find, so you keep working, putting the candlestick in a trash bag and setting it aside. Your greed seems to pay off, you find a couple of real silver tea cups! You don’t understand why this stuff is here in the garage, but it is, and now it’s yours. You put the tea cups in the set aside bag. Nobody’s around, but there are a lot of cats starting to gather in your direction. It’s almost as if they’re suspicious of what you’re doing. They start watching you intently.\n","page 158":"You keep your cool, and start throwing the rest of the worthless trash into other bags. The flea bags watch you for a long time, but eventually they get bored and move on. This has actually been slightly beneficial, you end up completing the real job you were hired to do, so you go back to the old lady to get paid.\nAfter ten minutes of ringing the door bell, she finally comes to the door.\n\n“Ah you finished? Good, here’s your money and yes you may take those things you put aside, you completed the job…oh you thought I didn’t know? I told you! hehehehehehe! My kitties allow me to see all! Hehehehehehehe!” she cackles and slams the door.”\n\nYou’re a little creeped out by this house and all this crazy cat lady babblings, so you quickly take the bag of valuables and head home. It’s late so you’ll have to go to the pawn shop tomorrow.\n\nWhen Tina gets home, she finds out about your little discovery and insists on doing something spectacular with all the money you’re going to get for it (As opposed to your grand plan of buying more beer) namely going on vacation.\n\nYou and Tina have a good time at Graceland, and during the tour, you and her sneak away to fuck on Elvis’ bed.\n\nLong live the King baby!\n","page 157":"Maybe it’s the overall creepiness of this place combined with the weird vibe you’re getting from the cats, but you lose your cool briefly and try to escape. However, this sudden movement from you alerts them that you’re up to no good, and they attack.\n\nOne runs in front of you as you’re trying to get away. You end up tripping over it and falling on your face, the bag of loot you’re carrying is still in your hand though. You manage to get up pretty quickly before the rest of them get a chance to claw your eyes out, however one does manage to claw the bag before you start running. It isn’t until you get back to trailer park that you realize the bag has been shredded and its contents have spilled out.\n\n“SHIT! SHIT! FUCK! GODDAMMIT!” you shout and punch your trailer, succeeding in injuring your hand, which of course only makes you madder.\n\nYou think about going back to get your items, they’ve probably been picked up already, plus there’s the cat army still waiting for you. Still, you’re pissed. You grab your pistol and head back down there.\n\nSome of the cats still lingering around see you and immediately run off, the items you found are gone though, just like you thought. You attempt to make yourself feel better by shooting at a couple of cats in the distance and then return home.\n\nYou sit and watch TV all day still pissed off about what happened. Tina comes home ready to give you shit as usual.\n\n“So did you make your millions by sitting on the couch all day?”\n“Don’t even fuckin’ start with me, Tina. I had a fortune today and I lost it.”\n“Sure you did Mel, sure you did.”\n","page 43":"Its late, you wanna go home and you just don’t fuckin’ care anymore.\n\n“Alright go the fuck in.”\n\nHe looks a little surprised, but he goes in. This is soon followed by loud noises and shouting.\n“MEL! Get this fucker off of me!”\nYou run inside and smash the junkie in the back of the head until he stops moving.\n\n“Holy shit, did I kill him?”\n“I dunno, I hope so. Mel why the fuck did you let him in here in the first place?! Didn’t I tell you nobody was supposed to come in?! Look at this place! My fuckin’ work station is ruined! Test tubes broken, beakers destroyed, my fucking stove was ripped out of the wall. Whew now there’s a gas leak.”\n“Your burner’s still working.” You point out as it lies on the floor still shooting out flame.\n“OH SHIT! I GOTTA TURN THAT OFF!!!!!” Sam yells.\n\nWhile you immediately run out of the door pushing drug zombies out of the way, Sam rushes to turn his Bunsen burner off, but is met with a small fireball flare, followed by a spectacular explosion.\n\nYou make it, but you can’t say the same for Sam or some of his customers. The ones that lived though seem to congregate around the fire trying to get high off the fumes. Soon the fire department arrives and attempt to put out the flames as onlookers watch like its most excitement they’ve had in years. You go back to your trailer and Tina’s just getting home.\n\n“What got set on fire?”\n“My money and former place employment.” You say unemotionally.\n","page 46":"You quickly go through the forms. Yeah right like you’re going to admit to being convicted of a felony! College? Is he fucking kidding? Two thirds of the fucktards who live in this town are illiterate! What the fuck is a PhD? And if you had one, why the fuck would you be working here? No drinking on the job? What the hell, Billy Ray is usually half plastered himself by noon! You don’t even bother to fill them out entirely Billy Ray should know all this shit; he’s known you long enough! You got into his office and throw the forms back at Billy.\n\n“Alright I filled out yer fuckin’ forms, NOW what’s my job in this shithole?”\n“Well normally you’d be working at the register, but with your asshole attitude, you just ain’t gonna cut it. In fact I better keep you away from the customers altogether. You can either be a cook or a janitor.”\n","page 48":"As you go up to their table, one of them immediately begins shouting at your choice in hairstyle. Probably jealous no doubt.\n\n“Hey you look like a faggot, with all that long hair! Ha Ha!”\n“Uh huh, now run along home. The street lights are almost on and you know you have a curfew. After all seeing as your mothers are working the streets at night for their ebony pimp, someone should be looking after the house.”\n\nAll of 3 of them stand up very angry.\n“What’d you say motherfucker?” one asks.\n“I said all your moms’ are a black man’s bitch, you skinhead fucks! Didn’t they teach you English in Neo-Nazi school, or was that too difficult a concept for you to understand?” you shout combatively.\n“You’re paying for that asshole!” one shouts and tries to attack you, but you instinctively counter and slam his head into the table. Another tries to get behind you, but you back kick him and then elbow him in the face. The other one attempts to escape, but you grab his arm, and in doing so you notice his Swastika tattoo starts smearing!\n\n“You fucking wannabes! You aren’t even real skinheads! You fuckers were just trying to act tough! Pathetic!” you say and throw him into the soda dispensing machine. After shaking off the cobwebs, they run off to lick their wounds.\n“And don’t come back or I’ll shove a burning cross up your asses!”\n“Erm, that’s the Klan, Mel.” Billy says coming out of hiding.\n“Whatever, you got my money?”\n“Yeah, here you go, but you ruined my soda machine! So I’m docking you one hundred dollars!”\n“Figures you’d find some way of not paying me the full amount, ah fuck it. I’m rich! Time to go get liquored up!”\n\nYou leave and go to the store and stock up on massive quantities beer and pork rinds. You then spend the rest of the day watching pay per view porn. When Tina comes home, you’re definitely in the mood for some lovin’. (Plus you just learned a few things you want to try out) Tina’s less than enthusiastic to you drunkenly pawing all over her right after she’s had a bunch of other drunken idiots try to do the same, but after she sees you actually made some money today, she’s a little more willing.\n\nFighting, drinking and fucking. Life is so simple for you…\n","page 47":"You don’t want to even work here in the first place, and now he wants you to fill out fuckin’ forms? You don’t need this shit. You start to leave, but Billy stops you.\n\n“Hey look Mel, hold on. I kinda need ya to help me with something.”\n“What?” you say shoving his pork pie hand off of you.\n“There’s some teenagers that come in and cause a bunch of trouble all the time and I’d like you to stick around.”\n“Why don’t you do something?”\n“Cause they’re teenagers! I can’t lay a finger on them, I’m an adult remember?”\n”Billy, you’re getting head jobs from 16 year old girls and you’re worried about getting into trouble for fighting some punks fucking with your place of business? Interesting set of priorities you got there…”\n“Shut up! Look will you help me or not?”\n“Oh so it’s okay if I get into trouble for kicking their asses?”\n“Erm, well I didn’t think you’d care or worry about it.”\n“I don’t, but it’s the fuckin’ principle of the thing! Why not get the pigs?”\n“Erm, no. I don’t really like police sniffing around this place.” Billy says.\n“Yeah, and I know several reasons why. Alright, how much you willing to pay?”\n\nBilly offers a large sum of money. He must REALLY want them gone. You accept his offer and stick around. Sure enough, you later see the teenagers he’s talking about. You can tell by their shaved heads and Swastikas on their arms. They begin harassing the customers and shouting at the employees to hurry up with their food. You see Billy attempting to hide his wide load behind a corner and look over towards you, hoping you’ll do something.\n","page 49":"Billy is too much of a coward to do shit, yet he doesn’t mind you getting in trouble. Well you want that money, but you’re not going to take the risk. At least not directly. You know what to do.\n\n“Hey guys you want some extra burgers?” you ask.\nThey seem to be surprised you’re asking them so politely, but they accept.\n“Yeah! And make it quick faggot!” one of them says.\n\nYou begin making up burgers for them, while Billy wonders what the hell you’re doing.\n“What the hell are you doing Mel?”\n“Something YOU should’ve thought of a long time ago fat ass!” you say finishing up the burgers, and give them to one of other employees to serve to the skinheads.\n“Now watch biological warfare at work.” You say.\nSoon, the skinheads don’t feel very well, and start collapsing on the floor, retching and outright puking. You go to stand over them as they moan in pain.\n\n“Aww, do your tummys’ ache? Maybe next time you’ll think about making sure the person making your meal isn’t putting tainted meat in it! Fucking idiots!”\n“Dammit Mel, this doesn’t help me! They could sue the place now!”\n“Relax, if the health department hasn’t shut you down yet, I doubt this little incident is going to cause them to. Hell I’m surprised they didn’t get sick from just eating your regular hamburgers! Where’s my money?”\n“Well alright, but help me drag them out of here.” Billy says handing you the money.\n“Get your minions to do it for you, I don’t work here!” you say and leave.\n\nYou go buy the “top shelf” wine, get drunk and proceed to practice shooting at broken furniture lying outside your trailer until Tina comes home.\n\n“Well I see you’re in your usual state of drunkenness. Did you actually work at Billy’s today?”\n“See for yourself (hic!)” you say and throw a wad of money on the ground. As Tina bends over to pick it up, you take advantage of the situation and her position.\n“Oh fuck yeah!” you shout in the middle of the act and fire your pistol up in the air several times.\n\nThe next day you and Tina are the topic of discussion in the entire trailer park.\n","page 40":"“Calm the fuck down, ya fuckin’ loser! Now how much you want?” you say, pushing him away, he suddenly regains his composure.\n“Um…um…forty dollars!”\n“Alright, wait here.”\n\nYou go back in, make the transaction and give the junkie his purchase. He’s so eager to get high, the desperate fucker pulls out a wire coat hanger and starts cramming the fix into his track marked arm right then and there!\n\n“Jesus! Fuck, go do that shit somewhere else!” You say and kick him to make him move along.\n\nYou continue to do your job and around night time you start to see a noticeable change in the demeanor of the customers. They’re a little more rowdy. Most of them were here during the day and their high is wearing down so they’re back for more, of course it hasn’t worn off completely.\n\n“Hey motherfucker, I wanna see that cocksucker Sam!”\n“Well that ain’t gonna happen, now tell me how much you want.”\n“I want YOU to get the fuck outta my way! I wanna buy directly from Sam! I don’t fuckin’ know who the hell you are!” he says poking you in the chest with his finger.\n\nThat’s funny since he’s the very same junkie who was cramming the fix into his arm with a coat hanger earlier today.\n","page 42":"“Yeah well maybe this will help you remember…” you say and then sucker punch him. It doesn’t quite have the effect that you’d hoped, he’s still hopped up. He attacks you ignoring the fact you’ve broken his nose and wrestles you to the ground. He punches you in a flurry of anger. While he does that, you reach for a nearby rock and smack him in the head twice with it, getting him off of you. When you stager back up, you pull out your gun and shoot him twice in the legs, actually you were aiming to for his crotch, but you were still a little disorientated from the blows to the head you took. As the other junkies back off, and some other trailer park residents come to see what’s going on, Sam immediately comes out.\n\n“Mel! What’s going on?”\n“Had to put one of your customers back in line. No big deal.”\n“Oh. Alright then, somebody drag that trouble making piece of shit somewhere else.”\n\nWell a meth lab might not close down, but there’s no way you’re going to be here all night keeping the retards in line, soon after the incident, you tell Sam you’re taking off. He tries to convince you to stay, but you just want to get paid and get the hell out of there. He offers you to come back tomorrow, and you say you’ll think about it.\n\nYou come home, and Tina’s already there.\n\n“Whew! Mel, you smell like a fuckin’ meth lab! You better not be fuckin’ doin’ that shit!”\n“Tina do I look like I’m bouncing off the fuckin’ walls? I was working over at Sam’s today, so you’d get off my fuckin’ case!”\n“Did it ever occur to you to get a legal job?”\n“Tina, you do things your way, and I’ll do things mine. An’ right now, I’ll be doing you.”\n","page 161":"Not a place for the weak, but you’re prepared for it. Of course you need to gather some things. First of all you grab your pistol, shot gun and lots of ammo. You know this isn’t going to be a cake walk, you need someone to keep an eye out, while you look for stuff. You go to your “friend” Dan’s trailer. You knock on the door and he answers it almost immediately.\n\n“Oh hey Mel! What’s going on? You want some blow?”\n“What the fuck? You gone faggot on me?”\n“What? No! No! I mean coke!”\n\nHe’s hyper from doing too much coke already, good he’ll be perfect.\n\n“No man, look we got some work to do, so come on I’ll tell you what to do on the way there.”\n“Work? Um I dunno Mel, I’m kinda busy you know…”\n“Dan, you ain’t doin’ shit except getting’ high and probably fucking some fat bitch. Get yer ass in the truck! You’ll be getting a cut of the money to go get wasted some more don’t worry.”\n\nDan jumps at your command and quickly gets in the truck. You get in the truck and start driving. You turn on the radio and appropriately AC/DC comes on to get you in that “warrior mode”, of course Dan’s chatter ruins it for you.\n\n“So um, what’s with all the guns, Mel?”\n“Goddammit, you couldn’t have saved your questions for after this song? We’re going to the abandoned warehouse district, to pick up scrap.”\n“WHAT!? I didn’t know that! If I had…”\n“If you had, you still woulda been coming with me, kicking and screaming. Now stop being a bitch and fuckin’ be a man! I need someone to look out while I’m searching for the good stuff, an’ being as hyper as you are, I know you’ll at least be good at that. If someone fucks with you, well that’s why I brought the shot gun.”\n“But I don’t wanna kill anyone!”\n“For fucks sake, its not gonna come to that probably. You just need it to at least appear threatening. Only use it as a last resort. Knowing you, you’ll probably shot your goddamn foot off with it.”\n\nYou finally get to the abandoned warehouse district. It’s pretty quiet actually, normally there’s scrap collectors battling it out in the streets. Of course maybe they’re all fighting in the buildings. You’re about to go inside one of them, when a miracle happens, Dan gets an idea.\n\n“Hey Mel, why the fuck do we gotta look for anything? Why not just wait around for some other idiots and jump them for their stuff?”\n\nAh now THERE’S the criminal mentality that Dan’s suddenly unleashed! He might be cowardly junkie, but the fool makes a good point.\n","page 163":"You go to the scrap yard to collect money for your finds. They throw the money at you, and give you a little extra just to quit stinking up the yard. You go to the liquor store and buy yourself some liquid rewards, where the proprietor almost does the same thing.\n\nWhen you get home, you decide to do the thoughtful thing by sparing Tina of your current odor and take a shower. This pays off later when she comes home, she’s used to your smell of alcohol, but the skunk smell would’ve resulted in no “happy time” for you.\n","page 162":"You don’t feel like putting up with too much drama today, so you decide to take the road less traveled literally. You drive for awhile trying find scrap as well as something to listen to on the radio.\n\n“Oh shit! NO! Fuckin’ pop shit! What the fuck is happening to this country where some fuckin’ pretty boy who sings like a bitch gets popular? Ain’t fuckin’ right…No! Fuckin’ rap garbage, they need to remember to put the “c” back in front of that brand of…whatever the fuck it’s suppose to be, cause it ain’t music. What the fuck is this? Garth Brooks? Fuckin’ pussy! He ain’t no real country singer! Fuckin’ poser! Ah this’ll do I guess. Yeah!” You say as you finally settle on the “Dinosaurs of Rock” station.\n\nEventually you have as much success in finding scrap as you do in your recent quest to find a radio station. As you’re struggling to load an old stove into your pick up truck, the wilderness decides to show exactly what it thinks of you as a skunk passes by and sprays you for no apparent reason.\n\n“UGH! Goddammit!” you say, as the skunk goes bounding back into the underbrush.\n\nYou stink pretty badly now, though you’ve smelled worse, like that one time you participated in the town’s first and last pork butt eating contest. The gases you and the other contestants were giving off were bordering on noxious that day. Damn shame that small explosion occurred when in the middle of the contest when someone lit a cigarette up, or else you would’ve won. Yep, life just seems to conspire against you from achieving greatness.\n\nWell you could call it a day. You won’t get a lot for this stuff, but you can at least prove to Tina you did something, or you could ignore your own stench as you have so many times in the past, and keep looking.\n","page 164":"You ignore the smell of skunk on you and continue driving. Your search proves fruitful. You find enough stuff that you have to stop due to your truck being full. You also find a full bottle of whiskey in an abandoned refrigerator! “Who the hell would throw something like this out? Shit, its mine now!” you say and start drinking. You notice you’ll have to go to the scrap yard tomorrow though as its now night time, so you start heading back home.\n\nOut in the wilderness the night is a lot more imposing. No lights at all except the stars and your own headlights…and that strange light in the sky that’s suddenly appeared over your truck.\n\n“What the fuck?” you say and step out of your truck, looking up.\n\nSuddenly you feel a surge coursing throughout your whole body! You’re completely rendered numb and feel yourself floating upward.\n\nYou black out only to wake up on a table, you can’t really see what’s happening as your eyes are covered in some sort of jelly substance, but you can make out some strange looking figures with objects in their hands. You know you’re naked and you’d probably attempt to talk, but having some sort of metal object holding your mouth open makes that a bit difficult. You feel sticky all over, followed by sharp poking sensations and you don’t EVEN want to think about all the places you’re being probed…\n\nAfter falling in and out of consciousness during this unpleasant event, you can see another blurry figure getting on top of you. It looks female, but different somehow. You know its fucking you though. It doesn’t feel all that good for some reason though. Eventually she finishes and gets off of you. Damn, she didn’t even kiss you.\n\nYou pass out again as more weird looking blurry figures come in. The next time you wake up, you’re lying outside butt ass naked outside your truck. You quickly get in it and drive home as fast as you can (And having a hard time sitting) When you run in the trailer, Tina is wondering what the fuck is going on.\n\n“Mel? What the fuck? Why the hell are you naked?!”\n“Tina! I don’t know what the hell happened! But I think…I think…”\n“What?! Spit it out man!”\n“I think I was abducted by aliens and they probed me and then one of their women fucked me to repopulate their planet or something, but I didn’t enjoy it I swear!”\n\nTina looks at you for a good five minutes in silence and then starts laughing.\n\n“Mel, that’s the funniest excuse I’ve heard yet for getting drunk! Hahahaha!”\n“I’m not drunk! This happened!”\n“Oh suuuuure it did! I can smell the whiskey Mel! You probably got drunk, passed out and had an interesting dream relating to all that science fiction shit you’ve been known to watch.”\n“What?! I’m serious Tina! Why am I naked then?”\n”Hell if I know. Maybe some teenagers passed by and saw you lying in the gutter and thought it would be funny to strip your clothes off.”\n“I was in the wilderness! Aliens got me Tina! I know it!”\n“Look Mel, I’m tired and the joke’s over. Quite frankly I don’t give a shit, I’m going to bed. Forget about sex tonight seeing as you were fucking inter-galactic whores. Yeah right, like if aliens DID come down, they’d want you! Hahahaha!”\n\nYou know it happened! Didn’t it? Is it possible that whiskey you found just made you hallucinate? No! It happened and you’re determined to tell everyone!\n\nThe next day you make a call and later get booked on the Larry Leaper Show called “I was abducted by space nymphos.” You become a town star! Normally you’d try to make a lot of money off of this, but you decline despite Tina’s nagging that if you’re going to claim this happened then you should milk it for all its worth. Its not that you’re humble, but you just worry about having to pay half of the money for child support for the little inter-galactic bastard if the Mom ever comes back, and you’ll be damned if you’re gonna do that!\n","page 101":"“Arrgh, alright since you probably won’t leave me the fuck alone about it.”\n“Oh thank you! Like I said I don’t have any money, but I can repay you in other ways. Do you want to…”\n“NO! Just go get your stuff, I gotta figure out how we’re gonna get out of here.”\n\nWhile Suzy goes to get her belongings, you make your way back to the truck, and just your luck, you run into Clem.\n“Hey there Mel, where ya goin’?”\n“Oh hey, y’know I just don’t think this is for me,”\n“Aw a little too much hard work for you city boy? Haw Haw!”\n“Well that and the smell.”\n“Well I will give ya that. Sometimes the smell is too much for some folks. It’s okay though, you’re still my favorite cousin!” Clem slaps you on the back hard.\n“Erm, Thanks.” You say and see Suzy trying to sneak behind her dad, she makes a motion that she’s going to hide in the back of your truck, you try to keep Clem focused on you.\n“So hey, you’re not mad at me are you?”\n“Me? Nah! Like I said you’re still my favorite cousin! It might be just as well thought that you didn’t work out. My wife Bertha as you know isn’t too fond of ya ever since you told me that I shouldn’t marry her.”\n“Hey I was drunk remember?”\n“Oh I know, I know, but geez Mel, didja have ta call her a cow? I know it ain’t apparent but my wife’s sensitive about her weight! I told her it don’t make no never mind to me, but you hurt her feelings that day and I don’t think she ever forgave ya fer that.”\nYou see that Suzy has hidden herself as well as she can, you decide it would be a good time to leave.\n“Oh well, I guess I’ll just have live with that fact then. See ya Clem.”\n“See ya Mel, have a good un’!”\n\nYou drive off as quickly as you can before anyone can figure out what’s going on. Suzy suddenly shouts in your ear through the back window of your truck.\n“Yeah! No more pig farm! So where are we going cousin, back to your place?”\n“I’m going home, but you won’t be following me!”\n“But, but you can’t just abandon me!”\n“Stop fuckin’ whinin’! I’m not abandoning I’m gonna drop you off somewhere where I think you’ll fit in JUST fine…\n\nLater…\n\nTina comes home, she doesn’t look pleased.\n“Mel! What the fuck was the meanin’ of dropping that little slutty cousin of yours at the strip club? They gave her MY spot!”\n“So? Aren’t you always sayin’ that they over work you there?”\n“Yeah, but…”\n“And aren’t you always sayin’ how we don’t spend no more time together no more?”\n“Yeah, but…”\n“And since I don’t have a job at all and you havin’ to spend less time at the strip club now, don’t you think we can spend all that extra time together like you wanted?”\nTina looks at you for awhile, and then smiles.\n“Oh Mel that was so sweet of you!”\n“Yeah well I am the thoughtful one. Speakin’ of sweet, bring your sweet ass over here, I haven’t had a drink today so I’m gonna need a LOT of lovin’ to make up for it.”\n","page 100":"You know trouble when you see it, and this little underage tart is definitely trouble.\n\n“I know what the hell I’m doing.” You shout, as you throw the food to the pigs. You didn’t realize pigs could jump so high until one bites your finger in an attempt to get at the food.\n\n“OW SHIT!” you shout, and draw your hand away. Suzy instantly runs up to you.\n“See? I told you! Here let me look at that. You’re bleeding.”\n“I’m fine, I…” You stop talking as soon as Suzy begins kissing your hand.\n“Does this feel better? How about this?” Suzy then proceeds to suck slowly on your bleeding finger and look at you while doing it.\n“Uh…stop that! Jeez what the hell is wrong with you, I’m your fuckin’ cousin!” you say withdrawing your hand from Suzy this time.\n“Sorry, would you like me to do that lower then?”\n“I’d like you to leave me the fuck alone! I ain’t intendin’ to make the bloodlines in this family to be anymore inbred than they already are! Don’t you have something else to do?”\n“Not really. Ohhh Tattoos! You get these in the big city?” she says rubbing your arms.\n“Big city? You mean that shithole town I live in? Yeah.”\nI wish I lived in the big city like you. That way I could do anything I wanted instead of being stuck here on this boring ol’ farm.”\n“Well why don’t you just fuckin’ leave?”\n“How? I don’t have no money.”\n“Oh I’m sure a girl like you could make tons of money in town, all you gotta do is get there.”\n“Huh! Ma and Pa would never allow that! They want me to rot here!”\n“So, who says you gotta do what they say? Fuck, my Pappy used to beat me with a fuckin’ ball peen hammer when I used act up an’ I still did what the fuck I wanted anyway!”\n“Aw man that’s so cool! Oh Cousin Mel will you take me back to your town?! It’s so boring here! I wanna live where the action is!” Suzy begins grabbing your arm in excitement.\n\nNice going big mouth.\n","page 102":"“Hell no! You ain’t getting’ me into trouble. You wanna get to town so badly then you find your own way. An’ no, wiggling your ass isn’t gonna help you change my position on the subject either, so you’d better just get that out of your mind right now. Whew, it’s fuckin’ hot.” You say getting back to throwing food to the hogs\n\nThis simple statement seems to give Suzy a glimmer in her eye and she runs off. As you continue to avoid getting your fingers bitten off by swine, Suzy returns with a jug, which she gives to you.\n\n“What’s this?”\n“Well you said you were thirsty, so I went and got some of my Daddy’s White Lightning from our still out back.”\n“Oh ho! So I guess pigs aren’t the only way you’re raking in money around here.”\n“Nah, Pa just uses it for himself mainly and a few others, I never drank any before I heard it’s really strong.”\n“Shit, they ain’t MADE a drink strong enough for me yet.” You say and proceed to knock the jug back.\n\nAbout five minutes after drinking it, you feel quite different…\n\n“So about goin’ back to town, you gonna take me?” Suzy asks again.\n“Huh? (hic!) Ohhhh so that wasssh yer li’l plan eh? Get me dru (hic!)get me dru (hic!) get me drun (hic!) get me inebriated so I’d be easier to convince.”\n“Oh no I’d never do that cousin Mel, I know you’re too smart for that!” Suzy says and begins rubbing your chest.\n“Ah (hic!) now you usin’ (hic!) yer wiles on me again! I know you! (hic!) hmmm but I gotta say I don’t mind it right now…” you say and start fondling her. You hear some laughter and then you black out…\n\nYou feel the splash of ice cold water on you.\n“AGH! What the fuck!?” you wake up, rub your eyes and feel a heavy kick to your ribs.\n“Mel you dipshit! Suzy’s gone! You got drunk on MY moonshine an’ she stole your truck!” Clem says and you feel another kick.\n“OW! Fucker stop kicking me!”\n“That’s not Clem, you blind drunken bastard! It’s me!” Bertha shouts giving you another kick.\n“Okay Bertha that’ll do, it probably wasn’t entirely Mel’s fault bein’ that he’s got a weakness for the whiskey.”\n“Wait you said she stole my fuckin’ truck?! Shit! Shit!” you say still half in the bag.\n“Ah I wouldn’t worry too much, she probably just went to town like she’s always harpin’ on about. I’m sure its fine.”\n“No! The fuckin’ breaks are shot on it! She might’ve crashed it!”\n\nYou, and Clem instantly run to his truck, with Bertha threatening that she’ll cut your balls off, if Suzy’s hurt. Sure enough as you drive further up the dirt road, your truck is lying in a ditch; Suzy is sitting by the side of it.\n\n“Suzy you okay?”\n“Yeah, but cousin Mel’s truck nearly killed me!” she says.\n“My truck! You were the one who stole it! You fuckin’ ruined it you stupid bitch!”\n“Now hold on there Mel, you can’t just talk that way to my baby girl like that. It was yer fault for letting her steal it in the first place.”\n“Fuck you Clem!” you say and kick him in the balls. “Since you feel everything’s my fault, I’ll give ya something to legitimately blame me for! Thanks for the new truck!” you take Clem’s key and drive back to the trailer.\n\nTina wonders why you’re home so late.\n“So I see you’re only half drunk, why the attempt at sobriety?”\n“I didn’t wanna ruin my new truck.” You answer collapsing on the couch.\n","page 105":"Well the best way to diffuse this, is to continue to hang around a bunch of smelly hogs! Suzy’s jailbait pussy is gonna be the furthest thing from your mind if you’re bombarded by the smell of rotten food and pigs.\n\n“Okay well I guess I’d better finish this up then.” You say grabbing the wheel barrow.\n“Oh. Okay.” Suzy says a little disappointed, but she hasn’t given up yet. “Well I think I’ll just come with you. I think you still need my help.”\n“Oh no, I don’t need it. Shouldn’t you be helping your mom or something?”\n“I think you do need it. And Mom and I don’t get along. Probably because I look like everything she wished she looked like. Fat bitch!” Suzy says.\n“Well alright then.” You say in defeat. You head over to the other pens. Suzy skips along side you, occasionally brushing her tits up against you. You really wish Tina was here, she’d beat the hell out of this incestuous slut within seconds, while you on the other hand are having a hard time not giving into your baser instincts. It’s all you can do to not to be a hillbilly stereotype of fucking his kinfolk.\n\nFinally when you get to the next batch of hogs, Suzy grabs some more food and does her little Pig “charming” dance again. Except this time she proceeds to remove her shirt. Normally this would result in major bonerage for you, but the fact she’s near a bunch of filthy pigs and rubbing spoiled cabbage on her body makes it a little less appealing to you. The pigs seem to be enjoying the show though.\n\n“Girl get your clothes back on!”\n“Why? Don’t you think I’m hot?” Suzy says and begins unzipping her jeans while trying to balance on the fence. “Doesn’t your girlfriend do this for a living?”\n“This ain’t the time or the place for that!”\nThere go the jeans…\n“Jesus fuckin’ Christ! You better watch your ass, you’re gonna fall in that pig shit!”\n“No YOU watch my ass!” she laughs and slaps her ass.\n\nStrangely you pay little attention to Suzy’s now naked body; instead you notice the pigs getting agitated. Looks like the “charm” is working TOO well. They begin to ram the fence causing Suzy to struggle to maintain her balance.\n“SUZY!” you yell.\n“Eeeeeek!” Suzy falls off the fence and into the pig pen. She’s covered in shit, food and mud, but that’s the least of her problems, as the pigs seem intent on either eating her or fucking her. Probably both.\n","page 106":"Oh man this is bad. This is SO bad…\n\nUnable to resist the sexual wiles of your cousin you head into the barn, you know damn well what’s going to happen.\n\nSoon…\n\n“WHAT THE HELL IS GOIN’ ON IN HERE!?!?” a voice shouts. Its Clem’s wife Bertha, all 400 pounds of her. You immediately attempt to explain yourself, Suzy would probably do like wise if her mouth wasn’t full at the moment.\n\n“Its not what it looks like! I was just…I…” actually you can’t think of a good excuse.\n“Bertha I heard you yellin’ an…oh sweet Jesus, Mel!” Clem says walking in.\n“Look Clem, I…uh…”\nStrangely during this family reunion, Suzy is still focused on her job at hand. She’s focused you’ll give her that. “UGGGH YEAH!” you shout.\n\n“Dammit Mel, why’d you do that for? Now yer gonna have to marry her.”\n“What?! Suzy stop it! Clem what the hell are you sayin?” you say in an attempt to assess this new turn of events.\n\n“Well you deposited your seed into her, she’s yourn’ now son! We’ll have a big weddin! We’ll have a hoot nanny, a hoe down, an’ everything!” Clem says enthusiastically\n“Clem! I’m not havin’ him marryin’ our daughter! He can’t provide for her! He’s a shiftless bum!”\n“Ah come on Bertha, he’ll work here on the farm. Sure he might be citified, but he’s kinfolk! He’ll get used to the work! You’ll feel differently about him when all those baby’s come poppin’ out of Suzy here!”\nYou look back over and see Suzy look at you smiling lovingly at you. This is NOT happening!\n“Clem, I’m not marrying Suzy! I mean…I mean I didn’t even fuck her! She just gave me fuckin’ head!”\n“Oh no, you ain’t gettin’ away on one of those there techno-calities boy! You stuck your meat in her, now ya gotta do the right thing an’ make her an honest woman!”\n“Honest woman? You’re jokin’ right?”\nSuzy begins to get hurt by your remarks and runs over to cry and hug her Dad.\n“Dammit Mel, look watcha did! You got my baby girl all upset! This ain’t a choice, yer gonna marry her, lessen I put foot in yer ass! Now what’s in gonna be Mel, peaceful weddin’ or shotgun weddin’?“\n\n“Well Clem, it’s like this…FUCK YOU!” you say and run forward tackling him and Suzy to the ground. Bertha sees this and tries to stop you by attempting to “dog pile” on you. Fortunately you roll out of the way, and Bertha lands on top of Suzy and Clem both of which begin to gasp for breath. You make it to your truck and escape.\n\nYou spend the rest of the day in your trailer checking and cleaning your shotgun and pistol, just in case Clem comes looking for you. Tina comes home.\n\n“Aw shit, the guns are out and you’re not drunk. Who the fuck did you piss off this time?”\n“Nevermind Tina, it’s a family thing.” You say.\n","page 55":"Normally you’d kick his ass, but you’re already on probation. Instead you storm out of the building and go slash all his tires before leaving. You stop off at the liquor store and spend what little money you had in your pocket and buy a 24 case of beer and then go home. You then proceed to listen to 80s Hard Rock all day and get shitfaced drunk by the time Tina comes home.\n“Fuck Mel, can’t you go ONE fucking day without getting drunk?”\n“ (Hic!) I’m not drunk bitch! I’m…I’m…tryin’ to… ah fuck it, its all bullshit anyway.”\n\nYou then pass out head first into the table, creating a nasty gash that you don’t even feel. Out of semi-concern for you, Tina pours vodka on it, to make sure it doesn’t get infected and goes to bed.\n","page 109":"Well you’re not too fond of your family, but death by pig fucking isn’t something you’d wish on any of them, maybe others, but not family! You jump over the pen fence and start kicking the pigs in the face. They don’t like that and begin squealing in displeasure!\n\n“Gweeee! Gweee!” they begin to bite at you as you attempt to pick up Suzy who’s still trying to get out of the mud.\n“Ugh! Get up ya dumb bitch!” you say and sling her over your shoulder, as a hog bites you viciously on your ass.\n“Agh Fuck!” You back kick the pig, throw Suzy over the fence and leap over landing on top of her.\n\n“What the hell’s goin’ on here?!” you hear a deep voice shout…and it isn’t your cousin Clem. You look up and see Bertha, all 400 pounds of her standing over you and her daughter who you just realized that underneath all the filth IS naked. You being on top of her looks mighty suspicious. You quickly get off Suzy.\n\n“Mel I always knew you were no fucking good! I knew that at the wedding when you told Mel that he shouldn’t marry a fat obnoxious cow like me! Now I see you tryin’ to fuck our daughter!”\n“I wasn’t! She was dancing naked on the fence and she fell in the pig pen! I just saved her fuckin’ ass!”\nSuzy’s previous big rebellious talk against her mother seems to change when face to face with her. “He wanted me to do all kinds of weird things Ma! Like dance naked with the pigs and then cover myself with their shit before he fucked me! I was so scared!”\n“WHAT!!? Why you fuckin’ lyin’ li’l cunt!” you shout\n\n“The only liar here is you, you fuckin’ sick bastard!” Bertha shouts back and takes a swing at you. She misses but she’s surprisingly spry for being such a large woman. You deck her, but your fist slides off her fat greasy face. She tries to kick you in the nuts at this point, but luckily for you her legs don’t reach easily and she falls down under her own weight due to lack of support. She lies helpless on the ground trying to get up, at which point you make your escape back to your truck and drive off.\n\nYou spend the rest of the day attempting to get the stench of that farm off of you. Tina comes home and enters the bathroom to see you being unusually hygienic.\n\n“Wow, Mel, did the farm stink THAT badly?”\n“Yeah, and so does the attempt to do good deeds.”\n","page 54":"“Oh fuck you Billy! You’re the one getting your half incher sucked by sixteen year old bitches on a regular basis and you call me a fuckin’ perv? And you can take this fucking job and shove it up your fat fucking ass! This fucking hairnet’s fucking up my mullet anyway!” you shout and throw it in his face and then kick him in the balls. (At least you think you do, considering all his blobby flesh its hard to tell, but it seems to have the desired effect.) And punch him in the face.\nAs he falls to the ground in pain, his mounds of flesh seem to jiggle in a slow motion type way, some of “him” hits the grill and you can smell the cooking of flesh. Mmm smells like bacon!\nWhile Billy screams in pain from his third degree burns, you grab Peggy Sue’s tits.\n“How’s THIS for sexual harassment?” you say and she screams and goes running off. You then go into Billy’s office and take the bottle of liquor that he keeps in his desk as worker compensation. Finally, you then take the opportunity to piss on the floor, which clears everyone out of the building pretty fast.\n\nYou get home and watch wrestling, drinking the whole time. Soon Tina comes home and looks at you in dismay, but too tired to argue.\n\n“Let me guess, you got fired already for being a complete dick to everyone.” She says.\n“You know me so well, and that’s why I love you baby.” You say taking another drink.\n","page 108":"There’s no way you’re gonna be able to save her from all those huge adult pigs. Chances are they’d fuck and eat you too given the agitated state they’re in. You run off to find Clem as you hear Suzy scream for someone to help. Eventually you find him.\n\n“What?! Goddammit Mel! You shoulda been savin’ her! She might be dead by now and if’n she is I’m personally gonna make you my NEW daughter to replace her!” Clem runs to grab his shotgun. You both run to the pen, but Suzy is climbing out a little shaken, and completely covered in nastiness. The pigs seem to have lost interest in her and are now rolling around in their own filth contentedly\n\n“Darlin’! What happened?”\n“Oh Daddy it was…it was…WONDERFUL!”\nYou and Clem look at each other. “WHAT?!”\n“I mean I was ravaged like a common farm animal. Mmmmmm, I never knew the touch of a pig could feel sooooo good!” She says rubbing her hands over her disgusting body and wandering off to the house.\n\nYou’re not sure how to react. If you had a weaker stomach you’d probably puke, but of course being made of stronger stuff you just stand around looking like a dumb ass instead.\n\n“Well, I think you’ve done more than enough work today Mel.”\n“Hey look Clem it’s not my fault that your daughter got molested by horny pigs!”\n“What? No I’m not mad about that! If anything I’m happy, Suzy’s been wanting to leave this farm for a long time. I was wondering how I was going to keep her here. Well I know she’s gonna stay put now! I’m gonna give you ”\n”Uh…okay. Clem aren’t you the least bit concerned that your daughter got fucked by pigs, let alone the fact she likes it?”\n“Fuck no! I mean hell I’ve been known to slip some pork to the pork now and then! We all done it.”\n”Hey Mr. animal lover, I HAVEN’T fucking done it! An’ I’m not about to!”\n“Haw Haw! You don’t know what’s good boy! Ah, I guess you don’t know no better bein’ citified an’ all. Well here’s your money.” Clem hands you a wad of bills. They smell like the rest of the farm, but green is still green.\n\n“You coming back tomorrow? Got some more work for ya to do. Could be lucrative!”\n“No Clem, you just reminded me why I don’t associate with the rest of my fucked up family!” you say and drive off.\n\nYou’re eager to get rid of the money Clem gave you, since it’s stinking up your truck, of course you’d be doing that anyway. You don’t think the stink of that farm is ever going to come off of you. After spending most of it on beer at the liquor store, you go home and get drunk. Tina comes home.\n\n“Well, well, well, I guess you got some money somehow, I hope you didn’t spend it ALL on fuckin’ beer. Whew! It smells like pig shit in here!”\n“(hic!) Hey baby I was just thinkin’ how high class we are.”\n“Oh? And what made you come up with this delusion?”\n“Well (hic!) we might be dysfunctional white trailer trash…BUT at least we don’t fuck pigs.”\n","page 59":"Probably just a rat, Billy really needs to get better traps. Exterminator isn’t part of your job description, so you leave and prepare yourself to clean the men’s bathroom. On your way there, Billy stops you.\n“Hey Mel, some woman just came running out of that bathroom half ass naked! What the hell did you do?”\n“I didn’t do shit! She went in the stall to take a piss and then came out screaming, probably got bit in the ass by a rat sloshing around in your toilet!” you say as customers look in your direction.\nBilly attempts to quiet you down. “Shhhh! Fuck Mel, you want everyone to hear?”\n“Fuck off Billy, everyone knows this place is a health hazard anyway!”\n“Fuck you Mel, you’re fired!”\n\nSuddenly a big ass alligator comes crashing through the bathroom door and eyes everyone in the place as potential food. It scampers quickly to the nearest customer and begins to bite into him. “AGGHH!” People begin running for the exit\n\n“Shit! I’m gonna get sued!” Billy shouts as he goes running into his office.\n“Dammit, Billy you cowardly fat bastard!” you say and run and grab a meat cleaver.\nYou swing at the alligator which moves out of the way as it rips some flesh off of the customer it was chewing on. Billy comes out with a .22 pistol and begins firing at it; unfortunately he’s so scared he hits one of his employees hiding behind one of the tables!\nThe alligator having a sense of its own survival goes running off out the door while Billy’s place is left with a customer clutching his chewed up arm and an employee who’s been shot in the leg.\n\n“Oh no! My place! Awww man! Shit!” Billy laments\n“Yep, sucks to be you. Well I’ll be going now.”\n“What?! You better fuckin’ help me clean this shit up!”\n“Go fuck yourself fat ass! You fuckin’ fired me remember? Now you got injured customers, workers, and a pissed off fired employee. As a matter of fact I’d say you got a big lawsuit on your hands! See ya in court!” you say leaving while Billy yells obscenities at you.\n\nYou go home and watch Judge Roy Williams in an attempt to study up on your “legal skills.” Tina comes home and looks slightly confused to as why you’re watching that and not even drunk.\n“What’re you doin’?”\n“Investin’ in our future baby.” You say trying to take notes.\n","page 58":"You cautiously open the stall door. You wish you had your converted Desert Eagle with you right now, but your mop will have to do. SOMETHING splashes filthy water from out of the toilet right in your face causing you to fall to the floor and the door closing.\n\n“Agh Fuck! Pfft! Shit!” you say spitting the water out that got in your mouth, Billy waddles his fat ass in.\n“Hey motherfucker what the hell’s going on? Some woman just ran out the place showing everything her momma gave her. Shit, her hair was so red it looked like her pussy was on fire. You tryin’ to molest my fuckin’ customers? You better not be. I don’t need a goddamn lawsuit!”\n“No I leave the molesting to your fat greasy ass. She ran out of here because there’s something clogging up your toilet, that’s as big as my dick. Its probably one your pre-cooked burgers that got away from the rat traps.”\n“Stop saying that! I only used rats that one time because the people at the slaughter house were on strike!” Billy protests.\n“Yeah, yeah tell it to the health department.”\n“Well?”\n“Well what?”\n“Well aren’t you gonna go in there and kill whatever it is?”\n“What?! Fuck off; exterminator ain’t part of my fuckin’ job!”\n“It is now!” Billy insists.\n","page 53":"“Fine, if I gotta work in this shithole I might as well clean it up!” you say.\n“Hmmm well since you feel that way, you can start on the bathrooms.” Billy says handing you a mop.\n\nYou grab the mop and start cleaning the ladies room first since you know the men’s bathroom is going to be disgusting no matter what you do.\n\nIt’s relatively uneventful, until a redheaded woman walks in and just stands around watching you, giving you a dirty look.\n\n“You got a fuckin’ problem ya redheaded cunt?” you ask.\n“Yeah asshole, I wanna take a fuckin’ piss and you’re in here!”\n“So go take a fuckin’ piss bitch! I don’t give a fuckin’ shit, don’t nobody want your freckled ass anyhow!”\n“Fuck you, you inbred bastard!” the woman says, but goes into the stall and closes the door. Soon she immediately comes out screaming with her pants around her ankles exposing everything she didn’t want you to see to everyone in the place!\n\n“Holy shit, her hair was so red it looked like her pussy was on fire.” You say to yourself, and then you hear something sloshing around in the stall.\n","page 52":"“Fine, I’ll flip your goddamn rat burgers then!” you say and head to the kitchen.\n\nYou put some meat substitute on the grill, not even bothering to remove the hair, and begin to flip them. You’re actually pretty calm for a total of 2 whole minutes before two of your co-workers start getting on your nerves.\n\n“So I said to Jed, I don’t care if you got a car, I’m still not sure if I want you to do that to me.”\n“Did he try that with you too? When we were going out, he always wanted me to do that, so I eventually let him.”\n“Really what happened?”\n\n“She fucking squealed like a goddamn pig when he fucked her in the ass!” you shout rudely. “Jesus fuckin’ Christ, will you two little bitches shut the fuck up? This burger flipping is pointless enough without having to listen to you two split tails yammer on about your anal sexcapades!”\n\nOne of the future welfare mothers of America is very hurt by your remark and runs off crying, the other gets very mad at you.\n\n“Who the hell do you think you are? I’ll get my boyfriend Jed on you! I’m telling Billy!”\n\nYou ignore her threats, and start spitting in the burgers as a sign of your contempt, soon Billy comes out of his office very mad. “Peggy Sue here tells me you sexually harassed her.”\n“What the fuck? I didn’t do shit! I just called her and her friend annoying bitches!”\n“That’s sexual harassment; you were creating a hostile work environment! You’re fired dickhead!”\n","page 66":"Well you’re not too keen on doing some REAL work, so you ask what Jim’s mission is.\n\n“Go in Petrov’s and do some recon for me.”\n“What good is that gonna do? What you think he’s got some kind of secret weapon or some shit? The fuckin’ cold war’s over you know!”\n“Fuck you! I know that commie bastard’s (COUGH!) got something over there that’s drawing more people there, find out what it is!”\n“Haven’t you ever been in the shop?”\n“No. And I ain’t setting foot in some soviet store front!”\n“Setting foot?” you snicker.\n“You know what I mean wise ass! (COUGH!) Now you got your orders, now go!\n“Yeah, yeah.”\n\nYou exit and head down to Petrov’s. You don’t even know what you’re supposed to be doing, let alone how to go about doing it! All you know is, you’ve had a run in with Petrov before and it didn’t end well. The place is a lot brighter than Jim’s. It almost looks too clean to be a repair shop. There’s an unrecognizable flag of some country you’ve never heard of (let alone pronounce) on the wall. You see Petrov, he’s chain smoking as much as Jim, but is somehow twice as dirty and grungy.\n\n“YOU! You there! I remember you! You call me communist asshole! Get out of shop and kiss my dick!” Petrov yells as soon as you enter.\n\nNope he still doesn’t like you.\n","page 65":"“Look, I’m just here to fix shit, not to indulge your Nam flashbacks.”\n“Wait, do you even know how to fix anything?”\n“I can use a hammer.”\n“Good enough. Well? Get to work motherfucker! (COUGH!)” Jim says and goes back to his work table in his office.\nYou start to work on a TV. Soon a customer comes in. He doesn’t look like he’s from around here. He’s well groomed for one thing. He has a disdainful look upon his face as he enters and approaches you.\n\n“Hey you, my car just broke down.”\n“Oh yeah? That’s tough shit. What the fuck do you want me to do about it?” you ask.\n“Well isn’t this a repair place?”\n“Yeah, for TVs an’ toasters an’ shit, not fuckin’ cars ya fucktard! Hector’s garage is over on the other side of town.”\n“I can’t possibly be expected to go traipsing in this god forsaken town! I was just passing through, and had the misfortune of breaking down in front of your shop! Don’t your type usually know how to fix vehicles?”\n“MY TYPE? What the…” before you can finish, Jim comes squeaking from his office.\n“What the hell’s going on here?”\n“This uptight bitch came in here demanding that I fix his car, I told him Hector’s garage is over on the other side of town.”\nJim looks at the outsider up and down.\n“You willin’ to pay up boy?” Jim asks.\n“Yes, yes! Anything, I just want to get out of this town!”\n“Alright, assuming your car isn’t in too bad of condition, (COUGH! COUGH!) I think we probably got the tools and supplies here to fix it.”\n“Good! And be quick about it!” the man says and walks out the door.\n“Well you heard him Mel.” Jim says.\n“What? I didn’t sign up for that!” you say\n“(COUGH!) Oh fuck Mel that dickhead (COUGH!) probably just blew a hose or some shit. It can’t be that hard to fix! Besides with Petrov cuttin’ in on my business, it’ll be a nice (COUGH!) chunk of change.”\n“Wait, aren’t YOU cutting in on Hector’s business by getting into fixing vehicles?”\n“Look, are ya gonna do it or (COUGH!) not ya argumentative sonofabitch?”\n","page 68":"“Look if you wanna go fix that shithead’s car go right ahead, but I ain’t doin’ it! He’s already pissed me off, with his condescending attitude. I’m libel to kick his ass.”\n“(COUGH!) Oh fine I’ll fuckin’ do it then! Get back to fuckin’ work on that TV and look after the shop if you think (COUGH!) you can handle that!”\n“Yeah, yeah. See ya later Ironside.” You say dismissively as he squeaks out the door.\n\nYou work in peace until someone enters the shop. Oh great it’s your “friend” Dan. He’s very surprised to see you. He’s looking around and twitchy as usual.\n\n“Hey Mel, what’re you doing here?”\n“I work here now, what’re you doing here?”\n“Uh, no reason…”\n“Bullshit, you’re probably in here to rip something off to support your fuckin’ habit! Shit, you’re so fuckin’ obvious!”\n“I am not! I was uh, looking for a job here too!”\n“Dan, you gotta be fucking desperate, what fucking dealer is going to take BROKEN TVS as payment?! Not to mention stupid, you know what Jim would do to you, if he caught you? Crazy fucker has more weapons than the army.”\n“Shhh! Come on Mel, isn’t there something here that’s fixed yet?”\n“How should I know? I just started working here! I guess that waffle iron over on that table’s fixed. In fact anything on that table I think is ready. And NO! You’re not getting me in fuckin’ trouble because you’re a goddamn thieving junkie! So you’d better just go else where.”\n“Aww come on! I just need something!”\n","page 67":"“Alright, fine! What do you want to charge this rube?”\n“Just try to get as (COUGH!) much as you can.” Jim says.\n\nKeeping that in mind you leave the shop, “Fuck! The sun!” you say as your eyes have to get re-accustomed to the outside. You see the stuck up prick by his fancy convertible car. You also see what you assume is his girlfriend or wife still sitting in it.\n\n“Okay lift up the hood and let’s see what’s wrong with this thing.” You say.\n“Me? You’re the mechanic! You do it!”\n“For fuck’s sake all ya gotta do is pull the little handle in the…nevermind I’ll fuckin’ do it you prissy bitch!”\nBefore you can reach into the car to pull the hood handle, the man’s girlfriend pulls it instead.\n“Steve, we don’t need to antagonize the man.” She says.\n“Susan, will you keep quiet! I know how to handle this situation! Stop nagging me!”\n“Oh yeah, you’re handling everything real well pretty boy. Sounds like there’s trouble in paradise. Heh heh!” you say.\n“Mind your own business, and just fix the car!” Steve snaps.\n“You better start fuckin’ mindin’ your tone with me.” You say waving a wrench at him. “And stop fuckin’ hovering over me. If I’m gonna fix this thing I need the both of you out of the fuckin’ way!”\n“And where are we supposed to wait?”\n“I dunno, I don’t give a fuck! Go to the fuckin’ porn shop down the block and buy your girlfriend a fuckin’ vibrator or something. Or buy one for yourself, whatever shit you’re into, just leave me alone!”\n\nSteve seems unable to even form a response to your tirade, he just takes his girlfriend and walks off somewhere in a huff. Good. Now you can work in peace. Sure enough, Jim was right, there was a blown hose. All you have to do is replace it. You could fix it properly though, if you went back in and got some more tools.\n","page 69":"This arrogant fuck has pissed you off, and you’re not about to waste anymore time than you need to on his car. You replace the hose and slam the hood down just in time for Steve and his girlfriend to come back.\n\n“It’s all fixed.”\n“Took you long enough, how much is it?”\n“How much you got?”\n“Don’t try to intimidate me, how much?”\n“Motherfucker, if I was trying to intimidate you, you’d be begging for mercy and pissing your pants by now. I’m asking you how much you got!” you say getting in his face and then grabbing his wallet from him. You take 400 dollars out of his wallet, and hand it back to him. Steve looks like he wants to say something but resists and just gets in the car. Lucky him.\n“God you’re such a pussy!” Susan says to Steve.\n“Shut up! Shut up!” Steve says back and screeches off.\n\nYou go back inside and hand Jim a hundred dollar bill.\n“Mel, (COUGH!) you better damn well give me the rest of this shit!”\n“What? You said get as much as I could and he wouldn’t budge. I only used a fifty cent piece of fuckin’ rubber to fix his car anyway, you still made a profit ya greedy bastard!”\nJim looks at you VERY suspiciously, “You probably pocketed the rest.” he says,\nbut lets it drop.\n\nThe rest of the day is relatively uneventful until Mei Mei starts yelling at Jim again, you take that as a good opportunity to leave and say you’ll see him tomorrow. You also take the opportunity to stop and get drunk at the bar. You get loaded and don’t leave until the wee hours of the night, you end up running over 2 cats on your way home and park your truck in the middle of the trailer park. You stumble to your trailer and fumble with your keys. Tina opens up the door.\n\n“Did you get a job today?”\n“(Hic!) Sure did baby!”\n“Alright you can come in.” Tina says and attempts to guide you to the bed, but your body decides it will be more comfortable on the floor.\n","page 62":"“Fuck that! You ain’t paying me near enough to go killing things living in your toilets! Do it yourself!”\n“Dammit Mel, you better do this or you’re fired!”\n“Is that suppose to fuckin’ scare me? Go ahead, I don’t give a shit!”\n\nBefore Billy can tell you that you’re fired, the thing that was in the toilet shows itself in an impressive way. A big ass alligator comes out the stall knocking the door off the hinges. It looks at the both of you in hunger, but especially Billy. You and Billy immediately run for the door, you make it first. As you run back into the eating area, you hear Billy scream “AGGGGH! HELP ME!” The place has cleared out of customers, and Billy’s idiot employees are just standing around with their thumbs up their asses.\n\n“What’s going on?” one of them asks you, picking his nose.\n“Goddammit boy are you fuckin’ head up with the dumb ass or what? Get me a fucking weapon!” You say grabbing him by the neck and then throwing him to the ground. Upon hearing this one of the brighter employees throws you a meat cleaver. You catch it with the skill of a juggler and run back in the bathroom, but it’s not a good sign that you don’t hear Billy anymore.\n\nYou see the alligator ripping into Billy who’s lying on the floor in a heap of unrecognizable gore. You don’t hesitate; you strike at the gator’s head with your cleaver while it’s preoccupied. It attempts to attack you in its death throws, but with a couple more chops, it dies. THEN all of Billy’s employee’s decide to come in. Upon seeing the carnage, a couple of the girls scream and run off, one of the guys gets sick and pukes on your shoes. “Sonofabitch!” you shout. When you exit the bathroom, the employees seem to want to know what happens next.\n\n“So what do we do now?” another asks.\n“Well the way I see it, Billy’s final wish to us, would be to get worker compensation for working in this dangerous shithole. Namely me.” You say cleaning out the register.\n“Shouldn’t we call the hospital or something?”\n“Oh that, sure I guess. Knock yourself out.” You say as you go into Billy’s office and take his liquor bottles.\n“Where are you going?”\n“Fucker, I’m going home! I did my bit for today!” you say and leave. You go home and don’t even bother washing the disgusting odor of alligator, blood and puke off of you as you get drunk and watch wrestling. Tina notices it right away when she comes home.\n“Holy fuck Mel! What the shit?” she says holding her nose.\n“It’s a long story baby, now come over and gimme some head, I’ve had a hard day at work.”.\n","page 61":"“Alright fine, but you better be paying more for this.” You say\n“Yeah, yeah, whatever I just can’t have things attacking my customers in the bathrooms anymore!” Billy says.\n“Well, gimme one of your fuckin’ cleavers or some shit, I ain’t going in there with just a mop!”\n\nBilly runs off (Well waddles off) and fetches you a meat cleaver.\n“Yeah, this’ll work.” You say, and then you notice Billy brandishing a .22 pistol.\n“Motherfucker, I’m the one going in there, why the fuck do YOU have the gun?”\n“Because its mine Mel!”\nYou shake your head and enter the stall, all quiet so far. You take the mop and begin poking it in the toilet, still clutching the cleaver in the other hand. Suddenly the entire toilet breaks apart as a big ass alligator comes up through it biting the head of the mop off in one chomp!\n\nYou fall back through the door breaking it off the hinges and on to the floor again.\n“HOLY SHIT!” Billy says and begins firing. Unfortunately the .22 caliber has no real effect on its tough scaly hide.\n\n“What the fuck are you gonna do with that Bill? Make it mad?” You say and swing your cleaver at it. It rolls out of the way and slaps you with its long tail, causing you to crash into the mirror. Its eyes hungrily look at Billy’s wide load and scampers after him. He fires a couple more times, but is too scared to aim properly. A bullet nicks your ear and buries itself into the wall.\n“STOP FUCKING FIRING! YOU NEARLY HIT ME, ASSHOLE!” you shout.\n“Oh no!” Billy says sweating and panting heavily, trying to get to the door. It bites his fat ass. “AGGGGH! Mel, help me! Help me!”\n\nWhile you’re tempted to let it eat Billy, you instead sink your cleaver into head; it twitches a bit and then dies. Billy lies on the ground with a bloody ass; he looks up and thanks you.\n\n“Oh Mel thank you! You saved my life! Anything you want!”\n“Anything I want eh? Three months pay in advance!”\n“Done! Here!” He painfully reaches into his pocket and hands you a wad of money.\n“Good. Now I quit!” You pick up the alligator corpse, leave Billy lying on the bathroom floor, and tell the rest of the workers who were standing around outside to call the paramedics for Billy’s fat ass.\n\nYou put the alligator body in your truck and drive home. You spend the rest of the day making a pair of boots for Tina. She’s very pleased when she gets home to see you brought home money AND a gift for her. That night you don’t just get some pussy, you get ALL the pussy.\n"}