{"page 33":"It wasn\u0027t often my emotions got the best of me.\n\nI sat at my kitchen table. The morning sunlight beat brightly down onto my face, warmed the coolness I felt everywhere. I wondered if I had enough money saved so that I could retire. Perhaps I could invite my cousin to take over the store. Perhaps I could leave the cursed city of Blackwood for good.\n\nBut a part of me argued mercilessly against my leaving. That part of me deeply desired to know what Edithe Zilonis truly was, and how she came to be. Another part of me felt compassion for Edithe Zilonis. For her story, at least.\n\nAnother part of me felt a different compassion for Edithe Zilonis too.\n\nI finished the black coffee and went to look through my books again, to see if anyone could explain how a dead could become possessed, if she was possessed at all.\n\nThe study, which was already riddled with dust, dirt, books, tools and other items of mysterious origin became even more cluttered when I tore through my shelves on the search for answers.\n\nZasadzinski, Reindl and D\u0027angelo wrote about what to do with a body that has broken bones. Fielding, Sheats and Levant wrote about ills and diseases. And Galwey taught me how to properly use a scalpel, but no one knew about mystery of the dead.\n\nBut perhaps no one had witnessed what I had. Perhaps no one wanted to try and solve any mysteries. We\u0027re only undertakers after all. We\u0027re not the police, not detectives, usually not witches. I wasn\u0027t anything but a person who repaired the dead.\n\nI cursed loudly. I could have stopped. I could have gone on with Edithe Zilonis\u0027 funeral, buried her myself and gone back to embalming old folks.\n\nThere was a knock at the door, then the doorbell rang.\n","page 77":"\"Is she there?\" I asked Edithe.\n\nEdithe closed her eyes, tried to summon Agrona.\n\nThere was a long moment of silence, where Edithe and I sat in my apartment. Edithe seemed flushed. I was tired.\n\nShe looked up at me, shook her head.\n\n\"Well,\" I mused, \"that must be a good thing.\"\n\n\"I\u0027m so sorry,\" Edithe said.\n\nThe doorbell rang and echoed through the silent building. Edithe touched my hand as I went to answer it.\n\nI opened the door to see my Mother, she rushed into my arms and we exchanged an embrace. She sobbed into my shoulder. I don\u0027t think my emotions had caught up to me yet.\n\nEdithe appeared from the steps, stood solemnly at the bottom.\n\n\"Would you be her undertaker?\" my mother asked.\n\n\"Of course,\" I said.\n\nMother had looked over my shoulder, seen Edithe.\n\n\"You have an awakened dead,\" Mother mentioned.\n\nWe all returned to the parlor. I explained to Mother all that had happened. She seemed surprised but not too surprised.\n\n\"The dead are mysterious,\" she said.\n\n\"Oh indeed,\" called Edithe. \"I am still quite unsure of how this all could happen.\"\n\nMother did manage a small smile for Edithe. I supposed Edithe Zilonis had that type of mystical power after all.\n","page 32":"I said, and her golden eyes shifted back to normal. She collapsed and I went to the foot of the bed to hold her.\n\nHer eyes flittered before they opened to me. They were wide and confused. And if the dead could blush, I think she did.\n\n\"You woke me,\" Edithe Zilonis managed to say.\n\n\"You shouldn\u0027t be awake,\" I told her.\n\n\"No, I don\u0027t want to sleep,\" she pleaded.\n\n\"I\u0027m sorry,\" I said.\n\nShe had touched my face, left a cold impression on my cheek as I said Goodnight to her, again.\n\nI carried her back downstairs, put her to bed and closed the freezer tightly.\n\nI had chills on my neck when I returned upstairs for breakfast. Although I could hardly eat.\n","page 76":"\"Is she there?\" I asked Edithe.\n\nEdithe closed her eyes, tried to summon Agrona.\n\nThere was a long moment of silence, where Edithe and I sat in my apartment. Edithe seemed flushed. I was tired.\n\nShe looked up at me, shook her head.\n\n\"Well,\" I mused, \"that must be a good thing.\"\n\n\"I\u0027m so sorry,\" Edithe said.\n\nThe doorbell rang and echoed through the silent building. Edithe touched my hand as I went to answer it.\n\nI opened the door to see my Mother, she rushed into my arms and we exchanged an embrace. She sobbed into my shoulder. I don\u0027t think my emotions had caught up to me yet.\n\nEdithe appeared from the steps, stood solemnly at the bottom.\n\n\"Would you be her undertaker?\" my mother asked.\n\n\"Of course,\" I said.\n\nMother had looked over my shoulder, seen Edithe.\n\n\"You have an awakened dead,\" Mother mentioned.\n\nWe all returned to the parlor. I explained to Mother all that had happened. She seemed surprised but not too surprised.\n\n\"The dead are mysterious,\" she said.\n\n\"Oh indeed,\" called Edithe. \"I am still quite unsure of how this all could happen.\"\n\nMother did manage a small smile for Edithe. I supposed Edithe Zilonis had that type of mystical power after all.\n","page 35":"I rested back against the tall bookshelf, ran my fingers through my hair.\n\nI supposed no one else was going to try and discover the truth of Edithe Zilonis. I supposed I had discovered something new in the realm of speaking to the dead. I supposed I would have to find the man Edithe Zilonis told me about, and her purse as well.\n\nI was fully off-the-clock. It was even Saturday morning, and I always slept late on Saturday mornings.\n\nIt was why I would have to reawaken Edithe Zilonis, and write my own book of the dead too.\n\nIt was also why I went to answer the door.\n","page 79":"Edithe remained by my side the rest of the day.\n\nAgrona\u0027s body was on her way and I would see her the following day. Until then, I held more or less random conversations with Edithe. Some conversations we spoke about our assumptions about Heaven. Other times it was about the weather, or how that new restaurant on Eastend was operating.\n\nNone of which were about how Edithe would have to return to death as some point.\n\nAnd soon, the night came. Edithe mused over how she was now never hungry while I prepared dinner for myself.\n\nI was stirring peppers in a pot over the stove when I finally said, \"Edithe, you can\u0027t stay here. You know that?\"\n\nShe had been sitting across from me when I spoke. Her brown eyes dropped down.\n\nShe said, \"I know. Of course.\"\n\n\"If it is any consolation, I will certainly remember you,\" I told her.\n\nShe said, \"I\u0027m sure you say that to all the dead.\"\n\n\"You\u0027re correct, but I do remember all the dead.\"\n\nEdithe smiled. She said, \"What if I choose to become a ghost?\"\n\n\"Lingering about here is not worth Heaven.\"\n\n\"I know, I know, I was just thinking.\"\n\nI don\u0027t think Edithe Zilonis was just thinking.\n","page 34":"It wasn\u0027t often my emotions got the best of me.\n\nI sat at my kitchen table. The morning sunlight beat brightly down onto my face, warmed the coolness I felt everywhere. I wondered if I had enough money saved so that I could retire. Perhaps I could invite my cousin to take over the store. Perhaps I could leave the cursed city of Blackwood for good.\n\nBut a part of me argued mercilessly against my leaving. That part of me deeply desired to know what Edithe Zilonis truly was, and how she came to be. Another part of me felt compassion for Edithe Zilonis. For her story, at least.\n\nAnother part of me felt a different compassion for Edithe Zilonis too.\n\nI finished the black coffee and went to look through my books again, to see if anyone could explain how a dead could become possessed, if she was possessed at all.\n\nThe study, which was already riddled with dust, dirt, books, tools and other items of mysterious origin became even more cluttered when I tore through my shelves on the search for answers.\n\nZasadzinski, Reindl and D\u0027angelo wrote about what to do with a body that has broken bones. Fielding, Sheats and Levant wrote about ills and diseases. And Galwey taught me how to properly use a scalpel, but no one knew about mystery of the dead.\n\nBut perhaps no one had witnessed what I had. Perhaps no one wanted to try and solve any mysteries. We\u0027re only undertakers after all. We\u0027re not the police, not detectives, usually not witches. I wasn\u0027t anything but a person who repaired the dead.\n\nI cursed loudly. I could have stopped. I could have gone on with Edithe Zilonis\u0027 funeral, buried her myself and gone back to embalming old folks.\n\nThere was a knock at the door, then the doorbell rang.\n","page 78":"\"Is she there?\" I asked Edithe.\n\nEdithe closed her eyes, tried to summon Agrona.\n\nThere was a long moment of silence, where Edithe and I sat in my apartment. Edithe seemed flushed. I was tired.\n\nShe looked up at me, shook her head.\n\n\"Well,\" I mused, \"that must be a good thing.\"\n\n\"I\u0027m so sorry,\" Edithe said.\n\nThe doorbell rang and echoed through the silent building. Edithe touched my hand as I went to answer it.\n\nI opened the door to see my Mother, she rushed into my arms and we exchanged an embrace. She sobbed into my shoulder. I don\u0027t think my emotions had caught up to me yet.\n\nEdithe appeared from the steps, stood solemnly at the bottom.\n\n\"Would you be her undertaker?\" my mother asked.\n\n\"Of course,\" I said.\n\nMother had looked over my shoulder, seen Edithe.\n\n\"You have an awakened dead,\" Mother mentioned.\n\nWe all returned to the parlor. I explained to Mother all that had happened. She seemed surprised but not too surprised.\n\n\"The dead are mysterious,\" she said.\n\n\"Oh indeed,\" called Edithe. \"I am still quite unsure of how this all could happen.\"\n\nMother did manage a small smile for Edithe. I supposed Edithe Zilonis had that type of mystical power after all.\n","page 37":"I skipped the second-to-last step, opened the door of the shop to a nervous man.\n\nHe had taken off his cap, revealing a bald head with few hairs swept over to make it seem as if he wasn\u0027t already so old. And the hair was black, and his skin was white, and his face was heavy with lines and stress.\n\nIt was the man who hit Edithe Zilonis with his carriage, or the carriage driver who hit the woman who dashed in front of his carriage, by accident.\n\nHis name was Monty Queneau and he irritated me because he spoke loudly and acted as if I had to listen to him.\n\n\"Good morning,\" he said. \"How is Miss Zilonis?\"\n\n\"Possibly possessed,\" I said. I realized I had put on a work shirt but was still in my bed slacks. But it was Saturday and I wasn\u0027t supposed to be working anyway. And Monty Queneau knew that I was closed on Saturday too.\n\n\"What?\"\n\n\"She\u0027s swell. She was a good girl, you know. And she didn\u0027t jump in front of your carriage,\" I said.\n\n\"Pardon? She didn\u0027t?\"\n\nMonty Queneau seemed surprised. The guilt on his face seemed to drip down and land in a puddle at his feet of which he constantly wallowed within.\n\n\"There was a man,\" I said, \"I think, who pushed her. And that man stole her purse too.\"\n\nI had realized one flaw in my thinking, and it was thinking that this man who pushed Edithe Zilonis in front of the carriage was alive. I was on a hunt for a live man, but I had the purse the day Edithe Zilonis came in to me.\n\n\"He\u0027s dead,\" I said to Monty Queneau.\n\n\"Pardon?\"\n\n\"The man\u0027s dead. He\u0027s a ghost, or a dead. Not from here, but he\u0027s dead,\" I said.\n\nMonty Queneau pounded on the door after I closed it in his face and went to awaken once more, Edithe Zilonis.\n","page 36":"I skipped the second-to-last step, opened the door of the shop to a nervous man.\n\nHe had taken off his cap, revealing a bald head with few hairs swept over to make it seem as if he wasn\u0027t already so old. And the hair was black, and his skin was white, and his face was heavy with lines and stress.\n\nIt was the man who hit Edithe Zilonis with his carriage, or the carriage driver who hit the woman who dashed in front of his carriage, by accident.\n\nHis name was Monty Queneau and he irritated me because he spoke loudly and acted as if I had to listen to him.\n\n\"Good morning,\" he said. \"How is Miss Zilonis?\"\n\n\"Possibly possessed,\" I said. I realized I had put on a work shirt but was still in my bed slacks. But it was Saturday and I wasn\u0027t supposed to be working anyway. And Monty Queneau knew that I was closed on Saturday too.\n\n\"What?\"\n\n\"She\u0027s swell. She was a good girl, you know. And she didn\u0027t jump in front of your carriage,\" I said.\n\n\"Pardon? She didn\u0027t?\"\n\nMonty Queneau seemed surprised. The guilt on his face seemed to drip down and land in a puddle at his feet of which he constantly wallowed within.\n\n\"There was a man,\" I said, \"I think, who pushed her. And that man stole her purse too.\"\n\nI had realized one flaw in my thinking, and it was thinking that this man who pushed Edithe Zilonis in front of the carriage was alive. I was on a hunt for a live man, but I had the purse the day Edithe Zilonis came in to me.\n\n\"He\u0027s dead,\" I said to Monty Queneau.\n\n\"Pardon?\"\n\n\"The man\u0027s dead. He\u0027s a ghost, or a dead. Not from here, but he\u0027s dead,\" I said.\n\nMonty Queneau pounded on the door after I closed it in his face and went to awaken once more, Edithe Zilonis.\n","page 39":"Edithe Zilonis walked briskly, so that my own walk was too slow but a light jog was too fast.\n\nShe seemed to remember this city like the back of her hand.\n\n\"Where were you coming from, Edithe?\" I asked. \"Before you were killed? Did you live here, in Blackwood?\"\n\nShe said, \"No. I\u0027m from Central City. I like to travel. I wanted to eat at the Obsidian Hotel, so I came here. I was walking to the park after that. Then it happened.\"\n\n\"What was your job?\"\n\n\"I don\u0027t have a job. I was fired from my desk job. I worked for Willi Cranshaw as a secretary, until he had enough of me talking, I suppose,\" Edithe Zilonis said.\n\nShe had slowed down to walk beside me, after realizing I was farish behind.\n\n\"Can anyone see me?\" she asked.\n\n\"No, you\u0027re not a spirit. Only I can see you,\" I said.\n\nShe had been looking at me but shifted her head when I said that, as if it upset her.\n\n\"So you\u0027re talking to yourself now?\"\n\n\"Yes, indeed.\"\n\nShe did smile, and I smiled too.\n\nWe came upon the spot of her death. There was still traces of blood along the stone.\n","page 38":"\"Edithe,\" I called softly.\n\nThis time, I was not about to roughly awaken her, in fear I\u0027d lose my good cheek.\n\nShe was still.\n\n\"Edithe Zilonis,\" I called, \"wake up, Edithe Zilonis. We have unfinished business, my dear.\"\n\nShe was still.\n\n\"Edithe Zilonis,\" I tried once more, \"this is no time for sleeping. Don\u0027t be stubborn now.\"\n\nShe jolted awake, sat up straight and threw open her arms. I was completely not startled.\n\nShe laughed, said, \"I got you, didn\u0027t I? You silly undertaker, I scared you!\"\n\n\"You didn\u0027t---\" but there was no use arguing with Edithe Zilonis.\n\nI said, \"You were possessed again. You said there was a man, Edithe. A man pushed you in front of the carriage, and stole your purse.\"\n\nShe put an arm around my shoulder so I could help her off the bed.\n\n\"A man,\" she mused.\n\n\"Yes, a man. But he\u0027s not alive, Edithe. Because your purse, I swore I had it when I met you,\" I told her.\n\n\"A dead man pushed me in front of the carriage?\" Edithe Zilonis asked.\n\nI nodded.\n\n\"Poppycock.\"\n\nThere was a moment where I fumbled for my words, because there wasn\u0027t a reason for her to not believe me.\n\nThen she grinned wide, said, \"I\u0027m joking. It\u0027s not the most bonkers thing you\u0027ve said to me yet. You certainly don\u0027t like jokes.\"\n\n\"I\u0027m sorry I don\u0027t like jokes when there is a thieving, murderous dead man running about,\" I snapped.\n\n\"You\u0027re very stressed for someone who is alive,\" Edithe Zilonis told me. \"I am dead, and murdered, and having a ball, really.\"\n\n\"Edithe,\" I said.\n\n\"Undertaker. Or do you prefer My Undertaker? You\u0027re funny, you know.\"\n\nShe walked by me, her skirt followed behind her, left a coolness in the air and left me speechless like no living woman ever had.\n\nI thought, now that\u0027s silly, thinking of that. Certainly a living woman is much more attractive to me. I was living after all. And Edithe Zilonis was dead.\n\nPerhaps the living are just a bore.\n\nShe was walking to the door, had the handle in her grasp. She looked at me over her shoulder and asked, \"Are you going to follow me, or stand there like a fool?\"\n\nI was no fool.\n","page 71":"Leola Viles had been particularly solemn the day of her death.\n\nShe sat for several hours looking out the windows while she exchanged few words with me.\n\nBut what she did say was, I deserve this. I deserve to die because of the things I have done.\n\nI said to Leola Viles, No one deserves death, not even the worst murderers. Because death is a ceremony. Life is useless and overrated. Death is silent, but freeing.\n\nShe asked me to sit with her, so I put my work aside to do so. She spoke softly about how well she could sew and cook although she hardly did because those were maids\u0027 jobs.\n\nI said, Some professionals sew too. I have to sew up the dead sometimes. I wouldn\u0027t want my maids to do that.\n\nAnd for the first time since I had met Leola Viles, she smiled, and she was immensely beautiful when she did.\n\nIt was a quarter after midnight when she asked to say goodbye, told me to dress her in her simplest gown for her funeral. I obliged.\n\nShe held my hand tightly until she went on.\n\nI think she felt as if I humbled her. But, in fact, Leola Viles had humbled me.\n","page 70":"Alford Salono had clung to me, cried into my shoulder the night he died.\n\nHe said he did not want to die. He said he was scared and that he did not mean to shoot anyone. He told me he thought he was going to the Hells.\n\nAnd it is difficult, sometimes, to say farewell to the dead, especially when they are young and unknowing.\n\nSometimes one person will capture my heart, and make his or her death all that much more painful for all those involved.\n\nAlford Salono had died three years before I met Edithe Zilonis. But the way he pleaded to me to keep him alive, although he was very dead, struck something in my soul that made turn away clients for several weeks after.\n\nMy cupboard of alcohol did not sustain me. I had nightmares about Alford Salono.\n\nWhat truly became of him, I didn\u0027t know, but I did know that Death, while cruel, while unfair, treats his souls with the utmost respect, and as did I.\n\nI had said to him, I\u0027m sorry. I wish you the best wherever you will be. No one deserves this, miserable life.\n\nAnd Alford Salono said, Thank you. And, I\u0027m sorry, for you too.\n","page 73":"Tessy Pirie was incredibly inspiring, and gave me advice on how to talk to folks that were not dead.\n\nShe sat on the couch in my study, waggled her finger when she was speaking to me.\n\nShe said, Tell my husband it was my time, and to not mourn me too much. Tell him I love him, and I\u0027ll see him soon.\n\nThen Tessy Pirie must have realized something, for she continued, I certainly hope that Lisbeth isn\u0027t up there in Heaven, else I\u0027ll be having some words with her!\n\nShe added, Look at me, vices till my death day. That\u0027s good old Tessy for you, huh?\n\nI didn\u0027t know if that was Good Old Tessy but I nodded in agreement and smiled.\n\nIt is often I have to console the dead. It is not often I am consoled by the dead. Tessy Pirie was the exact person to give advice to her undertaker, and make me promise to listen to it.\n\nWe had some gin and laughed through the night, until Tessy Pirie kissed my cheek and said, I best be going. You were a doll. Also tell my husband to shave. He\u0027s been too scruffy!\n\nI said, Yes ma\u0027am, and wished Tessy Pirie a See You Again.\n","page 72":"Although, I thought, Perhaps I had broken my vow before, because I could not rid myself of Damon Ellsworth. He captured me and my lips while he recited to me all he had done in his lifetime.\n\nHe told me he had travelled all over the state, the country, even other countries, to write. He said he wrote about wars and deaths, about cultures and travelling itself, even about the foods he ate and the people he met.\n\nBut he said to me, I\u0027m glad I met you. Of all people I have met, you are the most interesting. You can speak to the dead. I have travelled everywhere, but I\u0027m sure I haven\u0027t one story like any of the ones you know.\n\nI said, Perhaps, but I have not even left Washington. No number of stories is worth the world.\n\nAnd Damon Ellsworth laughed, kindly told me I was foolish before I let him go.\n\nI purchased a majority of my books I owned after I met Damon Ellsworth. I began collecting the weekly paper stored in boxes in the attic. I read them all, until Damon Ellsworth had no more stories left for the editors to publish.\n","page 31":"When I spoke, she fell onto her face and into my bed then promptly vanished. She was a stubborn one, this Edithe Zilonis, or whatever was possessing her at the time.\n\nI rinsed my face in the washroom, perhaps to awaken myself or to come to terms with what I had seen. That being Edithe Zilonis I had sent to sleep the night before.\n\nI had not a dead who had awakened on her own to bother me in my room. I realized then that Edithe Zilonis was not just any dead.\n\nI wasn\u0027t paid enough for any of this.\n\nI went downstairs to see if Edithe Zilonis\u0027 body was still on its bed, tucked into the freezer.\n\nShe was, looked as kind as ever. Her face was smooth and still and her body seemed as if it hadn\u0027t moved at all.\n\nI was rightly upset, stumbled back up the stairs to make some coffee for myself.\n","page 75":"\"Is she there?\" I asked Edithe.\n\nEdithe closed her eyes, tried to summon Agrona.\n\nThere was a long moment of silence, where Edithe and I sat in my apartment. Edithe seemed flushed. I was tired.\n\nShe looked up at me, shook her head.\n\n\"Well,\" I mused, \"that must be a good thing.\"\n\n\"I\u0027m so sorry,\" Edithe said.\n\nThe doorbell rang and echoed through the silent building. Edithe touched my hand as I went to answer it.\n\nI opened the door to see my Mother, she rushed into my arms and we exchanged an embrace. She sobbed into my shoulder. I don\u0027t think my emotions had caught up to me yet.\n\nEdithe appeared from the steps, stood solemnly at the bottom.\n\n\"Would you be her undertaker?\" my mother asked.\n\n\"Of course,\" I said.\n\nMother had looked over my shoulder, seen Edithe.\n\n\"You have an awakened dead,\" Mother mentioned.\n\nWe all returned to the parlor. I explained to Mother all that had happened. She seemed surprised but not too surprised.\n\n\"The dead are mysterious,\" she said.\n\n\"Oh indeed,\" called Edithe. \"I am still quite unsure of how this all could happen.\"\n\nMother did manage a small smile for Edithe. I supposed Edithe Zilonis had that type of mystical power after all.\n","page 30":"It was not strange that that night I had a dream about Edithe Zilonis.\n\nThe dead haunted my dreams often. Some ghosts continously haunted me until I ceremoniously redirected them to where they desired to be. It was all part of the job. I\u0027m sure most undertakers dealt with their share of the ghost and spirit population as well.\n\nSo I assumed at first Edithe Zilonis was merely in my dreams.\n\nWe had been at the park on Eastend. Edithe Zilonis walked in front of me, would turn back to tease me, and ask if I was still following.\n\nI called back, Yes, Edithe, I am. I\u0027ve followed you for some time now. Why would I not follow you?\n\nI didn\u0027t know the correct answer to that nonsense question.\n\nThe Edithe Zilonis that was in my dreams was much less pale, much less cold, and much less dead. She had color in her cheeks and shoulders. I saw her shoulders because her dress cut low, although it didn\u0027t seem like a thoughtful clothing choice, given it was very cold in this sunny park.\n\nHer blonde hair was done back in soft curls and glittered brightly too, as if it was no longer whitened by death. And she had a bow tied around her head like a girl as well.\n\nHer gown was a brilliant pink with ruffles and shiny fabrics. It was pulled in tightly at the waist, which is a large cause of female organ failure later on. But I did not think about organ failure during this dream. I thought how I rather liked Edithe Zilonis\u0027 waist, how much more I would have liked it without the dress.\n\nI awoke from sleep when the coldness from the sunny park was too much to bear. Edithe Zilonis was standing at the foot of my bed. Her eyes were glowing golden like they had before.\n\n\"Find the man,\" she said to me.\n\n\"Why aren\u0027t you asleep?\" I asked.\n\n\"Find the man,\" she said again, this time with more ferocity. I knew that this part of Edithe Zilonis was not Edithe Zilonis, but I didn\u0027t know who it was.\n\nI was not scared but certainly not content.\n\n\"What man?\" I asked.\n\n\"The man who murdered me,\" she said. \"He has my purse.\"\n\n\"Edithe, you need to sleep,\" I said.\n\n\"I can\u0027t sleep.\"\n","page 74":"Alford Salono had clung to me, cried into my shoulder the night he died.\n\nHe said he did not want to die. He said he was scared and that he did not mean to shoot anyone. He told me he thought he was going to the Hells.\n\nAnd it is difficult, sometimes, to say farewell to the dead, especially when they are young and unknowing.\n\nSometimes one person will capture my heart, and make his or her death all that much more painful for all those involved.\n\nAlford Salono had died three years before I met Edithe Zilonis. But the way he pleaded to me to keep him alive, although he was very dead, struck something in my soul that made turn away clients for several weeks after.\n\nMy cupboard of alcohol did not sustain me. I had nightmares about Alford Salono.\n\nWhat truly became of him, I didn\u0027t know, but I did know that Death, while cruel, while unfair, treats his souls with the utmost respect, and as did I.\n\nI had said to him, I\u0027m sorry. I wish you the best wherever you will be. No one deserves this, miserable life.\n\nAnd Alford Salono said, Thank you. And, I\u0027m sorry, for you too.\n","page 44":"Sure, the owner of the Topics and Genres Bookstore three places down from my shop was a dashing red-haired woman with a large smile and kind eyes. Her name was Cristi Moneo and if the name didn\u0027t, certainly her attractive confidence would stop any person in his or her tracks.\n\nI had been looking, in fact, for a certain book from Lisbeth Mccullough. Cristi Moneo was kind and helped me find it.\n\nI had said to her, Thank you, I don\u0027t suppose you\u0027re an avid reader of magic and the dead as well?\n\nShe smiled at me in such a way I felt the sun shine from the window, onto her white teeth and eyes hit me directly in the face. It had been pleasant.\n\n\"We had coffee later that day,\" I said to Edithe Zilonis.\n","page 43":"\"How does someone become a ghost?\" Edithe Zilonis asked me as we finished up our investigations at her murder scene.\n\nShe added, \"I quite like this, walking around on Earth, no one seeing me. Imagine the things I could do.\"\n\n\"You will have to take that up with the folks who monitor the dead,\" I said. \"Why wouldn\u0027t you want to go to Heaven?\"\n\n\"I don\u0027t like the color white,\" Edithe Zilonis said.\n\nI laughed out loud at her absurd answer. She smiled at me.\n\n\"Besides,\" she said, \"I quite like you too. I\u0027d like to hang around you a bit longer.\"\n\n\"I am not worth the Heavens,\" I said.\n\n\"Poppycock. You\u0027ve got to have someone who thinks you are. A lucky lady, or a felicitous fellow?\" She asked.\n\nShe had slipped her arm under mine, walked alongside me.\n\nAdmittedly, I was not fond of romance. It impeded my job. And besides, no one was interested in a person whose hands are always touching the dead. Women were often taken aback, and men startled, when I mentioned my occupation.\n\nThe dead couldn\u0027t judge me, and the living thought they could.\n","page 46":"\"Coffee?\" questioned Edithe Zilonis. \"Did you pay?\"\n\n\"I did not,\" I said.\n\n\"Oh you know what that means,\" she said.\n\n\"It means a met a kind person who found my rigid personality refreshing?\"\n\n\"No, it means you\u0027ll be in bed in no time, certainly,\" teased Edithe Zilonis. \"How scandalous of you, Undertaker.\"\n\nI didn\u0027t understand what was so scandalous about a good night\u0027s rest, other than not receiving one, like I had not the night prior. I was actually quite weary. But Edithe Zilonis seemed to liven me up.\n\nWe came back to my shop. It was a storefront built in the early eighteen-hundreds. The entire city of Blackwood was very dated. When the time came for buildings to have electricty, most were unequipped to do so. The first floor of my shop was still lit mostly by candles and lamps. Although I hardly minded. Perhaps I assumed the dead couldn\u0027t see me in the dark.\n\nBut the dead are mystical, I began to believe. And the trivial whispers I gave the dead were perhaps heard. But I hoped not, because the dead knew more about me than any of my family did.\n\n\"Do you have a family?\" Edithe Zilonis asked.\n\nOf course I did. I had a supportive mother and father and a very successful sister who lived in Peach City, owned a trading company. I rarely heard from her, but I assumed she was well. And Mother and Father were slowly growing old and before soon I feared I would see them in my shop.\n\nBut death did not frighten me. I was living, and life was so much more frightening.\n\nI told this to Edithe Zilonis.\n\n\"When you die, who is going to undertake you?\" she asked.\n\nI said, \"I don\u0027t know, but I hope the person treats me with as much respect as I do my own dead.\"\n\n\"Do you think you\u0027ll go to Heaven?\" Edithe Zilonis asked.\n","page 45":"Sure, the son of the owner of the Perkins Bank beside my shop was handsome enough. He had wide eyes and curly hair, both of which seemed rare in Blackwood. I believed his name was Wiatt Perkins, and when I meant believed I actually meant I quite knew his name was Wiatt Perkins.\n\nHe would come around now and then, ask me questions about my job, if I had fetched the mail today, and if there was anyone famous in the freezers.\n\nI said, No, not yet, although I would not tell you if there was, lest the population storms my shop.\n\nTo which Wiatt Perkins laughed. And I was suprisingly taken by his laugh. It was a sound I didn\u0027t often hear from the mopey dead and much less myself.\n\nI told Edithe Zilonis, \"We went out for coffee once. In fact, last week.\"\n","page 48":"It was true there were, and never would be, records of the events that transpire in Heaven nor the Hells.\n\nHeaven is often assumed to be a paradise in the clouds, where angels fly about and play musical harps, and the Gods oversee the folks there. It is guessed that each person that has gone to Heaven lives in his or her own paradise, constantly, forever and forever.\n\nNone of these theories are true, nor are they false. Even as a person who speaks to the dead, I was unsure of both Heaven and the Hells. I thought more often about Purgatory, which seemed to be just a replication of Earth, where good and bad both occur.\n\nI told Edithe Zilonis No because I hoped I would go to Purgatory, or become a ghost. I had a fear of the unknown, and I was certain about it.\n\nBut Undertaker, she said to me, Purgatory is the unknown, truly. We know at least Heaven is good and the Hells are bad.\n\nI replied, Yes, that might be true.\n\nDoes that mean you live in fear on Earth, here now? Edithe Zilonis asked.\n\nOf course. I do not want to die, but I also do not fear it.\n\nYou are a paradox, said Edithe Zilonis.\n\nPerhaps.\n","page 47":"\"Coffee?\" questioned Edithe Zilonis. \"Did you pay?\"\n\n\"I did not,\" I said.\n\n\"Oh you know what that means,\" she said.\n\n\"It means a met a kind person who found my rigid personality refreshing?\"\n\n\"No, it means you\u0027ll be in bed in no time, certainly,\" teased Edithe Zilonis. \"How scandalous of you, Undertaker.\"\n\nI didn\u0027t understand what was so scandalous about a good night\u0027s rest, other than not receiving one, like I had not the night prior. I was actually quite weary. But Edithe Zilonis seemed to liven me up.\n\nWe came back to my shop. It was a storefront built in the early eighteen-hundreds. The entire city of Blackwood was very dated. When the time came for buildings to have electricty, most were unequipped to do so. The first floor of my shop was still lit mostly by candles and lamps. Although I hardly minded. Perhaps I assumed the dead couldn\u0027t see me in the dark.\n\nBut the dead are mystical, I began to believe. And the trivial whispers I gave the dead were perhaps heard. But I hoped not, because the dead knew more about me than any of my family did.\n\n\"Do you have a family?\" Edithe Zilonis asked.\n\nOf course I did. I had a supportive mother and father and a very successful sister who lived in Peach City, owned a trading company. I rarely heard from her, but I assumed she was well. And Mother and Father were slowly growing old and before soon I feared I would see them in my shop.\n\nBut death did not frighten me. I was living, and life was so much more frightening.\n\nI told this to Edithe Zilonis.\n\n\"When you die, who is going to undertake you?\" she asked.\n\nI said, \"I don\u0027t know, but I hope the person treats me with as much respect as I do my own dead.\"\n\n\"Do you think you\u0027ll go to Heaven?\" Edithe Zilonis asked.\n","page 49":"The places beyond death were mysterious to the living. In fact, not a living soul knew what either Heaven or the Hells were like, much less how he or she would be judged for either.\n\nHeaven, I assumed, was pleasant. It probably was a place in the sky, high above the clouds, or perhaps upon them. It probably was eternal bliss.\n\nBut I told Edithe Zilonis I was not sure if I would go there. The stipulations for the dead are varied and beyond even my comprehension.\n\nHeaven is a nice thought, and no soul is free from thinking what his or her personal Heaven would be like.\n\nMy Heaven would be being an undertaker for the rest of eternity. But the problem is, being an undertaker was probably a scarce, if impossible job in either Heaven or the Hells. But how can my Heaven exist if I am not an undertaker?\n\nEdithe Zilonis did not ponder existentialism like I did. Instead she asked, Why would you be an undertaker forever?\n\nI said, I love my job, and I love the dead.\n\nYou\u0027re mad, Edithe Zilonis said to me.\n\nPerhaps.\n","page 80":"It was after dinner. The clock read eight or nine. Edithe Zilonis held my hand tightly as we returned to the shop.\n\nI had never had such a difficult time saying Goodnight to a dead. Edithe\u0027s gentle eyes gazed over her bed, then at me, then I helped her up.\n\nShe quickly embraced me, pulled away and kissed me, and then said, \"Thank you so much, Undertaker.\"\n\n\"It is my job, my dear,\" I said.\n\nShe smiled, kissed me once more before she rested back.\n\n\"If there is any chance I can visit,\" she said, \"you know I will.\"\n\n\"I have no doubt.\"\n\n\"I will be sure to become friends with your sister,\" she said.\n\n\"That would be swell.\"\n\n\"How much do you get paid for this?\"\n\n\"Not nearly enough in gold. But more than enough in satisfaction.\"\n\n\"What is your name?\" Edithe Zilonis asked.\n\n\"Oh it\u0027s quite a common name. My first name is Good and my surname is Night.\"\n\nShe was about to shout at me when I said, \"Goodnight Edithe. And good luck.\"\n\nShe fell asleep then and there. I placed her arms gently on her stomach, over her pink purse. I pressed a kiss onto her forehead before I returned to bed.\n\n~~~\n\nThe night seemed delightfully long. I slept well and had not a dream. But I did muse over the day, over ghosts and possessions, over murder and Agrona, and over Edithe Zilonis.\n\nSometimes it is a comforting thought, to know that life, if anything, has a finite end. But it is disturbing to know that anyone could cause that end, dead or alive, as I discovered.\n\nHumans are exceedingly fragile, emotionally and physically, unfortunately. But they are capable of taking that knowledge and discovering how to become stronger. Edithe Zilonis was too young when she was murdered. Agrona was even younger. But Edithe did not dwell on the sadness, and I discovered neither had Agrona.\n\nEdithe Zilonis, instead of weeping in my arms, desired the truth. I think I wept more for her in the end. She looked on at death as merely a small setback.\n\nAnd she inspired me. She inspired me when my parents died forty years later, and she inspired me when I died sixty years later.\n\nThere was a vast jury of judges looking down upon me. Most of them said I had been good. Some said kissing the dead was not good, but ultimately I had a choice.\n\nClearly, I should have chosen Heaven. I would have been free from my job, would have never had to speak to the dead ever again, and would have lived in complete bliss with my parents, Agrona and Edithe Zilonis.\n\nBut the thought of that was too much for me to bear.\n\nI told those judges, I want to return to Earth, and be an undertaker forever.\n\nI was laughed at, but that hardly mattered, because one day, a twenty-nine-year-old young man came into my shop, dead of course, and his wallet disappeared under my watch.\n\nAn undertaker\u0027s job never ends, and that is fine by me.\n","page 81":"The cermony went on as usual. I guided Edithe Zilonis to her bed. She hesitantly sat down.\n\nShe embraced and kissed me, told me, \"Thank you, Undertaker. You deserve more than some rickety old shop.\"\n\nI said, \"I quite like my rickety old shop. It does its job, and it does it well.\"\n\n\"Except when you have ghost folk wandering around and stealing things,\" Edithe teased.\n\n\"You have me there,\" I admitted. \"Perhaps when you visit again I will be in Central City.\"\n\n\"Oh don\u0027t go there, they cremate folks there.\"\n\nI laughed and Edithe Zilonis smiled at me. She kissed me once more and rested back.\n\n\"You never told me your name,\" she said.\n\n\"That is a shame.\"\n\n\"And how can you speak to the dead anyway?\"\n\n\"I took classes.\"\n\n\"Poppycock.\"\n\n\"Goodnight, Edithe. Have fun, wherever you might be.\"\n\nEdithe Zilonis closed her eyes, and her breath stopped. I put her purse beneath her hands and retired to bed.\n\n~~~\n\nAnd I was in bed and reading the rest of The Dead and Their Deeds when the door to my bedroom creeped open.\n\nI thought, Well that\u0027s odd but not impossible. The building was old and the floors were uneven.\n\nI was on chapter twenty-three, Proper Etiquette and The Dead, when the sheets beside me shuffled. Then, I felt a soft touch on my arm.\n\nI had chills and nearly jumped out of my skin to see Edithe Zilonis beside me.\n\nShe was in a pretty pink gown and stood at the edge of the bed. Her hair was done up and curled back and her skin was far from colorless now.\n\n\"Edithe,\" I called. I had nearly fallen off the bed.\n\n\"Hello, Undertaker. You\u0027re going to be very upset with me,\" she said.\n\nBut her smile was comforting.\n\nSo Edithe Zilonis turned away Heaven, told the folks, I can\u0027t stand how you pray at every meal, and became a ghost.\n\nI scolded her but I truly never minded her. She helped me around the shop, took a great interest in my work. We would go out on the town, her arms tightly around mine, and not once had I been questioned why this woman looked so much like the dead woman from the papers.\n\nI never did retire. I died before I could. Such is the way of cruel, merciless life.\n\nBut it was peculiar, because I was dead for perhaps a day or so when I woke again in my own shop. Except I was in a very different bed. A freezer bed, in fact.\n\nIt was my cousin, who had taken my shop.\n\nShe smiled at me, said, Now you can\u0027t go so soon. Not without telling Edithe where you will be.\n\nIt was not ideal, but I returned to Earth, not to work, not to speak to any more dead, but to live with Edithe Zilonis.\n\nShe said, \"I\u0027m glad you died young. I couldn\u0027t stand kissing an old person.\"\n","page 40":"\"You\u0027re so very silly, wearing your sleeping slacks like that,\" Edithe Zilonis teased.\n\nI kneeled down to observe the blood on the stone.\n\n\"The folks around here already think I\u0027m mad,\" I said, \"and it\u0027s best to let them continue to think that.\"\n\n\"They trust a mad person with their dead?\"\n\nEdithe Zilonis put her hands on her hips, peered over at me.\n\n\"A madman can\u0027t kill what is already dead,\" I said.\n\nEdithe Zilonis laughed.\n\nThe blood was exactly five days old. I had known Edithe Zilonis for four. Dirt and water had since washed it mostly away. A couple stones from the road had been pulled up. Perhaps when the carriage trampled Edithe Zilonis.\n\n\"A coin,\" called Edithe Zilonis. \"It must be mine,\" she joked.\n\nShe found a coin, perhaps one that had come from her purse.\n\n\"You had your purse when you came to me,\" I told her, \"so this man wasn\u0027t after your money.\"\n\n\"But he has my purse now,\" she said.\n\n\"Yes, he does. Perhaps he wants us to find it, and ultimately him.\"\n\n\"That\u0027s absurd. He killed me, now he wants us to find him?\" Edithe Zilonis asked.\n","page 42":"\"Did you know any men?\" I asked Edithe Zilonis.\n\n\"Well sure, I know lots of men. Like Willi Cranshaw, Archibold D\u0027oyley, Payton Brandenberger---\"\n\n\"Any man who would push you into a carriage?\" I corrected. \"Who is now dead.\"\n\n\"Fin Seaburg died by jumping off a roof a summer ago. But he was much too kind,\" Edithe Zilonis said.\n\nI began to feel hopeless.\n\n\"Edithe,\" I tried, \"have you had any family at all? Certainly a mother, or a father? Even a sibling or a cousin?\"\n\n\"Well yes, but Mother died when I was five years old. And Father, well he died just a few months ago, but he was mean to me. I hated his guts. I couldn\u0027t wait to get out of that house.\"\n\n\"Edithe,\" I said.\n\n\"Yes?\"\n\nShe turned to me fully, had a silly smile on her face as if the man deserved a fate worse than death that she imagined quite often. Her eyes drifted along my chest and my sleeping slacks.\n\n\"Edithe, could it have been your father?\"\n\n\"Certainly not. Why would he haunt me? He hated me as much as I loathed him.\"\n\n\"I need to speak to the you who is possessed,\" I said.\n\n\"Oh I don\u0027t like when that happens. I completely forget where I am when that happens,\" she said.\n\nEdithe Zilonis must have read my face, for she sheepishly admitted afterwards, \"But of course. We have to get to the bottom of this.\"\n\n\"Hey! You bloody loon! Quit talking to yourself!\" called a few boys walking past us. They must have witnessed my speaking to Edithe Zilonis, who they did not see.\n\nI was very immune to insults from little people. I had better things to worry about, but not Edithe Zilonis. She was taken by any event, regardless of importance.\n\n\"How about you shove it up your ass you white-livered spoons!\" shouted Edithe Zilonis back at them. \"We\u0027re trying to find the man who murdered me!\"\n\nShe rushed up and kicked the ankles of the boy who shouted, who then doubled over and hollered.\n\nIt was absolutely gut-busting, and it also meant the dead were physically capable of perhaps shoving young women into the tracks of carriages.\n","page 86":"Alyda had just sewn up and wished Goodnight to a relatively fresh man named Sal Frantz and put him away to cool when the front door chimed as it opened.\n\nAlyda was a young, reserved woman who had her cousin\u0027s gift to speak to the dead. She took over the Undertaker\u0027s shop when it was passed down to her.\n\nShe recalled the stories her predecessor had told her. Of Damon Ellsworth and Leola Viles. Of the mysteries that overwhelmed Blackwood and the folks who were most affected by them.\n\nBut Alyda\u0027s favorite story had always been the one of Edithe Zilonis. The woman who died without rhyme or reason, whose death was even beyond that of religion or the rules of life and death.\n\nShe published the writings of the Undertaker, weaved them together in a coherent story but did not at all embellish it. She felt no need to.\n\nAnd one particular person, or rather, one particular person and one particular, tall and dark figure beside her, had read the published book, stormed the front of the shop.\n\nIt seemed Edithe Zilonis was not the last person to be unfairly murdered in Blackwood.\n\n\"What the Hells,\" said Alyda as she gazed upon the two, but mostly the figure.\n\n\"We need your help,\" said a nervous woman named Cynthia Vedaldi.\n\nIndeed, spoke the figure beside Cynthia.\n","page 41":"\"Did you know any men?\" I asked Edithe Zilonis.\n\n\"Well sure, I know lots of men. Like Willi Cranshaw, Archibold D\u0027oyley, Payton Brandenberger---\"\n\n\"Any man who would push you into a carriage?\" I corrected. \"Who is now dead.\"\n\n\"Fin Seaburg died by jumping off a roof a summer ago. But he was much too kind,\" Edithe Zilonis said.\n\nI began to feel hopeless.\n\n\"Edithe,\" I tried, \"have you had any family at all? Certainly a mother, or a father? Even a sibling or a cousin?\"\n\n\"Well yes, but Mother died when I was five years old. And Father, well he died just a few months ago, but he was mean to me. I hated his guts. I couldn\u0027t wait to get out of that house.\"\n\n\"Edithe,\" I said.\n\n\"Yes?\"\n\nShe turned to me fully, had a silly smile on her face as if the man deserved a fate worse than death that she imagined quite often. Her eyes drifted along my chest and my sleeping slacks.\n\n\"Edithe, could it have been your father?\"\n\n\"Certainly not. Why would he haunt me? He hated me as much as I loathed him.\"\n\n\"I need to speak to the you who is possessed,\" I said.\n\n\"Oh I don\u0027t like when that happens. I completely forget where I am when that happens,\" she said.\n\nEdithe Zilonis must have read my face, for she sheepishly admitted afterwards, \"But of course. We have to get to the bottom of this.\"\n\n\"Hey! You bloody loon! Quit talking to yourself!\" called a few boys walking past us. They must have witnessed my speaking to Edithe Zilonis, who they did not see.\n\nI was very immune to insults from little people. I had better things to worry about, but not Edithe Zilonis. She was taken by any event, regardless of importance.\n\n\"How about you shove it up your ass you white-livered spoons!\" shouted Edithe Zilonis back at them. \"We\u0027re trying to find the man who murdered me!\"\n\nShe rushed up and kicked the ankles of the boy who shouted, who then doubled over and hollered.\n\nIt was absolutely gut-busting, and it also meant the dead were physically capable of perhaps shoving young women into the tracks of carriages.\n","page 85":"Alyda had just sewn up and wished Goodnight to a relatively fresh man named Sal Frantz and put him away to cool when the front door chimed as it opened.\n\nAlyda was a young, reserved woman who had her cousin\u0027s gift to speak to the dead. She took over the Undertaker\u0027s shop when it was passed down to her.\n\nShe recalled the stories her predecessor had told her. Of Damon Ellsworth and Leola Viles. Of the mysteries that overwhelmed Blackwood and the folks who were most affected by them.\n\nBut Alyda\u0027s favorite story had always been the one of Edithe Zilonis. The woman who died without rhyme or reason, whose death was even beyond that of religion or the rules of life and death.\n\nShe published the writings of the Undertaker, weaved them together in a coherent story but did not at all embellish it. She felt no need to.\n\nAnd one particular person, or rather, one particular person and one particular, tall and dark figure beside her, had read the published book, stormed the front of the shop.\n\nIt seemed Edithe Zilonis was not the last person to be unfairly murdered in Blackwood.\n\n\"What the Hells,\" said Alyda as she gazed upon the two, but mostly the figure.\n\n\"We need your help,\" said a nervous woman named Cynthia Vedaldi.\n\nIndeed, spoke the figure beside Cynthia.\n","page 6":"This Edithe Zilonis was stubborn. I began to think that she intended to run in front of that carriage, as if it would have magically stopped once she was there. It did, but it stopped her too.\n\nI added some rouge to her cheeks to liven her up. It was pretty on her white skin. Then I tapped at her cheeks, tried to wake her.\n\nUsually I can prod someone only a few times before he or she awakens to speak to me. This Edithe Zilonis required not exactly a slap on the face but not exactly a pinch either.\n\nAnd when she awakened, she slapped me on my face. I recoiled and held my face.\n\nUsually they don\u0027t awaken with such ferocity, but Edithe Zilonis certainly did.\n\nI hollered and Edithe Zilonis cried, \"Why did you hit me? Who are you?\"\n\nAs far as I understood, the dead are aware that they are dead. Lost souls aren\u0027t lost, they just aren\u0027t sociable. And howling ghosts are just having a bit of fun. But Edithe Zilonis was furious I had awakened her.\n\nUsually they\u0027re only furious when they\u0027re old and prepared to die. Edithe Zilonis was quite quaint being dead, and at least old folks can\u0027t hit hard.\n\nI bit back the faint tears in my eyes and said, \"I\u0027m your undertaker. It\u0027s a pleasure, Miss Zilonis.\"\n\n\"Why did you hit me?\" She demanded again.\n\nShe had a heavy eastern accent. It was charming, except she was shouting.\n\n\"I didn\u0027t hit you,\" I said.\n\n\"Oh you certainly didn\u0027t pinch!\" she argued.\n\nPerhaps I could focus her anger on something else. I hoped I could, lest she strike me again.\n","page 19":"Edithe Zilonis\u0027 eyes turned a brilliant gold, shone so brightly I could hardly see them. Her expression flattened, her body froze.\n\n\"Edithe!\" I called. I moved towards her, grasped her shoulders.\n\n\"It was a man,\" she said, in a voice far less eastern and much deeper and unfamiliar.\n\n\"A man?\" I asked.\n\n\"Yes,\" she said, \"he was tall, he had a top hat. He was behind me. My purse.\"\n\n\"Your purse in the safe,\" I said.\n\n\"My purse!\"\n\nEdithe Zilonis fell backwards. I caught her. She seemed dazed.\n\nWhen she came to, her eyes had shifted back to their brown irises. It was surreal to me. I had embalmed witches before, broken a few spells, but none had spoken to me as if they were possessed.\n\n\"Are you alright?\" Edithe Zilonis asked me.\n\n\"Quite swell. And you?\" I asked Edithe Zilonis.\n\n\"Well yes, I was just listening to you.\"\n\n\"Edithe, you just told me there was a man, and your purse. Do you need your purse?\"\n\n\"I\u0027d like to have it, yes,\" she said. \"What man?\"\n\nA tall man, I told her, recited back to her what she had done and said to me.\n\n\"Am I magical? Like you?\" she asked.\n\nI was not sure she was, but I was not sure she was not, either.\n\nShe said, before I left to fetch her purse, \"You had your hands around my waist. Do you plan on inviting me to dinner?\"\n","page 5":"This Edithe Zilonis was stubborn. I began to think that she intended to run in front of that carriage, as if it would have magically stopped once she was there. It did, but it stopped her too.\n\nI added some rouge to her cheeks to liven her up. It was pretty on her white skin. Then I tapped at her cheeks, tried to wake her.\n\nUsually I can prod someone only a few times before he or she awakens to speak to me. This Edithe Zilonis required not exactly a slap on the face but not exactly a pinch either.\n\nAnd when she awakened, she slapped me on my face. I recoiled and held my face.\n\nUsually they don\u0027t awaken with such ferocity, but Edithe Zilonis certainly did.\n\nI hollered and Edithe Zilonis cried, \"Why did you hit me? Who are you?\"\n\nAs far as I understood, the dead are aware that they are dead. Lost souls aren\u0027t lost, they just aren\u0027t sociable. And howling ghosts are just having a bit of fun. But Edithe Zilonis was furious I had awakened her.\n\nUsually they\u0027re only furious when they\u0027re old and prepared to die. Edithe Zilonis was quite quaint being dead, and at least old folks can\u0027t hit hard.\n\nI bit back the faint tears in my eyes and said, \"I\u0027m your undertaker. It\u0027s a pleasure, Miss Zilonis.\"\n\n\"Why did you hit me?\" She demanded again.\n\nShe had a heavy eastern accent. It was charming, except she was shouting.\n\n\"I didn\u0027t hit you,\" I said.\n\n\"Oh you certainly didn\u0027t pinch!\" she argued.\n\nPerhaps I could focus her anger on something else. I hoped I could, lest she strike me again.\n","page 18":"Edithe Zilonis\u0027 eyes turned a brilliant gold, shone so brightly I could hardly see them. Her expression flattened, her body froze.\n\n\"Edithe!\" I called. I moved towards her, grasped her shoulders.\n\n\"It was a man,\" she said, in a voice far less eastern and much deeper and unfamiliar.\n\n\"A man?\" I asked.\n\n\"Yes,\" she said, \"he was tall, he had a top hat. He was behind me. My purse.\"\n\n\"Your purse in the safe,\" I said.\n\n\"My purse!\"\n\nEdithe Zilonis fell backwards. I caught her. She seemed dazed.\n\nWhen she came to, her eyes had shifted back to their brown irises. It was surreal to me. I had embalmed witches before, broken a few spells, but none had spoken to me as if they were possessed.\n\n\"Are you alright?\" Edithe Zilonis asked me.\n\n\"Quite swell. And you?\" I asked Edithe Zilonis.\n\n\"Well yes, I was just listening to you.\"\n\n\"Edithe, you just told me there was a man, and your purse. Do you need your purse?\"\n\n\"I\u0027d like to have it, yes,\" she said. \"What man?\"\n\nA tall man, I told her, recited back to her what she had done and said to me.\n\n\"Am I magical? Like you?\" she asked.\n\nI was not sure she was, but I was not sure she was not, either.\n\nShe said, before I left to fetch her purse, \"You had your hands around my waist. Do you plan on inviting me to dinner?\"\n","page 8":"This Edithe Zilonis was stubborn. I began to think that she intended to run in front of that carriage, as if it would have magically stopped once she was there. It did, but it stopped her too.\n\nI added some rouge to her cheeks to liven her up. It was pretty on her white skin. Then I tapped at her cheeks, tried to wake her.\n\nUsually I can prod someone only a few times before he or she awakens to speak to me. This Edithe Zilonis required not exactly a slap on the face but not exactly a pinch either.\n\nAnd when she awakened, she slapped me on my face. I recoiled and held my face.\n\nUsually they don\u0027t awaken with such ferocity, but Edithe Zilonis certainly did.\n\nI hollered and Edithe Zilonis cried, \"Why did you hit me? Who are you?\"\n\nAs far as I understood, the dead are aware that they are dead. Lost souls aren\u0027t lost, they just aren\u0027t sociable. And howling ghosts are just having a bit of fun. But Edithe Zilonis was furious I had awakened her.\n\nUsually they\u0027re only furious when they\u0027re old and prepared to die. Edithe Zilonis was quite quaint being dead, and at least old folks can\u0027t hit hard.\n\nI bit back the faint tears in my eyes and said, \"I\u0027m your undertaker. It\u0027s a pleasure, Miss Zilonis.\"\n\n\"Why did you hit me?\" She demanded again.\n\nShe had a heavy eastern accent. It was charming, except she was shouting.\n\n\"I didn\u0027t hit you,\" I said.\n\n\"Oh you certainly didn\u0027t pinch!\" she argued.\n\nPerhaps I could focus her anger on something else. I hoped I could, lest she strike me again.\n","page 7":"This Edithe Zilonis was stubborn. I began to think that she intended to run in front of that carriage, as if it would have magically stopped once she was there. It did, but it stopped her too.\n\nI added some rouge to her cheeks to liven her up. It was pretty on her white skin. Then I tapped at her cheeks, tried to wake her.\n\nUsually I can prod someone only a few times before he or she awakens to speak to me. This Edithe Zilonis required not exactly a slap on the face but not exactly a pinch either.\n\nAnd when she awakened, she slapped me on my face. I recoiled and held my face.\n\nUsually they don\u0027t awaken with such ferocity, but Edithe Zilonis certainly did.\n\nI hollered and Edithe Zilonis cried, \"Why did you hit me? Who are you?\"\n\nAs far as I understood, the dead are aware that they are dead. Lost souls aren\u0027t lost, they just aren\u0027t sociable. And howling ghosts are just having a bit of fun. But Edithe Zilonis was furious I had awakened her.\n\nUsually they\u0027re only furious when they\u0027re old and prepared to die. Edithe Zilonis was quite quaint being dead, and at least old folks can\u0027t hit hard.\n\nI bit back the faint tears in my eyes and said, \"I\u0027m your undertaker. It\u0027s a pleasure, Miss Zilonis.\"\n\n\"Why did you hit me?\" She demanded again.\n\nShe had a heavy eastern accent. It was charming, except she was shouting.\n\n\"I didn\u0027t hit you,\" I said.\n\n\"Oh you certainly didn\u0027t pinch!\" she argued.\n\nPerhaps I could focus her anger on something else. I hoped I could, lest she strike me again.\n","page 2":"Damon Ellsworth was interesting to me. He was a very attractive man of thirty when he came in to me.\n\nHe had thrown himself off the twelfth story of the apartments on Cherry Avenue. Every bone in his body was broken, which made his mending long and tedious, but he charmed me all the while.\n\nHe was prideful, because on his way down he had cleverly covered his face with his arms. Shattered his left shoulder but his face remained in tact.\n\nI think he only jumped for attention.\n\nA young girl and her mother had been walking the sidewalk when he fell, completely traumatized the girl.\n\nDamon Ellsworth had been known for his writing for the Blackwood Chronicles. He had a small following of avid readers. I never discovered why he jumped, but I think while he was popular and handsome, he felt a lack of true affection in his lifetime.\n\nThe papers wrote, Damon Ellsworth, Writer of Blackwood Chronicles, Falls to Death After Drunken Tumble Over Balcony.\n\nHe was very sober, not a trace of anything in his system, besides depression.\n","page 1":"Leola Viles was forty-three when she died of asphyxiation at the hands of a man twenty years older than she. The darling woman had marks on her neck I had to generously cover with makeup.\n\nShe seduced married men and drowned her newborn in the wishing well out on the Old Road when she was sixteen. She was unmarried and could not stand the thought of raising a child all alone, because married men were bound to get into trouble at some point.\n\nThe man who had killed her had been just another tick on her lipstick case, but he had been truly in love with her. When he found out she was no loyal housewife, he strangled her on the balcony of his three-story home in Middletown. He admitted at court he should have pushed her over, but I\u0027m glad he did not. Broken bones are hard to mend after someone dies.\n\nHer mother had said to me, Leola is the gentlest, kindest, most honest woman you\u0027d ever meet.\n\nWell that\u0027s sweet of you to say, Mother. She told me she loathed you.\n","page 4":"Alford Salono was sixteen when he died. It was shocking and saddening to me. The dead get younger as the living get older, it seemed.\n\nHe was shot walking the street when a gang fight erupted.\n\nOr so the police said. No one was willing to admit the Mayor\u0027s son had started the fight and shot three other boys with his gun before they got him back.\n\nI found a knife in his left pocket. He was not willing to speak much to me, as if the afterlife granted him immunity because he was the Mayor\u0027s son after all.\n\nHe had a hole in his chest, right through his heart. I commended whoever shot him. A good marksman only needs one bullet.\n\nThe hospital had sewn him back up, poorly, so that he was still bloody when he got to me. Leave it to the undertaker is what they say at the hospital.\n\nWhile stubborn, Alford Salono was respectful. His father had beat him.\n\nThat day, the Mayor recited a long and dull speech about Alford Salono.\n\nA woman jabbed her elbow into my shoulder when I laughed at the Mayor\u0027s false affection.\n","page 3":"Tessy Pirie was sixty-three when she passed away in her sleep under unknown conditions. She had been otherwise healthy and mostly happy, but Death waits for no one.\n\nShe was an fascinating soul. She had witnessed the last war, worked on the fields as a nurse. She had sharp eyes and always a half-smile on her lips. She was fiery for a woman who went so peacefully.\n\nShe had married three men, the last two died and the third one wept on my shoulder while I put her away in the freezer.\n\nShe seemed kind, if misunderstood.\n\nWhen she was eighteen, Tessy Pirie ran away to live with a man her parents did not admire. I think they cursed him, because he died when he was only thirty-four.\n\nTessy Pirie was a lover and it was apparent. While the cause of her death was labelled Unknown Cause, it was obvious her immune system had been weakened and finally caught up with her.\n\nHer husband had said, She loved me with all she had. She told me I was her everything.\n\nShe loved a lot of folks, certainly.\n","page 11":"\"That is none of your business,\" Edithe Zilonis argued.\n\n\"It is very much my business,\" I said. \"I\u0027m your undertaker, and I deserve to know more than anyone why you would do such a thing.\"\n\nFor a moment she was silent, as if she was not willing to tell me.\n\nBut it was because, \"I don\u0027t know.\"\n\nShe didn\u0027t know.\n\n\"Well,\" she started, \"it\u0027s not that I don\u0027t know, it\u0027s that I don\u0027t remember.\"\n\nA dead person who does not know why she killed herself, or if she did at all. I was suddenly fascinated. My stinging cheek seemed to subside.\n\n\"You don\u0027t remember,\" I said.\n\n\"I don\u0027t remember,\" she snapped. \"Should I? I don\u0027t know how this all is supposed to happen!\"\n\n\"A dead woman,\" I said, \"who doesn\u0027t know why she died. Well this is unprecedented.\"\n\nShe seemed offended, but softened when I knelt beside her. I looked closely at her head. I wondered if her being struck on the head had anything to do with her forgetting. But dead folks are fully capable when they are dead. How could this Edithe Zilonis be any different?\n\n\"Did you have to take off my clothes? When you. . .undertook me?\" she asked.\n\nI smiled at her. She bit her lip and turned away from me.\n","page 55":"Edithe Zilonis\u0027 eyes closed then opened, blinded me with the golden rays of the spirit that possessed her.\n\n\"He waits,\" the spirit said, but now she took on a gentler voice. It still echoed and chilled my bones.\n\n\"Who is He?\" I asked.\n\n\"A passenger, within a carriage, pulled by four horses. He waits.\"\n\n\"Where is he?\"\n\n\"The carriage. He is binded to the carriage. I can\u0027t---\" at this point Edithe Zilonis began to fight back, wanted to wake up. I held her shoulders, begged her for just one more moment.\n\n\"He has done this before. I am not Edithe, but you have to stop him for me.\"\n\n\"Who are you?\"\n\n\"Someone you know.\"\n\nEdithe Zilonis shuffled and groaned under the spirit\u0027s words.\n\n\"Who are you?\" I asked.\n\nThe spirit had nothing more to say, or rather, Edithe Zilonis did not like being possessed. Her eyes shut. She collapsed backwards onto the chair.\n\nI knelt before her, touched her face.\n\nShe awokened, gasped, exclaimed, \"You\u0027ve kissed a dead woman! That must be illegal.\"\n\nI let my head fall, ran my hands over my eyes and groaned too.\n","page 10":"\"What\u0027s it to you?\" she demanded.\n\n\"I\u0027m your undertaker,\" I replied, \"it would be nice to know who to bill.\"\n\nI feared Edithe Zilonis was not a woman of humor. Her pretty face scowled at me.\n\n\"I haven\u0027t got any family. Who are you planning to bill then? What are you going to do to me?\"\n\nI sighed. Of course. Edithe Zilonis couldn\u0027t have just been some beautiful young woman with a soft voice and a kind heart. She would be absolutely exhausting to me.\n\n\"Well, if you haven\u0027t any family, then you will not have a funeral. You\u0027ll be put in the Unknown Graveyard with the rest of them. And it will all be out of my pocket, how lovely.\"\n\n\"Oh you\u0027ve got a heart of gold,\" she mocked. \"What is the Unknown Graveyard?\"\n\n\"Exactly what you expect,\" I said, \"for the folks who haven\u0027t families or friends, sometimes the ones who don\u0027t have names.\"\n\nAnd at my explanation, Edithe Zilonis\u0027 ferocity did fade. She took her eyes off of me. Now they were clear, and I could see her dark irises. She glanced around but no one is ever surprised to find she is dead.\n\n\"And I\u0027ll be there, forever,\" she said.\n\n\"Well your body will. You\u0027ll go to Heaven or the Hells. Or Purgatory, which I heard is preferred to either. That is, given you believe in them or something like it. It\u0027s all very confusing to me. I\u0027m just an undertaker.\"\n\n\"No you\u0027re not,\" she said, \"because I\u0027m speaking to you right now. Shouldn\u0027t I already be in---\" She was going to say Heaven, it just barely didn\u0027t escape her mouth.\n\nWe both knew she was not the judge of that.\n","page 54":"I had had my fair share of the romantic dead. Sometimes a gentleman will desire one last fling before he descends into the firey depths. Sometimes a gentlewoman will want a kiss or two before she vanishes into nothing. Sometimes I have to peel the passionate old folks off of me. But I had never ever initiated anything with any dead. It seemed inappropriate.\n\nBut I had broken one of the few vows I took as an undertaker, and speaker to the dead, and leaned close to Edithe Zilonis and kissed her.\n\nShe seemed surprised as first, but soon her arms were around my neck, pulled me close. She was always soft and sweet.\n\nAnd Edithe Zilonis did not feel dead in the slightest, which at the time gave me reasoning as to why I would ever do such a thing. As far as I knew, she was not yet dead. And as far as I wished, I hoped she would never be.\n\n\"Oh my,\" she spoke between kissing me, \"you are the best undertaker I\u0027ve ever kissed.\"\n\n\"Let me speak to the spirit,\" I ushered.\n","page 13":"I flipped through the chapters. Most of my books I had read multiple times.\n\nOrly Rankin had a lot of nice things to say about the dead, but her theory on the Eternal Limbo fascinated me the most.\n\nThe Eternal Limbo, or the bridge between Life and Death, could possibly explain why Edithe Zilonis did not remember why she dove in front of that carriage.\n\nThe theory states, The dead can sometimes occupy both the living and dead worlds. They are not spirits, as spirits are soulless. While truly dead, the person can be aware of his or her surroundings, but ultimately confused as to how he or she came to be dead.\n\nRankin went on to speak about how only certain types of folks can see the dead in this state. But I needed to know how to cure it. I flipped ahead. Edithe Zilonis wandered behind me, would sometimes peer over my shoulder.\n\nIf such a dead is encountered, it is wise to persuade him or her to continue on to the afterlife, whether that is Heaven or the Hells, Purgatory or another place of their beliefs.\n\nWell, thank you, Rankin, but I had to know why Edithe Zilonis died.\n","page 57":"I poured some gin and drank the rest from the bottle as I muled over what the spirit inside Edithe Zilonis had said to me.\n\nI had known so many lives in my own lifetime. And I was quickly approaching my thousandth client. The dead were aplenty, all the time, under every circumstance.\n\nSo this spirit telling me that I knew her was more frustrating than it helped Edithe Zilonis\u0027 mystery.\n\nBut I combed my memories for any person that I might know well enough, at least, that she, or he, would possess one of my dead and tell me I knew her, or him.\n\nI had called my parents just last week, and I would have been the first to know if Mother or Father suddenly died, as in their wills, they requested I be their undertaker. It might be an obscure, even disturbing request to anyone who was not my family, but they knew I could say goodbye one last time.\n\nMother had even said, I\u0027m so very lucky to have you. You are skilled and passionate. You care about the dead as much as your father does. You are a marigold in a lily field.\n\nFather had said, You have a heart of gold for the dead, and a heart of steel for the living.\n\nThen there existed my sister, although she was much younger than I and gone far into Peach City. She was probably rich and famous, while I stuffed the dead.\n\nAnd I loved my job, I truly did. I would not have exchanged it for the world. I just wished I had Agrona\u0027s life, and she mine.\n\nThen it occurred to me, I hadn\u0027t spoken to Agrona for several months. And as far as I knew, neither had Mother or Father.\n\n\"I haven\u0027t spoken to my sister in some time,\" I told Edithe Zilonis.\n","page 12":"I offered Edithe Zilonis to come and join me in my study if she so desired. I also offered to put her back to sleep, but she decided very quickly she was not ready, so she skittered along behind me to my study.\n\nMy study was on the second story of the shop, as was the rest of my life that didn\u0027t involve embalming the dead.\n\nMost of the dead are not ready to die. But most of the dead come to accept it rather quickly. Most of the dead, I heard, go to Heaven. Some of the dead haunt the Earth in exchange for their souls. And some of the dead argue with me until three in the morning on how they should still be alive.\n\nI am referring to a particular Terrence Pauling, who decided he would extend his time on Earth by arguing with me until I forcibly put him back to sleep some three hours after midnight. I had already been working late and the bastard was getting on my nerves.\n\nThat is not to say, however, I was not amused by him.\n\nBetween his bouts of cursing me and my family, flirting with me, and sobbing so loud I might have thought my neighbors could hear him, he did amuse me. He was incredibly vibrant for a man of forty, who suffered the death of his wife and daughter only a few years prior. In fact, I thought he would almost want to die, perhaps so he could see them again.\n\nBut he told me, I\u0027m going to the Hells. I just know it.\n\nEdithe Zilonis was quite amazed by my book collection.\n\nShe said, \"You\u0027ve got an awful lot of books about dead people, don\u0027t you?\"\n\nThat was true.\n","page 56":"\"What are we going to do?\" asked Edithe Zilonis.\n\n\"I really wish I knew a witch,\" I mused.\n\nEdithe Zilonis sat up straight from her place upon the chair. She had been resting heavily, as if she was tired. But I would be tired too if I was possessed.\n\nI worried, because I had never had a dead awake for so long before. I feared Edithe Zilonis\u0027 time on Earth was slowly slipping away.\n\n\"Undertaker,\" she called.\n\nI turned to look at her. She had kind eyes.\n\n\"I understand if you can not continue with this. You\u0027ve been a blessing enough already. I\u0027ve come to accept my fate,\" she said.\n\nIt wasn\u0027t a matter of fate. Fate did not exist. No one walked predetermined paths, because if that was true, then no one could have murdered Edithe Zilonis. We were all living creatures of free will.\n\nBut the dead, I thought, Perhaps were not. The dead go on to specific places, with specific people and specific futures for eternity. But why was there a rouge spirit then? Who was he?\n\n\"No,\" I said to Edithe Zilonis, \"I want to help you. I\u0027m already too deep into this.\"\n\n\"I suppose you\u0027re six feet under by this point,\" Edithe Zilonis offered.\n\n\"Hush you.\"\n\n\"Hush you,\" she teased.\n\n\"The spirit said I knew her,\" I told Edithe Zilonis.\n\n\"Well who is dead that you know?\"\n\n\"Everyone that has come into my shop,\" I said.\n\n\"Well that\u0027s just peachy. Who has been murdered, particularly by a ghost man?\"\n\n\"Many by a man, none by a ghost man,\" I said.\n","page 15":"\"I never heard your name,\" Edithe Zilonis said to me as she sat down on the couch.\n\nIt was a nice couch, if old and a little worn. I had recieved it in the will of my grandmother, who also gave me a tin of mints and a couple dollars. She was frugal, and put the rest into investments I had yet seen anything from. She also specifically requested that I not be her undertaker.\n\nI had pulled up a chair beside Edithe Zilonis and opened Lisbeth Mccullough\u0027s other book, Various Spells for the Modern Witch.\n\nI was no witch, so my hope was all but null. But I would give Edithe Zilonis my best. It was the least I could do for her.\n\n\"Well!\" she started.\n\n\"I\u0027m sorry, I was reading,\" I said.\n\n\"What\u0027s your name?\" she demanded. \"Do you just want me to call you My Undertaker? You\u0027ve already seen me nude, it\u0027s the least you can offer me.\"\n\nI quite liked being impersonal with the dead. I had no reason to become attached. A name was a step in a direction I was not fond of.\n\n\"I like My Undertaker,\" I said. I smiled but Edithe Zilonis was having none of it.\n\n\"I don\u0027t. And I\u0027m about to have unfinished business,\" she said.\n\nShe folded her arms in front of her. She was cute. For a dead woman, she had a big personality.\n\n\"Ire. . .\"\n\n\"Your name is Ire?\"\n\n\". . .mortuis. Ostende mihi faciem tuam memorias,\" I said.\n\nEdithe Zilonis was about to curse at me.\n","page 59":"I poured some gin and drank the rest from the bottle as I muled over what the spirit inside Edithe Zilonis had said to me.\n\nI had known so many lives in my own lifetime. And I was quickly approaching my thousandth client. The dead were aplenty, all the time, under every circumstance.\n\nSo this spirit telling me that I knew her was more frustrating than it helped Edithe Zilonis\u0027 mystery.\n\nBut I combed my memories for any person that I might know well enough, at least, that she, or he, would possess one of my dead and tell me I knew her, or him.\n\nI had called my parents just last week, and I would have been the first to know if Mother or Father suddenly died, as in their wills, they requested I be their undertaker. It might be an obscure, even disturbing request to anyone who was not my family, but they knew I could say goodbye one last time.\n\nMother had even said, I\u0027m so very lucky to have you. You are skilled and passionate. You care about the dead as much as your father does. You are a marigold in a lily field.\n\nFather had said, You have a heart of gold for the dead, and a heart of steel for the living.\n\nThen there existed my sister, although she was much younger than I and gone far into Peach City. She was probably rich and famous, while I stuffed the dead.\n\nAnd I loved my job, I truly did. I would not have exchanged it for the world. I just wished I had Agrona\u0027s life, and she mine.\n\nThen it occurred to me, I hadn\u0027t spoken to Agrona for several months. And as far as I knew, neither had Mother or Father.\n\n\"I haven\u0027t spoken to my sister in some time,\" I told Edithe Zilonis.\n","page 9":"\"That is none of your business,\" Edithe Zilonis argued.\n\n\"It is very much my business,\" I said. \"I\u0027m your undertaker, and I deserve to know more than anyone why you would do such a thing.\"\n\nFor a moment she was silent, as if she was not willing to tell me.\n\nBut it was because, \"I don\u0027t know.\"\n\nShe didn\u0027t know.\n\n\"Well,\" she started, \"it\u0027s not that I don\u0027t know, it\u0027s that I don\u0027t remember.\"\n\nA dead person who does not know why she killed herself, or if she did at all. I was suddenly fascinated. My stinging cheek seemed to subside.\n\n\"You don\u0027t remember,\" I said.\n\n\"I don\u0027t remember,\" she snapped. \"Should I? I don\u0027t know how this all is supposed to happen!\"\n\n\"A dead woman,\" I said, \"who doesn\u0027t know why she died. Well this is unprecedented.\"\n\nShe seemed offended, but softened when I knelt beside her. I looked closely at her head. I wondered if her being struck on the head had anything to do with her forgetting. But dead folks are fully capable when they are dead. How could this Edithe Zilonis be any different?\n\n\"Did you have to take off my clothes? When you. . .undertook me?\" she asked.\n\nI smiled at her. She bit her lip and turned away from me.\n","page 14":"Lisbeth Mccullough was very spiritual. I had her book because I had met her. My copy was in fact signed, the only signed copy that existed, as far as I knew, and the only signed copy of any book that had been signed after the author\u0027s death.\n\nShe signed it for me, kissed me, before she fell back into her eternal slumber.\n\nMccullough was of my personality, intelligence and fascination with the dead. I quite admired her.\n\nShe wrote, The dead sometimes can not transition if they have unfinished business. This is commonly remedied by the friends and families casting a farewell spell, or having the dead person speak through his or her traumas.\n\nVery good. I quite admired Mccullough. But all I had to find out was why Edithe Zilonis just couldn\u0027t remember.\n\nMccullough continued: Occasionally, a dead person has no idea how he or she came to be dead. In my years I have only met one person who defied these laws of the dead. My knowledge does not extend very much into the rules and laws of either Heaven or the Hells. I casted a memory spell upon this dead person, and it seemed to work.\n\nEdithe Zilonis asked why I had cursed aloud. She was sifting through my cupboard.\n\n\"I\u0027m not a spellcaster,\" I said.\n\n\"That\u0027s funny,\" she noted, \"because you brought me here, didn\u0027t you?\"\n\n\"Two very different things, I\u0027m afraid,\" I said.\n\n\"What do you plan to do?\" She asked.\n\n\"Well, do you really want to know what happened?\"\n\nI had asked that because if she wanted to know, I had an excuse to find out. Else, I would put her back to sleep and be done.\n\nBut is an undertaker\u0027s work ever truly done?\n\n\"Yes, of course! How thick are you?\" Edithe Zilonis scolded.\n","page 58":"Edithe Zilonis looked on at me with heavy eyes. She had made herself at home, rested upon the couch while I looked through all the past clients I had. Her eyes lazily followed me, looked me up and down every now and then.\n\nMy father had been an undertaker, but could not speak to the dead. My mother could speak to the dead, but had not been an undertaker. My father had given me all the client cards he had had. Each was written on a small card, with the dead person\u0027s name, age, and burial site, and most of them included causes of death. They were tucked nicely into fitting boxes, stacked high upon shelves.\n\n\"Edithe,\" I called.\n\nShe nodded and hummed.\n\n\"Where did your parents live?\"\n\n\"Well I was born here in Blackwood. Father moved us to Central City when Mother died.\"\n\n\"Did you mother die here?\" I asked. \"If you don\u0027t mind me asking.\"\n\n\"Yes.\"\n\nI quickly flipped to the last cards, where the surnames began with X, Y and Z. At last, I found a certain Annaliese Zilonis.\n\nI breathed a sigh of relief at this fortunate coincidence. I stuffed the rest of the cards back onto the shelves, some fell and scattered but I hardly cared. I would have to hire a maid.\n\n\"Her name was Annaliese Zilonis. She died by---\" I began, but I wasn\u0027t so sure Edithe Zilonis would want to hear such a thing. \"She was twenty-three.\"\n\n\"How do you know this?\" Edithe Zilonis asked.\n\n\"My father was an undertaker, here in Blackwood, too. He must have embalmed your mother.\"\n\n\"Your father was an undertaker? You didn\u0027t tell me that! Could he speak to the dead too? No, tell me how my mother died. Father said it was because she hated herself, so she threw herself onto train tracks. He said it was my fault, that it happened, and that was why we had to move.\"\n\nEdithe\u0027s words faded into sorrow at her recollection. For a moment, the room and the air within it was still, as was my breath.\n\nI knelt before her, said, \"The card says she was murdered, Edithe. She was stabbed in the chest.\"\n\nTerror struck Edithe\u0027s face.\n","page 51":"Edithe Zilonis wanted to return to my study. She seemed charmed by the place, even if I didn\u0027t understand why.\n\nI had pulled the large cushioned chair out from the corner. Edithe Zilonis thanked me and sat down. I sat in front of her, on the edge of the short wooden table after pushing all the books and pens aside.\n\nEdithe Zilonis was amused when most of them fell onto the floor.\n\nShe said, \"You have to hire a maid. Certainly you can afford it.\"\n\n\"This is the cleanest this place has been in some time,\" I corrected.\n\nShe laughed, but that was no way to become possessed, regardless of how much it livened her face.\n\nI had a book on possession in my hands. I would perform a simple sance, request that I speak to the other part of Edithe Zilonis.\n\n\"Wait,\" she called, closed her eyes tightly. \"I need a moment, to prepare.\"\n\nI waited a moment, before I began: \"Loqueris---\"\n\n\"Wait!\" Edithe Zilonis called again.\n\n\"Edithe,\" I said.\n\n\"I\u0027m scared,\" she admitted.\n\nI liked to believe I was especially good at comforting the dead.\n\nWhile often they bite away their tears, it is the fragile mother, or old man who fears death who sometimes needs reassuring words. It was just another part of my job that I accepted and became swell at.\n\nI placed aside Summoning Spirits by Lovell Zakarian to put my hands over Edithe Zilonis\u0027.\n\nHer eyes fell to my hands and she blushed when I touched hers.\n\n\"Edithe, I am here to help you,\" I told her.\n\nShe finally looked at me.\n\n\"We have to find the man behind this. If that means being scared, so be it. I\u0027m scared too.\"\n\nI quite admired Edithe Zilonis, because she did not say, I don\u0027t want to; I can\u0027t! I would rather die unknowing!\n\nShe said instead, \"You are never scared. Don\u0027t try and fool me, you fibbing Undertaker.\"\n","page 50":"Edithe Zilonis wanted to return to my study. She seemed charmed by the place, even if I didn\u0027t understand why.\n\nI had pulled the large cushioned chair out from the corner. Edithe Zilonis thanked me and sat down. I sat in front of her, on the edge of the short wooden table after pushing all the books and pens aside.\n\nEdithe Zilonis was amused when most of them fell onto the floor.\n\nShe said, \"You have to hire a maid. Certainly you can afford it.\"\n\n\"This is the cleanest this place has been in some time,\" I corrected.\n\nShe laughed, but that was no way to become possessed, regardless of how much it livened her face.\n\nI had a book on possession in my hands. I would perform a simple sance, request that I speak to the other part of Edithe Zilonis.\n\n\"Wait,\" she called, closed her eyes tightly. \"I need a moment, to prepare.\"\n\nI waited a moment, before I began: \"Loqueris---\"\n\n\"Wait!\" Edithe Zilonis called again.\n\n\"Edithe,\" I said.\n\n\"I\u0027m scared,\" she admitted.\n\nI liked to believe I was especially good at comforting the dead.\n\nWhile often they bite away their tears, it is the fragile mother, or old man who fears death who sometimes needs reassuring words. It was just another part of my job that I accepted and became swell at.\n\nI placed aside Summoning Spirits by Lovell Zakarian to put my hands over Edithe Zilonis\u0027.\n\nHer eyes fell to my hands and she blushed when I touched hers.\n\n\"Edithe, I am here to help you,\" I told her.\n\nShe finally looked at me.\n\n\"We have to find the man behind this. If that means being scared, so be it. I\u0027m scared too.\"\n\nI quite admired Edithe Zilonis, because she did not say, I don\u0027t want to; I can\u0027t! I would rather die unknowing!\n\nShe said instead, \"You are never scared. Don\u0027t try and fool me, you fibbing Undertaker.\"\n","page 53":"I had had my fair share of the romantic dead. Sometimes a gentleman will desire one last fling before he descends into the firey depths. Sometimes a gentlewoman will want a kiss or two before she vanishes into nothing. Sometimes I have to peel the passionate old folks off of me. But I had never ever initiated anything with any dead. It seemed inappropriate.\n\nBut I had broken one of the few vows I took as an undertaker, and speaker to the dead, and leaned close to Edithe Zilonis and kissed her.\n\nShe seemed surprised as first, but soon her arms were around my neck, pulled me close. She was always soft and sweet.\n\nAnd Edithe Zilonis did not feel dead in the slightest, which at the time gave me reasoning as to why I would ever do such a thing. As far as I knew, she was not yet dead. And as far as I wished, I hoped she would never be.\n\n\"Oh my,\" she spoke between kissing me, \"you are the best undertaker I\u0027ve ever kissed.\"\n\n\"Let me speak to the spirit,\" I ushered.\n","page 52":"The spell read, Loqueris ad me: spiritus.\n\nEdithe Zilonis sat before me, looked at me with a strange face.\n\n\"It did not work,\" she said.\n\n\"Spiritus,\" I tried.\n\nEdithe Zilonis startled me when she slapped the book shut, almost caught my fingers when she did.\n\n\"Obviously this ghostie doesn\u0027t respond all that well to spells, Undertaker. She is probably like me, the unexpected will bring her out,\" Edithe Zilonis said.\n\nWe both sat for a moment, debating on what in the world could bring this spirit out to speak to me.\n\nThankfully, Edithe Zilonis was hardly dead.\n","page 29":"It was not strange that that night I had a dream about Edithe Zilonis.\n\nThe dead haunted my dreams often. Some ghosts continously haunted me until I ceremoniously redirected them to where they desired to be. It was all part of the job. I\u0027m sure most undertakers dealt with their share of the ghost and spirit population as well.\n\nSo I assumed at first Edithe Zilonis was merely in my dreams.\n\nWe had been at the park on Eastend. Edithe Zilonis walked in front of me, would turn back to tease me, and ask if I was still following.\n\nI called back, Yes, Edithe, I am. I\u0027ve followed you for some time now. Why would I not follow you?\n\nI didn\u0027t know the correct answer to that nonsense question.\n\nThe Edithe Zilonis that was in my dreams was much less pale, much less cold, and much less dead. She had color in her cheeks and shoulders. I saw her shoulders because her dress cut low, although it didn\u0027t seem like a thoughtful clothing choice, given it was very cold in this sunny park.\n\nHer blonde hair was done back in soft curls and glittered brightly too, as if it was no longer whitened by death. And she had a bow tied around her head like a girl as well.\n\nHer gown was a brilliant pink with ruffles and shiny fabrics. It was pulled in tightly at the waist, which is a large cause of female organ failure later on. But I did not think about organ failure during this dream. I thought how I rather liked Edithe Zilonis\u0027 waist, how much more I would have liked it without the dress.\n\nI awoke from sleep when the coldness from the sunny park was too much to bear. Edithe Zilonis was standing at the foot of my bed. Her eyes were glowing golden like they had before.\n\n\"Find the man,\" she said to me.\n\n\"Why aren\u0027t you asleep?\" I asked.\n\n\"Find the man,\" she said again, this time with more ferocity. I knew that this part of Edithe Zilonis was not Edithe Zilonis, but I didn\u0027t know who it was.\n\nI was not scared but certainly not content.\n\n\"What man?\" I asked.\n\n\"The man who murdered me,\" she said. \"He has my purse.\"\n\n\"Edithe, you need to sleep,\" I said.\n\n\"I can\u0027t sleep.\"\n","page 22":"The bed I had awokened Edithe Zilonis from was no traditional mattress-ridden bed. It was actually a steel tray with two long cushions upon it. I took pride in the comfort of the dead, as they are bound to return the good deed.\n\nAt least, I assumed. I hadn\u0027t recieved any gift from the dead yet, perhaps because they are dead. But there is always hope.\n\nEdithe Zilonis\u0027 well-kept body was hardly a chore for me. The tray had no trace of blood or other bodily fluids, and her embalming was quite straight-forward. But there also was no purse, as if she snatched it while I was out getting the morning paper.\n\nThe morning paper read, Woman Struck and Killed by Carriage on Main Street, Drunken Driver to Blame?\n\nI thought, well that\u0027s silly, giving out the name of the street. Tourists will be even livelier than usual.\n\nI didn\u0027t realize at the time, but when I awokened Edithe Zilonis, she had thrown her hand onto my cart, knocked my tools askew. A syringe had fallen to the floor. I had frankly not fixed them because I had been slapped.\n\nI also thought, I have never been slapped by a dead woman before, and while the experience had certainly hurt, it thrilled me. Perhaps I was a masochist for the dead.\n","page 66":"I think my reaction time was usually slow, as I spent most of my time in the dark speaking to the dead softly.\n\nOften, I felt dead myself, not because I despised my job, but rather, I had to put myself into the mindset of a dead person in order to properly service him or her.\n\nAnd even when I returned to bed for the night my dreams were sullen too, entwined with the what-if\u0027s of how the dead move on, and how I could better understand them. I was a thinker, not an action-taker, and certainly not a quick action-taker.\n\nBut I was light on my toes. The world around me ceased to move. And as this murderous ghost-man went to shove Edithe back to her death, I had my arms on him.\n\nI had so much momentum I almost lost control of myself. I watched from the ground the carriage trample the man.\n\nThe pink purse fell from his hands, to the ground and landed open. The coins and the perfume bottle within it scattered and shattered at Edithe\u0027s feet.\n\nEdithe gasped. So did I.\n\nThe wheel of the carriage almost caught my fingers.\n","page 21":"I peered closely at the safe. It was an old Herring Safe, at least a century old. I got it cheap when an old barber told me to take it off his hands. He was planning on pulling insurance fraud by leaving a few too many candles lit at his shop.\n\nHe didn\u0027t tell me what he planned to do, but he said he had removed all valuables from the inside, and usually had a box of matches in his pocket. I also met him again a week later but he was half-scorched and dead too.\n\nThe safe was an odd dark red color. However, it was not originally red. The red paint was chipping, revealing the steel beneath it. Why anyone would want to paint a perfectly good safe red of all colors was not something I pondered, especially not at that moment.\n\nThe safe could not be moved by myself. It was as tall as I was and weighed a good bit more than I did too. But I looked at the frame and all about on the inside. The only peculiar thing was that there was a relatively new scratch above the lock, as if someone fumbled to get it open.\n\nI sighed. Perhaps I had been robbed since the morning and the culprit had already left, or was waiting behind me ready to bash my head in, desiring to steal my embalming fluid I supposed.\n\nIt was not often when I was startled. I prefer to think that in all my years of working with the dead, nothing could scare me by then.\n\nBut I absolutely jumped when Edithe Zilonis put her arms on my shoulders and shook me, yelling, \"Boo!\"\n\nShe said, \"I\u0027m like a ghost, see? Did I scare you?\"\n\n\"Absolutely not,\" I said.\n","page 65":"I had a severe case of dj-vu. Not for this exact event, not for Edithe, or the man and the purse. Not even as I had walked back from lunch and seen the police just outside my shop, cleaning blood from the stone.\n\nI felt as if I had met Edithe before, as if I had heard Agrona\u0027s voice in my head before, as if I had witnessed all these events in sequence before.\n\nAnd if Agrona had been murdered by this same man, I thought, Perhaps this is all just a deadly, endless loop.\n\nBlackwood was a place of mystery of life and death, and the chills on the back of one\u0027s neck was an unfortunate side-effect one deals with when moving to Blackwood. Eventually, the chills subside, leaving one feeling either completely empty, or even more confused than when one began.\n\nI supposed everyone on Main Street of Blackwood were completely empty.\n\nAnd I thought I was too, until I shouted, Edithe! It is him!\n\nAnd I hadn\u0027t heard myself shout so loudly or ferociously before.\n\nThe man had placed a hand on Edithe\u0027s shoulder, went to push her to her death again when she reacted just in time to do the same to him.\n\nI watched the carriage rightly trample him.\n\nThe pink purse fell from his hands to the ground and landed open. The coins and the perfume bottle within it scattered and shattered at Edithe\u0027s feet.\n","page 24":"Lisbeth Mccullough was very spiritual. I had her book because I had met her. My copy was in fact signed, the only signed copy that existed, as far as I knew, and the only signed copy of any book that had been signed after the author\u0027s death.\n\nShe signed it for me, kissed me, before she fell back into her eternal slumber.\n\nMccullough was of my personality, intelligence and fascination with the dead. I quite admired her.\n\nShe wrote, The dead sometimes can not transition if they have unfinished business. This is commonly remedied by the friends and families casting a farewell spell, or having the dead person speak through his or her traumas.\n\nVery good. I quite admired Mccullough. But all I had to find out was why Edithe Zilonis just couldn\u0027t remember.\n\nMccullough continued: Occasionally, a dead person has no idea how he or she came to be dead. In my years I have only met one person who defied these laws of the dead. My knowledge does not extend very much into the rules and laws of either Heaven or the Hells. I casted a memory spell upon this dead person, and it seemed to work.\n\nEdithe Zilonis asked why I had cursed aloud. She was sifting through my cupboard.\n\n\"I\u0027m not a spellcaster,\" I said.\n\n\"That\u0027s funny,\" she noted, \"because you brought me here, didn\u0027t you?\"\n\n\"Two very different things, I\u0027m afraid,\" I said.\n\n\"What do you plan to do?\" She asked.\n\n\"Well, do you really want to know what happened?\"\n\nI had asked that because if she wanted to know, I had an excuse to find out. Else, I would put her back to sleep and be done.\n\nBut is an undertaker\u0027s work ever truly done?\n\n\"Yes, of course! How thick are you?\" Edithe Zilonis scolded.\n","page 68":"Although, I thought, Perhaps I had broken my vow before, because I could not rid myself of Damon Ellsworth. He captured me and my lips while he recited to me all he had done in his lifetime.\n\nHe told me he had travelled all over the state, the country, even other countries, to write. He said he wrote about wars and deaths, about cultures and travelling itself, even about the foods he ate and the people he met.\n\nBut he said to me, I\u0027m glad I met you. Of all people I have met, you are the most interesting. You can speak to the dead. I have travelled everywhere, but I\u0027m sure I haven\u0027t one story like any of the ones you know.\n\nI said, Perhaps, but I have not even left Washington. No number of stories is worth the world.\n\nAnd Damon Ellsworth laughed, kindly told me I was foolish before I let him go.\n\nI purchased a majority of my books I owned after I met Damon Ellsworth. I began collecting the weekly paper stored in boxes in the attic. I read them all, until Damon Ellsworth had no more stories left for the editors to publish.\n","page 23":"I invited Edithe Zilonis to have a seat in the parlor.\n\nShe seemed fascinated by all my various medical equipment, books and photos. To me, my apartment was dusty and dirty, overwhelmed with clutter but barely used. Edithe Zilonis must have not thought about any of that.\n\nShe looked on at my things, then finally met my gaze with eyes not nearly dead enough for a dead woman.\n\n\"You live here,\" she said in such a way it sounded like it was not a fact nor question.\n\nBut I said, \"Yes, I do. Often just to sleep and eat. Sometimes I\u0027ll read in this room, but I am usually busy with work.\"\n\n\"Does it scare you, to have dead bodies under your feet?\" Edithe Zilonis asked. \"I saw those freezers. Are they all full?\"\n\nShe made me laugh, seemed pleased when I did, but she was still curious.\n\n\"Not usually. I prepare and ship off the dead rather quickly. I am good at my job,\" I said.\n\n\"I hope so. I\u0027m speaking to you right now. Why is that? How is that possible?\"\n\n\"Do you not remember anything before your death?\" I asked.\n\n\"I remember a carriage,\" she said. \"You didn\u0027t answer my question.\"\n\n\"Yes but what had you been doing before then? Were you just taking a stroll? You had nothing but perfume and coins in your purse.\"\n\nEdithe Zilonis took her eyes off of me. \"You have my purse,\" she said.\n\n\"Yes, and I intend to put it in your coffin with you, if that\u0027s alright,\" I said.\n\n\"My purse,\" she said again.\n","page 67":"Leola Viles had been particularly solemn the day of her death.\n\nShe sat for several hours looking out the windows while she exchanged few words with me.\n\nBut what she did say was, I deserve this. I deserve to die because of the things I have done.\n\nI said to Leola Viles, No one deserves death, not even the worst murderers. Because death is a ceremony. Life is useless and overrated. Death is silent, but freeing.\n\nShe asked me to sit with her, so I put my work aside to do so. She spoke softly about how well she could sew and cook although she hardly did because those were maids\u0027 jobs.\n\nI said, Some professionals sew too. I have to sew up the dead sometimes. I wouldn\u0027t want my maids to do that.\n\nAnd for the first time since I had met Leola Viles, she smiled, and she was immensely beautiful when she did.\n\nIt was a quarter after midnight when she asked to say goodbye, told me to dress her in her simplest gown for her funeral. I obliged.\n\nShe held my hand tightly until she went on.\n\nI think she felt as if I humbled her. But, in fact, Leola Viles had humbled me.\n","page 26":"I peered closely at the safe. It was an old Herring Safe, at least a century old. I got it cheap when an old barber told me to take it off his hands. He was planning on pulling insurance fraud by leaving a few too many candles lit at his shop.\n\nHe didn\u0027t tell me what he planned to do, but he said he had removed all valuables from the inside, and usually had a box of matches in his pocket. I also met him again a week later but he was half-scorched and dead too.\n\nThe safe was an odd dark red color. However, it was not originally red. The red paint was chipping, revealing the steel beneath it. Why anyone would want to paint a perfectly good safe red of all colors was not something I pondered, especially not at that moment.\n\nThe safe could not be moved by myself. It was as tall as I was and weighed a good bit more than I did too. But I looked at the frame and all about on the inside. The only peculiar thing was that there was a relatively new scratch above the lock, as if someone fumbled to get it open.\n\nI sighed. Perhaps I had been robbed since the morning and the culprit had already left, or was waiting behind me ready to bash my head in, desiring to steal my embalming fluid I supposed.\n\nIt was not often when I was startled. I prefer to think that in all my years of working with the dead, nothing could scare me by then.\n\nBut I absolutely jumped when Edithe Zilonis put her arms on my shoulders and shook me, yelling, \"Boo!\"\n\nShe said, \"I\u0027m like a ghost, see? Did I scare you?\"\n\n\"Absolutely not,\" I said.\n","page 25":"\"I didn\u0027t find your purse,\" I told Edithe Zilonis. \"And it\u0027s strange because I swear I locked it in the safe.\"\n\n\"You\u0027re speaking to a dead woman and a lost purse is strange?\" she questioned.\n\n\"I speak to the dead all the time, my dear. But I never lose a thing,\" I said.\n\n\"Peculiar,\" Edithe Zilonis said, but I think she just liked the sound of the word.\n\n\"Very,\" I said.\n\nThe shop did not have any windows besides the two on the front that looked out onto Main Street, and even those had curtains.\n\nI was quite lucky to be an Undertaker on Main Street. When I moved to Blackwood, the city was small and growing. Then it started booming, and the land I stood on, and the land Edithe Zilonis died on, was worth millions.\n\nI also had invested in a large sign outside the shop. I hoped it caught attentions, and perhaps led drivers to hit citizens too, but that\u0027s only good for business.\n\nAnd I hadn\u0027t seen a clock but I knew the shop had to be closed soon. The sun was setting and would have glittered through those front windows had I not curtains.\n\nEdithe Zilonis, who was much shorter than me, looked up at me with wide eyes.\n\n\"It\u0027s time to close,\" I said.\n\nI walked past her to lock the front doors and fix the crooked curtains. The dead are a curious bunch and always want to see outside one last time before they leave but they never fix the curtains.\n\n\"Do I have to go back, to being dead?\" Edithe Zilonis asked me.\n\nHer voice had lightened, almost became frightened as if she was scared. But she had been through the worst part already: Life.\n\n\"You are already dead,\" I told her.\n\nI reached to turn off the lights. Edithe Zilonis was standing by the steps and the lights and the sun from the windows upstairs shone down upon her. It made her seem ghostly, but she was not yet a ghost.\n\n\"I mean, go back to. . .\" she started, but I understood what she meant.\n\n\"Yes. It is unfortunate about your purse, and about your death, but I am just an undertaker,\" I said.\n\n\"No, you\u0027re not,\" she said. \"You talk to the dead. You bring the souls of the dead back to life, as least for awhile. What are you?\"\n","page 69":"Tessy Pirie was incredibly inspiring, and gave me advice on how to talk to folks that were not dead.\n\nShe sat on the couch in my study, waggled her finger when she was speaking to me.\n\nShe said, Tell my husband it was my time, and to not mourn me too much. Tell him I love him, and I\u0027ll see him soon.\n\nThen Tessy Pirie must have realized something, for she continued, I certainly hope that Lisbeth isn\u0027t up there in Heaven, else I\u0027ll be having some words with her!\n\nShe added, Look at me, vices till my death day. That\u0027s good old Tessy for you, huh?\n\nI didn\u0027t know if that was Good Old Tessy but I nodded in agreement and smiled.\n\nIt is often I have to console the dead. It is not often I am consoled by the dead. Tessy Pirie was the exact person to give advice to her undertaker, and make me promise to listen to it.\n\nWe had some gin and laughed through the night, until Tessy Pirie kissed my cheek and said, I best be going. You were a doll. Also tell my husband to shave. He\u0027s been too scruffy!\n\nI said, Yes ma\u0027am, and wished Tessy Pirie a See You Again.\n","page 28":"\"Well,\" Edithe Zilonis prompted.\n\nShe put her hands on her hips, tapped her foot against the ground.\n\n\"I\u0027m just an undertaker,\" I said.\n\n\"That\u0027s poppycock if I ever heard it!\"\n\n\"I\u0027m sorry about your purse, and about your death, Edithe. But I\u0027m going to have to say goodnight.\"\n\n\"Goodnight?\" she demanded. \"There will be no good night until---\"\n\nI said, \"Goodnight, Edithe Zilonis.\"\n\nI had walked up to her, put my arms out, so I could catch her once she collapsed. I was just an undertaker, and perhaps I spoke to the dead too.\n\nAnd I wished myself a goodnight too. I was quite exhausted.\n","page 27":"\"I am not a witch,\" I said.\n\n\"Witches are real?\" Edithe Zilonis asked.\n\n\"I\u0027m not sure, but I know I\u0027m not one. In fact, I don\u0027t think I can wield magic at all.\"\n\n\"That\u0027s preposterous,\" she said, \"and frankly impossible.\"\n\n\"I don\u0027t know magic,\" I said, \"but I do know I can speak to the dead. Mediums, children and animals can do that too.\"\n\nEdithe Zilonis seemed frustrated with me. Her soft face grew perturbed. Her mouth turned inward. Her eyes looked me in my soul. It had been done before to me. I was unfazed by the dead and their cold glares.\n\n\"I refuse to believe that,\" she said.\n\nShe also crossed her arms. For a woman of twenty-nine she acted like she was fourteen. I hoped I was that ferocious when I died.\n\n\"Goodnight, Edithe Zilonis,\" I said.\n\nI had come up to her, extended my arms when I told her Goodnight. It was true that I spoke to the dead. Because when I said Goodnight, her eyes flittered closed and she fell. Her darling expression had faded into something much softer.\n\nI placed her back into her bed, went up the stairs.\n","page 60":"Edithe\u0027s eyes turned to gold.\n\nThe spirit spoke: \"He is hiding, waiting. There is a carriage coming, will be there in the hour. Edithe was not first, and if you can\u0027t stop him, then she will not be the last.\"\n\n\"Agrona,\" I called.\n\n\"I was coming to see you, travelling from Peach City, when I was pushed into a travelling carriage.\"\n\nEdithe groaned, moved her hands to shoo off the spirit.\n\n\"I\u0027m sorry,\" I said.\n\n\"We are fateless. But he is not.\"\n\nEdithe returned, took a breath and gazed at me.\n\nShe said with awe, tears falling from her eyes, \"I heard her.\"\n\nI rushed up Edithe, to take her by the arm. \"We have to go, Edithe, back to the place you died.\"\n\n\"Yes, of course. We\u0027ll be heroes, Undertaker.\"\n\nI wasn\u0027t sure we would be heroes, but it seemed like the good thing to do.\n\nI was not just a dealer of the dead, I spoke to the dead, I cared for the dead, and I loved the dead, because no other living soul was going to. And I was proud, and I was suddenly glad I did not have Agrona\u0027s life.\n","page 62":"Annaliese Zilonis died when her husband stabbed her through the chest five times with two different knives from a kitchen set.\n\nEdithe had not been in the house when this occurred, but upon her return, her father had packed most of their things and set off for Central City.\n\nHer father travelled, was not often at home thereafter. Edithe stayed at a home of a Bernice Dacosta, an old woman who seemed to care about Edithe more than her father did.\n\nEdithe said, Bernice adopted me. My father eventually vanished, but I didn\u0027t care. Bernice loved me like my father didn\u0027t.\n\nShe also said, My father returned a decade later, wanting to involve himself in my life again. I told him to shove it up his ass.\n\nI asked, Did no one ever tell you about your mother?\n\nShe said, No. The police must have never found me, or my father. If he is this murderous ghost, then he is avoiding death, and he must be stopped.\n\nShe said, He deserves to rot in the Hells.\n","page 61":"Agrona was seven years younger than me, and the age difference put a strain on our relationship. I didn\u0027t mind her little self waddling around the house, nor her crying in the middle of the night, but I never particularly adored any of it, or her, either.\n\nBut she was a good girl. She never started trouble, rather, she seemed to always end it. She was clever and funny and her face was always lively and made Mother smile.\n\nAgrona could not speak to the dead, and while she never mentioned it, I knew she was jealous of my ability. She actively avoided any roles that involved the dead, and eventually moved to Peach City with a handsome gentleman.\n\nThe last I heard, she sold exotic makeup and perfumes by the coast. I believed she was married, perhaps to the same gentleman.\n\nBut at some point she was travelling to see me when she died.\n\nI recieved a telephone call later that day from Mother, who informed me about what I already knew.\n\nEdithe said, I\u0027m sorry.\n\nBut I didn\u0027t know why Edithe was sorry for me, for she was dead, and now was my sister.\n","page 20":"I actually tripped on the second to last stair, which was crooked sideways and had been since the building had been renovated. And I knew it was, and I hadn\u0027t tripped on it since I had moved in.\n\nI moved some six years ago into this shop and its apartment. I had the freezers built in, and a large safe placed in the far wall, so that if the building caught on fire, the safe would be the first to burn.\n\nThe combination was four-five-one-twenty and then eight. The numbers had some deeper meaning I had since forgotten, but I had remembered the numbers.\n\nI was musing over Edithe Zilonis and hardly realized that I had unlocked the safe without thinking. In fact, for a moment I stood as if I had forgotten why I was there, standing in front of my Safe of the Dead. It was as if my mind was severely unfocused even though I was quite focused. Or at least, I thought I was quite focused.\n\nSo it took me even longer to realize that Edithe Zilonis\u0027 purse was no longer there within the safe.\n\nArticles of the dead tend to go missing, not usually but it does occur. Perhaps a wandering dead will find her ring, place it on her hand and leave me to wonder how I had just set it down on the table beside me moments before.\n\nBut disappearance of articles only occurs with objects exceptionally partial to the individual. I was no writer, but I could write that in my own book on the dead whenever I decided to publish one, I believed it so.\n\nPerhaps Edithe Zilonis had taken it when she went upstairs with me. Although how she could have opened the safe was beyond me.\n","page 64":"\"What time is it?\" Edithe asked.\n\nI checked my watch. \"It is almost four,\" I said.\n\nEdithe died at four-o-two.\n\nWe hurried back along the road to find the place of Edithe Zilonis\u0027 death.\n\n\"You have to stand back,\" Edithe told me, \"If he likes shoving people in front of carriages, it is best you stay away.\"\n\n\"Edithe,\" I tried, but she spoke.\n\n\"You are swell at reading and solving mysteries. Now I am going to speak to this man. What is he going to do, kill me again?\"\n\nShe shooed me away with a hand. I stepped back, pressed myself against the building behind me, which was the Vince\u0027s Barber Shop.\n\nThere had been folks walking the streets, and horses and carriages as well, but in the distance a certain horse and carriage barreled down the street, as if the person inside desired to get home very quickly.\n\nAnd a regular man in a dark, dated suit and hat brushed past me. I would not have noticed him if he hadn\u0027t had in his hands a certain, pink purse.\n\nAnd he called, \"Madam, your purse!\"\n\nEdithe turned to look at him.\n\nTime, for a moment, slowed to nearly a stop. I saw myself walking from the far side of the street, a brown bag in my hand, which had been my lunch.\n","page 63":"Annaliese Zilonis died when her husband stabbed her through the chest five times with two different knives from a kitchen set.\n\nEdithe had not been in the house when this occurred, but upon her return, her father had packed most of their things and set off for Central City.\n\nHer father travelled, was not often at home thereafter. Edithe stayed at a home of a Bernice Dacosta, an old woman who seemed to care about Edithe more than her father did.\n\nEdithe said, Bernice adopted me. My father eventually vanished, but I didn\u0027t care. Bernice loved me like my father didn\u0027t.\n\nShe also said, My father returned a decade later, wanting to involve himself in my life again. I told him to shove it up his ass.\n\nI asked, Did no one ever tell you about your mother?\n\nShe said, No. The police must have never found me, or my father. If he is this murderous ghost, then he is avoiding death, and he must be stopped.\n\nShe said, He deserves to rot in the Hells.\n","page 0":"I had finished preparing a lovely young woman who died after being struck by a carriage just outside on Main Street. The ordeal had been surprisingly not gruesome, given her tight corset and big skirts which had protected her soft flesh from the sharp, front corner of the carriage.\n\nShe had, however, been hit head first, knocked unconscious and then ran over by the rear wheels.\n\nThe driver had been upset, had said that the young woman dashed into the road as if she desired to be hit. But no one knew if she desired to die.\n\nI think the driver had gone slightly out of his way.\n\nRegardless, I was not the police, who arrived at the scene some twenty minutes later. And I had not witnessed the event. I was actually coming back from lunch when I saw the police folk outside my shop.\n\nBut I had not necessarily a shop. I was an undertaker. I suppose my shop could be a shop, just for the preparation of the dead and payment thereafter.\n\nPerhaps I rather dealt the dead.\n\nThis young woman was twenty-nine. Her name was Edithe Zilonis, and she had no known relatives.\n\nPolice believed she was from out of town but had searched the local cities for anyone of the same surname. They found absolutely no one. She hadn\u0027t any personal belongings other than a small purse with her name stitched within it, and some coins and a bottle of perfume. It was in the safe and I would set it into her hands when the time for her funeral came.\n\nBut I did not know if this dear Edithe Zilonis would even have a funeral. The carriage driver had come back twice to check on her. Perhaps he would ask for a funeral for her, but that meant he would also have to pay. And the man seemed kind but not too kind.\n\nIt was unfortunate for everyone, because I just cleaned up a corpse and would not be getting paid. I assumed.\n\nSo to soothe my lamenting, I spoke softly to Edithe Zilonis.\n\nWhen I first met her I said to her, \"Hello Miss Zilonis. I\u0027m your undertaker. I hope your stay will be pleasant for you. You are very beautiful, and that is a shame.\"\n\nAnd Edithe Zilonis was very beautiful. She had fair skin and blonde hair. Her eyes were brown had they not been bloodshot, and she had a small frame. She had not had any children, from what I could tell, and very little stress either. Her skin was soft and her dainty little face had no wrinkles or blemishes. It made my heart sink.\n\nPoor girl, I thought, You could have had anyone at your feet, and now you\u0027re dead.\n\nI was curious. I was very curious most of the time. I revelled in the stories of my clients. I loved hearing what families had to say about their sweet Leola, or handsome Damon. How Tessy was such an affectionate grandmother, and how Alford had been taken from us much too young, Gods bless him.\n\nI loved these stories because most of them were just stories.\n\nI allowed the families and friends and lovers to relish in their pleasantries, but I knew the truth. I knew the dead far more intimately than the living.\n"}