{"page 123":"You can’t do this. It goes against everything that mom instilled in you. You begin to cry and collapse on the floor in tears.\n\n“Oh geez, she is an emotional one. Oh well nevermind then.” Steve says zipping up his pants. “Kelly I’ll see you at tonight’s show, hope you put on a good one, because combined with your complaining yesterday and wasting my time today, you’re not exactly high on my list right now. Get out of here.”\n\nKelly doesn’t say anything but she pulls you up by the hair and roughly pulls you back to the car. She’s entirely silent during this time, but when she throws you in the car, she lets loose.\n\n“You fucking little bitch! You couldn’t help me out once? I told you to trust me, and you can’t even do that! When we get home you better just permanently stay in that goddamn basement of yours! Don’t EVER ask for my help ever again! Fuck you! Fuck you!” She screams and your cries are stifled when she punches you in the face a couple times before starting up the car.\n\nShe continues to berate you and smacks you a few more times whenever you start to cry a little louder. You almost think she’s going to dump you in the middle of one the ghettos you’re driving through and she does threaten to do so several times, but she never does.\n\nWhen you get home, Peter and his buddy Kevin are outside filming something irrelevant, but when they see you and Kelly they film her pulling you out of the car, screaming obscenities, and kicking you a few times before driving off. Kevin helps you up and tries to grope you in the process, but you push him away and run back to your room to cry.\n\nYou attempted to do something in the real world and were literally beaten and harassed for your efforts. It’s apparent to you now that you have no place out there anymore. You follow Kelly’s advice this time and vow never to leave the basement ever again.\n","page 124":"Reluctantly you agree, but definitely not because you want to, but more because you feel scared and pressured right now.\n\nTearfully you go towards Steve who begins to fondle your breasts and run his hands generally all over your body.\n\n“Oh yeah, you’re nice. Don’t be scared little darling. Nobody’s going to hurt you here.”\n\nYou get on your knees before Steve who pulls his dick out and begins stroking it, but is getting dismayed by your reluctance. At this point your sister Kelly speaks up.\n\n“Erm, Steve. I think this would go easier for my sister if there wasn’t an audience. As you might’ve noticed she’s a bit on the shy side.”\n“Yes, yes, whatever. All of you get out.”\n\nSteve’s goons look a bit disappointed, but comply. You sister leaves as well. You could swear she had a grin on her face as she was leaving.\n\n“Alright sweetie, we’ve wasted enough time, get to work.” Steve says and shoves your face in his crotch.\n\nIt has to be one of the more awful things you’ve smelt and it definitely tastes just as bad. You begin to cough.\n\n“Bitch you better not vomit on my dick!” Steve orders, but you’re having a very hard time with that order.\n\nBeing a virgin, you haven’t even done this before. So you’re sort of fumbling around a lot. True you’ve watched porn on the internet out of curiosity and you’re attempting to mimic what you remember those ladies (or guys in some cases) did, but you’re just not a natural at it seems. Either that or the smell and the entire degrading situation is really distracting you.\n\nOnce again Steve begins to get agitated.\n\n“Christ have you ever done this before? Here!” he says and put his hands on your head and push it back and forth himself. You’d probably choke on his dick with this technique if his dick wasn’t so small. As it is your head is partially ramming into the flab of his gut, so you’re still not getting much air.\n\nSteve continues to violate your mouth and says how much you’re a whore and how you enjoy this. You absolutely don’t though and the only thing you can do as the salty taste invades your mouth is close your eyes and pretend you’re someplace else.\n\n“Swallow you fucking whore!” he shouts in ecstasy and at that point a shot is heard.\n\n“Ack!” Steve shouts as he cums in your mouth. You gasp and gag for air and manage to break free while more cum shoots from his dick and all over your face. You immediately start spitting and throwing up in the corner, still not realizing what has happened.\n\n“Teach you to cheat me, motherfucker. Now where’s that safe combination?” you hear your sister say.\n\nYou finally look behind you, still hacking up cum and attempting to wipe it off your face along with tears.\n\n“Kelly?”\n“Yeah, I’m here. I told you, that I wouldn’t let anyone hurt you. Glad you trusted me.” She says as she searches Steve who lies in a slump in his chair and a big hole in his head. “Hah! Knew he had the combo written down, this fucker could never remember anything.”\n\nKelly gleefully proceeds to open the floor safe hidden nearby, though not too hidden since Kelly knew where it was. You on the other hand are still trying to come to grips with what just happened.\n\n“Didn’t let any one hurt me?! You let this bastard rape my mouth! And for what?”\n“For this! All this lovely loot!” Kelly says thrusting a wad of bills in your face, which you don’t like considering that you’ve had your fill of having anything thrust in your face today. You’re beyond fear now and moved on to outrage and anger.\n\n“For money?! You could’ve just killed him without me!”\n“True, but it would’ve been much harder. He had those bodyguards with him at all times, your distraction was just what I needed.”\n“Bullshit! You did this to me for your own twisted pleasure!”\n“Did I?” your sister smiles. “Maybe. But I also did it for the money and revenge.\n“Revenge on me or him?”\n“Perhaps both. And I didn’t make you do anything. You could’ve backed out. I would’ve been pissed of course, but you still could’ve backed out. So you took a shot in the mouth, so fucking what? I told you before that you were going to have to get a little dirty to make it in the real world. I’m going to give you half of this money for helping me anyway. Buy yourself a box of mouth wash or some shit. Hell the guy’s dead now, it’s not even like he can brag about it. Here help me with this money.”\n\nNot knowing what to do, you comply to your sister’s orders again. You and her put it all in a bag and leave, but not before Kelly kicks Steve and his chair over.\n\n“And I’m not a dyke you fucking asshole!” she says.\n\nYou pass one of the dead guards on the way back, then another near the exit. They showed no evidence of being shot. You guess that Kelly killed them with her bare hands.\n\nKelly and you drive off and you begin to ask about the cops or any other criminals that might miss Steve.\n\n“Nah, don’t worry about the cops. They’ll probably throw a party. Steve’s just another dead criminal. No serious investigation. And as for other criminals, they’ll probably throw a party too. Nobody’s going to miss him. Look, I’m sorry for what happened to you, but you needed a wake up call. You needed to understand that the real world is based on sacrifices. You made a sacrifice and the pay off was bigger than the sacrifice. Wish I could’ve learned that lesson a lot sooner and quicker instead of putting my body through hell and waking up in pain every morning.”\n\nWhile Kelly’s unique “lesson” might have a point, all it makes you feel is violated and used. All her abuse over the years doesn’t even compare to this twisted little endeavor. And she wants you to be thankful? Fuck that, and fuck her. You see the gun she used to kill Steve next to her and grab it.\n\n“Suzy what the fuck are you doing?”\n“Teaching you a lesson too, that you can’t abuse people for years and get away with it!”\n\nKelly is momentarily surprised, but then reverts back to calmness.\n\n“If you shoot me, you’ll have a hell of a time getting back home, with two bags of stolen money, a bloody car and a dead body collapsed on the steering wheel and gas pedal.”\n“That’s why you’re pulling over.”\n“Hah! The hell I am. Nice try, but you didn’t think this through. Should’ve waited until we got home where you wouldn’t have been at my mercy as much, though you probably would’ve lost your nerve if you waited. Maybe just as we got in this car? Oh well doesn’t matter you missed your opportunity.”\n“I’m telling you to pull over now!” you say jamming the gun into her head.\n“Ohh, you ARE mad. Never seen this side of you before. Maybe you should’ve been like this when Steve was shoving his little dick in your mouth. God, that had to be horrible. What a first time for a blow job eh? Well at least his fat ass wasn’t laying on top of you. Give it up Suzy. You’re not going to kill me. You don’t have it in you to take the risk. I’m being understanding right now because you’ve obviously snapped from the wake up call to reality, but you continue to shove that gun at my head and I’m going to be less understanding. Trust me on that.”\n","page 127":"Kelly’s last bit of arrogance is the last straw. You don’t say anything, you just shoot and Kelly’s brains splatter all over the driver’s window and partially on you. The thrill of killing her is short lived as her body does indeed cause the car to swerve out of control.\n\nYou attempts to regain control fail and you crash into an oncoming truck.\n","page 126":"Kelly’s right. Shooting her now wouldn’t be a good idea and you put away the gun. The pair of you remain silent for the rest of the trip home and eye each other warily.\n\nWhen you get home you get out of the car and grab your bag of money from the back seat without another word. Peter and his buddy Kevin are outside filming something irrelevant, but when they see you and Kelly their attention is turned.\n\n“Hey Suzy, whatcha got in the bag?” Kevin says while attempting to touch you. You’re in no mood for his antics and you swing the bag of cash into his head. He falls to the ground and you proceed to pistol whip the shit out of him.\n\n“Holy shit! This is great stuff!” Peter says pointing the camera at you.\n“Open your fucking mouth you little bitch!” you scream into Kevin’s ear. When he complies you start jamming the pistol into his mouth and scream even more at him. The scene you’re causing in public makes all the neighbors head inside. Even a couple of the Morningstar clan make haste for their compound.\n\n“DON’T YOU EVER FUCKING TOUCH ME AGAIN!” are your last demands to Kevin who is more than willing to capitulate to your threats. You then warn Peter that if he keeps stealing your clothes you’re shoving the gun up his ass and pulling the trigger. He backs off as well.\n\nKelly meanwhile is laughing at you abuse the pair of them.\n\n“See, told you it did you some good. Now try to channel that energy into something more useful. You got a bunch of money now to help you get started.” Kelly says before going into the house.\n\nAnd so you do. With the money you use it to get yourself an apartment and move out that lunatic asylum you used to call home. You also enroll into the local college and get a part time job there.\n\nIt’s a start of a brand new life for you and it isn’t exactly easy, but you’re better prepared to handle it now.\n\nAnd as much as you’re loathed to admit it, Kelly was right.\n","page 79":"Jesus fucking Christ, if you’re not even going to try to improve your position then what’s the goddamn point? Don’t you have even the slightest incentive to improve your miserable existence?\n","page 73":"Wise choice! Everyone knows 10,000 in Mexican currency is only $2.00 US currency!\nAfter waiting for a better deal you finally get an offer of $10,000 from some rich lesbian in Hawaii.\n\nJackpot!\n\nApparently she also wants to meet your Mom in person.\n\nYou know your Mom\u0027s been kinda lonely after Dad was killed in that \"elephant incident\" so you decide to set it up...\n\nAnd after months of workin\u0027, proddin\u0027, fixin\u0027, and schemin\u0027 on your part, your Mom is now a much happier person and so are you having a rich stepmom and all. Now you can go buy that bomb shelter you always wanted.\n","page 72":"You sell, send off the pics and receive your money\n\nUnfortunately you forgot to consider the foreign exchange rate!\n\n10,000 Mexican Pesos is only $2.00 in US Currency!\n\nWhile it’s very possible that your Mom won’t find out what you did, but there’s always the chance she will. And hell, for that amount of money you could\u0027ve sold naked pictures of yourself!\n","page 75":"Some gay porno magazine offers you a $2.00 for your naked pics. You accept the offer.\n\nUnfortunately it’s a MEXICAN gay porno magazine!\n\nYou get a fat nickle!\n\nWell you\u0027ve made a total of $2.05 from selling your Mom\u0027s self respect as well as your own. (Not that you had that much to begin with)\n\nYou try not to think too much of it and just hope you Mom never finds out, but as you find out later you should’ve worried about other things instead.\n\nYou and she unknowingly become a point of obsession by a deranged bisexual midget. He eventually gets to the point where his obsession can’t be restricted to just images and pictures.\n\nHe tracks you both down and somehow manages to ambush your Mom and knock her out cold. You hear the noise from the basement and come up to investigate, where upon the midget knocks you out as well.\n\nHe ties you both up and well; it sort of only gets worse from there…\n\nYour images are uploaded one last time through the sick freak’s illegal snuff site.\n","page 74":"Fortunately the Mexican guy is now trying to sell them for a bigger profit, 20,000...unfortunately its US currency. You’re fucked. You don’t have that sort of money.\n\nSo you do the only thing you can do. You steal your Mom\u0027s credit card and buy back the pictures.\n\nHowever there ARE consequences for your actions.\n\nFirst your Mom finds out about all of this the very next time she tried to use her card. (Which gets cut up)\nSecond she\u0027s wickedly pissed off that you even sold the pictures in the first place let alone the fact that you didn\u0027t get squat for them and then put her in SEVERE debt by buying them back.\nThird there are some questions about your erm... morality, not to mention your sanity. You basically STOLE her private property which makes you a thief, the fact that you knew the content of the pictures and looked at them, makes you a sicko, the fact that you sold them makes you a sleazeball, and the fact you lost money on the whole deal makes you an idiot!\n\nYour Mom has you committed to the asylum, where you spend the rest of your days, until you cause so much trouble you get lobotomized.\n","page 130":"You don’t have time for Moon Shadow’s hippy shit, you’re here to find Ben.\n\n“No, I’m pretty sure the only path I wanted to follow today was to find Ben.”\n“Very well, but as I said before I have no idea where he’s hidden the entrance this time. You’ll just have to find it yourself.” Moon Shadow tells you and then goes back to her meditation.\n\nYou begin wandering the backyard, looking at the ground in the hopes of finding something out of place, but you’re not having too much luck.\n\n“How the hell…gah, tis is pointless…huh?”\n“Aunt Suzy pretty!” you hear a familiar voice say.\n\nYou turn around and see Tommy!\n\n“Tommy! I thought you were with your dad. Your mom’s over there.”\n“Mommy sleeping.”\n“No she isn’t she’s med…” you look again over in Moon Shadow’s direction and she’s no longer meditating she’s on the grass sprawled out fast asleep.\n\n“Oh well, I guess she is asleep. So Tommy, as I said before I thought you were helping your dad.”\n“Busy. No want my help anymore.” Tommy says while looking down at the ground. At first you think he’s sad, but actually he’s just become fascinated with a bug on the ground.\n“Tommy where’s the entrance to the bunker?”\n“Dunno.”\n“You don’t know? How can you not know? You came up from the bunker!”\n“Oh yeah…me don’t know. Keeps changing location. You want to play?”\n\nThis little trip to find Ben has just gotten weirder by the minute. You’re really starting to wonder what the hell is going on. Though part of you just wants to give up and not bother with this nonsense.\n","page 132":"“Tommy, think carefully. WHERE is the entrance to the bunker?” you order which seems to make Tommy upset. He collapses on the ground and begins to cry.\n\n“WAHHHHHHH! I don’t like this game! No blue anymore! No more bad place!”\n“What the hell?”\n“Dig too deep! Too deep! Two trees! Scary things! (Sob)”\n\nIt’s a bit incoherent gibberish, but you begin to wonder if Tommy hasn’t given you the clue of where to find the shelter entrance. You look around and notice the blue colored flowers near the medium sized trees in your backyard and you start to wonder.\n\nYou leave Tommy to his retard seizure and head over to one of the trees and knock on it. Sounds solid, you knock on the other one and it makes a completely different sound.\n\n“Hah! Hollow!” you say and feel around for a door of some sort, eventually you find one and when you open it up a long ladder leading down is revealed. At the bottom you can see a faint bit of light and hear the hum of a generator.\n\nWhile you’re glad you found the entrance, you still don’t know how the hell he’s been supposedly changing the entrance. It really doesn’t seem possible, unless Moon Shadow and Tommy were initially lying to you.\n\nYou descend down the ladder. It takes awhile, but when you get to the bottom you find yourself in a fairly spartan room with a few dim lights and a generator. There’s only one corridor leading from the room so you follow it.\n\n“Ben? Are you down here? Don’t shoot if you are, it’s me Suzy!” you call out, walking down the corridor.\n\nYou pass many smaller room, most are empty. Some have things like canned food in them. You marvel at the fact that Ben was able to build something like this within a relatively short period of time. Amazing still that nobody really paid much attention to what he was doing or how he even got the materials down here.\n\nEventually you come to a spot where the bunker doesn’t have the wall siding and just dirt with wooden support beams are being used. You’re guessing that Ben’s only just started digging here. You also notice that the newly dug pathway is sloping downward and there isn’t any lighting in that direction. This was creepy before, but now it’s starting to approach the scary realm. You decide you don’t really want to go any further.\n\n“BEN?! Are you down there?”\n\nYour call is followed by silence for a moment, then you hear some shuffling, then heavy breathing. Whatever it is that’s approaching, it doesn’t sound like Ben and when a disgusting figure dripping with ichor steps into the dim light, you know damn well it isn’t Ben!\n\nPanic and fear overwhelm you, and you run screaming back to the ladder. The inhuman noises are only getting louder though. You completely freak out when you run into a figure that steps out from one of the side rooms. You’re temporarily blinded by the powerful light shining from where the figure’s head would be. The figure turns down the light and you can see that it’s Ben wearing light mounted helmet.\n\n“Suzy, what the fuck are you doing down here? Get out of the way!” Ben shouts and strides past you with a shotgun when he hears the noises behind you.\n\nYou crawl into the room he just came out of and hear him shout “DIE FUCKING MUTANT BASTARD!”, followed by a couple of gunshots a hideous cry and a loud thump.\n\nBen then returns to find you.\n\n“Suzy, you’re still here? You’ve should’ve kept running, it’s not safe down here.” Ben asks helping you up.\n“W…what’s going on down here?”\n“Oh nothing much except trying to clean out some sort of race of creatures. I dunno what the hell they are, but I call ‘em Chulocks. Y’know like a combination of a Morlock and a Chud heh heh.”\n\nYou have so many questions that you don’t know where to begin. Ben touches some sort of panel on the wall with his shotgun and a secret door slides open and motions you inside a nicely furnished room with a large arsenal, computer, books, bed and some food.\n\n“Don’t worry about the Chulocks, we’re safe in here, though I really need to install a security camera system down here. Just haven’t had time. I Look Suzy, I’m sure have a shitload of questions, and I’ll try to answer some of them, but you’ll have to leave soon. I have to start working on changing the layout of this place again, obviously it isn’t hidden enough if you found it. What were doing do here anyway?”\n“I…I was going to ask you for job advice.”\n“Job?” Ben starts to laugh. “I don’t think I’d have any good advice since I gave up that life long ago. You still living in the basement?”\n“Yeah.”\n“Hmm, you might want to think about moving or at least sleeping with a weapon.”\n“Why?”\n“Well as you can see living underground around here isn’t exactly the safest thing. Now I doubt if these things will be crawling into the basement anytime soon, but still it’s something to think about. Ironic that I built this place to be safe and it turns out to be almost as dangerous.”\n“Almost? Why the hell are you still living down here?”\n“You might as why as why am I still living in America. Because it’s my home and I’m not going to be run off by some underground mutants or ancient race, or whatever the hell those things are. Besides I got a theory they’re government made anyway. Probably some sort of experiment that went wrong, or maybe even unleashed on me purposely. It wouldn’t surprise me.”\n\nYou’re not sure if that is the case, but given that you saw one of these things, Ben’s conspiracy theories might not all be crazy.\n\n“How long have you been fighting these things?”\n“Quite awhile. I first ran into them about a year after I started digging this thing. Little did I know something else was digging UP. There were shitloads of them in the past. Nowadays not so much. I dunno if it’s because I’m killing them all off or they’re finally getting the idea of not to come around here. For awhile I thought I’d killed them all, and I even had Tommy come down here to help me sometimes, but as it turned out they weren’t all gone and I sent Tommy back up. He’s seen them, and is scared of them, but I know his attention span isn’t the greatest.”\n“So, wait does Moon Shadow know about this? Does anyone else?”\n“Moon Shadow, well if you’ve spoken with her, she’d probably try to make friends with the damn things. So no she doesn’t know. Everyone else in the family doesn’t know either. They’re all too wrapped up in their own dramas and wouldn’t believe me if I told them. Well Uncle Ed might, but he’s up to his own suspicious dealings and quite frankly I think a Chulock eating him wouldn’t necessarily be a bad thing. He’s just plain creepy.”\n\nThis all seems very surreal to you. All you did was want a little job advice to do something with your life and you got wrapped up in something much more.\n\nQuestion is now, are you going to actively do anything about what you learned?\n","page 131":"Moon Shadow seems pretty happy with life and she does even less than you, so maybe she’s on to something. You sit down with Moon Shadow who looks even happier than she did before.\n\n“So what is this path you speak of?”\n“If you meditate with me, you may find out. This will be so nice, Ben never meditates with me anymore and I’m afraid Tommy is a bit too hyperactive to sit still for it.”\n“So what do I do?”\n“Just sit across from me and cross your legs. Good, now stretch out your arms towards me so that we may hold hands. We shall hold hands the entire time so that we may feel our energies combining and let the positivity flow between us.”\n“Okay, now what?”\n“Now close your eyes and contemplate you life as it was, as it is and as it can be. See the universe, be the universe. Touch the universe…”\n\nWhile your eyes are closed you can definitely tell that Moon Shadow is maneuvering your hands towards her.\n\n“Feel the majestic mountains. Their peaks so perfect and beautiful. You could just want to bury yourself in between them…”\n“Uh…”\n“Feel the plains below, smooth and tight. No doubt due to a good diet…”\n“Hey…”\n“Now follow further south and AH! FEEL the field of everlasting glory!”\n“MOON SHADOW!” you say pulling your hands away.\n“What’s wrong I thought you wanted to meditate?” Moon Shadow says looking concerned.\n\n“That wasn’t meditation, that was you trying to shove my hand under your dress!”\n“Oh you’re right. I’m so sorry! I just…I’m just so lonely here and mostly everyone here is mean! I never see Ben anymore and I can’t even leave because it wouldn’t be right to take Tommy away from his dad. I feel so trapped! I guess when I saw you I thought…I oh, I dunno what I thought. (Sob)”\n\nYou sort of feel sorry for Moon Shadow, and you can sort of sympathize with her plight. You too feel a little trapped. While Moon Shadow might’ve been a little misguided in trying to make “friends” with you, you try to console her.\n\n“Look Moon Shadow, you seem very nice, but you really caught me by surprise there. I mean I’ve never been with anyone before so this is all a bit weird for me. Not to mention you ARE with my brother. How would that look?”\n“Oh, I don’t place restrictions on such things. Never have. I believe if you have feelings for someone you should share them. And as far as Ben is concerned, he’s so infatuated with his bunker he’d rather be raping the holes in mother Earth rather than entering mine.”\n“Hmm, well if you’re horny couldn’t you just go out and meet someone else for a few hours? I mean like you said Tommy’s under watch by Ben. They probably wouldn’t know you’re even gone.”\n“Suzy, you misunderstand. I’m not some whore that just gives it up to anyone. I need to feel a spiritual connection with them first. Such things take time, but I felt it with you which is why I reached out. Didn’t you feel it too?”\n“Well I felt something…” you say looking at your hands.\n“You say you’re still a virgin? That is an awful long time to be one and I can’t imagine why given how pretty you are. Don’t you ever get urges?”\n“Sure, that’s why there are vibrators though.”\n“Oh Suzy, you are lost! No machine can ever compare to the touch of a real life human being. The tenderness and warmth…don’t you wish to experience that?”\n","page 112":"You think and wish and concentrate and all that other shit like you’ve never done before!\n\nAnd congratu-fuckin’-lations, you just knocked yourself fuckin’ unconscious you wacky fucktard!\n\nYou’re not out for long though and when you come to, you hear a voice say to you…\n\n“Are you alright?”\n\nYou rub your eyes. Can it be? IT IS! IT FUCKIN’ IS! IT’S SHE-HULK! In all her green Amazonian glory!\n\nYou knew it! You knew if you worked for it hard enough, and wanted it bad enough, dreams really can come true!\n\nShe-Hulk looks at you smiling, and helps you up. She wants you, you KNOW it. You were meant to be together! And this your big chance to hit that sweet green pussy!\n\nYou briefly think about talking with her to get to know her a little better…\n\nTalk? What’s to talk about? You already know everything about her from the comics you read! No you gotta be a man of action! That’s what got her to come to life in the first place. You kiss She-Hulk.\n\nShe kisses you back! You were half expecting her to clean your clock, but with the way things are going it looks like she’s gonna be sucking you cock!\n\nThis fuckin’ rules!\n\nYou and She-Hulk express your mutual love for each other in a physical way. She does things to you that you haven’t even had wet dreams about! (And you’ve had a lot of them) What surprises you the most is that’s she’s a gentle lover, which makes this not only physical attraction, but an emotional and even spiritual one as well. You are truly in heaven…\n\nAt least until your Mom walks in on you!\n\n“WHAT THE HELL ARE YOU DOING?” she screams.\n\nYou suddenly realize you haven’t been fucking She-Hulk at all. You’ve been ramming your dick into your poster of her on the wall the entire time you crazy fucker! You’ve ruined your poster, you’ve ruined your wall, you’ve ruined your dick and you’ve ruined your life! (Okay so your life was already ruined to begin with, but I was on a roll)\n\nYou dumb motherfucker, all the wishing in the world ain’t gonna make that green mutant come to life! (And like she would want YOU even if she was real!)\n\nYour Mom has you committed (And who could blame her) You spend years in therapy trying to get over your obsession for She-Hulk, eventually your love goes away. It’s not easy, but the doctors manage to help you kick the green goddess by giving you other comics to read. In time you soon forget all about She-Hulk and don’t know what you ever saw in her, as you read your other comics.\n\nYou should’ve been focusing more on Wonder Woman!\nNow she’s REALLY hot!\n\nHey maybe if you wish REAL hard…\n","page 111":"You quickly snap to your senses. This She-Hulk fetish is just yet another way for you to avoid real women! You did that with anime, and now you’re doing it with this.\n\nPatricia helped you out and was kind and sweet to you when by all rights you should’ve been taken out to the woods and shot for being a useless waste of skin. You need a woman like that in your life.\n\nYou quickly stop jerking it to She-Hulk and call up your cousin Patricia.\n\n“Hello? Who is this?”\n“Hey Patricia, it’s me Brian! I want us to be together! I know I fucked up before, but it’s because I thought that obsessing over my underage cousin was unnatural! But now I’ve come to realize it wasn’t unnatural at all! It was perfectly normal! Shit, it was downright Biblical! I know you must’ve liked me on some level too, so how about it? Will you give us another chance…and uh…keep it a secret at least until you’re eighteen?”\n“Brian, this is Patricia’s mother, Evelyn.”\n\nOh fuck.\n\n“Uh…hi Aunt Evelyn. Wow, you sound just like Patricia…uh…um…”\n“Don’t even try to talk your way outta it Brian.”\n“Erm…uh…”\n“Stuttering isn’t much better. If it’ll clear your mind though, I’m not going to call the police on you. However, I can’t allow you to go out with Patricia.”\n“But…but I love her!”\n“Yeah, and I’m sure you would love for her to have your seven fingered, one eyed kids, but Patricia’s getting sent to a convent in the South Seas.”\n“What? Why?”\n“Why? Because me and her father are sick of her going off her meds and giving us fucking grief, that’s why! She’s a disobedient little whore, and we’ve had enough!”\n\nYou’re pretty floored by this revelation.\n\n“…but…well hey wait. Maybe you could marry her off to me, and I could keep an eye on her and show her love she desperately needs.”\n“YOU? Hah! And how’s that going to work out living in your mom’s basement? Christ I dunno how my sister even puts up with you. I would’ve sent you to a convent years ago. Besides, if we can’t control her, I doubt if you’d be able to. She’d have you so wrapped around her little finger you’d probably suck an AIDS ridden cock if she told you to. And while I’m sure it would still be the best thing that’s ever happened in your basement dwelling life, it ain’t happening. Goodbye.”\n\nWith that final telephone click, you fall to the floor in defeat. Your destiny is sealed and you return to the basement to wallow in 2-dimentional girls. Eventually you save up enough money to get a new computer and hooked up to the internet again and your relapse is complete. The only differences being that you still work at the comic shop and that you aren’t obsessed with anime anymore. (Though you still jack off to the occasional loli-con)\n\nA step up, I suppose but not much of one. The fact remains that you’re still a basement dwelling virgin and you remain one until you eventually die of a Twinkie overload which causes your artery clogged heart to explode.\n","page 116":"You’re not really sure of how much help you’re going to get from Ben given that he’s probably just as reclusive as you, probably more so.\n\nYou head to the backyard to look for him, but he’s nowhere to be found. You do see his girlfriend Moon Shadow meditating in the garden though. For being a filthy hippy she’s very pretty. In some ways you can see why Ben gave up his potentially lucrative job in the government for her. Though you don’t think Moon Shadow had it in mind that he’d become a paranoid survivalist nut that indulged in every conspiracy theory known under the sun.\n\nYou ask her where he is.\n\n“Hey Moon Shadow, sorry to bother you, but do you know where Ben is?”\n\nMoon Shadow stops her meditation to address you.\n\n“No worries Suzy. I am just happy to see you! You spend far too much time inside that dark basement hiding out from the world much like Ben does in his bunker. The both of you should embrace all the beauty it has to offer!”\n”Uh, sure. So do you know where Ben is?”\n“Sadly no. I haven’t seen him for a couple days, but I’m sure he’ll return to me soon. He always has!”\n“A couple days? Where did he go?”\n“Oh he’s working on his underground bunker as always. He really gets caught up in it; though I try to tell him that it’s completely unnecessary, but I understand his intentions to protect all of us are good. It is my hope that he will someday come to his senses and we will leave this place. The aura and karma here are…well very fucked up.”\n\nNever having been in Ben’s bunker you ask where it is.\n\n“Dunno, he hides it really well and keeps switching the entrance. In fact I haven’t ever been inside it; I’ve always slept up here beneath the majestic stars.”\n“Hmm, I think I’ve seen you and Tommy on the couch in the living room a few times.”\n“Well Tommy gets cold sometimes and he wants his mommy with him, would you have me deny that right?”\n“I suppose not. So where’s Tommy then?”\n“He’s been spending time with his father, so he’s also down in the bunker. It’s good for them to bond and it allows me to get back in touch with the cosmos.”\n\nAt this point you’re getting exasperated.\n\n“How the hell can Ben move the damn entrance around and hide it so well in just this backyard?” you ask.\n“I’m afraid I do not know the answer to your questions. You will have to ask him yourself. All I can tell you that if you truly wish to find him, you will do so, but I am wondering if you should not stay here and meditate with me so that you may calm yourself and perhaps find another path.”\n","page 115":"It’s probably not the best pick of all possible choices, but Kelly is the only one who has a real job and constantly working. Surely she’d be in the best position to help you, though even now you’re shuddering of what you might have to put up with to gain her help, even if she choices to do so.\n\nCautiously you head to her room where you find her resting on her bed with her eyes closed.\n\n“Go away Peter! I told you before you’re NOT doing a documentary on me!” Kelly says without looking up.\n“Uh, it’s not Peter, it’s me Suzy.”\n\nKelly instantly sits up to take notice of this revelation. She doesn’t make a move towards you, but it’s obvious she isn’t happy about you disturbing her. You haven’t been out of the basement for awhile, so you haven’t seen here lately, but Kelly is sporting some heavy duty scars and looking a little more muscular than when you last saw.\n\n“You? What the fuck do you want? Get out.” Kelly demands\n“But I just want to talk to you for a moment about something.”\n“You deaf or just fucking stupid? Bitch I said get out!”\n“But I wanted advice on how to get a job.”\n“(Snort) You want a job? Little Miss priss wants to get a job? I can’t believe I’m hearing this! Ha ha! Do you even have any skills? Shit, you’re still a virgin. You probably wouldn’t even make a good whore. Just go back to the basement and hide out from the real world. It’s what you’re best at.”\n\nYou pause for a moment before answering.\n\n“Why have you always so mean to me? I’ve never done anything to you.”\n“Oh no? You were Mom’s perfect little angel that did what she was told and never had to do anything more than that. Me? I got nothing, but shit from Mom, just because I wasn’t what her so called standard of womanhood was supposed to be. Yet I also had to do most of the work around here as well as look out for you to make sure someone didn’t rape your naïve ass. Your mere existence did something to me!”\n“Mom was just trying to instill guidelines for how we should behave. She was just looking out for us. What’s wrong with that?”\n“Yeah, yeah, and following her guidelines has really served you well eh? A complete fucking recluse that can’t function on her own.”\n","page 118":"It might be morbid curiosity that’s causing you to ask Uncle Ed. He obviously is getting money from somewhere, but you and everyone else can only guess how. It’s most likely illegal no doubt.\n\nAs you approach the door to the garage, you have a feeling of dread overcome you, but you press on anyway.\n\nUpon opening the door you see Ed’s van and various other things that would be in a garage. Everything looks normal. Of course you haven’t actually inspected the little apartment space that exists above the garage where Ed actually sleeps.\n\nYou make your way up the steps only to find Ed isn’t there. His place isn’t exactly as you imagined it. It’s clean! Everything is neatly packed away. In fact he appears to be the neatest person in the house.\n\nHis bed is neatly made and doesn’t appear to be slept in, which is odd since his van is here, unless he made it already and went out during the day without his van. Of course that would be out of character behavior for him as you know him to be a night owl.\n\nYou shrug your shoulders and decide to wait for him. Waiting for you though doesn’t include just sitting, you start to snoop around. Without thinking anything of it you open up his large freezer…\n\nInside are heads and other body parts. Frozen blood paints the inside of the freezer. You scream in shock and fall backwards.\n\n“So, now you know, what many in this family have probably already whispered about for years. Knew I shouldn’t have slept in the van last night.”\n\nYou turn your head and see Uncle Ed standing by the stairway. His clothing is caked with dried blood and he has a knife in hand.\n\n“Oh…uh…Uncle Ed…um…” you sputter, you’re too terrified to even scream out, though Ed gives you some quick instructions on that line of thinking.\n\n“Suzy, before you say anything else. Keep in mind that I kill pretty things like you on a regular basis. If you scream, I’ll do it again, family or not and that would be very regrettable. Besides I doubt if anyone would come running anyway.”\n\nEd’s threat is completely calm which makes it all the scarier. You just sit down and quietly watch him as he approaches.\n\n“What’re you going to do to me?” you ask trying not to think about his possible answers.\n“Do? Well…there’s a lot of things I WOULD do to you if you weren’t my niece. You’re just about everything I look for in a girl. Nice, pretty, young. You’re even a virgin aren’t you? Yeah you are. You know how appealing that is in this age of whores who are only suitable for rape and annihilation?” your uncle says licking his knife in front of your face before stepping back.\n\n“Oh yes, I WOULD have lots of fun with you. However you’re family, and I always had a lot of respect for my sister. God rest her soul. And from what I know of you, you’re about the only one who followed her value system, which means you respected her too. So you’re safe for now…but…”\n“But?”\n“Well, call me paranoid, but it would really be foolish of me to just let you go after knowing my secret now wouldn’t it?”\n“But you already said everyone in the family thinks you’re a serial killer anyway…”\n\nEd gets perturbed and holds his knife up.\n\n“Now stop right there. That’s the point. They THINK that. They don’t know for sure though, and I thought I was doing a good job of keeping them all away too. (Sigh) But I’m not really worried about you telling any of them, I’m more concerned with you going to the police after you leave here. Then I have to move, and then I’d have to come back and do something bad to you when you least expect it. So what could you do that could convince me?”\n“My word?”\n\nEd starts to laugh.\n\n“Ha ha ha ha! You’re serious? My you are a unique one. God I wish you weren’t family…but anyway no I’m afraid that won’t do. While I’m sure you may very well be telling the truth, your moralistic view point and conscience may get the better of you one day and then where would I be. No, I need something else from you. Something that will bond us in a more meaningful way.”\n\nYou start to panic and what he might be implying and you start to cover yourself with your arms and cross your legs. Again he laughs.\n\n“Oh no, not that my little Suzy. As much as I might like to, that’s just not something for me to place on the table. Besides it wouldn’t make me inclined to trust you anymore than I do now. Tell me Suzy, what do you know of the Morningstars?”\n“The Morningstars? You mean the family that lives in that compound up the street? Not much.”\n“Hmm, I thought as much. They are a strange lot, I’m surprised nobody has complained about them given their blatantly cultish ways.”\n”Well people on this block tend to keep to themselves.”\n“Hm, true. One reason why I like living here. It’s perfect really. But there’s really only room for one of us.”\n“What do you mean?”\n“Isn’t it obvious dear girl? The Morningstars ARE cultists. Not sure what they worship, but I know damn well in involves human sacrifice. I’ve kept an eye on them ever since I noticed a few of their number taking in young girls.” Ed says while starring at your body. “These girls are never seen again.”\n“Uh, how do you know all this?”\n“Because sometimes my work overlaps with theirs and I know my prey. And they’re encroaching on it. I don’t think they’re really aware of me yet, but I think they’ve been getting suspicious.”\n“Okay so what does all this have to do with me?”\n“Right, straight to the point. Well whether you want to be or not, our families are going to embark in a good old fashioned feud. And you’re going to be bait.”\n“What?”\n“You heard me. Now as far as I can tell the Patriarch of that family and his eldest son are in absolute control. I figure if you can help me take out those two, that family will fall into chaos and it will be a simple matter of picking off their more incompetent members at leisure.”\n“So what am I supposed to do exactly?”\n“Heh…yeah I guess you might very well be clueless in this sort of thing. Look Suzy, I know you’re a good girl…but within every good girl lies a filthy dirty whore. A whore that wants to be fucked and desecrated…”\n\nUncle Ed seems to be somewhere else for a moment, but he tries to quickly get back on track.\n\n“…uh anyway. YOU need to get in touch with the whore that is within you. You need to flirt, seduce and beguile those two in such a way that will allow me to get them. I really don’t think you’ll have that much of a problem though.”\n\nYou take a deep breath and realize you have little choice, but to agree at this point.\n\n“Okay. I’ll do it.”\n“Good girl. I knew I could count on you. I’ll be in contact with you soon.”\n“Alright, I…”\n\nUncle Ed grabs your arm as you try to leave.\n\n“Remember, we’re in this together now. Don’t do anything foolish. I really wouldn’t want to have to hurt you.”\n\nWith that final warning, he lets you go.\n\nCompletely unnerved and creeped out, you run back to the basement and pace the floor wondering what you should do next.\n","page 117":"Well Dad used to work a lot at one time, so much so that he was never around, most would say he still isn’t due to him being drunk all the time, and you’d pretty much agree.\n\nYou find Dad in the living room half passed out. You almost think to come back when he’s in a better state, but then you remember this is probably about as sober as he gets.\n\n“Hey Dad I need to ask you something.”\n\nDad looks at you in a drunken daze.\n“What tha hell? (Hic!) Whadda you want?”\n“Well uh…I just wanted some advice on how to get a job.”\n“Job? (Hic!) What for? Workin’ man’s a sucker. I worked and worked to support all you bastards and what did it get me? Nuthin! Just a dead wife and sorrow. None of you appreciated her the way I did!”\n“Hey, that’s not true. We all missed her. As I recall you weren’t even at the funeral.”\n“Because the pain was too great, that’s why! And what exactly are you (Hic!) implyin? That I didn’t love her? Cause I did! Hell, I loved her enough to produce you and your worthless sib (Hic!) lings!”\n“Uh…okay.” You say and start to back away.\n“HEY! Don’t you walk away while I’m talking to you!”\n\nAt this point your Dad manages to get up to lurch at you, but only succeeds in tripping over his feet and banging his head on the coffee table.\n\n“Argh! Shit. Fuck…(sob) Why? Why did you leave me? I was gonna…come back…just…just wasn’t enough time…(sob)…”\n\nYou Dad lies on the floor clutching his head and sobbing quietly. He is truly a pitiful sight.\n\nDad’s anger at you is probably misguided and while it’s true he wasn’t really there for you, it doesn’t mean you have to do the same. So you try to console him.\n\n“Erm…there there. I’m sure Mom knew how you felt even if you weren’t around to help raise five kids…”\n“(sniff) You think so?”\n“Sure, she often mentioned you a lot while you were gone.”\n“Oh really? What would she say?”\n\nYou try to think back to anything positive, but come up empty. You just say non-committal.\n\n“Oh…just stuff about wishing you were here…”\n“Y’know, Suzy I REALLY do wish I could’ve been here more. It’s just always thought I’d have time to spend all the time in the world with her after I retired. If I could just have that time back, I would do everything I wanted to do with her.”\n\nSensing that it might ease his pain you tell him stories about Mom. You try to just focus on the good times you spent with her, rather than all the arguing that usually went on with her and your more unruly siblings.\n\nThis seems to cheer him up. He’s also sobered up a little while listening to you.\n\n“You really did take after her the most didn’t you?” he states.\n“Um, yeah I suppose I did.” You reply.\n\nYour Dad begins to look around as if to make sure nobody else is around and then looks at you intently.\n\n“I have something of your mother’s. I think she’d want you to have. It’s in the bedroom, follow me.” He whispers and gets up.\n","page 88":"You decide it’s too much temptation so you don’t even suggest it. Meanwhile Jake continues to speak.\n\n“So what are you looking for today, if you gave up the Anime shit?”\n“Uh, nothing Jake. I don’t have any money.”\n“Well if you don’t have any money get the fuck outta my store, I can’t afford to have fuckers lingering around without Ron around anymore. He might’ve been a retard, but he scared away any potential shoplifters.”\n“Aw Jake, I’m not going to steal anything!”\n“Yeah well I’m making sure you don’t by throwing your broke ass out. Besides you’re on the wagon, you might do something desperate like grab a bunch of my comics and run out of the store.”\n\nIt’s useless to argue with Jake at this point so you leave continuing to feel depressed. Eventually you go back home go to sleep hoping that Mom will take mercy on you when she gets home.\n\nShe doesn’t.\n\nShe was quite serious about throwing you out and does just that. All you have are the clothes on your back and the comics that Patricia gave you.\n\nPatricia! That’s it! You’ll go live at her parent’s house! Then you can talk to her all the time!\n\nAt this point you’ve definitely cracked a little bit and have become hopefully delusional. You make your way over there fully believing that you’ll be accepted with open arms. Nevermind the fact that Patricia’s parents always thought you were a big ass loser even when you a kid. (They always thought your mom was a bitch too)\n\nWhen you get over there you bang on the door loudly. At first there is no answer and you hear some sounds of running around and the sounds of “Hold on! Hold on!” You think you even hear someone running out the back. Eventually the door opens up. It’s Patricia and she’s only wearing a skimpy little robe. Her hair also looks disheveled. You’re almost awestruck by her near nakedness if she wasn’t so obviously pissed off.\n\n“Brian what the hell are you doing here? I thought you were my Mom and Dad! You scared the shit out me! (Sigh) I was finally going to make a man outta my boyfriend today, thanks for interrupting us, fat ass!”\n“What?”\n“Do it! Have sex! FUCK! You scared off my boyfriend though when you were banging on the door.”\n“Well you still could go through with those plans...” You say lustfully.\n“Huh. You don’t know my boyfriend. It’ll be awhile before he calms down again, I practically had to make the first moves to begin with.”\n“I was talking about me.” you say attempting to reach for her robe.\n\n“Huh? What? EW! NO! Get away from me you perv!” Patricia screams and quickly slams the door in your face.\n\nYou completely lose it at this point and start banging on the door screaming.\n\n“Come on Patricia, I know you want this! And I NEED this!”\n\nYou go so far as to grabbing a nearby brick and throwing it through the window. Some of the neighbors hear the commotion and come out to investigate.\n\n“Hey you crazy fat fucker, what the hell’s going on!?”\n“I’m getting some pussy!” you cry out, as you clumsily climb through the broken window cutting yourself up in the process.\n\nYou climb inside and fall on the floor, with your hands bloody and your dick still hard. Dirty thoughts of Patricia getting ready to have sex with her boyfriend fill your mind. Those thoughts will be your last as Patricia has grabbed her daddy’s gun and when you look up a bullet goes through your eye.\n\nOn the plus side, you didn’t think about anime once during your last living moments.\n","page 87":"This is going to be very difficult, but you’d rather risk getting addicted again than being homeless.\n\n“I’ll take the job.”\n“Alright then, but let’s get something straight first. I’m going to be watching you CLOSE. While you say that you’ve kicked the anime habit, I remember when you were a little junkie, so I don’t want to find out if you’re stealing shit, because I will be kicking your fat ass if that’s ever the case.” Jake threatens.\n\nYou nod and agree meekishly where upon Jake tells you go start moving and unpacking boxes.\n\nThis is probably the first time you’ve actually had to do any “hard work” in your life. Moving the boxes is an effort for you and you have to rest several times. Jake yells and screams at you the entire time. You almost think he’s going to fire you that day, but he never does. You can only assume he’s really desperate for help and he must be considering he hired you.\n\nThe only good thing about all this, is that you’re too damn tired to even think about your anime addiction, but this is just the first day after all…\n\nWhen you get home, your mother is a little surprised to see you.\n\n“You’ve been out? I figured you were down in the basement.”\n“No, I got a job. You said you were going to kick me out if I didn’t.”\n“YOU DID?! How much does it pay?”\n“Not much, I work at the comic shop…”\n“Oh. Well I suppose it was too much to hope for that you’d actually be able to move out one day…(Sigh) Alright, I guess you made the effort, but don’t you think it’s a little idiotic to work at a place like that given your addiction?”\n“Probably.”\n\nYour mother just shakes her head.\n\n“Well you never were the brightest. However, considering that you’re making your own money now, you can use THAT to feed your addiction if it should flare up again. And you WILL be paying me back for all that shit you bought with my stolen credit card you asshole!” your Mom says while hitting you upside the head.\n\nYou head back down to your basement completely exhausted by today’s labor. You don’t even jack off, you just fall asleep. You MUST be tired!\n\nAs the days go by you go about your job, but you start to feel the temptation. Especially when a big shipment of Japanese DVDs, graphic novels and comics arrive.\n\nYou’re trying hard not to look too much at the Japanese shit. REALLY hard. In fact something else is starting to get hard and you’re starting to hear shit in the stock room.\n\n“Tee hee! Come on, open us up! We’ve never been touched yet!” a little girl voice says.\n“What the fuck?” you reply.\n“Yeah, come on Brian, what’s wrong? You used to like to deflower us and run your hands ALL over us. I remember how you used to spew all your delicious spunk on our 2-Dimensional faces! Mmmm! Come back to us! We’ll love being your little fuck slut in LOLI-WHORE SCHOOL! Tee hee!”\n“I was a different person, look I read different comics now. I need some variety.”\n“Hey man, I’m all for variety, you remember that time you bought that ORGY OF THE CYBERNETIC TENTACLE MUTANTS anime DVD? We’ve got it all! You should come back to us. It’s pointless to resist.” a more robotic voice says.\n“Shhhhh! Shut up about that! I was uh… just wondering what the appeal was! Look I’ve been reading some super hero stuff, and I’m starting to like that now, so…”\n“Bah! Super heroes! You actually like those muscle bound parodies of the masculine form? I remember when you appreciated a more subtle type of hero. One who was shy, soft spoken and had a large dose of ambiguous sexuality to them. Hey if you don’t like girls anymore, we got things to satisfy those urges too you know! Like SHOTA DICKGIRL ADVENTURES!” an effeminate male voice says.\n“GAH! Leave me alone!”\n“Well there’s always…”\n“Don’t say it!”\n\n“Come on, you can’t say you never thought about it…”\n“Don’t say it!”\n\n“Come on, it’s completely normal. They even did a CSI episode of it…”\n“Don’t you FUCKING say it!”\n\n“Furries.”\n“NOOOOOOOOOOOOOOO!”\n\nAt this point you run out of the stock room and the comic shop screaming your head off. You don’t stop running until you collapse from exhaustion which means you only get to the end of the block thanks to your poor physical condition.\n\nFortunately some kind soul helps you.\n\n“Hey Brian, are you okay?” Patricia asks.\n\nYour eyes flutter open and you look up to see an angel of perfection. Your eyes follow her exposed legs, at this angle you can see up her dress. White panties. The color of purity.\n\nShe’s so pure. She’s sooooo good. You take one look at her smiling face and you ejaculate in your skidmarked underwear, giving something else for your poor mom to clean.\n\n“Yeah, I’m okay…I just…I dunno. Some weird shit happened.”\n“It happens. Okay let’s help you up.”\n\nAs Patricia helps you up, you smell the scent of her hair…SMMMMMM AHH! It smells like heaven!\n\nYou just want to tell her how much you like her right now. You’re sure that IF you just had a girlfriend you could get over your addiction a lot quicker.\n\nFar be it from me to warn you about this course of action. But you’re doing it again.\n\nYou start sweating and breathing heavy. Patricia’s looking at you with concern.\n\n“Are you alright? You look a little flush.”\n“I just…I dunno…it addiction is really hard to break and I liked it when we used to speak and stuff. It kept my mind off things a lot better. You were so nice and understanding.”\n“Awww…look I didn’t know I had so much of an effect. I’ll tell you what, I’ll try to make some time for us to talk every once in awhile”\n\nWell fortunately for you, you weren’t quite brave enough to admit your inappropriate feelings directly and she takes what you say completely out of context.\n\n“So where were you heading?” she asks.\n“Oh…uh the comic shop. I work there now.”\n“You do? Well no wonder you nearly had a relapse silly!”\n“Yeah well Jake might fire me after this.”\n“Nah, I’ll talk to him. He’s always nice to me and gives me discounts. Let’s go.”\n\nThis probably doesn’t make things easier for you since this naivety just turns you on more. You have to fight the urge to pull it out and start wackin’ it as you stare at her ass the whole time you’re walking back to the comic shop.\n\nJake is about ready to yell at you, but when he sees Patricia he focuses on her instead. You quietly go back and move boxes, getting to keep your job. Once again Patricia has helped you out. This girl MUST be yours! She’s everything you could ever want in a girl. She’s perfection.\n\nTime passes and you continue to work at the comic shop and spend time with Patricia when you can. It’s good for you. You get exercise and get to spend time with a pretty girl… who just happens to be your underage cousin.\n\nPatricia also encourages you to read more American comics which you start doing on a regular basis. Of course now this means you’ve got a little more to talk about with Patricia and your feelings for her are getting to a point where it’s getting harder to not hide.\n","page 119":"Well it’s always been there for you before; it might as well be there for you again.\n\nYou go online and start looking up a local job site. Naturally there doesn’t seem to be anything you want to do, let alone be qualified for.\n\nAfter your half-assed attempt at “looking” for a job, your attention begins to wander and you start surfing the internet like you always do. Soon you get an instant message from Julie. She hasn’t sent one in a long time; she must either have something serious to talk about or…\n\nParteegurl69: HAY SUZEE!1! PARTY TONITE! GET OUTTA DAT BASEMENT AND GET LAID FOR ONCE IN YOUR LIF! LOL1!!!111!\n\nThat.\n\nMaiden4ever: Hi Julie.\nParteegurl69: HAY SO LIEK R U CUMMING TO MY PARTY? LOTZ O GUYZ WILL BE THERE!\nMaiden4ever: You party all the time and there are always a lot of guys at your place, what makes this one so different?\nParteegurl69: CUZ! UR GONNA BE THERE THIS TIME! SIRISLY U NEED TO CUM. I NEED TO TALK TO YOU BOUT SOMETHING 2.\nMaiden4ever: Why don’t you just tell me you think you’re pregnant again right now?\nParteegurl69: LOL. NO IZ NOT THAT. I NEED TO SEE U IN PERSON ITS SUMTHIN I GOT TO TELL U FACE 2 FACE. BUT I ALSO WANT U TO HAVE SUM FUN 2 4 ONCE.\nMaiden69: You can’t tell me online?\nParteegurl69: NO I GOT TO TELL U IN PERSON. PLZ CUM!11!!!1\n\nNormally you’re not the type to go to parties, let alone the glorified orgies she calls parties, but if she really does have something to tell you in person it has to be important. She’s never been known to exaggerate in times like this. Though you wonder if it’s really all that serious considering that she’s still having a party tonight.\n\nMaiden4ever: Alright Julie I’ll try to be there, but if I do get there, I’ll only be there to talk to you. I’m not staying.\nParteegurl69: UR CUMMIN KEWL! C U TONIGHT AT 6!\n\nJulie logs off and you continue to browse the internet for hours like you were doing. Eventually you hear a faint knock on the door and whispering.\n\nYou quickly open the door and see Peter and his friend Kevin standing there.\n\n“Oh hi Suzy, we were just wondering if you’d like to have the honor in being in my movie.”\n“Bullshit. You were seeing if I was in here or not to steal more of my clothes! I told you to stop that!”\n“I wasn’t! I seriously wanted to know if you’d be interested in taking part in the movie.”\n“Peter, you’ve been making this so called movie for like two years now, what the hell is it even about? I mean the only thing I’ve seen you do is walk around the house filming insignificant stuff. I mean have you even posted any of your crap on YouTube at least to see if ANYONE would even be interested?”\n“YouTube? Pshaw! I AM a film maker! Not some fly by night hack! I’m creating a vision! My movie is going to be about life! It’ll be the best art house movie ever! So, you should be grateful that I’m allowing you the chance to be in this thing at all!”\n“Gee, I’m so flattered. Anyway don’t you already have a ton of footage of me already? I mean your pervo junkie friend is always aiming the camera at me when I’m around. Just like now.” You say pointing at Kevin who is shamelessly pointing the camera at your crotch.\n\n“No, Suzy. That footage is mostly unusable will be edited. I need real scene with you. So how about it? I promise I’ll stop borrowing your clothes and I’ll give you five percent of the profits this movie will make along with credit! And trust me when this thing becomes well known you’ll thank me that I gave you this generous offer!”\n“(Sigh) How long is this going to take?”\n“It may very well go into the night! So if you want in, I suggest you clear your schedule. Hah, look at who I’m talking to, you don’t have a life, so what else have you got to do?”\n\nPeter’s obnoxiousness aside, you almost don’t mind doing this if it’ll get him to stop stealing your clothes. You also aren’t completely gung-ho about going to Julie’s party either.\n","page 80":"After years of watching anime and being dangerously close to either becoming a pedophile or a furry, (Or possibly a furry pedophile) you finally make a worthwhile decision. You grab your new anime DVDs and break them all! You then grab all your old ones and break them too!\n\nManga books all fucking burned! Comics too! Video games with anime graphics destroyed! You even break your computer just so you can’t be tempted by the internet! You’ve just destroyed your “social life” by doing that, but it’s worth it!\n\nNO MORE FUCKING ANIME!\n\nHoly shit you feel free! Seriously this is the first day of your new life and you’ve just made a break through here.\n\nBut don’t get too puffed up there fatty. The fact still remains that you’re a basement dwelling loser. You’re also going to experience withdrawals and the temptation to go back to anime will be there.\n\nBest thing you can do right now is confine yourself to the house for awhile. Now…I know that might seem odd given that you practically stay inside for days on end anyway, but your trips to the comic shops might provide too much temptation.\n\nAnd so begins the long road to recovery…\n\nDays pass into weeks and you got the jitters like a fucking crackhead. You spend a lot of time pacing and staring at the walls in your room. You try to find ways to keep yourself occupied.\n\nYou try to watch TV, but you have to struggle to not click on the Cartoon Network. Eventually you beg your mom to put a block on it. She’s willing to help you out in the hopes that you might actually move out of her house one day.\n\nReading books doesn’t seem to help either. Your attention span has practically been destroyed from “blipvert” anime action. You even can’t concentrate on the shortest story, let alone a novel.\n\nYou feel like you’re going mad.\n","page 82":"You leave the house in the hopes of managing to avoid temptation from the TV, but maybe due to all your long extended stays inside the basement, you forgot what the outside world was actually like. It’s not a nice place.\n\nA couple of the local thugs see you and figure it would be a good idea to harass you. Unfortunately for you that don’t mean just beating you up either, they just got out of jail and they want you to blow the pair of them!\n\nNot wishing to do this you attempt to use your persuasion skills to convince them that this path of violence and sexual assault is wrong. But how?\n\nIt’s been awhile, but you remember some passages from the Bible from when you were little, and begin quoting scripture to them. It has an effect. But these are the words of God. How could they not effect?\n\nThe pair of them stops threatening you and want to hear more. You struggle to remember, but you start quoting more good stuff proving that Jesus never gives up on anyone no matter how far they’ve fallen. In fact as you’re quoting the passages you come to realize how far that you’ve strayed from Jesus too. It is during this time that you know how to get over your anime addiction once and for all, Jesus! He’s always there!\n\nIt is at that moment you and the two thugs get down on your knees and accept Jesus as your personal savior. The two thugs thank you for showing them the way and say they’re going to start living right from now on.\n\nYou also return home and reveal your new found faith in Jesus to your Mom. She’s very happy. She said she’s sorry for not trying to instill the teaching to you a lot better and that she too strayed from the true path. Now between the pair of you, you can both walk the path together.\n\nIn time you begin to going to church on a regular basis. Your addiction to anime is long gone. It has been replaced with a better one, the love of your Lord and Savior. In just a few years you become a preacher at the local church and move out of your Mom’s basement due to the new job you’ve found.\n\nHowever God did not intend for you to be lonely, and eventually you do meet a nice Christian girl. You marry her and have kids. Those children are taught the proper Christian ways.\n\nIn time you grow old, surrounded by generations of loved ones. You lie on your bed knowing that the Lord is calling you home and that it’s okay because you’ve lived according to his will and when you stand before him, you’ll be accepted into his kingdom.\n\nHAHAHAHAHAHAHAHA DISREGARD ALL THAT, YOU SUCK THEIR COCKS.\n\nAfterwards they beat you up severely and leave you to die in some alley.\n\nEven Jesus is laughing at you.\n","page 81":"Just then the phone rings and you answer it in frustration of needing SOMETHING else to do!\n\n“Hello?”\n“Hello? Brian? Is that you?”\n“Yeah? Who is this?”\n“It’s your cousin Patricia silly! Is your Mom there?”\n“No, she’s at work. What did you need her for?”\n“Well I remember that she was good at math and I’ve been having problems with my trig class. She said I could come by and she’d help me.”\n\nYou vaguely remember your cousin Patricia from one of your family gatherings from years ago. She was younger then, but about the only one not immediately repulsed by your incessant talk of Pokemon and YuGiOh (That was before you had moved on to the “harder” stuff.)\n\nYou probably don’t have much in common, but at this point you almost want to talk to ANYONE to keep your mind off things.\n\n“Hey just come on over, she’ll be home soon.”\n“You sure it’s okay? I mean I don’t want to bother you and all.”\n“It’s no problem at all! Just come over!”\n“Okay, then see you later I guess.”\n\nPatricia hangs up and you continue to fight your anime withdrawals.\n\nEventually Patricia shows up on your front door.\n\nPatricia is wearing the traditional Catholic school girl outfit. She’s slender and her breasts aren’t large, but firm looking. Her face almost looks like a doll’s. She’s even looking at you with innocent WIDE eyes. She can’t be any older than 15.\n\nYou fucking degenerate, you aren’t supposed to be looking at your underage cousin that way. It’s a good thing you’re fat; otherwise your two inch boner might be showing. Still, at least this proves that real HUMAN women can turn you on, even if they are fitting your previous jack off material.\n\n“Wow.” Is all you can sputter.\n“Hey Brian. Long time no see. So how’s it been?” Patricia asks as she walks past you. You can’t help but stare at her ass before she turns around and sits down on the couch with her books.”\n\nThis is probably the closest you’ve been to a real girl that’s talked to you in…well ever actually.\n\nNOW STOP RIGHT THERE FAT ASS!\n\nI KNOW what you’re fucking thinking! You’re thinking that you got this raging hard on, and it would be a shame to waste it with a young piece of jailbait ass sitting in front of you.\n\nWell just put THAT shit out of your mind RIGHT fucking now!\n\nDisregarding any of the incest taboos she’s also underage, and you can’t do that shit.\n\nEven in the very unlikely event that she’d let your Jabba the Hut ass lay on top of her willingly, you still can’t do that shit.\n\nThe best you can do is excuse yourself and jack off in the basement. And that still makes you a perv, but at least you aren’t doing anything illegal.\n\nNow then, is that what you’re going to do? Or can you actually talk with the girl and not try to hump her like a dog in heat?\n","page 84":"Pretty brave of you, let’s see if it works.\n\nYou sit far away from her and answer her, while trying not to stare too hard.\n\n“Oh, well I’m sorta doing okay I guess…”\n“You seem troubled, what’s wrong?”\n“Nothing really, I’m just trying to…(sigh) I’ll be honest. I’ve been severely addicted to anime for years and I’ve just now started to go cold turkey and it’s been harder than I thought.”\n\nThis confessional is about the only thing you could think of to talk about that wouldn’t cause her to call the cops on you. And that’s still a possibility. Stay the course fatty, stay the fucking course!\n\n“Wow, that’s pretty commendable of you. I remember that you were all into that anime stuff the last time we had a family gathering. Even though I was young even I thought you were a bit obsessed with it.”\n“Yeah I dunno how I’m going to make it…” you say trying to fight the urge to say anything inappropriate.\n“Maybe you should try this.” Patricia says and opens up her bookbag. She throws a comic book at you. It’s one of those superhero ones. AMERICAN superheroes! Like superman and such. You’re taken off guard and forget about your unnatural feelings for a moment.\n\n“Superman?”\n“Yeah, maybe if you read some other comics it will help ease your transition. The only thing is, you could get addicted to those, so be careful.”\n“Y’know, this could work. I never really was interested in these types before, so I probably won’t get too attached.”\n“And unlike the anime shit, you got more of a variety meaning you’re less likely to get obsessed with one thing. I mean the characters are at least different from each other in looks and stuff.”\n“This is a great idea! I just wish I had some money to go down to the comic shop and try this out!”\n“Here, take these. I never bother rereading them.” Patricia says handing you a bunch of superhero comics.\n“Alright! Thanks!” you say and run down to the basement.\n\nIt’s funny, but the fact that Patricia was into comics didn’t make you more aroused like it would most loser geeks. It might be due to the fact that you were so thankful that someone was not only willing to talk to you, but help you that caused you to no longer look at her with nearly overwhelming lust.\n\nOkay, so after you read them, you DO spend an inordinate amount of time rubbing the comics on yourself and enjoying her “scent” and think about her while you jack off a little bit. But you still feel a little better, like the obsession has lessened a little.\n\nPatricia comes over several more times as your Mom tutors her and she brings you more comics. You appreciate it, but eventually she doesn’t need anymore tutoring and you miss her and the comics especially since the comics were working.\n\nYou get depressed and mope around the house, but your Mom is quite tired of you in general at this point.\n\n“Look, I know you’re trying to beat your fucking addiction, but you’re taking too fucking long about it! If you’re going to insist on being a man-child that lives in my goddamn basement forever, the least you can do is go and get a fucking job! In fact you ARE going to get one, or I’m kicking your fat ass out!”\n\nSince you don’t have much of a choice, you leave the house for the first time in a long time. The sunlight burns your pasty skin and eyes, but you waddle down the street in your quest to find a job.\n\nThe problem is, you don’t even know where to look, so you just end up going to the comic shop to read them without paying.\n\nJake the comic shop owner sees you enter and is really surprised.\n\n“Brian is that you? Shit man, thought you might’ve died of a heart attack or gotten arrested for having child porn on your computer har har har har! Where have you been? You’ve missed several issues of your favorite Japanese shit.”\n“Yeah, well that’s why I haven’t been here, I destroyed my entire collection. I’ve quit it cold turkey, but it hasn’t been easy.”\n“Shit, that’s almost hard to believe, but then again you never were one to miss an issue before, so I guess you’re telling the truth. But what brings you back here?”\n“I dunno, my mom told me to look for a job or she’s going to kick me out. I dunno what I’m going to do.”\n“Well, you could work here, I need someone to lug around the comic boxes. I’m going to be doing some rearranging.”\n“What? Are you serious, I thought Ron did that.”\n“Ron’s fuckin’ dead. Found the asshole dead with a broken neck in my fucking bathroom! He was looking at one of those sex comics and the dumb ass decided to try autoerotic asphyxiation. I swear that’s the last time I hire a retard.”\n\nThis could be an opportunity to save yourself from being homeless, or it could be a relapse back into your former addiction. Remember, you’d be working right at the source.\n","page 83":"Ah well, I suppose it WAS too much stimulation for you.\n\n“Uh…excuse me Patricia I have stuff to do in the basement, you just wait up here.”\n“Oh, alright then.”\n\nYou immediately run down into your basement and can’t take your pants off quick enough to jack off to her image.\n\nThe first few times you just think of the traditional missionary position and blow job images. Then you move on to fucking her in the ass. Eventually you return to your “Anime roots” and start imagining yourself growing tentacles and simultaneously fucking her in all three holes and filling them with cum and then shitting on her face through your mouth.\n\nI suppose this sick scenario would be inventive, if you hadn’t stolen it from those Wacky Japanese.\n\nAnyway by the time your mom has come home, helped Patricia, talked with her, sent her home and then went to bed herself, you’ve jacked off at least into the double digits. It’s actually amazing that you didn’t give your fat ass a heart attack.\n\nYou are incredibly tired though and you fall asleep in your incredibly sticky bed.\n\nThe next day, you still have images of your cousin running through your mind. This probably wouldn’t be anymore than a lingering sick fantasy, but the problem is that your cousin is coming over again. Apparently she needs more help from your Mom.\n\nShe comes over and your urges are stronger than ever. You barely manage to make it to the basement that time.\n\nShe comes over a third time and is starting to notice your increasingly odd behavior, but by then it’s too late for her. You can contain your unnatural lust any longer.\n\nWhen she’s sitting on the couch waiting for your mom with her books you don’t bother going into the basement this time.\n\n“So uh…don’t you have something to do in the basement?”\n“Nah, I’d rather just sit and look…I mean talk to you…”\n“Okaaaaaaay…hey look maybe I’ll just come back later…”\n“No wait! I want you to stay and we can play!”\n“Eeeek! What’re you doing?!”\n\nAt this point you lunge at your cousin and nearly crush the poor girl with your weight. You begin gyrating against her and trying to pull your pants down while lifting her skirt up.\n\n“Mmmm yeah…you smell good…so fresh and innocent…I just wish you were twelve.”\n“NO! Get off me you fucking fat ass pedo!” she screams and manages to smash your head in with a nearby lamp, before sliding from underneath you and screaming rape in the streets.\n\nYou’d probably go to jail and get ass raped multiple times for this, but the lamp to the head put you in a coma. Your mom is content on just taking you off of life support and letting you die, but the state insists that you must pay for your crimes and therefore must be kept alive until you come out of the coma where upon you can stand trial.\n\nThe joke’s on them though, you remain a vegetable!\n","page 121":"Antagonizing her isn’t going to help you and you did come to her for advice so you maintain your calm demeanor. You just hope it doesn’t result in some sort of physical abuse.\n\n“Kelly I’m just asking you for help since I acknowledge the fact that you have looked out for me in the past. Obviously you’re right, Mom’s guidelines didn’t work out for me since you’re so strong and independent and I’m not.”\n\nKelly’s eyebrows raise and you almost think she’s going to smile. She doesn’t, but at least she doesn’t seem to be as agitated anymore either.\n\n“Well maybe you HAVE seen the light at last. Took you long enough. (Sigh) Alright I’ll help you out, but you have to do what I say exactly because I know what’s best. Are you willing to do that?”\n“Okay.”\n“Alright then, let’s go.” Kelly says as you both begin to walk and talk.\n“Where are we going?”\n“You said you wanted a job, well I’m going to get you one where I work.”\n“The roller rink?”\n“There? No, I doubt if you’d last five seconds being a roller girl. I was talking about the other job I have down in the warehouse district.”\n“Um…there? But that’s illegal and I don’t think I’d be able to fight any better there either.”\n“Not to fight you airhead. To be a ring girl.”\n“A ring girl? I don’t think I’m pretty enough.”\n“You always were lacking in confidence. Trust me considering the skeezers I’ve seen hanging out down there as so called eye candy, you’re already ahead of the pack. Besides, the audience is filled with a bunch of drunk testosterone laden idiots, you’ll do just fine.”\n\nWhen you get to Kelly’s car, you start to panic.\n\n“I dunno if I can do this. Displaying my body for pay. It seems so wrong.”\n“Oh fuck Suzy, I thought you were trying to change you pathetic status in life! And if you’re serious about doing that, you’re going to have to get a little dirty. I dunno what you’re worried about anyway; I’m going to be there to save your timid ass if things get out of hand as always. Now are you coming or have I been wasting my fucking time?”\n\nMeekishly you enter the car and the pair of you drive off.\n\nYou’re already nervous about this and when Kelly starts driving in progressively more run down areas, you begin to feel even more so. You attempt to make conversation to keep your mind off things.\n\n“So uh what exactly goes on in these things?”\n“Well it’s pretty simple. There’s a crowd of degenerate gamblers around a ring. Two people enter the ring. They proceed to beat the fuck out of each other until one of them can no longer proceed. People collect their money. The end. It’s just like ultimate fighting except there aren’t as many professionally skilled people and there aren’t as many stupid rules that get in the way.”\n“I didn’t think there were that many women in this sort of thing.”\n“There aren’t. I’m fighting guys most of the time, though one of the few rules they adhere to is a weight class system. So it’s not like I’m going against a fucking muscle-bound steroid junkie most of the time. After all it is supposed to be a good show too and they want the matches to at least be somewhat evened out. I’m pretty much accepted now there though. I’m kicked enough balls that they know I’m not one to be fucked with and can handle myself.”\n\nYou hesitate to ask, but you can’t help yourself.\n\n“Do you take steroids?”\n“Ha ha ha ha! You sounded like Mom, which I guess isn’t surprising. Well since we’re getting all sisterly and all I might as well tell you. Yeah, I used to take them, but I stopped since I decided that I’d like to at least remain female even if I wasn’t some beauty. I’m probably addicted to pain killers though. Oh well shit happens right?”\n“I guess.”\n\nSoon Kelly pulls up to an abandoned warehouse. Its pretty deserted now, but you’re guessing later on tonight it won’t be. A couple of dubious individuals peep their heads out\n\n“Here we are, let me do all the talking.”\n“What do I do?”\n“Just stand there and look pretty as usual.”\n\nAs you follow Kelly into the warehouse the two men who you saw earlier stand armed as another fatter man comes to greet you both.\n\n“Ah Killer Kelly always a pleasure. You’re here very early. I hope you haven’t come to convince me that you deserved more money for that last match because I thought we had settled that, disagreement.”\n“No Steve, that’s settled, I’m here about something else. Namely my sister here.”\n“Oh?” Steve says as he eyes you up and down lustfully, making you very uncomfortable.\n“She wants a job and I figured you could help me out, us being friends and all.”\n“Why of course! But surely this pretty little thing is no fighter is she?”\n“No, but I know you’re always looking for more ring girls, and well obviously since your tongue is hanging out you believe she qualifies.”\n“Oh yes, she qualifies, but let’s go to my office and discuss this in more detail.”\n\nAll five of you head towards the office and every instinct in your body is telling you to get out, but then you remember your sister telling you that she’ll be looking out for you. She’s always been mean, but she’s never lied to you.\n\nThe office isn’t anything unusual and Steve continues talking with Kelly the whole time, until he sits down and begins to address you directly.\n\n“So you willing to walk around a ring holding a card for a few minutes while drunks gawk and scream at you?”\n“I guess so.”\n“You willing to dress in a skimpy outfit that shows off those tits and that ass you’ve got covered?”\n“Uh…yeah.”\n“You willing to suck my cock?”\n“What?”\n“I said are you willing to suck my cock darling? Your sister did mention that as a pre-requisite didn’t she?”\n\nYou look at Kelly in horror.\n\n“Heh, well by that expression, I can see she didn’t.”\n“Kelly! You mean you blew this guy to get this job?”\n“Hah! I wouldn’t let Kelly near my dick! She’s a dyke anyway. No only ring girls get this special privilege. So let’s get to it.”\n\nSteve starts to unzip his pants while his two goons just smirk. Kelly’s expression hasn’t changed. She looks as serious as ever.\n\n“Kelly, I don’t think I can do this…” you say.\n“Oh fuck Suzy what’s the fucking problem? So you suck a little dick to get a job, it’s not the end of the goddamn world! I told you before; you’re going to have to get a little dirty if you want to function in the real world! DO NOT make me look like a fucking asshole right now by backing out!”\n\nYou feel so scared, outnumbered and overwhelmed right now.\n","page 120":"You’ve had enough of your older sister’s abuse, you’re going to stand up to her.\n\n“Yeah well at least I’m not some ‘roid dyke still whining about how Mom never approved of them.”\n\nFor a brief moment your sister can’t believe that you’ve actually stood up to her. Perhaps if you’d done that in the past she might’ve respected you more. However, now she just sees it as a threat to her position and one that needs to be squashed before you get even more uppity.\n\nKelly springs from the bed and grabs your arm before you can run out her room. When you attempt to fight back, it only makes her angrier. Her next step is to break it in three places and drop kick you in the face. She then takes your battered body, gets on the bed, jumps off it and pile drives you into the floor, breaking your neck instantly. At this point you’re already dead, but your sister proceeds to torment your corpse with physical abuse for about fifteen more minutes until she finally realizes she’s killed you.\n","page 6":"The car! You gotta get the car! As much as you don’t fit in to society, you still have urges, and even you think that having a real life girl would be better than wackin’ it every once in awhile You figure you might get a girlfriend if you get a car. After all chicks like cars right?\n\nNot so fast there, asbestos boy. You gotta buy it first and a few other people seem to have the same “great idea” you have.\nEventually the bidding war is won by you, for an even $5000. There goes all the money you have in the world.\n\nYou’re probably going to have to sell your prized Harlequin Baby Art Collection to make that money back, but who can put a price on the endless supply of pussy you’ll be getting from this cool car?\n\nEventually the car arrives outside your house along with keys and an instruction booklet on your doorstep saying “READ ME FIRST!” on the front cover.\n\nGuess they really want you to read the instructions first.\n","page 19":"You clear your mind, and ignore the common sense part of your brain that states you don’t have enough money to do that…sonofabitch it works! You buy the bomb shelter which magically appears right outside your house. It suddenly occurs to you though, that you have a VERY powerful gift…\n\nYou begin to clear your mind of every law (natural and man made) you’ve ever been taught. You are able to do amazing things! You can walk over a cliff and not fall, since you don’t “know” about gravity! You can breathe underwater, since you don’t “know” about oxygen! You begin to create things out of thin air, with just the will of your mind! You start to change the world and people marvel at your abilities and you become as a GOD, and it’s all thanks to ignorance!\n\nUntil one day someone says, “Hey you can’t do that.” And it suddenly occurs to you that you can’t, and that’s when it ALL comes crashing down.\n\nFortunately you had a bomb shelter to hide in during the apocalypse that happened soon afterwards. With the world destroyed you have a lot of time to think about what you did. You decide to try to make things right, starting with clearing your mind again in an attempt to “recreate” the world. It doesn’t work though. You spend the rest of your days eating spam in your bomb shelter.\n","page 5":"It literally pains you to part with anything being the fuckin’ obsessed pack rat you are, but you need to start earning your keep again. The problem is you’ll only part with a few things and those things are shit that nobody wants!\n\nYou can\u0027t believe that nobody would want things like S\u0026M Elmo or Trailer Trash Barbie! And you can\u0027t even wrap your mind around the fact that people don\u0027t want your used toothpick collection from around the world!\n\nWell it looks like the demand is currently for “Big Objects” and the only two big objects you have that you’re willing to part with are your full set elephant bones and your Kudzu plant.\n\nOf course there’s always a demand for porn, but you’re sort of attached to your collection of that stuff.\n","page 18":"You beg Mom for money, but she’s in no mood to listen to you. In fact she’s pretty pissed off at you even thinking that she’d go for this idea.\n\nYou REALLY want that bomb shelter though. You NEED it. You know the END is coming soon, so you decide to do something desperate.\n","page 144":"While maybe it’s not what you think, but your heightened suspicion based on reading countless incest stories on the internet, his odd behavior, loneliness and depression and the fact he said you took after your Mom…needless to say it’s understandable that you think something really wrong is going to happen.\n\n“Yeah…Hey Dad I just remembered I have to go get something. I’ll be back.”\n\nYour Dad doesn’t even reply he just stands there looking a little bewildered. You briskly head back to the basement and hope he doesn’t try to follow you. He doesn’t. In fact when you creep back upstairs a couple days later he’s passed out on the couch as usual. It would seem his attention turned back to booze which is perhaps where it should stay.\n\nWith this little example in mind, you come to the conclusion that changing things the way they are isn’t such a good idea and you rarely leave the basement ever again.\n","page 8":"You decide to get the island. Its only $50! Someone attempts to buy it for $100, but you outbid them to a whopping $150. You begin to daydream about what’ll happen if you actually win the bid. You think about all the bad B-movies that take place on islands and how directors are always looking to use cheaper sets. You could rent it out for that, or possibly a cheap “island getaway” substitute for people that don’t want to spend that much on a vacation. You’ll have to check it out. It suddenly occurs to you that maybe people are already living on the island. Hey maybe the island will already have those topless island babes that you’ve seen in your “nature” magazine under your bed!\n\nYou snap out of your day dream only to realize that you’ve won the bid! You clap you hands and dance around in celebration like a monkey on crack.\n\nEventually you receive the exact location and make arrangements to go to the island. After a short trip to the ocean and a boat trip you are now on YOUR island. Time to explore!\n","page 147":"Snatching a candle nearby you throw it at him and miss spectacularly. You do however succeed in setting some nearby clothes on fire.\n\n“Bertha you will be mine again!” your Dad yells and lunges, pinning you to the floor. “Quick take her body! Enter her! ENTER!”\n\nWhile Dad is screaming his delusional statements, the fire in the room begins to spread.\n\n“Dad, get off of me, we’re both going to die!” you plead, but it’s no use. He’s still insisting on holding you down so that your mother’s “spirit” will enter inside you.\n\nThat doesn’t happen of course, what does happen instead is the pair of you burning to death in the fire.\n","page 7":"Erm, it’s like $500,000. You can’t buy it, because you’re too damn poor. Even if you sold all your stuff you still wouldn’t have enough. Your Mom might have it, but you’d have to beg for it and your Mom’s usually not pleased with you at the best of times.\n","page 146":"You follow your Dad to the bedroom. When you walk inside it’s a little unnerving. There’s no lighting except candlelight.\n\nCandles are lit up near a dresser with a mirror and all over the walls are pictures of Mom.\n\nYou Dad goes to the dresser and pulls out a fancy looking ring. It’s the one your Mom wore, you remember unashamedly arguing over who should get it, when she died. It is a very nice ring, but you certainly weren’t going to dishonor Mom by ripping it from her corpse. Ultimately your Dad hung on to it, just like he did with most of Mom’s old belongings.\n\n“Here Suzy, I’ve held on to my pain long enough. You take this ring.”\n\nYou take the ring and stare at it for awhile.\n\n“Are you sure?”\n“Yeah, I’m sure. You’re the one. Try it on just for kicks.”\n\nAt first you think it won’t fit, but apparently you and Mom are about the same size. You like it, but you just can’t let your sisters see it. Hell, maybe you shouldn’t let Peter see it either.\n\nAs you marvel at the ring, your Dad is picking up the urn with your Mom’s ashes. Before you can ask him what he’s doing he opens it and throws the ashes in your face!\n\n“SHE IS THE ONE! YOU CAN POSSESS HER BODY! AND RETURN TO ME ONCE MORE!”\n\nYou try to stagger out of the bedroom choking and coughing while trying to get “Mom” out of your eyes, but Dad grabs you and throws you on the bed.\n\n“COME BACK TO ME BERTHA!” he shouts while locking the door.\n“Mom’s dead! Stop this right now you crazy fuck!” you exclaim rolling off the bed.\n“I’m sorry it has to be this way Suzy, but your mother needs a suitable body to return, and you’re perfect in everyway. Just think, you’ll be the one to bring her back to me!”\n","page 2":"You wake up to another day in your sheltered little world.\n\n“Sheltered” is probably a little inaccurate, but you’re about as close as you can get in your dysfunctional family.\n\nYour upbringing for you and all your siblings, quite frankly sucked, and it made you very introverted and unmotivated. It’s probably why you’re over 18 and still living at home.\n\nYou’re a basement dweller.\n\nHowever we shouldn’t be too hard on you. Your other four siblings are also living at home along with a few other freeloading family members. You just happen to be living in the basement.\n\nFucked up parenting aside, you actually have potential, if you’d just break out of your shell. You aren’t unintelligent. You at least graduated high school, watch the learning/history channel and read weird shit on the internet all day.\n\nYou aren’t even unattractive, though your mom always drilled it into you and your sisters head that you were always to be “good girls”. It only really worked on you though; as a result you’ve never had a boyfriend. (Or girlfriend for that matter) You don’t even have that much contact with the world outside your house anymore. The world’s a dangerous place and you feel much safer in your house.\n\nAgain, this thinking of yours is misguided as being out of the house of your crazy ass family would probably be a lot safer. Of course you rarely even leave the basement nowadays anyway. Seems like your world is getting smaller with each passing day.\n\nOf course you could do something a little out of the ordinary today and try to change your lot in life.\n\nHow about it? Want to give it that old college try? (Even though you never went to college?)\n","page 1":"You wake up and dread the fact that you’ve entered the real world again. The dream world will have to wait until later.\n\nYou don’t like real world, never have. It’s why you like to sleep. It allows you to get away from the reality for a little while. It’s also why you prefer to hang out on your computer all night and day.\n\nIt’s not really because you’re afraid of the real world, it’s just that you don’t have that much interest in it. Sometimes it can be fascinating, but over all you just find it to be involve so much boring tedium that you’d prefer to remove yourself as much as you can from it.\n\nIt’s also probably why you’re over 18 and still living at home.\n\nYou’re a basement dweller.\n\nFortunately you’re one of the productive ones. You contribute to the household by buying and selling useless shit on Ebay. Unfortunately this is still “work” and as a result, it’s a hassle so you probably don’t put as much effort as you should into it. In fact you’re more inclined to keep the stuff you buy due to your interest in odd things.\n\nDespite your limiting of outside world contact, you can’t help but feel like something different is going to happen today. You start daydreaming about possible things that could happen to you until you quickly snap yourself out of it.\n\nAs much as you’d like to waste time daydreaming, playing video games or other time wasting activities on the internet, you probably should go to “work.”\n\nWell don’t just sit there with a thumb up your ass, you gonna buy useless shit, or sell it?\n","page 148":"The only way you’re going to be able to escape is most likely through trickery, so you get the idea of letting him think Mom’s spirit is possessing you.\n\nYou immediately fall to the floor and begin to convulse and speaking in gibberish just like you’ve seen those fakers on televangelist healer programs.\n\n“G..,George! H…he…help m…me! Argh bleh! Garrrgh!” you gibber.\n\nDad’s so gone by this point he believes this act entirely. He runs to your side and holds your hand.\n\n“Bertha! You’ve returned! W..what do you need? I’ll do anything!”\n\nLacking any complex ideas, you just need to get out of this room.\n\n“W…water! Grah! Lots! Raghhh!”\n\nDad immediately picks you up and with one hand and unlocks the door. He runs with you towards the stairs where the bathroom is nearly slamming into Peter and Kevin along the way.\n\n“Get out of the fucking way! I have to save your…ARGH!” he cries out when you jam your thumb in his eye causing you to drop you.\n\n“Quick, get all this on camera!” Peter shouts to Kevin.\n\nYou recover just in time to avoid Dad trying to grab you.\n\n“You little bitch! Stop fighting it! Your mother MUST enter your body!”\n\nThis threat is followed by a stroke of lightning and thunder, which causes Dad to act even crazier.\n\n“Lightning! I know now what I must do! Bertha I will bring you back!” he exclaims and then runs back to the bedroom.\n\n“Peter call the fucking police, I’m getting the hell outta here, Dad’s lost it!” you shout\n“Kevin, make sure you’re getting my good side.”\n“PETER! This isn’t a fucking game! Call them NOW!”\n\nYour demands to Peter are cut off when you see Dad come back with a lightning rod in hand!\n\n“THIS! Will bring her back! The power of lightning will destroy your disobedient soul and allow hers to enter!” he says and then charges at you will the rod.\n\nYou run from your crazy ass Dad and manage to get outside where it’s storming pretty good. You don’t get far when you feel something hit the back of your head and you collapse to the ground.\n\nWith the rain beating down, you feel a kick to your ribs to turn you over. You look up and see your Dad with lightning rod in hand.\n\n“AND NOW BERTHA WILL RETURN TO ME!” he shouts with the rod raised over his head ready to bring it down on you.\n\nDad’s lightning rods were always considered the best quality…\n\nEven with there being higher structures in the area, the lightning strikes the rod immediately and fries your Dad to a crisp. Fortunately his legs weren’t touching you and you scramble and crawl to a much safer distance.\n\nThe lightning doesn’t just hit him once but several times before he falls over smoking and completely black. The smell of burnt flesh is strong even in this heavy rain.\n\n“HOLY SHIT!” Kevin shouts still holding the camera.\n“You get all that? This is going to make a great finale!” Peter replies.\n\nIn the aftermath, Peter does indeed manage to piece together some sort of movie from all this though he can’t use the real footage so he makes up a horror movie based on the events. It sort of becomes an underground hit in the horror genre. Due to it being based on you, you get to claim most of the profits. You sell your Mom’s ring too, as you don’t want to be constantly remembered of that dark day.\n\nWith the film money and what you got with the ring, you decide to move out of the basement (and house) to put this life behind you for good. You’re not sure what you’re going to do exactly, but you won’t be a basement dweller anymore.\n","page 4":"You decide to buy more useless shit. You can never have enough, you fuckin’ obsessed pack rat.\n\nOkay well some of this shit isn’t useless, and might even do you some good. Certain items catch your eye.\n\nYou see a car that’s made completely out of asbestos! How cool would that be? You could drive through fire and be none the worse for wear! True you rarely go out anymore, but maybe this would be the thing that could do it!\n\nYou see a bomb shelter for sale made of xentronium armor. Could be useful in these dangerous times we live in and it’ll definitely provide you more protection than the basement.\n\nThere’s a small island made of Styrofoam in the middle of the ocean. It says it’s held together by hemp. While you’ve never been one for the beaches and sun, you wonder if you could rent it out some how. Maybe movie producers would pay you to use it or something.\n\nActually perhaps something more practical might be good, there’s some toilet paper for sale. You know you always need that!\n\nFinally, you see a building for sale; it doesn’t really give a description. It just says “Generic Gray Building” It might be a good thing to invest in since you’re getting tired of hearing your Mom’s moans of ecstasy at night when she’s masturbating with her 400 horse powered vibrator. A place of your own might be in order.\n","page 3":"Look at you. You’re pathetic.\n\nYou’re over 18 and still living at home.\n\nYou have no job, no skills, and absolutely no future prospects!\n\nBut why bother pointing all this out? You know all of this already, but still choose to leech off of Mom’s hard earned money.\n\nYou’re a basement dweller.\n\nWorse, you’re an Anime loving basement dweller. Sure you could drop lower, but you’re already just below the tapeworm as far as social scale is concerned. Even Trekkies rank higher.\n\nRight now you’ve just received every anime DVD that you could buy with your mom’s stolen credit card. She’ll probably bitch at you later, but you figure you’ve got at least a week before she sobers up enough to find out. Until then, it’s anime time! Tonight is the night that you start your journey to give yourself totally to anime. If you do, you will be forever chained to it…\n\nHowever, that doesn’t have to be your fate! There IS still hope for you! Somewhere within you there does exist something human. You COULD resist the anime! Do something else! Anything else!\n\nThink about it. Is what is on those DVDs really going to be any different from what you’ve seen already? Seriously it’s all the same anyway. Bunch of wide eyed pre-pubescent girls dressed in the latest pedowear while sucking on lollipops and effeminate fags who emo whine about how they’re only half human and finding out that their true love is actually their long lost sibling.\n\nI mean as much as we all like watching a bisexual half demon commit anal rape on his 12 year old sister every once in awhile, there comes a time where you just gotta say: “What the fuck am I doing? Half of this shit is inane and stupidly childish, and the other half is really fucked up and twisted. And some of it manages to combine the two halves. Two nukes really weren’t enough for that country. I’m going to do something better with my life.”\n\nSo is today that day you sad little freak?\n","page 11":"Well you didn’t get to be a basement dweller by being adventurous so you read the instructions first. Good thing too, there’ a bunch of safety precautions to the car. Namely due to the extremely high levels of asbestos in the car, going in it without a hazmat suit would be fatal. Fortunately you just happen to have one. Unfortunately you only have one, which means that any lady that’s remotely impressed by it won’t be able to get in the thing without dying shortly thereafter. So unless you plan on becoming a necrophiliac, you have to come up with a new plan. (Though becoming a necrophiliac is plan B)\n\nAs you’re suiting up, you think about how you’re going to impress possible ladies with the car, without actually letting them get in it. You got it! A stunt! Chicks like daredevils right?\n\nYou got a bunch of compost in the backyard, A LOT. You get the idea to take that compost and put it in the middle of the street, set it on fire and then drive through it!\n\nEnthusiastically you start grabbing compost and going through with your plan. It probably would’ve been a better idea to at least use a fuckin’ SHOVEL on the compost instead of picking it up with your fuckin’ hands you silly motherfucker. Oh well at least you’re wearing a hazmat suit\n\nAnyway you smell REALLY awful and you’ve just made the entire block smell that way too, when you light it on fire. This act has finally come to the attention of all the neighbors who are giving you holy hell about it.\n\n“Jesus fucking Christ! It smells like a dead bum who just sprayed diarrhea on himself during a heat wave!” one of them shouts.\n\nAn angry mob is starting to form…\n","page 99":"Are you fucking serious? I was fucking joking about that! Then again you’re pretty much bat shit insane at this point anyway…\n\nOkay so you look at the poster of your unnatural object of desire, and begin to concentrate.\n\nAnd concentrate…\n\nAnd concentrate…\n\nWell you’ve stared at the fuckin’ picture long enough to get you horny as hell, but she still hasn’t come to life and spread her green legs for you yet.\n\nAll you’ve gotten is an erection from your staring.\n\nNow you’re looking at your dick.\nYou’re looking at the pic.\nYou’re looking at your dick.\nYou’re looking at the pic.\nPic. Dick. Pic. Dick. Pic. Dick. Pic. Dick.\n\nWhile all this is mildly amusing, we probably should get on with this futile exercise\n\n“URRRGGGH!”\n\nThat’s you still trying to wish She-Hulk into existence.\n\nYou don’t have a boner anymore since all the blood rushing to your other head as you redouble your efforts into concentrating on the poster.\n\nOf course now you’re starting to give yourself a fucking headache from this nonsense, in fact you’re getting a little dizzy, you silly motherfucker.\n\nY’know you gave it a shot, but maybe this just wasn’t meant to be.\n\nYour cousin Patricia’s still available and considering what a hopeless loser you are anyway, maybe it wouldn’t be so bad if you tried to pursue her again. I mean someone like you really should get it where you can and you can’t do that by jacking off to cartoon characters in your mom’s basement.\n\nThink about how she left. She seemed pretty upset on a personal level. Maybe she even liked you romantically in some way. Maybe you could contact her again.\n\nOf course if you wanna risk giving yourself a fuckin’ seizure, it’s your choice.\n","page 10":"Face it; you don’t really have that much of a personality, so instead of buying any one of the more “interesting” items, you decide to get the dull gray building to match your life. Its only $2000 and nobody else wants it, so you get it with relative ease.\n\nAlright! A place of your own, no more having to quickly erase the porn on the computer or explaining to Mom why your pants are off anymore!\n\nAfter you receive the location, you quickly start packing up your shit. Until you realize you’ve got a lot of it. Hmmm, you don’t really feel like moving it all and you briefly think about selling some of your shit on Ebay, but as usual you can’t bear to part with anything. Where else are you gonna get a genuine Hitler Pez dispenser? Or the rare gay version of Star Wars? Or even that picture of you with Boudicca’s ghost?\n\nBesides you don’t want to waste anymore time on Ebay today. You’re in a rare adventurous spirit and really wanna find out what this building’s all about. You load up your Mom’s car with as much shit as you can and drive to the building’s location. It takes you a day to get there, but you finally do it.\n\nYou’re here at the Gray Building. You’re also in the middle of nowhere! You can hear a pack of ravenous wolves in the distance. There’s only one door and no windows. Looks pretty ominous actually. Like a place where they’d do a snuff film, or perform secret government experiments.\n\nWell in any case you DO own it, so maybe you should find out!\n","page 13":"Realizing you can’t possibly calm them down or fight them, you quickly get in the car and start it. The car belches toxic fumes of its own causing the mob to back off a little as they begin to puke and and tear up from all the foulness in the air.\n\nThe shortest way to escape is through the burning compost. So part of you hopes that between the puking and tears that some of the cuter chicks on the block will still see your stunt\n\nYou barrel down the flaming compost pile…\n\nSPLUNGE\n\nYou don’t quite make it!\n\nIt seems you made the compost pile a little too thick and even at the high speed you were going the car couldn’t quite make it all the way through. Instead you got struck right in the middle of the compost until it enveloped you completely, effectively trapping you.\nFortunately the car is made of asbestos so you’re protected from getting burned to death. Unfortunately the car still runs on gasoline…\n\nYour car explodes spectacularly throwing hot shit and asbestos pieces everywhere, not to mention killing many of the mob that were already in a state of extreme sickness at this point. The whole block is later quarantined and treated as a biohazard dump.\n\nYou of course died instantly, BUT you did get your wish! You made front page news and became a sex symbol for lonely necrophiliac women who thought you were so cool for dying in your car like that.\n","page 12":"You figure you can read the instructions later, you decide to check out the car first. The whole point of buying the car was to impress women so you’re in a hurry to do that.\n\nThe car is a nice white gray color and looks like a 50s type car. It’s so well designed that you almost can’t tell that it’s made out of asbestos. You get in the car and breathe deeply to get that new car smell.\n\nAnd promptly fall over dead!\n\nAsbestos causes cancer you fuckin’ moron and your car is overflowing with the stuff! Well the only good thing is it was so toxic that the “sickness process” was accelerated by 200 and killed you instantly.\n","page 9":"Well last time your Mom went to the supermarket she couldn’t find the soft kind. In fact, she never can find it. It’s almost like there’s a conspiracy and the super markets hide it before she gets there. Either that or she just enjoys torturing you with toilet paper that feels more like sandpaper.\n\nBut this isn’t about your paranoia, and you manage to find some toilet paper for $5, 1000 rolls of it! You buy it immediately and soon it arrives magically in front of your house. You find out why it was so cheap.\n\nIt’s wet and USED…\n","page 14":"You attempt to calm the mob down; by saying this’ll be the coolest stunt ever! The mob disagrees and proceeds to disagree with you in a physical way!\n\nThey smash you in the head with a few bricks and frog stomp you, then they take some of the compost (Using a shovel) and cover you with shit.\n\nThen they proceed to destroy your car. The jokes on them though! By pounding and beating on the car they cause a lot of asbestos flakes and dust to go flying into the air which they breathe in, since there’s a lot of heavy breathing going on. (It IS a tiring job after all)\n\nThey all eventually get cancer from breathing in this toxic substance and die.\n\nOf course you don’t get any enjoyment from any of this, because you’re in a coma.\n","page 91":"This is pretty surprising. In your choice between pussy and morals you chose morals. You’ve really come a long way.\n\nActually you haven’t. Your fear is just overriding your hornyness level. The fear of getting locked up for statutory rape and pedophilia and getting ass raped by real criminals is too great. It’s just as well; your shot at your cousin was pretty slim anyway.\n\nIn the meantime you tell Patricia to get out as you’re getting sleepy. You begin pushing her towards the door trying very hard not to grab her ass or tits.\n\n“Alright, alright! I’m going! Stop shoving me! Shit, what’s your problem!?”\n“I got a lot on my mind alright? I won’t have you hounding me with questions! Get out! Out! Out!”\n\nYour outburst makes Patricia very upset. In fact she tears up, you fucking cad.\n\n“Oh fuck you then! I was trying to help your lame ass out! I even thought that maybe… Nevermind! Don’t fucking contact me anymore jerk off! (Sob!)” Patricia yells before slamming the door.\n\nWith your cousin gone you feel so lost. Normally the temptation to go back to anime would be there, but instead you just feel depressed. It’s sort of like the first time she stopped coming over, but a lot worse because now you know she’s not coming back. Patricia was like your “girlfriend” even if she really wasn’t; the illusion was enough for you.\n\nYou cry in your pillows. The very pillows you used to hump and pretend they were her. You’re too sad to even do that. You’re totally emo right now.\n\nWhy you’re so emo, you might just become AN HERO.\n","page 90":"It’s too much; you just can’t hide it anymore. You HAVE to tell her!\n\nOne day when you’re alone with her in your basement, you just blurt it out.\n\n“Patricia, you’ve been so nice to me. More than a basement dweller like me deserves. And I know this is wrong, but I’ve grown to love you. I can only hope that somewhere within you, you love me too.”\n\nYou’re never going to believe this, but Patricia doesn’t run away in terror screaming. Though she does look a little apprehensive and starts edging away from you.\n\n“Uh…Brian. I’m flattered, but…uh I don’t think…”\n“Believe me, I know it’s wrong. I used to read the SUPER HAPPY INCEST FAMILY comic series. But I can’t help but feel this way about you!”\n“Brian, I know you’re desperate for female companionship, but maybe you just need to jack off or something.”\n“Jacking off has lost all meaning now. At one time I used to just be satisfied with images of anime girls getting raped, but now that I’ve been in close and civilized contact with a real woman on a regular basis I want more.”\n“Can’t you find a different girl?”\n“What other girl wants me? You’re the only one I know who understands me!”\n“But dude, I’m your cousin!”\n“So? Samurai Warrior Raki Onari fell in love with his…”\n\nAt this point Patricia slaps you.\n\n“Damn it Brian! I thought you were past this! You aren’t a samurai, I ain’t some geisha and this ISN’T an anime comic! You need to get this Jap shit outta your head once and for all!”\n“I know, I know! (Sob!) But its like with you around, all my anime fantasies could come true! I mean maybe you could even put on some cat ears…”\n\nYour cousin slaps you again.\n\n“NO! FUCK NO! Look Brian if you expect any kind of relationship with me, you won’t be making me dress up in anything remotely furry!”\n“(Sob) I’m sorry, I’m just…wait…did you say?”\n“I said if you want any chance with me, you better knock off this anime shit for good!”\n\nYou can hardly believe your ears. Against all odds your pretty teenage cousin is offering to have a relationship you. It seemed like she was prett against it just a moment ago. At this point you pinch your own ass just make sure you’re not dreaming.\n\n“Ow!” you say.\n“Why the fuck are you pinching your own ass?”\n“Nevermind. I’m just over thrilled that you aren’t calling the police on me. I’m so glad you’ve made this decision! I can be so good for you; you’ll see…but uh, remember we’ll have to keep this a secret.”\n“No shit. We’d probably look suspicious hanging out together if most folks wouldn’t ever believe that I’d be caught dead fucking someone that looks like you! Hah! Though all that box lifting at the comic shop must’ve had an effect on you. You’re putting on a little more muscle rather than remaining the disgusting blob you were before.”\n“Um…thanks I think...”\n\nNow at this point someone less desperate would sense something is amiss personality wise with this chick, but of course you’re not really thinking about that.\n\nYou don’t think about it when she starts sucking your cock, minutes after this conversation.\n\nYou don’t think about it when she punches you in the face after swallowing your load.\n\nYou don’t think about it when she’s fucking you while your mom is out of the house.\n\nYou don’t think about it when she begins to constantly insult you and physically abuse you whenever possible.\n\nAfter getting a dildo shoved up your ass during a particularly rough round of sex, you begin to think about it!\n\nOver the past few months you’ve come to find out that your lovely Patricia is bat shit insane. Lots of stuff you didn’t know about her come to light, like your previous notions of her being some beacon of purity were completely wrong as well. She’s been fucking guys since sixth grade. (Definitely shows when she’s fucking you too) She’s also supposed to be taking meds and she hasn’t. You don’t exactly know what mental illness she has, but she’s definitely not a well girl. (This really shouldn’t surprise you considering she’s fucking you)\n\nNone of this would be so bad, if she hadn’t become so increasingly sadistic towards you. You’ve been letting her get away with it too, so she’s just getting worse.\n\nThe only good thing about all this is you haven’t once been thinking about anime. Not because you’ve got something else to concentrate on now, but because you’ve learned to associate anime with pain and fear. (Which is a fetish you definitely haven’t embraced) Anytime you showed signs of relapsing again, your cousin would punish you severely. (Even more than usual)\n\nWhile I’m sure there’s a lesson to be learned and the philosophical idea of being careful of wishing and all that other shit, but really none of that is going to help you right now. You can either stay in this completely fucked up relationship or try to break up with her.\n","page 93":"Well I would say you’re pussy whipped, and while that might have something to do with it, it’s far more likely that you’re just suffering from a form of battered spouse syndrome.\n\nYeah so anyway you stay with her and put up with more of her abuse. Now you’re probably thinking that she ends up killing you or something, but that doesn’t happen.\n\nNope, you don’t get arrested for statutory rape either. Her parents and your Mom are quite aware of the situation, but because Patricia lets all her aggression out on you, her parents find her to be much more manageable now. As for your mom, she figures that you getting laid and not wasting time on anime anymore so it’s at least step up.\n\nTime passes and eventually you manage to get her ass pregnant. It’s at this point you are forced to move out of your mom’s house since she’s not putting up with you, your crazy bitch AND your unholy seed (Patricia’s family is even less receptive to the idea). Fortunately, you save up enough money to move out of your mom’s house and into a cheap ass trailer park with Patricia. (Hey you’re already fucking your cousin, might as well go with it at this point)\n\nYou and Patricia live in this trailer park for the rest of your lives where she not only continues to abuse you mentally and physically but also gets fatter with each mutant child she gives birth to.\n\nFace it, you’re a big ass loser pal, but at least you’re no longer a basement dweller.\n","page 92":"Seriously? Shit, I didn’t think you had it in you.\n\nYou gather up all your courage for your next meeting with Patricia. You’re really nervous and on edge. Your mom notices this before she goes to work.\n\n“Hey Brian.”\n“AGHH! SHIT!” you shout, not realizing she was there. “Damn you scared me.”\n“Calm down, it’s just me. Shit, Patricia’s got you more jumpy than a five year old at a NAMBLA convention.”\n“Patricia? Uh I dunno…”\n“Cut the shit son, I know all about it. I wash your sheets remember?”\n“You knew? You didn’t care?”\n“Well, I can’t say I approved, but I guess I felt sorry for you. I mean hell you were finally getting laid and on a regular basis too. I figured if she got pregnant we’d just abort the unholy bastards. I didn’t quite know how crazy Patricia was until I spoke to her mother recently though. I imagine you didn’t either, but you were just so grateful for someone to fuck you. My sister Evelyn said they were going to ship her to some convent in South Seas, but strangely your relationship with her has had a calming effect. She seems to let most of her crazy shit out on you.”\n“Yeah, I noticed and I don’t think I like it anymore.” You say.\n“Well, I can’t say I blame you. I’m glad to see you have a backbone somewhere in that out of shape body of yours. Ah fuck, maybe some of this is my fault. I should’ve gotten you a hooker when you turned sixteen. At least you might’ve avoided this fucked up relationship.”\n\nAt this point your mom opens up her purse and takes out her handgun and gives it to you.\n\n“Here, take this. If you’re going to break up with her, you might need it.”\n“I don’t want to kill her!”\n“Hopefully it doesn’t come to that, but given how she is, you’d better have something to protect yourself. Now I’m going to work. Good luck son, and you better not leave a big fucking mess for me to clean up.”\n\nWow, that’s gotta be the first time your mom’s been supportive. Of course now you’re even more nervous.\n\nEventually Patricia comes over. She’s in a horny mood and grabs your balls hard when you open the door.\n\n“Hey you fucking perv. You ready to shove that little dick in me for a good two minutes before you get too tired? Hah! You’re such a loser!” she says and then shoves her tongue in your mouth.\n\nYou push her back a bit and cover your balls while rubbing them in pain.\n\n“Patricia, we really gotta talk.”\n“Yes we do! I wanna talk about the last Batman comic! Can you believe that…” she says changing her tone as usual.\n“No, Patricia we gotta talk about us.”\n“Oh?”\n\nWhile Patricia looks at you expectantly, you start and stop several times in an attempt to tell her it’s over, but just can’t do it. Patricia on the other hand realizes what’s going on and she gets very upset.\n\n“You fucking bastard…you’re breaking up with me aren’t you? YOU UNGRATEFUL PIECE OF SHIT!”\n“Now Patricia, it’s not like that.”\n“Oh then how is it like? I gave my body, my love, my fuckin’ SOUL to your sorry ass and this is how you repay me? Oh fuck no; you’re not getting away with this shit!”\n\nPatricia doesn’t attack like you think she was going to, she starts to leave.\n\n“What’re you doing?”\n”Me? I’m going home, that’s what I’m doing! And I’m telling everyone of how you’ve been molesting and raping me on a routine basis. You’ll be locked up and I hope some big ass black guys shove their dicks up your bitch ass every night!”\n“Patricia, your parents and my mom already know about us.” You say in the hopes it’ll stop her.\n\nPatricia does stop. She didn’t expect that, but she quickly resumes her tirade.\n\n“So what? Then they’ll get in trouble too! I’m still underage not to mention your fucking cousin! I’ll just go straight to the police and they’ll take you all in! Regardless of what happens, you’re still going to be in major fucking trouble and you’ll still be taking it in the ass in jail!”\n\nMaybe it’s fear, maybe it’s anger, maybe it’s a combination, but you pull the gun on Patricia and order her to stop.\n\n“Patricia, I can’t let you do that.” You say, while Patricia looks at you in disbelief.\n“Brian?! You’d actually shoot me? Someone you used to love?”\n“I still love you Patricia, but I can’t let you go now. I would’ve before, but given your threats and your past abuses towards me, I can’t take that chance. You’re too chaotic…and I gotta do this.”\n\nPatricia drops to her knees before you and starts to tear up. Her voice starts to quiver as she begs for her life.\n\n“Brian…(sob) please. Don’t do this! I’m sorry. I didn’t mean to treat you like that. I’m just all fucked up when I’m not on my medication. I’ll start taking it! We can still be together. Just please (sob) Don’t kill me!”\n\nFor a moment you drop your guard. It’s a moment though that is your downfall. Patricia punches you in the nuts and tries to wrestle the gun from your hand. In the ensuing struggle she manages to turn the gun on you and pull the trigger. You feel pain spread from your stomach to every other inch of your body. However unlike the movies, this doesn’t result in some “shocked” expression and you falling limp in slow motion. You instead have enough adrenalin to push her off of you and with the gun still firmly in your hands you shoot her twice in the chest.\n\nPatricia falls to the floor in a bloody heap and you do likewise.\n\n‘Ugh…damn it Patricia…”\n\nPatricia doesn’t respond though since she’s already dead. You’ll be joining her soon. It’s probably for the best anyway. Still, even though she was a crazy bitch, she’s still the only love your life. You crawl over and grab her hand as you bleed out.\n\n“Ha ha ha ha, Mom’s gonna have a big ass mess to clean up when she gets home.” You laugh as you start to lose consciousness and pass from this world.\n\nAnd so ends the life of another basement dweller, but you know the old saying: “Tis better to have fucked your cousin and die, then to have never fucked your cousin at all.”\n\nOkay so that’s not how it goes, but you still accomplished one major thing that most basement dwellers never do and that’s getting laid by a real live girl. And it didn’t even involve money or rape! Not to mention she was a jailbait family member. Do you realize how many sexual repressed Japs and jilted Rednecks dream to be in that position? Why some basement dwelling pedophile fucktards go through their whole pathetic lives too scared to act on their feelings and only content on wackin’ it to prostitot beauty pageant pictures. YOU were living the dream man! You were living the fuckin’ dream!\n\nSo cheer up and don’t think of dying as a loss because a Winner is YOU!\n","page 97":"No! You will not become like every other loser that kills himself due to not being able to get some jailbait pussy. You’ll be like every other loser that finds a substitute instead!\n\nYou can’t think about her though, you need something else! But you got rid of all your anime and internet months ago! And you gotta jack off NOW!\n\nYou then remember, your other comics! You can use them instead! You quickly grab and scan through them…\n\nAll these super females are more like women than girls, but as you’ve been reading them over the past few months you find that you can still get turned on by them.\n\nAh hah! She-Hulk! She’ll do!\n\nYou begin to jack off vigorously to your replacement, and lo and behold it works! You feel better and less depressed.\n\nMonths pass and eventually you’re over Patricia altogether and found that obsessing over comic book girls to be much easier for you.\n\nBesides you’ve found a new true love in all this: She-Hulk.\n\nWhy her? Hell if I know, it’s your pathetic fetish. I suppose you latched on to her the most due to her being your first jack off material after you resisted Patricia. Plus she’s green and shit.\n\nWhatever the reason you just can’t get enough of her! She’s not only strong, but she’s intelligent too! And she looks just SO sexy with her green skin and Amazonian build!\n\nYou never wanted to fuck that sexy green bitch so much in your life! The real women just can’t compare to this two dimensional green goddess! They’ll never relate to you the way that SHE can. Oh sure your cousin Patricia came close, but…\n\nForget about that bitch, you got She-Hulk now!\n\nBut how you WISH She-Hulk was REAL! If ONLY that giant poster on your wall could come to life.\n\nHey loser, MAYBE if you wish REAL hard it will come true!\n","page 96":"Well I guess we all shouldn’t be surprised that it would end like this.\n\nIn the traditional of overly dramatic An Heros you decide to make a suicide note first. If you still had the internet you would’ve really been able to take advantage of this momentous occasion, but ever since you gave up anime you lost that perk.\n\nAnyway since you don’t really have any friends or even any relatives that like you, you just write about how you can’t go on due to your sick obsession with Patricia and then life isn’t worth living, it sucks, blah blah blah…\n\nAfter writing your emo faggotry, you now decide on how to kill yourself. Unfortunately your mom carries her gun on her at all times so you can’t shoot yourself and you’re probably too much of a fucking sissy to go out V-Tech style anyway.\n\nYou try hanging, but your inept ass can’t tie a proper knot. Eventually you give up.\n\nYou head to the bathroom to find some pills, but your mom hasn’t refilled her prescriptions lately. You just swallow what’s left in the medicine cabinet, only to throw it all up five minutes later.\n\nUndeterred in your quest to pwn yourself, you grab your mom’s razor blades and slit your fucking wrists open (Down the road not across the street of course) at last accomplishing something worthwhile in your miserable life.\n\nYou begin to bleed out; surprisingly you don’t even change your mind and try to desperately call 911. You just think about how you wasted your life in your mom’s basement jerking off to anime and how if you hadn’t tried to stop you probably wouldn’t be in this situation now. You would’ve been content on living the life of a basement dweller not knowing any better. Gotta love the irony eh?\n\nEventually you die and leave a bloody mess for your mom to clean up when she gets home. You aren’t really missed, and your letter was so drenched in blood that it was illegible, so nobody really knows why you killed yourself if anybody cared in the first place.\n\nIn other words you’re not even amusing enough to be An Hero, you fail at life AND death!\n","page 152":"“Peter contrary to popular belief, I do have a life. I’m going to a party tonight!” you say indignantly.\n“Hmm, I find that hard to believe, but if you don’t want to be part of what will be the greatest movie ever, ‘tis your loss, not mine.” Peter says and leaves with Kevin who’s still pointing the camera at you until you slam the door in his face.\n\nYou groan when you now realize you’re going to a party that will most likely have several “Kevins” all attempting to get in your pants. Still, you’ve never not been there for Julie when she’s really wanted or needed you and that seems to be the case now. So you’re going.\n\nYou try to find something to wear that’s not going to cause the natives to get too restless, but then you remember it won’t matter, so you just wear something comfortable to you.\n\nYour walk to Julie’s is relatively uneventful and you get there exactly at six o clock. Julie is unusually sober. Granted the party hasn’t quite started yet, but that’s never stopped her before.\n\n“Suzy? What the hell are you doing here? Nobody else has arrived yet!”\n“Uh you told me six, so I’m here at six.” You say totally not grasping the concept of being fashionably late.\n\nJulie laughs and puts her hand on your shoulder.\n\n“Oh Suzy, you are just so precious sometimes. That’s why despite our differences I’ve always considered you my best friend after all these years.”\n“Uh huh. So what did you want to see me about?” you ask\n“Oh we can talk about that later, you should enjoy yourself now.”\n“Julie, as you pointed out nobody else is here yet! Also, I just came over to talk to you, not hang out at your party, so now is a good time to tell me. You said it was important.”\n\nJulie begins to get a little nervous now, and tries to avoid the situation.\n\n“Ha ha, yeah well. Maybe it wasn’t as important as I thought I guess. It’s funny to see you here; I almost didn’t expect you to come, but now that you are, stay!”\n“Julie, you mean to tell me you wasted my time, and lied to me?”\n“No! I just…yeah I guess it’s important, I just can’t tell you right now. I will later I promise. Please can’t you just stay for the party?”\n\nIt’s apparent that Julie really does want you to stick around, but at this point you’re very exasperated. You don’t like leaving your basement without a good reason.\n\nYou didn’t come here to play games. You give Julie one last chance.\n\n“Look Julie, if you don’t tell me what’s going on right now I’m leaving.”\n“No! Please no! If I don’t tell you now I might never…I need a drink first.” She says and goes to her liquor cabinet, but you stop her.\n\n“Dammit WHAT?!” you yell into her face while grabbing both of her arms.\n\nJulie breaks free of your grip and grasps your face to kiss you full on the lips passionately. You’re so surprised that you don’t resist at first, but eventually you push her off of you.\n\n“I love you Suzy! I think I always have! I think you’re my soul mate!” she blurts out. “There I said it.”\n\nYou’re in too much shock to even reply at this revelation. All you know is she wasn’t joking about it being important.\n\n“Whew, I feel like a great weight has been lifted off of me. I thought I wasn’t going to be able to tell you without being drunk, but I’m glad you forced it out of me. You always lead me to the right decision. It’s why I love you.”\n“Stop…just stop Julie.” You say, sitting down trying to take all this in.\n\n“What’s wrong Suzy? I mean I thought you might be into this.”\n“What? And what made you think that?”\n“Oh come on Suzy, you’re still a fucking virgin. You’ve never shown any interest in guys, so I’m pretty sure that it’s obvious that you’re a closet lesbian.”\n“Glad it’s obvious to you, because it sure wasn’t to me. Look I need to wrap my head around this. I gotta get out of here.”\n“But…but…”\n“But what Julie? What am I supposed to do fall down on my knees and start munching your rug? Look maybe YOU’VE had those feelings, but I haven’t. I mean I suppose we’re friends and all, but quite frankly we’re VERY different people and wouldn’t be compatible in a relationship even if I was so inclined to pursue one with a woman. Which I’m not. At least not now.”\n\nJulie begins to look very hurt and upset.\n\n“But…you could right?”\n“Look Julie, it’s not going to happen. First of all you’d have to undergo some serious lifestyle changes which I doubt if you’re even capable of. Second of all I question whether or not what you feel right now is going to last. You have a habit of falling in love every other week.”\n“No it not like that! I’ve always felt this way! And I’ll do anything for us to be together!”\n“Julie, forgive me if I don’t share your delusions. Look, I know that you probably believe what you’re saying, but let’s just forget about this shall we?”\n\nAt this point Julie starts to cry which is followed up by her running into the bathroom and slamming the door. You think about trying to console her, but that’s probably only going to make things worse.\n\nLacking any other ideas, you decide to go home and let Julie work it out herself.\n\nOn your way home, you run into Donna and a bunch of her slutty friends.\n\n“Suzy? What the hell are YOU doing out of the basement, you never go anywhere!” Donna says.\n“I’m coming back from Julie’s. It’s a long story.”\n“Coming back from there? We’re going there! Julie invited all of us to her party. Normally we wouldn’t get there so early, but we figured we’d like to get the first dibs on the guys.”\n“Yeah she invited me too, but she wanted to talk about something else.” You say and then feel the need to tell Donna more.\n\n“Uh…Donna can I talk to you about something in private?”\n“Sure, hey you guys just go on, I’ll catch up.” Donna tells her friends.\n\nAfter her friends leave you tell Donna everything that happened between you and Julie. Donna’s intrigued, but is shocked at your response.\n\n“So you just left her to cry?”\n“Well yeah, I mean if I stayed I would’ve just made things worse. She’ll get over it.”\n“No she won’t! She basically just admitted to you that she’s loved you all her life and had a hard time even admitting it to you. And you basically just stomped all over her little heart! She’s supposed to be your friend. The ONLY one you really have, and you didn’t even give her a chance!”\n“Yeah, key word being FRIEND. I never felt that way and I’ve known Julie a lot longer and better than you have and she’s incapable of having a stable relationship with anyone. She’s wild party girl just like you.”\n\nNow Donna gets offend by your rude choice of words.\n\n“Oh I see. Just because Julie isn’t some stick in the mud flying nun who’s only knowledge of a so called relationship is with a piece of battery powered machinery, she’s a whore that’s incapable of change or true feelings huh?”\n\n“That’s not…”\nAnd you see me and Julie as one of the same too, right?”\n“I didn’t…”\n“Fuck you Suzy! I know what you think. Let me tell you what I think! I think you’re an emotional cripple who’s so fucking scared of the real world so you hide out from it in your goddamn basement! So scared that you’ll get hurt that you miss out on shit that COULD be good for your uptight ass! Well fuck that, I’d rather be a whore than some scared virginal recluse!”\n\nYou’re left speechless as Donna storms off who says one more parting shot.\n\n“And I dunno why you’re claiming not to be interested in Julie anyway. It’s pretty obvious that you’re a lesbian.”\n","page 151":"“Oh alright, I’ll help you with your movie.”\n“Excellent! You’ll see in time that you made the right decision. Okay, Kevin go fetch the supplies.”\n“Supplies?” you ask as Kevin complies and gives Peter the camcorder.\n“Oh just some props and such.” Peter starts to look around your room and then places the camcorder in a position so it’s facing your bed. “There, that should do it for the initial scene. I’ll take it in for a close up later.”\n“Excuse me, but WHAT are you exactly intending to film here?”\n“The love scene for my movie of course.”\n\nWhile you stand in disbelief, Kevin comes back stripped to his underwear with a big bag in one hand and some lube in his other.\n\n“Woo! Yeah! I’m ready to do this thing!” Kevin says in a hyper tone. Apparently he’s taken something to speed him up.\n“NO NO NO NO! I am NOT having sex on camera! Least of all with that disgusting freak!”\n“What’s the big deal? It’s just sex. Look if it’ll make you feel any better, Kevin will wear a condom.”\n“What? That wasn’t part of the plan. You said I could fuck her straight bareback if she agreed to help us…”\n“NOBODY IS FUCKING ME!” you yell to make yourself heard and your attitude on the situation final, unfortunately Kevin doesn’t seem to get it.\n\n“Aw come on Suzy, I know you gotta be dyin’ to get laid.” He says and starts to grope your breasts with one hand, and grind up against your ass. You can feel his little cock poking you and that’s when you totally lose it.\n\n“Leave me the fuck alone asshole!” you say and throw Kevin on the floor. You then proceed to kick him.\n\n“Ah! Shit! Damn! Fuck! Feels good!” Kevin says. Sonofabitch is actually enjoying you kick the shit out of him. To be quite honest you’re starting to like it too, you wonder if you’ve learned something about yourself today.\n\nPeter of course gets a cunning plan.\n\n“Y’know, this could still work. Suzy would you be interested in wearing a dominatrix outfit while you beat the hell out of Kevin? You wouldn’t have to have sex with him and this could still serve as the romance scene for my movie.”\n","page 154":"“Get the hell outta here too Peter! And stop stealing my damn clothes!” you yell pushing Peter towards the door.\n“Alright, alright! Shit. Alright Kevin looks like you’re fucking me for this scene.”\n\nKevin gets up and stumbles towards the door.\n\n“Aw damn Peter, I really wanted to fuck your sister this time.”\n“Yeah well she’s being an uptight bitch as usual. Come on it’s not like we haven’t done this before.”\n\nYou stop them for one second before they leave.\n\n“Wait a minute, you guys are together?”\n“Well I wouldn’t say that. Kevin has been helping me a lot, but I don’t have any money to actually pay him most of the time. I see sex as a mutually beneficial exchange. Fortunately Kevin is very liberal when it comes to sex, however as you’re well aware Kevin has a bit of a thing for you. Hence why I borrow your clothes sometimes to dress up as you, though I really do think they look a lot better on me.” Peter sniffs.\n\nYou shake your head at all this sordid nonsense and give them both a shove before slamming the door.\n\nYou didn’t get much accomplished, but at least you prevented anymore of your clothing from getting stolen today.\n","page 153":"“Sure, why not, I’m just getting started.” You say stopping momentarily from kicking Kevin.\n“Great! My movie will be even better! There’s a dominatrix outfit in that bag, don’t worry nobody else has worn it yet.”\n\nYou quickly get the outfit and head to the small enclosed toilet area in the basement to change. The leather “catsuit” is a tight fit, but that’s to be expected. You feel a sense of euphoria overwhelm you, never before have to felt so comfortable.\n\nWhen you leave, you see Peter has the camera in hand and Kevin is all stretched out and tied up to one of the hanging ceiling pipes in the main area of the basement, rather than your room. Which is just as well since you really didn’t want any mess there\n\n“Hey you look great Suzy. You’ll find some useful tools in that bag too. Just grab some and do whatever comes natural.”\n\nAnd you do. Boy, do you ever! You start out by whipping Kevin on his back at first. Much like the kicking, he seems to enjoy it.\n\nYou then move on to a big paddle and start spanking his bare ass. Again he likes it. He’s also probably not registering a lot of the pain due to his drug intake. This frustrates you. You want him to HURT.\n\nYou pull out a big ass dildo next…\n\nHe feels that. Boy, does he ever!\n\n“Peter! This wasn’t part of the deal! I don’t want to be ARGH penetrated!”\n“Shut up and like it, bitch!” you snarl.\n“Beautiful! This is great stuff!” Peter exclaims getting a close up.\n\nYou continue to abuse Kevin’s rectum with the dildo for a good ten minutes the whole time he’s begging you to stop. It’s completely covered in blood and shit by the time you’re tired of using it.\n\n“Is that it? Damn I was hoping for more.” Peter says.\n“…No…no more…no…” Kevin sputters in exhausted pain.\n\nYou say nothing and throw the dildo back in the bag and reach in for something else, namely a strap on. You quickly adjust it to your leather catsuit.\n\nThis time you put a ball gag on Kevin so that he can’t scream as loud from the irreparable damage you’re about to do to his motherfucking asshole.\n\nPeter is there get shot after shot of the fairly gruesome scene. He makes sure to get a close up of the anguish on Kevin’s face, and the look of ecstasy in yours when you have an orgasm sometime during your rape of Kevin’s gaping hole.\n\nEventually Kevin passes out from the pain and you decide you’ve had your fill too. Peter stops filming.\n\n“That was better than I could’ve imagined! Thanks Suzy! I swear you are definitely getting credit and five percent of profits from this movie when it becomes a hit! Man, I never knew you had that in you. You should think about doing that full time. You could get paid serious money. Hell you already have the dungeon atmosphere for it. Go ahead and keep the outfit and bag of goodies, I get the feeling you’ll be wanting them.”\n\nPeter unties Kevin and carries his unconscious body out the door.\n\nYou take Peter’s advice under strong consideration. You were looking for a job; well this would be a good one. You could schedule clients online, be your own boss and never even have to leave the basement. Best of all you can have mind blowing orgasms and technically not actually have to fuck anyone thus retaining your good girl status.\n\nAnd so it happens, you pursue this life with a new found motivation. While you never do gain fame and fortune from Peter’s failure of a “movie” you do gain fame and fortune as the best dominatrix in the tri-state area.\n","page 134":"This definitely isn’t for you. You want to be out of here as quickly as possible. Ben certainly understands.\n\n“Can’t say I blame you, but like I said before you really should think about changing locations of where you sleep or move out entirely. This place was never the healthiest of environments…eh, I’m not going to tell you what you should do with your life, but take this pistol at least. Hell, given our family’s dysfunction you should have one anyway. Take care okay?”\n\nYou take the gun and make your way back up the ladder and out the bunker. Moon Shadow and Tommy are now both sleeping near the garden. You pass them and head back to the basement half expecting to be attacked, but of course that doesn’t happen.\n\nYou don’t sleep much for the next few days and when you do its on the living room sofa, which means you have to endure Kelly’s insults, but nothing worse than that. (She does notice that you carry a pistol around now though) Out of curiosity you go back to the tree with the secret entrance only to find it doesn’t exist anymore.\n\nTime passes and Ben comes up to the surface every once in awhile as usual, and you talk more in depth about things. Namely the “underworld”. He’s convinced more than ever that the government has something to do with them.\n\nEventually he says he has everything he needs down there now, and doesn’t expect to come to the surface again. He tells Moon Shadow to take Tommy away and go some place else for he cannot be the soul mate or father that is needed. He also tells you again that you should leave with them and hands you a bunch of money. He says it’s the last of his life savings from his “old life”.\n\nYou can’t see any reason to really stay. You’ve been on edge ever since you found out about the Chulocks, and you were looking for something to do with your life.\n\nSaying goodbye to Ben one last time, you, Moon Shadow, and Tommy move on to parts unknown where an unknown future awaits. But hopefully it won’t involve Chulocks.\n","page 133":"You decide you just don’t care enough to find Ben, you instead decide to play with Tommy as he seems starved for attention right now.\n\nYou take Tommy down to the basement to play, but now he seems more interested in your computer.\n\n“Puter! Better! Make better! Faster!” he says excitedly.\n“You saying you can upgrade my computer without me having to spend money?”\n“Make faster! Better! Puter!”\n\nYou take that as a yes and let him at it.\n\nAt first when you see Tommy ripping out wires and banging on the computer with a hammer he pulls out, you think you’ve made a horrible mistake. The computer looks entirely trashed in five minutes, but Tommy smiles and says.\n\n“Finished! Better now!”\n“I sure hope so…”\n\nYou hesitantly turn the computer on and try it out and Tommy has indeed succeeded. You computer runs a lot faster.\n\n“Hey thanks Tom…” you say, but then realize he’s wandered off again.\n\nYou shrug your shoulders and enjoy your upgraded computer. Looks like there will be even less of a reason to leave the basement now, though you know who to look for if you ever need it “made better” again.\n","page 135":"You were looking for something to do with your life, and you’ve come this far so…\n\n“Ben do you need some help fighting these things?”\n\nBen is taken back\n\n“Are you serious? Suzy, while I appreciate your willingness to help, I think this is a bit much for you. Maybe if you were Kelly it would be a different story. You don’t think Kelly would believe you if you told them what was going on down here do you?”\n\nThe pair of you laugh a little at that silly question.\n\n“Ben why don’t you just drag the bodies of one of them up here and show everyone?”\n“I thought about that, except it’s the damnedest thing. They fucking dissolve shortly after they get killed. I thought about catching one alive, but I doubt if I could do it myself and how am I going to drag one of those heavy things up a ladder while it’s kicking, biting, clawing and screeching at me in a net?”\n“Well…how about Peter?”\n“Peter? What the hell is he going to do? Dress up in lingerie and be bait?”\n\nYou laugh again.\n\n“As long as it isn’t in my clothes he can, but you are aware of his film aspirations aren’t you?”\n“I dunno I haven’t seen him lately, the last thing I remember was him playing with dolls.”\n“Well he’s been in love with filming every little thing he sees lately. Seems like he’d help film something like this so there was proof. I mean I suppose we could do it without him, but I figure he’s got some better connections, us being recluses and all.”\n“Hmm, maybe. Alright, get him down here. I won’t change the entrance again for awhile.”\n\nYou leave the bunker and go to Peter who is predictably filming unimportant shit around the house. Kevin thankfully seems to be in a corner nodding out from his recent heroin fix.\n\nPeter is surprisingly difficult to drag back to the bunker. He scoffs at the idea that you know what would be good material to record. But after promising him some of your pink underwear with the hearts on them, he agrees.\n\nYou and Peter head back to the bunker where Ben is in full battle mode. He tells you and Peter to stay behind him the whole time.\n\nYou follow Ben into the lower tunnel where more of those Chulocks are. The noise Ben makes attract them.\n\nPeter is dumbstruck by what he sees through his camera and records the whole gruesome incident.\n\nAfterwards Peter shows the whole family the tape and unfortunately almost no one wants to help. Uncle Ed is intrigued, but says he needs to be moving on with other things and wishes you luck. Donna is terrified and runs away from home. Moonshadow doesn’t approve of your willingness to destroy living beings and also leaves with Tommy.\n\nAs for Dad he’s so drunk he just thinks you guys are watching a horror movie.\n\nFortunately Kelly who practically sees herself as one of the “defenders” of the McCray household is willing to help out and you all take the fight to the Chulocks.\n\nAll goes well for awhile. The family that’s left is focused on goal of battling the Chulocks. It’s probably the closest all of you have been in….well ever.\n\nThe problem lies with the arrangement. Ben is still doing most of fighting. Kelly is still the main bread winner of the house and as such can’t really do any fighting (Indeed she does enough of that at her jobs!) Peter is almost more of a hindrance. He’s so eager to get more footage of the creatures; Ben has to bail his ass out most of the time. As for you, well you try, and you do alright, but ultimately it’s going to take more people to wipe out all the Chulocks as the deeper you go the more of them there are and there doesn’t seem to be an end to them.\n\nThen it all starts to break down. You begin to suggest reinforcing the bunker with thick concrete and steel so that the Chulocks can’t enter anymore. You figure that they’ll probably dig elsewhere for better picking. Ben argues that you need to exterminate all of them. Peter agrees, but his reasons are different than Ben’s. Kelly says she doesn’t give a shit, just follow through with a plan.\n\nSo extermination it is. During the discussion Peter says he can’t wait to present this to the world. You’re actually surprised he hasn’t been uploading it to the internet in sequences, but he states he wants the whole “epic” before unleashing this masterpiece in its entirety.\n\nThis causes an argument with Ben who has never been fond of the idea of showing this to the world since he’s starting to really believe that the government is behind the Chulocks. Peter says if they are then this would be a good way to expose them.\n\nThe final foray isn’t pretty. You, Ben and Peter descend down as usual. The initial attack goes well. Then the next. And then the next. In fact you’re doing very well, a little too well.\n\nEventually you go the deepest you’ve ever been and find the largest group of Chulocks ever. Ben wastes no time and starts throw grenades. Explosions occur and body parts start to fly. Unfortunately being underground this isn’t the best place for explosions.\n\nAll three of you hightail it out of the area. Peter trips on something and falls. He cries out for you and Ben. You’re about to go back for him, but Ben roughly pushes you forward and says he’s done for and that you have to move.\n\nYou get the very real impression, Ben wanted him to die.\n\nThe collapsing tunnel is followed by an ambush. Apparently the Chulocks were a lot smarter than you thought and dug their own hidden passages and waited for you to be in so deep in their home that you wouldn’t be able to escape effectively.\n\nBen fights valiantly, but the sheer number of them take him down. You see him gruesomely ripped to shreds before your eyes. Your fate is probably less pleasant.\n\nThe Chulocks apparently aren’t just fond of breeding with each other, but are attracted to your “scent” as well. Your clothing is ripped off and you are forced to the ground, beaten, bloody and ultimately violated several times.\n\nThe terror and pain is so great that you actually pass out. For a couple days you’re in those tunnels in a barely conscious state. You don’t come to until several figures in hazmat suits surround you.\n\n“Sir we’ve got them all, found this camcorder too.”\n“Good. So has the house been exterminated too?”\n“Yes, only two inside. We’ll be tracking the others down from this family soon.”\n“Hey this one’s still breathing. Christ, do you think they did what I THINK they did to her?”\n“Well it would explain why they didn’t kill her. Better take her back to the lab for examination. Should be interesting to say the least. Alright boys let’s move out.”\n\nYou are whisked away to a top secret lab. Your nine month stay is not a pleasant one and ultimately fatal when you give birth.\n","page 139":"Well you’d be lying if you weren’t a bit curious. Besides, Moon Shadow seems caring enough to make your first time a pleasant one.\n\n“Well okay, I guess let’s go do it back to my basement.” you say.\n“Do it in the basement? That’s so tawdry! No, we are going to embrace underneath the sky so that nature may witness it.”\n“Uh…out here? But someone might see us!”\n“So? We can’t be ashamed to express our desires…here let me relax you.”\n\nAt this point Moon Shadow crawls over to you and kisses you on the lips gently. Soon she has you lying on the grass as you both make out. Her tongue explores every inch of your virgin body as both of your articles of clothing are shed away. You feel her tongue pleasure you in a way you’ve never felt before, and it’s true, this is better than a machine.\n\nWhile the pair of you are making sweet interracial lesbian love in the garden, and bringing a whole new meaning to term ebony and ivory coming together in perfect harmony, Peter and his buddy Kevin stumble onto you.\n\n“HOLY SHIT DUDE!” Kevin shouts.\n“Shhh! Quick, get this on camera; we can use this for the romance scene. For some reason you heteros like watching the rug munching. Baffling to me, but I know it sells.” Peter says.\n\nYou and Moon Shadow hear them, but neither one of you care. The pair of you are enjoying each other too much right now. In fact after both of you are finished Moon Shadow is more than a little infatuated and you’re quite fond of her too. She decides that her true path was to meet you and to take you away from this dysfunctional place.\n\nYou and Moon Shadow end up running off together to live in a commune in the wilderness, where you and her grow your own food, make your own clothes and practice witchcraft. You two make the relationship “official” when you marry each other at the Sappho Fair and live happily ever after.\n","page 21":"Uh…no. That doesn’t happen! (Sicko!)\n\nInstead of THAT, you just beg you Mom harder for the money. Out of pity and to stop your whining, she gives you the money from her Swiss bank account and you buy the bomb shelter. You receive the location and keys soon afterwards\n\nSoon just before the nuclear bombs start dropping, you and your Mom head to the shelter where you remain safe and live for years. Over the years naturally you and Mom become very close and begin to look at each other with greater intimacy and fall in love until one day…\n\n(Okay, so it DID happen, but it was for love, not money!)\n\nEventually you and your Mom emerge from the bomb shelter and repopulate the Earth with your mutant children and found an empire that brings order to this hostile wasteland.\n","page 24":"You enter the jungle. You appreciate the beauty that is the lush green jungle. This really is a nice island you think. However the cannibals on the island think it’s pretty nice too. In fact you made it even nicer for them; nothing tastes better to them than virgin flesh…\n\nThey hunt you, trap you, kill you and eat you.\n(Not necessarily in that order!)\n\nThey end up selling your skull on Ebay for $500, which they use to build a new menstrual hut.\n","page 25":"You walk along the shore, marveling at the fact this island is made completely out of Styrofoam and held together by hemp.\n\nIn your wonder, you begin to inspect the hemp ropes which are holding the pieces of Styrofoam together.\n\nIn your curiosity you begin to pick at a frayed rope…\n\nAnd in your stupidity, you’ve just unraveled the entire island!\n\nWell so much for renting this place, you attempt to paddle your way back to shore on a piece of Styrofoam, but you’re eaten by a very large seagull flying overhead.\n\nFortunately it swallowed you whole, but its digestive juices are going to make quick work of you if you don’t do something to escape, so you figure fleeing through its asshole is the best way to do this.\n\nFighting through the intestinal tract of the seagull to get to the “exit”, might sound like a novel idea, but it does have its consequences. First of all you’re a mile above the earth and over the water. So assuming you managed to survive the fall out of the bird’s rectum, you’d still have to contend with minor problem of drowning and sharks.\n\nSecond, you’ve done quite a bit of damage to the bird itself by crawling around in it; in fact you’ve ruptured and punctured some vital organs. It’s dying and now falling at a terrific speed.\n","page 28":"You take a running push up against the seagull’s slowly beating heart, killing it instantly, but you knocked it just enough so its body would crash on land.\n\nAnd it crashes in a spectacular bloody fashion, fortunately you used its liver as a cushion to survive the fall, you remain unharmed and in desperate need of a bath. You head home with 20 hungry cats following close behind.\n","page 27":"Well you jump out and survive the fall, and since you do know how to swim pretty well, you also survive the drowning.\n\nHowever you don’t survive the sharks…\n","page 20":"You grab your Limited Edition Red Ryder BB Gun and attempt to threaten mom in a less than effective manner. She doesn’t know whether to slap you or laugh at you at this point.\n\n”Boy, I hope you’ve been doing some good drugs to excuse this behavior because I’m this close to throwing your ass out, you’re lucky I haven’t done it sooner.” She replies.\n“Mom, if you know what’s good for you, you better gimme what I want! The end is coming soon and I need that money to save us!” you say still pointing your gun at her.\n\nYour Mom is silent for a moment and then speaks.\n\n“Well since you put it that way…”\n\nMom wasn’t in the marines to sit around and look pretty. She easily disarms you, punches you in both eyes, kicks you in the nuts three times and throws you out of the house!\n\nAs you lay in the gutter pondering your poor judgment, you think “The joke’s on her, here come the bombs now!”\n\nYou and 3/4ths of the Earth’s population are vaporized in a nuclear fireball death.\n","page 0":"Ah the basement. The refuge of all who refuse to move out of the house for whatever reason.\n\nSome of them are dreamers who just can’t fit into proper society.\n\nSome of them have potential, but due to personality quirks fame has escaped them.\n\nAnd finally 99% of them are just downright pathetic losers that just fail at life.\n\nSo choose one of these basement dwellers and enjoy the desperation and horror of their tales! You may come to find that they are just like you. In fact chances are, you’ll think someone wrote a biography about you!\n","page 140":"“Sorry Shadow girl, but I think I’m straight.”\n“How do you know, if you’ve never done anything?”\n“Well, I suppose I don’t, but I do know I don’t really have any desire to roll around in the grass with you. Sorry. Hope everything works out for you.”\n\nMoon Shadow looks very upset, so you leave her alone. In fact you decide to head back to the basement and continue your hermitage; you’ve had more than enough “adventure” for one day. Still you don’t need to be completely alone.\n\n“Well looks like it’s just you and me again, old friend.” You say pulling out your vibrator.\n","page 143":"This is a little strange, but you have no reason to think that your Dad is going to do anything weird to you. Maybe it’s just a piece of jewelry or something. I mean you’re his daughter for Christ’s sake.\n\nSure he might’ve been an absentee father and he’s a drunk, but do you really think he’d be so overcome with grief that he’d actually be trying to lure you into the bedroom so that in his twisted mind he could have sex with Mom again?\n\n“What exactly is it that you want to show me?” you ask.\n“Come with me, it’s in the bedroom.” He beckons.\n“Can’t you bring it out here?”\n“Suzy, it’s very special. In fact I question on whether I should give it to you, not because you don’t deserve it, but because if your other sisters catch wind of it, they might get jealous. So when I give it to you, you can’t tell anyone. It’ll have to be our secret.”\n\nARE YOU SURE YOU WANT TO FOLLOW YOUR DAD?\n\nI’ll give you another chance to reconsider if you’re not entirely sure of his intentions.\n","page 169":"You wake up to another day in your sheltered little world.\n\n“Sheltered” is probably a little inaccurate, but you’re about as close as you can get in your dysfunctional family.\n\nYour upbringing for you and all your siblings, quite frankly sucked, and it made you very introverted and unmotivated. It’s probably why you’re over 18 and still living at home.\n\nYou’re a basement dweller.\n\nHowever we shouldn’t be too hard on you. Your other four siblings are also living at home along with a few other freeloading family members. You just happen to be living in the basement.\n\nFucked up parenting aside, you actually have potential, if you’d just break out of your shell. You aren’t unintelligent. You at least graduated high school, watch the learning/history channel and read weird shit on the internet all day.\n\nYou aren’t even unattractive, though your mom always drilled it into you and your sisters head that you were always to be “good girls”. It only really worked on you though; as a result you’ve never had a boyfriend. (Or girlfriend for that matter) You don’t even have that much contact with the world outside your house anymore. The world’s a dangerous place and you feel much safer in your house.\n\nAgain, this thinking of yours is misguided as being out of the house of your crazy ass family would probably be a lot safer. Of course you rarely even leave the basement nowadays anyway. Seems like your world is getting smaller with each passing day.\n\nOf course you could do something a little out of the ordinary today and try to change your lot in life.\n\nHow about it? Want to give it that old college try? (Even though you never went to college?)\n","page 168":"While maybe it’s not what you think, but your heightened suspicion based on reading countless incest stories on the internet, his odd behavior, loneliness and depression and the fact he said you took after your Mom…needless to say it’s understandable that you think something really wrong is going to happen.\n\n“Yeah…Hey Dad I just remembered I have to go get something. I’ll be back.”\n\nYour Dad doesn’t even reply he just stands there looking a little bewildered. You briskly head back to the basement and hope he doesn’t try to follow you. He doesn’t. In fact when you creep back upstairs a couple days later he’s passed out on the couch as usual. It would seem his attention turned back to booze which is perhaps where it should stay.\n\nWith this little example in mind, you come to the conclusion that changing things the way they are isn’t such a good idea and you rarely leave the basement ever again.\n","page 32":"You re-sell it as art. You list it as a great ornamental garden piece. Bio-degradable and good for the soil.\n\nYeah, you ALMOST believe that yourself. You do get a bid from some idiot though for $350, you figure you’ve made a large profit already, so you sell.\n\n“Ha Ha! What a sucker!” you think.\n\nWell think again toilet boy, turns out it was more valuable than you thought! It was the same toilet paper used by Elvis the day he died on the toilet! The “idiot” sells it back to Graceland for millions, and spends it on cars, girls and drugs.\n\nYou spend your $350 on more used toilet paper in the misguided attempt to get someone else’s famous toilet paper, but it turns out to be only Pat Boone’s and is worthless.\n","page 35":"You cautiously enter the building, but not before you take your Limited Edition Red Rider BB Gun with you.\n\nNothing!\n\nThere\u0027s absolutely nothing in here! No illegal underground sex club, no \"Area 51\" like facility. Nothing.\n\nYou can\u0027t help being slightly disappointed; well at least you don\u0027t have to worry though, its big enough to hold all your shit.\n\nYou go back to your car and proceed to gather your belongings. You kick the door open and are surprised by what you see!\n\nYou see a jungle like area, with a primitive village inside! There ARE some natives roaming around, but they haven\u0027t noticed you yet. They may or may not be friendly.\n\nThis is fuckin\u0027 bizarre to say the least!\n","page 37":"You quickly close the door and try to piece together what the fuck just happened!\n\nYou don\u0027t have as much time as you like though. Those wolves you heard earlier, must\u0027ve caught your scent, because there\u0027s a pack of them on a nearby hill. The leader is jet black, has red eyes and has gotta be a mutant of some sort because he\u0027s got six legs and is fuckin\u0027 HUGE!\nHe sees you and howls an unearthly howl calling his fellows after you.\n\nThey\u0027ll be upon you soon and you\u0027re not gonna make it to your car in time.\n","page 36":"You inspect the outside, but there\u0027s nothing unusual. It’s just concrete, no windows, or other doors at all.\n\nYou make your way back to the front of the building and the door is gone! You could\u0027ve sworn it was right there! You search and search, but to no avail. It’s just solid concrete now. You\u0027re search more, but you see some wolves up on a nearby hill that look very dangerous, so you decide to leave and come back tomorrow.\n\nWhen you come back, the entire building is gone! There\u0027s no trace of it. You can\u0027t figure it out! This WAS the right location. This is very strange. Maybe you made a mistake and need to travel further up the road.\n","page 39":"You\u0027d rather take your chances with some natives than these things! At least the primitives were human! (Well you assume they were)\n\nYou rush inside and slam the door shut, locking it. The jungle and village are gone, whatever you saw before will remain a mystery because there\u0027s no trace of it now.\nYou wonder if it was some acid flashback you had.\n\nIt’s possible; you have done the stuff in the past. Maybe this is all just the flashback of a bad trip.\n\nOf course the scratching at the door and inhuman noises outside sound pretty real...\n\nBad trip or no, there\u0027s no point in taking fuckin\u0027 chances! You stand in the center of the room and watch the door, as the banging gets more intense.\nYou prepare yourself, holding your BB Gun at the door and taking out your limited edition Charles Manson butcher Knife.\n\nYou stand ready, as the door looks like its going to come off its hinges, but then the noise stops and you hear the wolves padding off.\n\nYou breathe a little easier, but only for a moment. You look in utter horror as you see the alpha wolf (That would be the mutant, in case you weren\u0027t paying attention earlier) materialize out of one of the corners of the building.\n\nIt looks at you with absolute hatred and hunger.\n\nIf this IS an acid flashback, it’s a REALLY bad one!\n","page 38":"You enter the village, taking your BB gun with you and some of your other stuff.\n\nThe villagers see you, but don\u0027t attack. They\u0027re more curious than anything, especially with all the wonderful things you\u0027re carrying, suddenly you got a million hands grabbing at you.\n\nYou let them take the stuff, which they seem pretty pleased about. They give you some precious gems in return! You tell them, you have more gifts for them. You run out to your car, get more stuff and give it to them. This earns you more gems AND a chance to sleep with the chieftain’s twin bisexual daughters!\n\nYou fuckin\u0027 rule!\n\nIn fact you rule so much, they think of you as some kind of god. This isn\u0027t as fortunate as you might think...\n\nIt seems they want to EAT you, and become one with their god. They believe since you are a supernatural being, killing your body will be of minor consequence to you. Nothing could be further from the truth!\n\nGrabbing your clothes you begin running butt ass naked through the jungle with the entire tribe chasing you, whooping it up. They think this is a fuckin\u0027 test!\n","page 31":"You really can’t see anyone buying your shitty toilet paper; you’re still not sure why you wanted to buy it so bad yourself. Perhaps you have toilet training issues, but this isn’t about your screwed up childhood, this is about how you wasted your money! Or have you?\n\nUpon closer inspection you realize that this is the genuine toilet paper of Elvis! You can tell by the wiping signature! You sell it back to Graceland for millions! You then proceed to buy up other famous used toilet paper and selling them, making even more millions!\n\nFinally you decide to get out of the business and retire to your bomb shelter on your very own Styrofoam island where you live comfortably for the rest of your life.\n\nAnd perhaps when you die, YOUR toilet paper will sell for millions.\n","page 158":"Donna’s outburst has made you realize that she’s absolutely right. You do hide out in the basement from the real world because you’re scared of getting hurt.\n\nYou ponder several times on whether or not to go back to Julie’s and finally you do.\n\nWhen you get there, a few more people have arrived. Most of Donna’s friends are already talking to various guys. No sign of Donna or Julie though. You ask where they are and someone dismissively says her bedroom.\n\nYour heart sinks when you hear this. You can’t believe you were briefly swayed by Donna’s self-righteous speech! Here you were thinking that maybe she was right, and what happens? She’s fucking Julie! You’re just glad you didn’t allow yourself to get too emotionally involved to get hurt, but you are mad and fully intend on giving the both of them a piece of your mind!\n\nYou quickly make your way to Julie’s bedroom and throw open the door.\n\n“JULIE! DONNA! ...Oh.”\n\nYou see Donna and Julie sitting a respectable distance from each other, they both look in your direction with surprise on their face. Still, you maintain your suspicion.\n\n“…what’re you doing here Donna?”\n“I was trying to console Julie, by telling her that you didn’t mean to be a bitch, it was just you didn’t know how to react to human emotions. And what’re you doing here storming in like that…wait. YOU thought me and Julie were in here having sex didn’t you?!”\n\nYou sputter and answer.\n\n“Well…I…”\n“Yes you did! So were you jealous or something?” Donna asks.\n“NO! I was just…look. I took what you told me into consideration I decide you might be right. So I came back here, and when someone told me you and Julie were in the bedroom together, I just sort of got a little crazy.”\n“Jeez, Suzy I know you think I’m slutty, but I wouldn’t have rebounded with your sister!” Julie sniffles still wiping her eyes.\n“Yeah, I would’ve thought by now that you knew I kept my sluttiness to just guys. No offense.” Donna adds with smirk on her face.\n\nYou sit down coming to grips with all that has gone on within the last few moments. Donna at this point decides to leave.\n\n“I think the both of you have a lot to talk about, so I’m going back to the party.”\n\nJulie turns to you, still wiping her eyes.\n\n“So, you came back.”\n“Yeah, I came back.”\n“Not to break my heart again I hope.”\n“Alright Julie let’s not be overly dramatic. Look, I suppose on some level I might like you. I’ve never just considered us together like that before, but Donna said some things that sort of ring true. However, that doesn’t mean I’m throwing all my beliefs out the window. If we do this, I mean if you’re REALLY this serious about us. I need you promise me that from here on out, that I’M the ONLY one.”\n\nJulie walks over to you and grabs your hand tightly.\n\n“You will be. I swear, I’ll change for you, because I love you.”\n\nAt this point Julie moves in to kiss you again, but this time you don’t push her away. The pair of you embrace and begin to remove each other clothes. For the first time you don’t ponder getting hurt or anything like that, you just live in the moment.\n\nJulie’s naked body lies on top of yours. You feel the warmth of her and enjoy her tongue which first explores your breasts and eventually your clit. You then feel her fingers enter inside you. Your back arches in excitement as she proceeds to bring you closer to a climax.\n\nYou don’t get a chance to return the favor because when Julie finally causes you to have an orgasm you soon fall asleep completely satisfied.\n\nA couple hours later you feel something completely different. Something going inside you. You open your eyes and see a teenage guy on top of you. He’s a little shocked when you scream, which is good because it gives you enough time to push him off of you and roll of the bed. You pick up a nearby lamp ready to throw it if necessary.\n\n“Whoa whoa whoa! No need for that! I thought you were passed out!” The teenager explains.\n“Passed out? And that gave you the right to try to rape me?”\n“Hey it’s not rape! I wasn’t hitting you or forcing you or anything.” He replies, totally oblivious to the fact that what he was doing was wrong.\n\nYou refuse to argue with this teenage idiot and chase him with the lamp until he runs out the bedroom door. You get dressed as quickly as you can to find Julie. From the sound of the music it’s apparent that the party is now in full swing.\n\nYou don’t really want to think it, but you know damn well what’s going to happen next.\n\nYou leave the bedroom and ask where Julie is; various people say they don’t know. While fighting your way through the crowd you bump into Donna.\n\n“Hey, oh uh…”\n“Donna, where’s Julie?”\n“…Suzy maybe you were right…”\n“Donna, where the fuck is Julie?”\n“Suzy you don’t really want to see…let’s just go home.”\n“Don’t tell me what I don’t want to see. I’m a big girl, now where is Julie?”\n“…she’s in the backyard…I’m sorry…”\n\nYou make your way to the backyard and that’s when you see Julie. She’s engaging in her favorite past time of blowing one guy while another rails her from behind. You step up past the on looking crowd. Julie sees you out the corner of her eye and you get the impression she’d try to explain if she didn’t have a dick in her mouth.\n\n“It’s alright Julie, I know you’re real busy right now and can’t talk so just listen. I don’t blame you. I allowed myself to be temporarily swayed. Actually it’s a good thing this happened so soon, I didn’t get too hurt and it just proves I was right all along. Besides, I guess I can thank you for the sex at least. I’m sure its experience that we’ll both remember, because it’s not going to happen again. Don’t contact me again for anything. Goodbye Julie.”\n\nYou walk away and a few seconds later you her Julie in the background calling for you, but you quickly lose her in the crowd.\n\nYou head home and back to your basement. It’s odd, but you aren’t really upset by this whole ordeal. True, you are a little disappointed, because on some level maybe you wanted it to go well, but now that it failed so spectacularly you don’t really care. If anything you don’t ever have to put up with Julie’s chaotic cries for help ever again.\n\nMaybe that’s why you aren’t upset. You managed to cut off yet another link to the outside world which gives even more of an excuse to remain in your basement.\n\nBut you’ve had enough of thinking about this for tonight; you go to sleep even more secure in the fact that your way of “life” is the correct one.\n","page 157":"You head back home and don’t give Donna’s self-righteous speech another thought. She hasn’t known Julie as long or even as well as you have. She thinks she knows everything and is probably defending her because she has more in common with Julie’s “lifestyle” than yours. Hell, they ARE one of the same.\n\nYou know Julie, she’ll get over this “crush” just like she has with other past “relationships” namely through partying, fucking and drinking. She’ll probably be trying to convince you to go to another party next month and everything will be back to normal.\n\nStill, part of you does wonder if Julie did really “love” you as much as she claimed. You wonder if she would’ve changed had you given in to her advances. You shake your head at such thoughts though.\n\nYou head back home and to the comfort of your basement. Perhaps you are playing it safe, but in your opinion, it’s better to be safe than sorry.\n","page 44":"It occurs to you, you got lucky with the knife, you need to use one the other many objects you brought with you before hell hounds were on your trail.\n\nYou hastily look into your pockets for something and find some marbles. You throw them on the ground in the hopes that the Beast will slip up.\n\nThe Beast crushes the marbles underfoot as it advances! You just barely manage to dive out of the way, as it tries to plow into you. The Beast cracks its head into the solid concrete wall and emits a painful howl. Now\u0027s your chance!\n\nYou jump on the back of the Beast and start stabbing it in the back! It howls even more and attempts to get you off of it. You are relentless! You drive the knife in and grab hold of its spine! You pull part of it out! The Beast collapses unable to move, but still wailing. You finish it off by plunging the knife into its black heart.\n\nYou\u0027re winded, you\u0027re hot, you\u0027re sweaty and you’re covered in blood. And now it appears the other wolves have finally come through the now shattered door. The wolves all seem to whimper as they sense the power of the Beast is now within you. You look at the pack, and YOU are its master now. And you feel the urge to hunt...\n\nYou have embarked on a very strange new path.\n","page 43":"Your determination and bravery are admirable. Your intelligence though is questionable!\n\nThe beast charges at you and smashes into your body as you attempt to stab it in the eye. You feel your ribs break as this blow knocks you to the ground. You feel completely out of breath. As you gasp for air, the Beast sinks its razor teeth into one of your legs and rips it off, swallowing the limb in one gulp.\n\nYou go into shock as you watch blood spraying from your stump. It’s just as well because the Beast\u0027s next move is biting your head off.\n","page 49":"As you run you attempt to avoid protruding branches that could severely damage your tender bits.\n\nAs you get to the shore you trip over a piece of hemp rope. Sonofabitch! This is that Styrofoam Island! As the natives close in, you get an idea to start picking at the hemp rope. It works! You have successfully unraveled the piece that you were standing on from the rest of the island.\n\nThe natives shout something at you in an indecipherable language (Which is odd since they were speaking perfect English when you were friends with them) as you make your good escape on the drifting Styrofoam. You put your clothes back on and wait to reach the mainland.\n\nThe tribe suffers greatly however. They think they\u0027ve failed a great test and commit ritualistic mass suicide.\n","page 40":"Your BB Gun is NOT a suitable weapon! Especially not against Fenris over there. You manage to run back into the building and decide to take your chances with the village. At least they\u0027re human.\n\nYou run back inside, but the village and jungle have been replaced by a battlefield. Apparently, you\u0027re no longer in the building at all anymore. A mortar shell hits close by, when suddenly you\u0027re pulled in by some woman in a fox hole. She asks you what the hell you are doing. Her uniform isn\u0027t recognizable; in fact the surroundings are even a little strange looking. The sky\u0027s green for one thing.\n\nYou attempt to explain yourself, but she doesn\u0027t seem too surprised and just hands you a real weapon and mutters something to herself about how the Kragan\u0027s time/dimension experiments have fucked everything up. You ask her what\u0027s going on, but she says she\u0027ll explain everything later if you both get out of your current situation alive. She starts firing at a strange looking creature and tells you to move it. You both run as fast as you can as you see strange looking planes flying overhead which proceed to bomb the hell out of the enemy behind you.\n\nYou both dive for cover again as the explosion occurs. The woman surprisingly laughs at all of this. You on the hand are a nervous wreck. She notices this and kisses you.\n\nYou don\u0027t know what the hell\u0027s going on, but this isn\u0027t ALL bad. After she\u0027s done, she says you have to get moving again. You ask her what that was all about.\n\n\"Well you\u0027re cute and when you face death all the time, you gotta seize the moment sometimes. Plus I think you need something good to happen to you after walking into that Gray building.\"\n\nYou look surprised; you never got around to telling her that.\n\n\"Let me guess, Gray building on Ebay right?\"\n\nLooks like you just stepped into something REALLY weird, but at least you got a new girlfriend out of it.\n","page 42":"You empty your mind, close your eyes and completely disbelieve that this THING could exist as it comes charging at you.\n\nYou feel its hot breath hit your face, and expect your death, but nothing happens.\n\nYou slowly open your eyes, and there\u0027s no sign of the Beast. In fact you\u0027re not even in the building anymore. You\u0027re by your car.\n\nYou hear some wolves howling in the distance.\nYou look at the Gray building. There\u0027s only one door and no windows. Its pretty ominious looking actually. Like a place thed\u0027s do snuff films or secret government experiments. You cautiously look in and find nothing. No illegal sex club or \"Area 51\" like area, you\u0027re a bit disappointed actually. You go back to your car and pick up some of your shit to take inside. You open the door and see a primitive jungle and village! You also see some natives, who may or may not be friendly. You close the door and try to figure out what the fuck just happened, you don\u0027t have long though. Those wolves you heard earlier must\u0027ve caught your scent. The leader must be some kind of mutant since he\u0027s got red eyes, six legs and is fuckin HUGE! As they decend upon you, you quickly run back into the building and decide to take your chances with the villagers, at least they\u0027re human! When you get inside though the village is gone. There\u0027s no trace of it. The wolves begin to scratch and howl outside the door. You prepare yourself with your BB Gun and Limited Edition Charles Manson butcher knife. Suddenly the noises stop, but you don\u0027t have long to rejoice, as the mutant wolf suddenly materializes from one of the corners of the building!\n\nIt looks at you in absolute hatred and hunger.\n\nYou empty your mind, close your eyes and completely disbelieve that this THING could exist, as it comes charging at you.\n\nYou feel its hot breath hit your face, and expect your death, but nothing happens.\n\nYou slowly open your eyes, and there\u0027s no sign of the Beast. In fact you\u0027re not even in the building anymore. You\u0027re by your car.\n\nYou hear some wolves howling in the distance...\n","page 41":"You begin to fire, but you BB Gun has absolutely no effect on the thing. It reaches you in no time, but not before you smash it in the face with the gun, breaking it into pieces. This temporarily stuns the beast, which allows you to take your knife and start stabbing the shit out of it. It howls and knocks you to the ground with one paw, reeling back from its bloody wound. It sprints to the other side of the building but looks to be preparing for another assault.\n\nYou actually hope it does. You\u0027ve never felt so alive...\n","page 161":"Ed’s got you so scared that you don’t dare disobey him. For the next few days you spend your time in the basement as usual hoping that he forgets about you. You barely sleep and you’re on edge constantly expecting him to come in to get you. You get sick many times.\n\nExhausted from fear you eventually give in and fall into a deep sleep…\n\n“Wake up Suzy. It’s time.” You hear Ed’s unpleasant voice say.\n\nAs much as you’ve been dreading this moment, you oddly don’t feel quite as sick anymore.\n\n“I’m sorry you had to go through what you did. I figured that would happen so that’s why I let it run its course. I think you’re sufficiently drained of emotion to the point where you’ll be able to pull this off without the chance of hysterics now. I hope you don’t mind me dropping in like this…hmm nice little hide away you got here…very dark and isolated…nice.”\n\nUncle Ed continues his inspection of your “domain” as you slowly get up. You know he’s getting a kick out of this. You intruded on his “domain” and now he’s returning the favor.\n\n“Uncle Ed?”\n“Hmm?”\n“I gotta get dressed.”\n“Oh. Please don’t let me stop you. In fact I brought you some more appropriate clothing. Wear this.”\n\nYour uncle throws you some clothing at you. It’s a mini skirt and tight top and basically clothing your sister Donna would wear.\n\n“I took the liberty of getting you some more appropriate clothing. I’m pretty sure I got all the bloodstains out.”\n\nYou look at this “hookerwear” in disbelief.\n\n“You expect me to wear this stuff?”\n“I’m afraid it’ll be necessary for you to better lure Bobby and Pa Morningstar. They like to hang out by the park. That’s where we’re going. Put those on, because while you may have the morals of a saint, you have the body of a harlot… within every virgin lies a fucking slut…whore…”\n\nEd is successfully making you feel scared again. When he realizes what he’s doing he apologizes.\n\n“…I’m sorry Suzy. I get in another place sometimes. I guess you’ll want some privacy. I’ll wait outside.”\n\nUncle Ed goes upstairs to wait and you try to psyche yourself up for this ordeal. You look at the clothing and put it on which makes you feel really vulnerable. Your legs are exposed, your stomach isn’t covered. You feel almost naked.\n\nWhen you exit the house it’s twilight. You didn’t realize you slept so long. Ed motions you over to his van where he beeps his horn. You feel like a hooker going to be picked up. You don’t say a word when you get in the van.\n\n“Ah yes, you almost look the part now. But let’s do one more thing.” Ed says and then pulls something out of his jacket. It’s lipstick.\n\nUncle Ed gets close to apply it on you. Again you don’t say anything. It doesn’t take long, and then he shows you what you look like in a mirror. He’s done a good job. Probably better than you could have considering you’ve never worn any make up of any kind. It would appear that Uncle Ed’s done this before.\n\n“Wish I had some eye liner, but we don’t have time for all that. Your eyes are pretty enough without it though. You’re a very lucky girl to be blessed with such natural beauty.” Ed says as he starts up the van.\n\nThe drive to the park is uneventful. When you get near there, Ed stops the van to brief you.\n\n“Alright, I don’t want to get too close yet, but the father and son duo should be sitting at a picnic table over near that lightly wooded area way over there. I’ve been keeping up with their routines a bit, so they should be there. Now that area is a little secluded, but not enough, I need you to actually lure them into the woods. I’ll take care of the rest. After we do this, me and you will be even and I’ll be able to trust you completely.”\n“What if I can’t lure them into the woods? What if they try to kill me?”\n“They won’t try to kill you. They don’t do it that way. And I have faith that you’ll be able to lure them. No man can resist a whore…”\n\nSensing your uncle is going to his dark place again, you cut the conversation short.\n\n“Okay, I’m leaving…” you say quickly getting out of the van and nearly running off. You’re so glad to be out of his presence.\n\nYou look around the park which is still fairly populated at this time, though most of the families are going home now. You’re drawing some looks from several teenage guys though. You get a lot of comments as well. You aren’t used to it so now you’re afraid of getting assaulted by some horny teenagers. But like most teenage guys, they do a lot of barking, but don’t actually do anything.\n\nEventually you reach the area your uncle was talking about. You see a young man sitting at a table by himself, you know that’s Bobby having seen him a few time before in the neighborhood. No sign of his father though. No sign of your uncle either, but you sense he’s somewhere nearby.\n\nAs you approach Bobby you see that he must be preoccupied because he isn’t even looking up. It’s like he’s deep in thought.\n\nSearching your memory of how you’ve seen it done in movies and TV, you try your best to be seductive.\n\n“Hello.” Is all you can think of.\n\nBobby looks up.\n\n“Erm, hello? Do I know you?”\n“You might. I’m Suzy. I live down the street from you.”\n“Oh yeah…I haven’t seen you for quite awhile.”\n“Well, I’m around, I just don’t get out much.”\n“Hm. So what brings you out here?”\n“Oh sometimes I like to take walks by myself. You know clear my head from family troubles.”\n“Well I can understand all about family trouble, let me tell you. But I’ve never seen you here before. I come here quite a bit and I can honestly say I would remember you walking around.” Bobby says looking you up and down referring to your state of dress.\n\nYou get a little shy, and try to think of an excuse.\n\n“Oh this get up? Well, I don’t usually dress like this, these are my sister’s clothes. I lost a bet with her. It’s a bit complicated.”\n“Ah, say no more. Family again. (Sigh)”\n\nThat’s the second time Bobby’s mentioned family in a distracted manner again, so you decide to follow up on it before he presses you for more information.\n\n“Is there something wrong?” you ask as you sit down.\n\nBobby looks hesitant to tell you at first, but when you smile at him from across the table, he lets down whatever guard he might’ve had up.\n\n“It’s my Dad. He’s so demanding. I come from a very large family and just because I’m the oldest son I have all this extra responsibility! I’m expected to keep all my siblings in line, I’m supposed to take over when Dad’s gone. I’m supposed to do all this shit and it’s always been that way all my life and it sucks! Tiamat forbid that I get to do some stuff by myself.”\n“Uh…Tiamat?” you question, but Bobby doesn’t stop his rant to explain that oddity.\n“My Dad still treats me like a little kid sometimes. I have to go with him to do all these important things and he takes every opportunity to point out all my shortcomings, without listening to any of my ideas! We were supposed to do something to today and instead of doing it, we spent the whole day arguing. He stormed off and told me I better get my shit together by the time he comes back. In fact he left not too long after you showed up. If he saw me talking to you, he’d probably accuse me of not paying attention to my so called duties.”\n“Is your dad still here, where did he go?”\n“Yeah, I wouldn’t be fortunate enough for him to leave me alone that long. He went to go cool off in those woods over there…”\n\nYour heart begins to race quicker at that thought. If Pa Morningstar went into the woods then he might’ve already run into Uncle Ed. Things on your part are probably going to be a lot easier now.\n\nPart of you wants warn Bobby though since you sort of sympathize with him on some level.\n","page 162":"Wasting no time you decide to call the police. Uncle Ed cannot possibly clean up his place in time, especially not if he doesn’t know the police are being called.\n\nYou explain the situation to them, and they say they’ll send someone over right away and for you not to try to stop your uncle yourself.\n\nSoon the police arrive. Not just one but two cop cars. On your way to meet them you bump into Peter and Kevin who are filming something pointless as usual.\n\n“Suzy what’s going on?” Peter asks.\n“The cops are here, Uncle Ed’s a serial killer!”\n“HOLY SHIT! The cops? I gotta get outta here!” Kevin exclaims and runs off to hide somewhere in the house.\n“Hah! I always knew something was weird with him. I’m filming this shit.” Peter says taking the camera Kevin dropped.\n\nBefore you can get to the front door you hear a crash, shouting and the screeching of a vehicle followed by gun fire! Uncle Ed is escaping in his van! You rush outside just in time to see one cop car give chase and another officer calling for backup and paramedics for his partner who was run down.\n\nAfter the initial chaos has died down, the police question you and the rest of the family. They also take the opportunity to search the entire house when they find the body parts in Ed’s freezer.\n\nThis all doesn’t go over well for any of you.\n\nThey start out by questioning you, and you help out as much you can, but now you’re terrified that Ed is going to come back to kill you. You breakdown in the middle of it and have to be taken to a hospital. This fortunately allows you to miss most of the other “fun” that occurred…\n\nDad was half passed out, but when they tried to wake him he gets hostile and throws a punch at one of the cops. They cuff him and take him into custody.\n\nPeter attempts to make out like he discovered everything and asking if other news crews are going to be over. They dismiss him as the annoying fuck he is and tell him if he doesn’t get the camera out of their faces they’ll take him in for obstructing a police investigation. Naturally he cries about the Bill of Rights. They follow up with taking his camera away as evidence and throw him into the back of a police car right next to Dad.\n\nThey find Kevin hiding in a cupboard. They find a large quantity of drug on him and he gets a seat in the back of yet another police car.\n\nThe worst part comes when Ben has just happened to come up from his bunker to get some supplies. He thinks government agents finally come to get him and opens fire on them. The shoot out lasts a couple hours and doesn’t end until Ben is lying dead with several gunshots in him. This of course causes great outrage and sorrow from Moon Shadow and Tommy who see this happen before their eyes. They too are taken away.\n\nNeither one of your sisters were home at the time during this drama, but when Kelly finds out when she comes home later, she’s pissed. (Donna doesn’t find out until a couple days later since she was partying) She bails out Dad and Peter and blames you for everything. She comes to see you in the hospital and tells you that you that the house has been seized and that they’ll all have to find a new place to live! She also tells you that wherever it is they move to, you won’t be welcome back and that nobody wants to see you again for all the trouble you cause.\n\nYou try to explain your side, but none of them want to listen. It doesn’t matter that Uncle Ed was a serial killer, you disrupted the natural order of things in the house and everyone’s life has been made even worse because of it. Especially yours.\n\nAfter getting released from the hospital you’re now homeless. You can’t really think of any other ideas, so you call your friend Julie and ask if you can stay with her. Fortunately she says you can, but that you’ll have to get there yourself because she’s too busy with an orgy at the moment.\n\nUnfortunately you never make it.\n\nEven with the police having a manhunt, even with your heightened state of danger. Uncle Ed keeps his promise.\n\nYou don’t even hear him until he’s grabbed your mouth, dragged you into an alley and whispered into your ear.\n\n“My only regret is I won’t be able to take my time with you, traitorous bitch.”\n\nA razor sharp knife is run across your throat, allowing for a quick clean kill. Uncle Ed then leaves you to bleed out and die.\n","page 165":"It’s pointless, even if you did warn Bobby then what? You can’t count on him to help you and you’d be at Uncle Ed’s mercy. No, you need to go through with this.\n\nYou just hope you can convince Bobby to actually go into the woods. From the sound of it, he’s not to happy with his dad right now who’s supposed to be in the woods, so it wouldn’t be likely he’d follow you there to do anything sexual.\n\nYou decide to try a different approach.\n\n“Bobby. I know it might not be my place, but I think you should make up with your father.”\n“What?! You’re taking his side? Who the hell are you to tell me what to do?!” he snaps. “Hold on slow down, I sympathize with you. I really do. But remember he’s family.”\n\nBobby calms down and listens to you.\n\n“Sometimes family can be overbearing and annoying and all of that. Trust me I know. But like I said, they’re still family. And when it comes down to it, they’re the only ones who you can usually count on. There’s a bond there. A strong one that shouldn’t be easily broken over a silly argument. I’m sure deep down you dad cares about you.”\n\nBobby looks at you and nods.\n\n“Yeah…yeah…I suppose you’re right. My dad has always been there for me. For all of us. He must care, I mean I’m the next one to take his place in case anything happens to him. I guess he just wants the best for me. I need to go find him.”\n“You want me to come with you?”\n“Heh, no you’ve done enough. Besides I’m trying to make up with the old bastard, if he sees you, it might get complicated. I need to go alone. Thanks though. Maybe I’ll see you around sometime.” Bobby says quickly getting up to leave.\n“Yeah. Maybe. H…hey I’ll stay here though in case he comes out and you miss him okay?” you shout at Bobby, but he’s already entered the woods.\n\nYou wait at the table for awhile in the darkness. There isn’t a soul around. You continue to look into the woods waiting for someone to step out. Bobby, Uncle Ed, Pa Morningstar, anyone…\n\n“So you ready to go Suzy?” you hear Uncle Ed say as he puts a hand on your shoulder and scaring you again.\n“Oh shit! Fuck! You scared me!” you gasp. “Where the hell did you come from, I didn’t see anyone come out of the woods.\n“Oh I took the scenic route. You should be more alert though and look all around you so you don’t get anyone to sneak up on you again. Come on the van’s in the parking lot.”\n\nYou head towards the lot with Uncle Ed by your side the entire time. He’s pretty quiet on the way to the van. He’s not even staring at you anymore. Doesn’t make him any less creepy or dangerous though. In fact the trip back home in the van is pretty quiet as well half way through.\n\n“So, Suzy how did you manage to do that?” Ed suddenly asks.\n“Do what?”\n“Get those Morningstars to go into the woods, separately too I might add. Boy that made things a lot easier. Thanks. But I never saw you. In fact I thought you’d screwed up at first when I only saw Pa Morningstar there wandering around and so early.”\n“Well, he and his son had an argument. Pa stormed off into the woods to cool off, shortly before I even got there. So that’s why you bumped into him so quickly.”\n“Really? Guess that was a lucky break for you then. What about the son?”\n“I convinced Bobby to make up with his father, because it was important that family stick together no matter what. So he went into the woods to do so.”\n\nUncle Ed nods.\n\n“Well it didn’t go quite as planned, but it went easier than I expected. And more importantly I’m pretty sure I can trust you now. But not just because you’re an accomplice to murder now, but because of what you just said about it being important that family stick together. You really do believe that don’t you?”\n\nYou look at Ed, and it takes a lot of effort, but you convince yourself that you do.\n\n“Yes, I do.”\n\nEd nods again and doesn’t speak again until you get back home at which point he says one last thing to you before you get out of the van.\n\n“You’re a good girl Suzy. A very good girl. Your Mom would be proud. Hell, you didn’t even need to rely on your looks. You’re one of the rare ones. (Sigh) Wish things were different, y’know? But things are what they are. Guess I better leave. No sense in causing you distress. This isn’t the life for you. I’ll be out of here by morning.”\n\nEd starts to laugh as he gets out of the van.\n\n“Ha ha I just thought of something funny. I killed those two because they were encroaching on my territory, but now I’m leaving anyway. Oh well, guess it just wasn’t their night.”\n\nYou leave Ed to his morbid sense of humor and back to the “safety” of your basement. You don’t leave it for days. You swing from emotion to emotion. Guilt, fear, sickness, sorrow, etc. Eventually you leave to check the garage, because you just have to know if he really left, and he did. Apparently Moon Shadow and Tommy moved into the garage shortly after Ed left. The garage has been completely redecorated into a much “happier” place.\n\nIn time you learn to live with what you were involved in, but you become even more distant and introverted. You never leave the basement again.\n","page 164":"You can’t go through with this. You know your life is going to be in danger and that Pa Morningstar may very well already be dead, but you can’t actively be involved in killing anyone directly or indirectly.\n\nYour demeanor changes from one of feigned cheerfulness, to one of scared candor. You even take Bobby’s hand which shocks him a little.\n\n“Bobby, you opened up to me, so I’m going to open up to you. We need to go into that woods right now, because your dad might be in serious trouble.”\n“What?! What’re you talking about?”\n“There’s no time to explain, but my uncle is going to kill him!” you exclaim and get up trying to pull Bobby with you.\n\nBobby starts to move, but insists that you tell him in more detail of what is going on. You do in a very condensed fashion which causes him to pause.\n\n“So wait, you’re working with your uncle to kill me and my dad in the woods? And now you want ME to go in there?”\n“NO! I was bullied into helping my uncle, but I couldn’t do it that’s why I’m warning you now, so that you can save your dad!”\n\nBobby stops completely.\n“Why would I do that?”\n“What? Come on it may already be too late!”\n“So what if it is? Look Suzy, you don’t know my dad like I do. The guy has barely any fucking redeeming qualities and those he does have he barely shows most of the time. Fuck him.”\n“B…but he’s your father!”\n“What of it? Just because someone is related to you don’t mean anything if they’re complete assholes to you and treat you like shit your whole life. Hell he hasn’t even been the worst to me. He’s been a fucking abusive tyrant to my whole family. I’m sure all of them at some point have thought about killing him themselves. Shit, I know I have.”\n\nYou certainly didn’t expect this reaction. You don’t know what to do now, you start to cry.\n\n“Now what’s wrong with you?” Bobby asks.\n“I wish I could be that brave, but I’m so scared. Now that you know what’s going on you can avoid your fate. But I’m still in danger. My Uncle Ed is gonna (Sob!) kill me!”\n“Hey…Shhh…Hey…don’t cry. Don’t cry. Look you are brave. I mean it took courage to tip me off didn’t it? You went against your uncle’s threats and took a chance that I wouldn’t flip out and kill you myself right?”\n“(Sniff) I guess so.”\n“Look…your uncle is still expecting me right?”\n“Probably.”\n“Well let’s wait a minute or two, then I’ll go in the woods and I’ll take care of your uncle Ed.”\n\nAt this point Bobby lifts open his jacket and quickly displays a large knife of his own. It’s rather ornate from what little you see of it. “I’m prepared.” He says\n\nHe spends the next few minutes calming you down, but then begins to mumble some sort of prayers. You can’t make out most of them, but they certainly don’t sound Christian and you hear the name Tiamat a lot.\n\nAfter he finishes he turns to you and smiles.\n\n“Okay I’m going into the woods. YOU wait here. Now one of two things will happen. Either I’ll come out and your uncle will be dead. Or your uncle will come out and I’ll be dead, and you can still take credit for luring me into the woods. Just tell him you told me to make up with my dad or something. He should buy that, and you’ll be still be safe.”\n“What about your dad?” you ask.\n“My dad? He’s probably dead. If he was still alive he would’ve came out by now. Obviously Tiamat had forsaken him, if he was taken down by the likes of your uncle.”\n\nBobby makes his way into the woods.\n\nYou wait at the table for awhile in the darkness. There isn’t a soul around. You continue to look into the woods waiting for someone to step out. Bobby, Uncle Ed, Pa Morningstar, anyone…\n\nEventually someone does and it’s Bobby. He looks a little roughed up and there are bloodstains on his clothes. You can only guess that it wasn’t an easy kill.\n\n“Sheesh, that was intense. Your uncle might’ve killed me, if I hadn’t known he was lurking around. I think what caused him to go off his game plan was when I mentioned you told me that he was waiting. I think he wanted to yell at that point, because his calm killer demeanor turned into white hot rage. Still he never made a grand outburst, he just mumbled something about ripping you apart after he was done with me. Well we better get out of here. You need a ride home?”\n\nYou back off a little bit. As much as you didn’t want to be involved in Bobby’s murder, you’re not entirely trusting of him. You know for certain that he and his family are indeed cultists that sacrifice people to this Tiamat he’s mentioned a few times.\n\n“Uh…not that I don’t appreciate the offer, but maybe I should walk home.”\n“Walk? In that outfit and through this area? You’d be safer with me. I’m not going to do anything to you.”\n“How do I know you aren’t going to sacrifice me to Tiamat?”\n“…well I suppose you don’t. However, all I can say is that I’m in a better mood than I was, and that’s thanks mostly to you. I can now run the compound the way I want to and communicate to Tiamat directly as the new high priest. Plus you did warn me of your uncle and possibly saved my life. So I’d say you’re safe. I mean it’s not like you’re going to blab about any of this right?”\n\nBobby is smiling. He’s even a little playful, but you get the very real feeling he is warning you.\n\n“No, no of course I won’t.”\n“Good! I’m glad that’s settled then. Come on let’s go.”\n\nYou follow Bobby to his car and sit quietly. Bobby turns on the radio and begins humming happily to the heavy metal music playing. Halfway home he speaks to you directly.\n\n“So, you wanna go out sometime?” he asks.\n“What?!” you say in total surprise.\n“Do you wanna go out? I mean it seems like we got some stuff in common. And before all this went down it seemed like there was a spark there. At least I felt a little something. It’s why I told you about my dad, which was a major place of trust on my part given that you were a virtual stranger.”\n“Yeah, I suppose so.”\n“As you might guess my family isn’t much for outsiders. None of us gets out all that much. I was one of the luckier ones, being the eldest son and all, but I still had strict guidelines. Fucking your sister alleviates the tension so to speak, but really it doesn’t allow for a good future bloodline. Well that’s the way I see it anyway. So, how about it?”\n“Well, I dunno. I don’t get out much either. Though that’s by choice, not because anyone made me.”\n“Hah. Sounds like you were your own prisoner. Come on, let’s go out. It’ll be good for the both of us, you can tell me all about your obviously fucked up family on the date.”\n“I wouldn’t even know where to start.” You laugh.\n“See that’s the spirit! If it helps you don’t have to dress like that either.” Bobby points at your clothing.\n“I don’t normally wear this sort of thing.”\n“Yeah, I sort of figured that. You didn’t seem comfortable in it from the moment I saw you. Hell, if I had to guess. You’re still a virgin.”\n\nYou’re amazed at Bobby’s insight.\n\n“Is it THAT obvious? My Uncle Ed knew too when he roped me into this.”\n“Well it’s probably more obvious to us predatory types even if we don’t know that much about the person. Darkness is often drawn to purity. Don’t worry though; Tiamat doesn’t have a predisposition toward virgin blood. You’re still safe.”\n“Well lucky me.”\n\nBobby stops in front of your house. You didn’t realize you were already so close to home.\n\n“Here you are. See, nice and safe. So…do you want to go out sometime?”\n\nYou look at Bobby and its crazy that after all that’s happened tonight, you do feel a certain spark between you.\n\n“Okay what the hell. Come pick me up whenever you’re able I suppose. You know where I live and I never go anywhere so I’ll be here.”\n“Alright then, but first…”\n\nBobby quickly leans over and steals a quick kiss from you before you get out of the car.\n\nYour first kiss. You always wondered if it would happen. You feel completely giggly. He smiles in satisfaction.\n\n“See you soon!” he says and drives home. You head back to the basement nearly walking on air. A good thing came out of all this and you fall asleep with no problems for the first time in the past few days.\n\nThe wonderful dreams you have that night you know are just glimpse into the reality that is sure to come.\n","page 100":"You quickly snap to your senses. This She-Hulk fetish is just yet another way for you to avoid real women! You did that with anime, and now you’re doing it with this.\n\nPatricia helped you out and was kind and sweet to you when by all rights you should’ve been taken out to the woods and shot for being a useless waste of skin. You need a woman like that in your life.\n\nYou quickly stop jerking it to She-Hulk and call up your cousin Patricia.\n\n“Hello? Who is this?”\n“Hey Patricia, it’s me Brian! I want us to be together! I know I fucked up before, but it’s because I thought that obsessing over my underage cousin was unnatural! But now I’ve come to realize it wasn’t unnatural at all! It was perfectly normal! Shit, it was downright Biblical! I know you must’ve liked me on some level too, so how about it? Will you give us another chance…and uh…keep it a secret at least until you’re eighteen?”\n“Brian, this is Patricia’s mother, Evelyn.”\n\nOh fuck.\n\n“Uh…hi Aunt Evelyn. Wow, you sound just like Patricia…uh…um…”\n“Don’t even try to talk your way outta it Brian.”\n“Erm…uh…”\n“Stuttering isn’t much better. If it’ll clear your mind though, I’m not going to call the police on you. However, I can’t allow you to go out with Patricia.”\n“But…but I love her!”\n“Yeah, and I’m sure you would love for her to have your seven fingered, one eyed kids, but Patricia’s getting sent to a convent in the South Seas.”\n“What? Why?”\n“Why? Because me and her father are sick of her going off her meds and giving us fucking grief, that’s why! She’s a disobedient little whore, and we’ve had enough!”\n\nYou’re pretty floored by this revelation.\n\n“…but…well hey wait. Maybe you could marry her off to me, and I could keep an eye on her and show her love she desperately needs.”\n“YOU? Hah! And how’s that going to work out living in your mom’s basement? Christ I dunno how my sister even puts up with you. I would’ve sent you to a convent years ago. Besides, if we can’t control her, I doubt if you’d be able to. She’d have you so wrapped around her little finger you’d probably suck an AIDS ridden cock if she told you to. And while I’m sure it would still be the best thing that’s ever happened in your basement dwelling life, it ain’t happening. Goodbye.”\n\nWith that final telephone click, you fall to the floor in defeat. Your destiny is sealed and you return to the basement to wallow in 2-dimentional girls. Eventually you save up enough money to get a new computer and hooked up to the internet again and your relapse is complete. The only differences being that you still work at the comic shop and that you aren’t obsessed with anime anymore. (Though you still jack off to the occasional loli-con)\n\nA step up, I suppose but not much of one. The fact remains that you’re still a basement dwelling virgin and you remain one until you eventually die of a Twinkie overload which causes your artery clogged heart to explode.\n","page 103":"After years of watching anime and being dangerously close to either becoming a pedophile or a furry, (Or possibly a furry pedophile) you finally make a worthwhile decision. You grab your new anime DVDs and break them all! You then grab all your old ones and break them too!\n\nManga books all fucking burned! Comics too! Video games with anime graphics destroyed! You even break your computer just so you can’t be tempted by the internet! You’ve just destroyed your “social life” by doing that, but it’s worth it!\n\nNO MORE FUCKING ANIME!\n\nHoly shit you feel free! Seriously this is the first day of your new life and you’ve just made a break through here.\n\nBut don’t get too puffed up there fatty. The fact still remains that you’re a basement dwelling loser. You’re also going to experience withdrawals and the temptation to go back to anime will be there.\n\nBest thing you can do right now is confine yourself to the house for awhile. Now…I know that might seem odd given that you practically stay inside for days on end anyway, but your trips to the comic shops might provide too much temptation.\n\nAnd so begins the long road to recovery…\n\nDays pass into weeks and you got the jitters like a fucking crackhead. You spend a lot of time pacing and staring at the walls in your room. You try to find ways to keep yourself occupied.\n\nYou try to watch TV, but you have to struggle to not click on the Cartoon Network. Eventually you beg your mom to put a block on it. She’s willing to help you out in the hopes that you might actually move out of her house one day.\n\nReading books doesn’t seem to help either. Your attention span has practically been destroyed from “blipvert” anime action. You even can’t concentrate on the shortest story, let alone a novel.\n\nYou feel like you’re going mad.\n","page 102":"No?\n\nAlright then.\n\nI’ll save you the play by play details of your complete descent into degeneracy, but basically you move on past normal anime and you watch/sleep/eat/ and shit Hentai (Not necessarily in that order) for the next few months. You jerk off so much that your mom doesn’t even bother washing your sheets anymore. In fact she doesn’t even enter the basement if she can help it now.\n\nYou continue on this way for quite some time, discussing the intricacies of shitting dick nipple girls and tentacle rape with likeminded cohorts on the internet.\n\nHowever the fact still remains, you’re still a virgin and surprisingly somewhere within your sub humanoid body remains the yearning for a real live person. Who knew?\n\nUnfortunately you’ve gotten to the point where any chance of getting a real woman are impossible, not to mention that you’ve conditioned yourself to a point where you wouldn’t be able to even get it up for a “normal” woman anyway. Hell, it’s debatable that you even still like females at this point.\n\nWhile thanks to those wacky Japanese you’ve developed several fetishes, you have to admit that you’ve started to favor one over the rest.\n\nSo just what kind of pervert have you become?\n","page 105":"Children? Christ, you sick fuck.\n\n(Sigh) Awwwright then, baby raper…\n\nOf course being a pervert and having courage rarely go hand in hand, you’re still too afraid to actually leave the goddamn basement. And despite your sick fetish, deep down inside you have a loathing for yourself. So you try to contain yourself for a little while longer with just pictures. A process that is doomed to failure.\n\nAfter jerking it countless times to Lolicon and MySpace you finally cross that barrier and start looking for real child porn. Eventually you get a hold of a lot of it, but it still isn’t enough. You NEED to actually get your pedo hands on a little girl.\n\nBack in the old days you would’ve actually had to leave the house and stalk the school yards for suitable prey, but thanks to the internet and bad parenting you can find lots of young girls with daddy issues that are practically begging to be raped due to camwhoring in their underwear.\n\nYes, it’s certainly a golden age for pedophilia!\n\nYou stalk various sites and chatrooms looking for a live one and eventually you get lucky…\n\niluvhannah: so you watch cartoons? Whut kind? Liek Dizney?\nOursecret: oh all kinds, mostly anime\niluvhannah: OMG I LUV anime! I almost luv them as much as Hannah Montana! We even got the same first name! LOL! Anyway whut do u watch?\nOursecret: well I used to watch stuff like pokemon, but I moved on to better stuff. Deeper stuff that requires a more mature mind. I’d like to show you these cartoons sometime.\niluvhannah: yeah i could do that becuz i’m liek mature for my age.\nOursecret: I can see that. How old are you exactly?\niluvhannah: im 12. lol. how old r u?\nOursecret: oh im just a little bit older, but I don’t think that should prevent us from being friends right?\niluvhannah: No, bcuz I think age is just a number anyway. Wanna see my pic? lol.\nOursecret: Sure.\n\nHannah sends you a picture of herself and the best thing is that even though she’s 12 she only looks 10! You might have a little dick, but boy is it sure going to look big in her tiny hands! She even lives in your state! You’ve GOT to meet this girl.\n\nYou make plans to meet Hannah at her house where she says her parents won’t be since they’re going out for the weekend. She even tells you she’ll make some cookies for you. Could life get any better?\n\nSo for the first time in a long while you actually leave your basement. You take your mom’s car keys from as she’s asleep from a hard day’s work and drive over to your preteen queen’s house.\n\nYou see the silhouette of a young girl in the door way who waves over to you. You’re so hot for twelve year old trim that it never occurs to you that this could be a set up.\n\nYou enter the house…\n\n“Hey pedo, why don’t you take a seat over there?” you hear a voice say.\n\nOH NOES IT’S CHRIS FUCKIN’ HANSEN!\n\nYou gulp hard when you see the crusading media man in all his smug glory. He’s not as reserved as he usually is though, in fact he seems to be hold back laughter.\n\n“But…I thought you didn’t do this anymore! I thought you moved on to con artists and identity thieves!” You exclaim.\n“True. But trolling you pedos will never get old. Ever. Hell, I don’t even get paid for this anymore, I’m just doin’ it for the shits and giggles!” Chris laughs.\n\nWhile this is a bizarre revelation, it still doesn’t change the fact that you’re still in a world of shit. You immediately dash for the door.\n\n“Hey, you loli fucker, don’t you run on me! I didn’t get to ask you embarrassing questions yet!” you hear Chris yell.\n\nOf course you don’t get a couple feet from the house when several swat officers tackle your ass to the ground and shove a gun in the back of your head. Chris comes out with his crew and motions that the camera get a close up of your face.\n\n“YOU GOT HANSEND FOR GREAT JUSTICE, BITCH!” Chris Hansen laughs hysterically the whole time the officers arrest you.\n\nBitch is a term you become very familiar with while in prison. After only a few weeks your asshole makes Goatse look tighter than the 10 year old girls that you were lusting for.\n\nEventually some skinheads do something that your mom should’ve done when you were born, namely shank you in the fucking neck.\n","page 104":"Being the pussy you are, this choice isn’t really surprising, though this is probably safest out of some of the shit you could’ve gotten addicted to. Of course this pretty much means you’ve given up on the last vestiges of your heterosexuality, but having gay sex is probably the only way you’re going to get any at this point.\n\nHowever regular homo love just ain’t gonna cut it for you. The moment you decided to prance around in a fur suit and jerk off to the shapely ass of a rabbit you embraced the life style of fur faggotry and all the abuse that comes with it.\n\nYour status has just dropped even lower and even other basement dwellers you talk to online now think you’re lame. You don’t care though, because you find a site where your kind can freely talk to each other without the fear of being called a furfag. (Well okay the site gets trolled every other week, but it’s still the best a fur fag like you can hope for)\n\nEventually you chat up some faggot that likes dressing up as a fucking cat. (His name is Tom) It’s not a rabbit, but he actually lives in your state so he’ll do! Fortunately this guy seems to have a little more money than you, so he offers to meet you at some hotel and pay for everything.\n\nThe day you leave to meet Tom, your mom just shakes her head regretting the day she was too drunk to fight off your dad’s date raping that resulted in your conception that night.\n\nWhen you get to the hotel that’s when you meet Tom in all his furry glory. The two of you don’t spend too much time talking; after all you two have been doing all the getting to know you stuff online. Now you’re both just interested in hot furry love.\n\nThe pair of you furfags yiff it up and take turns sucking each others dicks and taking it up the ass. Your fursuits are taking a beating with all the cum, spit, blood and shit leaking out of various orifices, but after all is said and done the pair of you are happy. (If sore and chaffed)\n\nYou and Tom fall asleep in each others arms dreaming of a furry world…\n\nThe next morning you are both rudely and violently awakened.\n\n“GET UP FURFAGS! YOU’RE UNDER ARREST!” a man in jet black riot gear yells.\n“Phew! It smells like shit and wet dog in this motherfucker!” another remarks.\n“Wha…” is all you can say before you’re pulled out of the bed and dragged by your tail out of the hotel and thrown into a van. You see Tom try to fight back, but he’s severely beaten and then two shots placed in his head.\n\nYou cry out and try to leave the van when you see this, but a rifle butt to your face prevents that plan. The door is then slammed shut. After shaken off the cobwebs you notice other furries in the van with you. That’s when you swallow hard (Even more than last night) and realize what’s going on and it’s the day that all furries have feared would come.\n\nTHE FINAL FURSECUTION IS AT HAND!\n\nYes furfag, the world has finally had enough, and day of righteous cleansing has come! All of you degenerates are globally rounded up and placed into camps!\n\nThe executions go on through the night as furry bodies fall into mass trenches and the skies are gloriously filled with the black smoke of your burning fur and flesh.\n\nMinutes before your own death you scream out wondering why nobody is stopping this, after all they stopped this for the Jews and everyone hates them!\n\nWell you’re forgetting one thing; Jews are actually useful, like being comedians and killing Arabs. Furries on the other hand are a pathetic waste of a zygote and serve no purpose other than to be fucking hanged.\n\n“We will be remembered! You can’t erase history!” you shout.\n“Hah, we already are. Soon nobody will ever know about you fuckers ever again and the world will be thankful of that! Got any last words?”\n\nYou resign yourself to your fate, but still remain defiant in your last moments.\n\n“I’m proud to be a Furry!” you exclaim before getting your brains splattered all over the place.\n\n“Yiff in fucking Hell Furfag.”\n","page 55":"You give up that easily? Well it’s your choice I suppose and not too surprising considering you’ve spent most of your life in your Mom’s basement.\n\nYou go back home and go back to your safe little world that doesn\u0027t require any exploration at all.\n","page 109":"Alright, I understand, you have everything you want in the basement and even if you don’t you don’t have far to go get it. The outside world doesn’t really hold any interest for you, so there’s little point in going through the hassle of dealing with it. And living in the basement has worked out for you so far more or less, so why mess with success right?\n\nBut you must also understand that just hanging out in the basement for the rest of your life doesn’t usually offer much in the way of excitement. At least not without some sort of outside stimulus anyway, and with all the rest of the drama going on in the house, everyone usually forgets about you and you happily stay out of it most of the time.\n\nSo this little story will come to an end right here.\n","page 54":"You drive a little further up the road, still nothing. You\u0027re about to give up when then you see it again. You see the Grey Building. You guess you just didn\u0027t realize it was further than you thought.\n\nThe Grey Building stands before you and there\u0027s the door, so you can go in if you want.\n","page 108":"That’s the spirit! I knew you had it in you!\n\nOkay so you’re feeling uncharacteristically motivated today, that’s a start, but where exactly you’re going to begin is another question.\n\nGetting a job might be the way to go, but you have no idea what you might be qualified for. You could go to a family member for help or your old friend the internet as usual.\n","page 57":"You walk around the building again, and something isn\u0027t right. This is a Grey Building but it isn\u0027t your Gray Building.\n\nYou can hear shuffling inside, and the clinking of chains. This doesn\u0027t seem like a safe place to enter, so you hastily leave and head back home and just say to hell with the whole damn thing. Your life is more important than fucking around with mysterious buildings in the middle of nowhere.\n","page 56":"You enter the Grey building and suddenly feel a strike to the back of the head.\n\n\"THIS IS MY GREY BUILDING! DIE INTERLOPER!\" a voice shouts as you try to get back up. A heavy boot kicks you in the face and everything goes black.\n\nThe last thing you hear is a rusty chainsaw.\nThe last thing you feel is that chainsaw entering your back.\nThe last thing you think is that this is the GREY Building not the GRAY Building.\n","page 50":"Okay Action Hero...\n\nYou sneakily lose the tribals by climbing into a tree. As you put your clothes back on, one of the tribals wanders underneath you. Using one arm you reach down and quietly snap his neck with your forearm.\n\nYou pick up his knife and hid in some nearby bushes, a couple more tribals show up, you sneakily throw the knife at one of their heads and before he even hits the ground you charge the other and punch him in the throat and then tear out his wind pipe.\n\nYou dress up in one of the tribal\u0027s clothing in order to pass as one of them. Another one shows up and you begin motioning him over to \"Help\" your fellow tribals. When he does so, you throw an upper jab ramming his nose into his brain, killing him instantly.\n\nYou take his bow and arrows and wipe mud all over yourself. You return to the village and sneak back into the hut you were in and take your Micky Mouse Zippo lighter back and begin running around shooting fire arrows at the huts. The tribals are screaming in terror, as you mercilessly butcher them with their own spears.\n\nThen it happens, the Chieftain appears. He looks upon the carnage you\u0027ve inflicted upon his village and realizes you are not a god, but a demon! He stands before you and is ready to confront you once and for all.\n\nYou clash! The Chieftain is a very good fighter, he lands some very good hits and you\u0027ll certainly have some scars after this, but you\u0027re the good guy and have no choice but to win. Eventually you manage to stab him through the heart with his own knife.\n\nHe dies, but looks upon you with respect of a warrior. You give him the same salute as he passes into next life. He was a worthy opponent.\n\nAnd to the victor go the spoils, you take both of his daughters over your shoulders, all the gems you can carry and leave the village burning down behind you because you\u0027re SUPER FUCKING COOL.\n\nYep, that sure was a nice last delusional thought before one of tribal\u0027s spears plunged into your back as you were trying to get away.\n\nThat night the villagers eat their \"god\" and look up in the heavens wondering if you\u0027re looking down at them in approval.\n","page 110":"Suzy: This is you. We already went over what the fuck your problem was on the first page. Let’s move on shall we?\n\nBen: This is your older brother and the oldest of your siblings. He’s a paranoid survivalist nut that trains for inevitable apocalypse that’s going to come. He walks around armed at all times and is convinced that THEY are out to get him. He also has a misguided biracial hippy girlfriend by the name of Moonshadow and an illegitimate son with her by the name of Tommy who is an idiot savant. Currently they all live out in the backyard though Ben’s been building an underground bunker of some sort out there.\n\nKelly: This is your Amazonian older sister. She’s in a small time roller derby league and has been known to do some illegal underground fight club shit on the side. She’s probably the only one in the house that has closest thing to a “real” job. Kelly’s never liked you, for various reasons. When you two were growing up she’d always try to take every opportunity she could to abuse you in some way. Fortunately she’s mostly too busy working to engage in physical or psychological torture on you nowadays.\n\nPeter: This is your younger brother. He’s a pretentious effeminate aspiring film maker who has the annoying habit of attempting to record everything with his camcorder. Has the disturbing habit of stealing your clothes and wearing them. He also hangs out with a junkie drug dealer from school by the name of Kevin who is always lecherously looking at you when you’re around.\n\nDonna: This is your younger sister and the youngest of your siblings. She’s probably the most “normal” out of all of you. Perhaps a little on the wild side, but nothing excessively out of hand, basically your typical high school girl who hangs out with others similar to her. She’s probably the most alright with you, though sometimes she urges that you should get out more.\n\nDad: This is your Dad (George McCray is his real name). He used to be a traveling lightning rod salesman. He’s retired now and hasn’t really been the same since your Mom died. He’s usually in various stages of drunkenness and nobody much pays any serious attention to him anymore. It’s not like he was around for the parenting process anyway.\n\nMom: This is your Mom (Bertha McCray is her real name). Despite her overprotective moralist views on how you and your sisters should act, she was probably the one who kept some semblance of order on the family. When the flesh eating virus consumed her years ago, everyone missed her a lot especially your dad. Eventually she was cremated and her ashes are kept in your Dad’s room.\n\nEd: This is your really creepy uncle and brother of your late mother. It was her dying wish that he have some place to stay, so he lives in the garage which he’s pretty much made his domain as most other family members stay clear of him, even Ben. He doesn’t have any visible means of support yet contributes to the household at times. There are certainly rumors and whispers of what he might be up to when he leaves and comes back at various hours of the night, but nobody really wants to talk to him directly about it, let alone go in the garage and find out.\n\nJulie: This is your “best friend” since kindergarten, who you speak to less and less with each passing year. As you grew older the pair of you had very different lives. Julie was very wild in her teenage years and still is today. It is only due to the fact that you knew each other for so long that you two are even still in contact. She’s probably remained in contact with you mainly because you are about the only stable person in her life that she feels that she can talk to on a serious level about shit that sometimes bothers her.\n\nThe Morningstars: While your family on the block is rightfully seen as the most dysfunctional lot to live there, The Morningstars are definitely running a close second. They’ve converted their house into something of a compound. There seems to be a bunch of them of varying ages and gender, but “Pa” Morningstar and his eldest son Bobby Morningstar stand out the most. They mostly keep to themselves, though recently Uncle Ed has been asking a few random questions about them sometimes.\n","page 65":"Something in you snaps! You\u0027re overcome with panic and solve your problems with violence. You immediately knock the gun out of his hand and choke the life out the scientist, snapping his scrawny neck!\n\nYou have to figure out to get rid of the body; Mom doesn\u0027t like you leaving a mess. So you decide to chop him up and throw him in a trash bag.\n\nIn the middle of your grizzly work, you start to enjoy it. In fact you don\u0027t think you\u0027re going to get rid of the body at all. In fact you found something much more interesting to collect than useless shit on the internet.\n\nYou begin to increase selling things on the internet to attract more people...\n","page 68":"As just one man armed only with a lighter and a can of spray can, you decide you cannot stop it yourself. You jump out of your window and run off as the Kudzu begins to grow and eat your neighbors behind you. You eventually hide out in old cabin up north that you family used to go up to when you were little.\n\nWhile you\u0027re hiding out, the horror that you unleashed onto the world that ends up taking the lives of millions. It\u0027s eventually stopped, but your name is cursed and you will forever be known as the one who didn\u0027t stop the evil when it was small.\n","page 69":"You can\u0027t let this evil grow! You have to stop it right here and now!\n\nYou move forward to attack, burning it as you go. You start setting flammable things on fire and hope to get to the kitchen to turn on the gas and blow it up.\n\nYou get to the kitchen and turn on the gas, now all you need to do is escape before the gas hits the flame and explodes in that spectacular fashion like in all those movies you\u0027ve ever watched.\n\nWell unlike the movies there is no \"Dramatic time\" (Especially since you were still holding an open flame Zippo lighter in your hand!) and as soon as you turn the gas on the entire house blows up, with you and the Kudzu in it.\n\nYou have stopped an evil from attacking the world though, if it’s any consolation. Probably not, since nobody ever knew they were in any danger in the first place.\n","page 62":"You get an offer of $500 dollars for the Kudzu that has basically enveloped the house. You take it. You never wanted this stuff in the first place, it just grew out of hand and you couldn\u0027t get rid of it.\n\nAs you begin wondering how you’re going to ship the Kudzu, suddenly something green catches the corner of your eye! It’s the Kudzu! It appears that it didn\u0027t like the idea of being sold! It begins to crawl at you, and it looks a lot more dangerous than you remember considering it has sharp thorns now.\n\nYou grab your Mickey Mouse Zippo lighter and a can of Lounge Lizard Hair Spray and use it as a poor man\u0027s flamethrower!\n\nIt works! You burn and singe enough of the Kudzu to make it retreat, giving you time to wonder what to do next.\n","page 61":"You get an offer for $15,000 dollars! You take it! Man, what a sucker! You don’t feel like wrapping up the bones and shipping them so you tell the guy to pick them up at your house. He said he’ll come by with a briefcase of money.\n\nSoon you get a knock on the door. You answer it and a strange looking scientist type appears before you.\n\n\"Hello, I\u0027m here for my Elephant Man bones.\" he says\n\nELEPHANT MAN? No wonder they sold for so much! This dickhead thought he was buying the remains of a medical curiosity, not that of an actual elephant!\n\n“Hey I think there’s been a mistake. It’s just a regular elephant buddy. Still, should be good for something in the science field right?”\n“What?! This is false advertising! I demand my Elephant Man bones!”\n\nThe scientist is very angry, but he doesn\u0027t seem to realize that mistake has been made. He thinks that you\u0027re holding out on him and trying to renig on the deal. You tell him that the deal’s off and he can keep his money if he’s so unhappy, but he won\u0027t hear any of it, he\u0027s demanding that you give him his Elephant Man Bones!\n\nHe pulls out a pistol!\n","page 64":"Sensing that you’re looking around to hide behind cover, he fires before you can move!\n\nNothing happens.\n\nRealizing he forgot to put bullets into the thing, he throws the gun at your head, which you easily duck. You grab a nearby lamp and clobber him in the face with it. He goes down like a sack of potatoes.\n\nSeriously, as if you\u0027d really sell the bones of the Elephant Man in your basement!\n\nYou take the briefcase of money, drag him out to the curb for the derelicts to have their way with and think nothing more of it.\n","page 63":"We’ll save you the embarrassment of WHY you have the pictures in the first place, but after scanning one naked photo of your Mom, it doesn\u0027t take long for perverts all across the globe to start bidding for the whole set. The highest bid you\u0027ve got right now is some guy in Mexico who\u0027s offering 10,000!\n"}