{
  "page 123": "We were shivering at the football game, and I had brought a blanket, and we cuddled under it, and drank hot cocoa I had in a thermos.  I wasn\u0027t the boy with Gulliver\u0027s Travels dumbly staring at you across a table, but a man, or nearly, and I had been working on my shoulders and arms a lot, and I held shivering you and gave you a real story of meeting, not a stupid story about saying hi in a cafeteria.\n\n\nWe looked at each other,  your chestnut curls falling over your face, your crimson lips parting a little, showing me you wanted me to kiss you, but I knew, and the home team was scoring, and I kissed you as the crowd screamed.   Then I pulled back a little and looked at you, and took your chin in my hand and tilted your chin up, just a little.  Like we\u0027ve seen in dozens of movies, and then I kissed you again, and the camera pulls back, let\u0027s say, and we are in silhouette against the darkening sky.\n\n\nYou\u0027re right, Natalie.  It\u0027s much better.  Let\u0027s forget all the other parts.  I like this version better.  Come here, and let me kiss like that right now.  Just hit that final link below and look at me that way that you did then.\n",
  "page 244": "I didn\u0027t say that.  Did I?  I guess I did.  She just was really sensual--I don\u0027t mean sexual. I mean she responded to sensory things in a really--I don\u0027t know, like spinal way.  It did things to her.  Like picking off the transparent varnish off a floor, or picking off her nail polish was sensual to her.\n\n\nShe would tell me about these things, just artistic things.  Kooky artist type.  Like how some people just get a weird sensual feeling when they peel off dryer lint.  It\u0027s like that.\n",
  "page 122": "...right.  We said goodbye, I guess.  I\u0027m not sure what the point of telling this story this way is.  But all right.  So what happens then?  How did we fall in love, then?\n",
  "page 246": "Is it that obvious?  Natalie, you are so easy to tease.  Yeah, Quinn and I would actually just mostly talk about board games and about how developer\u0027s were going to cut down the Greenwoods behind her house, which she hated.  We were going to make a fundraiser at one point to protest, but we never got it together and the woods did get cut down.  But, no, we never had anything sexual or sensual or anything.\n\n\nOh, man, I think I made you either mad or turned on or both.  I love to bust your chops--I can\u0027t help it.  Come on, we can go back to where we were.\n",
  "page 124": "Yes, we did click.  We did click.\n",
  "page 245": "...and she loved the feeling of paint and craft paste on her body.  She would take off her clothes and roll around in paint, like a thick layer of paint, and  paste and then glitter, and then puff paint, and pipe cleaners and feathers until she had a thick layer of pigment and first-grade arts and crafts supplies on her body.  It\u0027s not sexual at all, it\u0027s just weird and sensory.  She would tell me about it.\n\n\nAnd she used to have these weird fantasy about the drive shaft under trucks, that long powerful rotating shaft, connected to the flywheel, how it rotated around so fast, but there were holes in it.  And she used to wonder what would happen if you stuck your hand in that hole while the truck was driving.  Would your fingers come off, just pop off?  Or would your whole hand get wrenched off, or the whole arm?  Would it get sliced off, or wrenched off?  Like, she would talk about that a lot.  One time we were talking about it and she said hold on, let me get something, and I heard a sort of buzzing in the background, and she got quiet for a while, and then louder.\n",
  "page 127": "Fine, then, Natalie.  Then fuck you.  I don\u0027t know what kind of story you\u0027re trying to tell, but it sounds like a story about wanting me gone.  So why don\u0027t I go.  I didn\u0027t tell you, but I have my bags packed already, and I don\u0027t need you, and I don\u0027t need these stories.  I\u0027m taking your car, too, because it\u0027s the better car. \n\n\nEnjoy playing the rest of this game.  Maybe you\u0027ll see how much I love you if you try some other fucking paths, but it won\u0027t matter, Natalie.  Because you always do this.  You aren\u0027t funny, and you aren\u0027t the young, sweet Natalie who I fell in love with, but someone cruel and unable to love, and I deserve better than you.  Don\u0027t say anything.  I don\u0027t want to hear it.  There are some choices you make that you can\u0027t take back.\n",
  "page 248": "Oh, you don\u0027t say.  That\u0027s quite a coincidence.  I guess I have a type.  Why haven\u0027t we ever talked about this before?  See, that\u0027s the problem--you love someone for a long, long time but you get too embarrassed to find out what they really want.\n\n\nNow you stay there.  I\u0027m going to get the peanut butter and the saran wrap and the puff paint, which I happen to have right here in this drawer, because I kind of had a feeling you\u0027d wander down this path.\n",
  "page 126": "All right, fine.  So let\u0027s say, we were in chemistry class, which I was taking as a requirement, and you were taking because you hated your physics class and needed a hard science for a prerequisite or something.  You slide next to me.\n\n\n\"Hey, uh, Nicole.  Natalie, sorry.\"\n\n\n\"Hi.\"\n\n\nWe might think about the cafeteria and also the laundry room.  Probably not.  Two years ago, one year ago.  Probably less than five minutes combined in two years, that\u0027s 5/1,051,200 minutes, and my calculator can\u0027t do that calculation of percent.  9.5 somethingsomething e-7.   Not sure what that means.  But a very small percent of your life, is my point, had been spent in my company.\n\n\nI only sort of remembered why I knew you.  You sort of start to recognize people at college, and you were just one of those familiar faces.\n",
  "page 247": "Yeah, so we had a bunch of phone conversations a lot.  She meant a lot to me.  She understood things like that, things that aren\u0027t sexual at all but it sort of sounds like it if you say it out loud.\n\n\nLike she had a thing about--ugh, you know those black spider clips, with the silver part that you press down and the black part that holds papers together?  You know how you can play with the silver parts, opening and closing them.  Well, when you open them, pulling the silver arms vertical, it makes a little click, but when you return them to the angled position, they make a sort of--not a double click, but a one-and-a-half click.  It drove her crazy, and she would do that, and she got some kind of synaesthesia orgasm from it, but again, it wasn\u0027t sexual.  It was like that ASMR on Youtube now,  which, all right, I guess it\u0027s kind of sexual, but that\u0027s not how it was.\n\n\nYou\u0027re telling me that I\u0027m supposed to tell an unbelievably attractive, long-legged dancer who I had a crazy crush on that she can\u0027t tell me what it does to her to take a knife full of peanut butter, spread some on bread, just like regular, and then take the knife, and slide it on top of the jar, and let the excess peanut butter that was on the knife slowly slide off and back into the jar.  How that feeling was almost knee-buckling to her, such that she couldn\u0027t do it in public.\n\n\nYeah, I wasn\u0027t going to tell her that.  It was just peanut butter!  That\u0027s not cheating!  And not even real peanut butter.  Just talking about it.\n\n\nI\u0027m not even going to get into her thing with stretching transparent saran wrap over the top of a can or jar, really tight, so tight that it was nearly at the tearing point, and then tighter and tighter--but not so tight that the wrap would break, but just before that point, and she would talk about how the bonds between the atoms were straining and trying to hold on to each other, that the carbon atoms were nearly getting pulled out of the socket (as she would say) and that she was going to leave it like that and let them suffer all day.  And she would get a little flushed when she said it.\n\n\n \n",
  "page 129": "No, we didn\u0027t.  It was a boring lecture about quanta or something.  We didn\u0027t listen to the lecture.  We were right next to each other, and we were realizing that we had waited for so long.  But now, we were orbiting around something special, orbiting around happiness, circling it, recognizing that all we had to do was reach out our hands and touch each other and the past, missed opportunities wouldn\u0027t matter.\n\n\nYes, we\u0027d have lost two years of youth and happiness, but really, it didn\u0027t matter.  We\u0027d found each other, and Fate kept shoving us together until we got it through our skulls that we were meant to be together.\n",
  "page 128": "This is all right, Natalie.  I see why you like this.  We were maturer, studying together.  We were growing into adults, both of us twenty now, less driven by hormones and more by recognition of someone special.\n\n\nWe shared a book at one point, when you had forgotten yours.  You often left your books in your dorm, you\u0027d tell me, not on purpose, but because you didn\u0027t want to remember, because they were heavy, the backpack sitting achingly on your small frame.  Of course I said I\u0027d be happy to carry them for you in the future, and you said you didn\u0027t mind sharing.\n\n\nWe started whispering in the back, sharing things about us, and I looked at your chestnut curls during class when I should have been learning about chemical bonds.  But in a sense, I was learning about bonds.  Words were bonding us, and something was happening, just the two of us sitting there.\n\n\nAnyone who has ever been in love understands about just sitting and basking in someone\u0027s presence.  We were falling deeper in love, just sitting, my hand touching your hand as we turned the pages.\n",
  "page 76": "Don\u0027t be like that, Natalie, don\u0027t you be that way.  I hope you aren\u0027t going to pick this path, but I know you well enough by now that I will swear you\u0027ll find your way here eventually.\n\n\nYou always did pick at me and pick at me when tried to imagine a better life, one where we could actually be happy with the person we each decided to be happy with--go figure.  You always shot me down when I imagined it.\n\n\nMaybe that\u0027s why I left and why I made sure never to fix the broken side window frame in the basement that I always said was too small for anyone to fit through, and you sit here, Natalie and play this game.  You read what I wrote about you, and think about us when we were happy.  I don\u0027t care how many times you have to click through this, how many wrong turns you take.\n\n\nYou find that happy ending, and the new chef\u0027s knife you bought is sharp, and the children are asleep, and we have all night, all night.\n",
  "page 79": "Think of all the money we have, and we park our car in front of our building, a townhouse in the cooler part of town, and we walk the steps with untired legs, very much not toting a stroller up the steps. \n\n\nAnd we sit on our balcony and drink coffee with no children clambering on us or plummeting to their deaths over the sheer parapet of the balcony.  We talk all evening and make love thrice and go out to dinner, sex-dazed, the entire Sunday paper consumed, and eat adult food.  The restaurant does not have plastic utensils, novelty placemats, or have laminated menus with pictures of the food in it.  And we go to bed after ten p.m., if such a thing is conceivable.\n\n\n \n",
  "page 71": "It\u0027s hard to imagine.  Sometimes I think the shrieks of glee and wails of disappointment (indistinguishable) have permanently dismantle some part of my brain responsible for the higher imaginative functions.  But I will try.\n",
  "page 73": "I\u0027m sorry that my pleasant fantasy doesn\u0027t quite mesh with yours.  I\u0027d hope we could, somehow, daydream.  You find my story sad with no children in it? \n\n\nAll right, look--one child.  Imagine one child, then, and forget the rest.  We enjoyed all the pleasures of raising a baby, youth, et cetera, and now let us say we have a ten-year-old, no a twelve-year-old.  Of of our more isolated daughters, entering her brooding adolescence, so she\u0027s mostly in her room all day, downstairs, door shut.\n\n\nCan we still have this fantasy, then, of being together, of soaking in other completely, if we stipulate one child in this fantasy?\n",
  "page 72": "What would that even mean?  We wake up and feel like sleeping more, and so we sleep.  We get Mexican food and drink bad margaritas, and walk home late.  Think of how empty the clothes hamper would be, how full the fridge is of food we like, how unsticky the floor!\n\n\nThe notion of being able to have sex while making any sound at all!  Or, more poignantly, to bite into a potato chip without six pairs of ears being alerted and demanding what is \"fair\"!\n\n\nNo birthday parties to plan, no \"plays\" with incoherent plots and inaudible narrators to sit and applaud through with gritted teeth.\n\n\nThink of the silence, where we could gaze at each other and be in love in the morning, as the sun warms us, curtains open, arms twined around each other without any one else around beseiging our bedroom door, swarming in, one child having slept on our floor, another actually having somehow slept in our bed (\"he was scared\"), but only us, us, us.\n\n\nWhen people are as in love as we are, the rest of the world melts away adn we don\u0027t need anything or anyone else.\n\n\nAnd here we can at least fantasize about it.  I like that you want to.  It\u0027s such a modest fantasy, to think of kissing you for more than four seconds at a time without you needing to take someone\u0027s temperature or sign a permission slip.\n",
  "page 75": "We could have been sitting on our patio, drinking--I want to say iced tea with mint, in a big round glass pitcher, sitting across from each other.  I would have the crossword puzzle at my side, but not be doing it.  The pleasure is in having the leisure to do it. \n\n\nAnd you would be curled into my arm, not sleeping, but not not sleeping either.  And I would feel your sleepy warmth, the smell of our soft hair, and we would watch the world get dark around us, knowing that our daughter was safe and teenage angsting in her room, playing music, perhaps, but with headphones, not disturbing our reverie.\n\n\nYes, we have a meeting with her French teacher next Tuesday, and there is the hearing for the shoplifting charge the week after that, but this is now, and it is night, and I can looking into your pale blue eyes, the same eyes, your eyes, my Natalie, and kiss you.\n\n\nIt is a modest fantasy, but it is enough.  I love you, and I love you in the past, and I love you now, and our daughter is kicking the door of her room as if she wished to knock it off the hinges, and I will love you in the future, I swear.\n\n\n \n",
  "page 74": "I\u0027ll tell you the story, and you just imagine.  Close your eyes and fantasize.  Well, no, I guess that won\u0027t work if you are reading this.  Just picture it.\n\n\nImagine me driving, slightly unsafely, in our new red convertible, with no room in the back for car seat or booster, driving with one hand on the wheel, my other around you.  The wind is whipping your chestnut curls back, and you are wearing those sunglasses I like with the slight cat\u0027s-eye tilt, your face and features looking small and sharply defined.  You are wearing the dark crimson lipstick you used to wear, your mouth a cupid\u0027s bow.\n\n\nBecause in this story, we are young and fresh and free.\n",
  "page 130": "So, what then?  What happened?  We took the class, got our grades, and went on our way?\n\n\nWe just stayed casual acquaintances, drifting away, and then we graduated, and then what?\n",
  "page 132": "So now, you\u0027re saying that instead of sitting next to you, I was sitting next to a bucket slowly filling with water?  And you were where?\n",
  "page 253": "Yeah, no question.  Ugh, when I think of how we probably make her uncomfortable by kissing near her and whispering all night and obviously wishing she wasn\u0027t there.  Oh well.  We were dumb kids.\n",
  "page 131": "Slowly, it happened.  We didn\u0027t expect it, but maybe we should have.  We drew our chairs a little closer together.  We stopped happening to sit together, and starting going to class together and sitting together on purpose, in \"our\" seats.\n\n\nWe studied together, and then one day we put the books down and looked at each other.  Do you think that\u0027s how it would have happened?  Would we have asked each other about past loves and figured out all of our past near misses?  Or would we forget that and touch lips to each other and be thankful that we\u0027d found each other, even after two years, lost, down the drain.  But that didn\u0027t really matter.  We would have been twenty, and your hips were slim and your wrists were narrow and covered in bangles, and your lips were crimson, and your hair was an impossible burst of chestnut curls, and your eyes were pale blue and young and unlined.\n\n\nI would have longed for those two years, though.  Two years!   Two full years of loving you--the sweetest, least jaded version of you I could possibly have loved, but it doesn\u0027t matter. \n\n\nPerhaps we found each other when we most needed it.\n",
  "page 252": "No, don\u0027t feel awful.  What exactly could we have done?  We couldn\u0027t go to my room.  My roommate always had his jock friends over, drinking and swearing and farting and crushing beer cans on their head, and leaving their cans and cigarette butts in my bed.\n\n\nSo it was your room or nothing.  I would come over, and say hi to Cassie, and we\u0027d hang out, actually, all three of us at one point, playing cards.  It was Uno or Mille Bournes.\n\n\nThen it would get late, and I\u0027d say I wanted to stay overnight, and Cassie understand about the bros in my room.\n",
  "page 233": "No, I know.  Come on.  Kiss me.  I love you.  People die, and this was a long time ago, and we\u0027re still here, after all.  I shouldn\u0027t have put this whole silly Quinn branch in here.  It\u0027s just silly, and it\u0027s not really about us.  Come on, let\u0027s go back to you meeting me.\n",
  "page 111": "Me too.\n\n\nBut the point is that with that start, propelled by those fireworks, how could we not be on a different trajectory--we could still be those kids, but just a bit older.  We could still be insatiable for each other, still in love, as hungry was we were that first time in the cafeteria.  That didn\u0027t happen, but you see it could have.\n\n\nLet\u0027s take those memories and go upstairs, and pretend, and defy time for a while.  Happy anniversay, my Natalie.\n\n\n \n",
  "page 232": "You...did what?  No, it was an electrical short.  Something mechanical.\n",
  "page 235": "I don\u0027t want to hear that.  Stop it, Natalie, this isn\u0027t funny.  Turn the game off.\n",
  "page 113": "Well, total stranger who see each other.  We\u0027d see each other at school functions or in a dark parking lot, and feel each other\u0027s eyes on each other\u0027s bodies.\n\n\nAnd then, forever after, we both would carry that germ of thought within us--at work, at the gym, in bed with our later lovers.  That someone whose name we never learned, had absorbed us completely, had consumed some part of us that nobody else could ever wholly have us.\n\n\nWe\u0027d think about each other, I suspect, and return in dreams of freedom and wildness when our current relationships grew stale.  And our image of us would grow brighter even as our memories of everything else got dimmer.  More of an idea than a person, with each passing year, central to our existence.\n\n\nI don\u0027t know if I wish that we\u0027d gone down this path.\n\n\nThe fact that you\u0027ve chosen it must mean you want to, that you would have wanted to.   We could have been each other\u0027s bright spot in the past.  I wonder if there\u0027s a way to find that, to untangle the maze of our choices, and find the way it should have gone, to relive it right.\n\n\nI love you, Natalie, and I loved you, and I will love you.  But I think I love past you, potential-you, nameless you, you about whom I have so little information-you best.  If I am ever unfaithful to you, ever, it\u0027s with that girl, when I close my eyes.\n\n\n \n",
  "page 234": "Yes, you remember!\n\n\nIt was so unlikely that you would have been there.  You, of all people.  Fate was impatient, and thrust us together as early as possible, I think.  We must have recognized each other, my Natalie.  It\u0027s funny to picture younger you--before I could rest my hand on your lower back and sweep you into a kiss, my other hand behind your head, fingers in your hair, lips on your neck.\n\n\nLike I am doing now.\n\n\nBecause we were just strangers to each other.  You walked up to the table where I was sitting.  Then what did you do, my love?\n",
  "page 116": "Is this the center of the labyrinth then?  Have we gotten to the middle of the spider\u0027s web only to discover that I\u0027m the fly trapped in the middle?  Hardly.\n\n\nNatalie, you know perfectly well that you are real, that we have been in love for decades.  I would not sit here, spending days and days without sleeping, getting fired from work for scribbling in a notebook and on my laptop drawing out flowcharts, to write a long, long interactive storygame as a testimony of my love to you if you were not real.  So I don\u0027t really know why you would say that, or why I would include this path.  It doesn\u0027t make sense, and it hurts my feelings.\n\n\nIf you weren\u0027t real, then why do I have this picture of you here, or this picture from a magazine that reminds me of what you would look like?  To whom did I write all of this poetry?  And all of these stories?  With whom have I been in love for so long, dreaming of, knowing that at least, at least, no matter what my failures and sorrows were, at least I found someone who I loved.\n\n\nIf that, nothing else matters.  Please, Natalie, don\u0027t not be real.  I didn\u0027t write this to have you tell me that.  If you\u0027re real, tell me.  Touch me.  Turn around from your chair and reassure me.  I don\u0027t want to look up and see a blinking cursor as the only movement in this house.  If I turn around, I know you\u0027ll be there.\n\n\n \n",
  "page 115": "It was solipsism, but with two people.  We\u0027d wake up on a lazy Sunday holding each other, having embraced all night, pressed together in a tiny twin bed, you, my tiny twin.  I would stroke your hair, slightly warm, eyes still sleep-sealed like a new-born kitten\u0027s.\n\n\nYour curves draping over my body, fitting perfectly, as if you were my own custom-tailored set of clothes, not that clothes had much to do with our mornings.  The sun rose and fell and rose and fell.  Did we get hungry or thirsty or ever need the bathroom or to get air?  I don\u0027t remember it ever being so.\n\n\nWe stopped using language almost, creating our own private language of syllables and looks.  Classes must have come and gone, and the janitors must have been perplexed by the chair we had propped against our doorknob to prevent anyone getting in, even after the semester had ended.  At least, that\u0027s how I remember it.\n\n\nI kissed you, and an hour went by.  The room smelled of sex, and the telephone had been ringing (something something the bursar needed to be paid, and students were not allowed in the dorms during summer break, and we had long ago been kicked out, and your legs were wrapped around me.\n\n\nAnd it\u0027s been so ever since then, at least, in my mind it has.  When I\u0027m at work, when we\u0027re at our table, when we dine out, when we are at the public library, it\u0027s only you.  My lips are never off yours, even at family court, or while I am talking to my grandmother on the phone, or at parent-teacher conferences, perhaps, perhaps I\u0027ll remove my hand from within your shirt or stop whispering to you, but only perhaps.\n\n\nNatalie, I could write this all day, and it is painful to have to write in English and not in our secret language.  But this is for you on our anniversary, although every day is an anniversary of a day we\u0027ve been in love, and actually, perhaps I will publish this, because everyone deserves to see what perfect love looks like.\n",
  "page 236": "...\n",
  "page 239": "No, that\u0027s not...I mean, I wouldn\u0027t have...\n",
  "page 238": "Uh, yeah.  Pretty much.  Keep doing that. \n",
  "page 87": "Now I am starting to get angry, yes.  And the whole point of this was to celebrate you, us.  And you being so obstinate or obtuse that you can\u0027t just click the right links is annoying me.\n\n\nIf you are trying to start an argument, I won\u0027t take the bait.  I\u0027m sorry, Natalie, OK?  This was a stupid idea.  I don\u0027t know what you want me to say, and it\u0027s hard to write an apology in advance like this, not even knowing if we\u0027re going to really have the fight that leads you down this path anyhow.   But I think I know you well enough to know we will.\n\n\nI\u0027ve learned all too well over the years that I shouldn\u0027t even respond to this kind of provocation.\n\n\nI have mastered the art of gentle nods and kind eyes.  Agree to be agreeable, while not agreeing.\n\n\nYou run the show, of course, the diva lyric soprano on the stage of the opera, while I play the role of supporting choric singer or trusted stagehand.\n\n\nIf you don\u0027t want to play with me, to remember our story together, to think of young us, but instead to focus on the bad, and resist, I will not protest.  I\u0027ll even show you how to delete this game.  Just go find that red \"x,\" I don\u0027t care.\n\n\nLet\u0027s just don\u0027t fight.  Let\u0027s close this up, then, and resume our usual evening activities.  If we have to be in bed tonight (magazine, sweat pants, game show, your body covered with two comforters and a small blanket) and have it be uncomfortable and awkward, I\u0027ll never get to sleep. \n\n\nLet\u0027s just forget about it, forget about it, forget about it.\n\n\n \n\n \n",
  "page 119": "All right.  I guess we can tell the story this way.  It doesn\u0027t really matter, because we find each other in the end.  It\u0027s a story about how two people meant to be together find each other.  When isn\u0027t so important.  It could have happened a thousand different ways.  We\u0027re opposite poles of magnets in a shoebox full of styrofoam.   Shake the shoebox long enough, and we\u0027re going to find our way to each other and click together.\n\n\nYou were doing your sweaters, remembering to take them out before the dryer load, actually hanging them up to dry.  I was just finishing my laundry, and we said hello, as we did.\n\n\nBut then, I felt, something shifted.  We had missed our opportunity back then, a year ago.  And we were a year older.  I looked at you, and at your clothes in the laundry basket.  It felt intimate, somehow, to see you like this.  You looked somehow slenderer than last year, but it may have been just how large your laundry basket was.\n",
  "page 80": "I see you shuddering in pleasure and flushing pink around your cheeks, and I know.\n\n\nIt is my favorite fantasy as well, and now I will kiss behind your ear.  I love you too.  Happy anniversary, Natalie.\n",
  "page 82": "Fights always began the same way.  I would get quiet, trying not to say anything, and then you would immediately come up to me and say \"why are you angry?\" and that would make me furious.\n\n\nI\u0027d say, \"I\u0027m not angry,\" and you would look concerned and sweet and say something like, \"Because you seem really angry.\"  And that would do it, that would put me over the edge.\n\n\nNow that we\u0027re thinking about the cafeteria, I\u0027m starting to think about a fight we had there once as well.  I think I know which one you\u0027re thinking about, where you said that I wasn\u0027t looking up when you were talking, that I was distracted, and that I needed to put you first when we were together.\n\n\n \n",
  "page 84": "Fine.  We can stop.\n",
  "page 83": "We said our goodbyes and walked away.  I suppose we felt we\u0027d found a new friend.  Here\u0027s an old diary entry from that time.  Listen:\n\n\nAugust 31, Train to school, did errands, got cafeteria card.  Went up for honor club, don\u0027t think I\u0027ll get in.  Chatted with new people, Donna, Karen, Michael.  Dorm looks ok-ish.  Helped Irene and Max (guy with green hair) move in.  Saw Sam by mail room.  Band coming to school \"Solid State\" and I might go.  Met Natalie in cafeteria.  There\u0027s a desk in the bathroom of the dorm???  Bill on my hall plays bass.\n\n\nSo, there you are, in the middle, worth mentioning, but no more special than helping Irene and Max (with his green hair) move in.  We met, we liked each other, and from then on, we were that person we saw on the way to and from classes, a mandatory, \"Hi,\" and \"Good morning, Natalie.\"  Later it became \"Morning,\" because saying \"Good morning\" was, I guess, just too intimate.  Passing acquaintances, I think, is the term, and we were always passing, never once going in the same direction.\n",
  "page 86": "No.\n",
  "page 85": "I suppose I was thinking about her.  I\u0027d gotten a letter from her, and I started thinking about high school friends.  She wasn\u0027t anything special to me that you knew about, I think, but you got jealous and perceptive, and asked questions.\n\n\nYou could tell I was thinking about her letter when you were talking.  I wanted to listen to you, and wanted to touch you, to run my hands through your hair, to pan for red gold with both hands in the river of your curls, but I was also thinking about Quinn with 10% of my mind, about what she meant when she said she missed me.\n\n\nI wonder if that moment, where you sort of snapped at me a little and told me I wasn\u0027t paying full attention to you, is where we drifted apart.\n",
  "page 240": "I do and I don\u0027t.  Uh, what is the right answer that will get me out of trouble.  Is it to pretend that you\u0027ve been possessed by Quinn, and we could pretend that you are Quinn-in-Natalie\u0027s body, and...\n\n\nNo, no, that wasn\u0027t the right answer that would get me out of trouble.\n\n\nAnd I am confident, totally confident that now you are throwing my pajamas and my blanket and my shoes and everything out of the bedroom, and that I will be sleeping on the couch, and it will take a very long time to explain this away.  But it feels good to tell you.  I\u0027ve had that bottled up inside me for a long time.  Do you know how hard it is to keep a secret from you for 20 years?  That I almost-sort-of-didn\u0027t-cheat, but there was cuddling and a little pelvis movement, but nothing that could technically be called cheating, but without the real fun of it?  It was emotional cheating if anything, and that\u0027s the stupidest kind.\n\n\nSo now you know, and I feel lighter.  So, ah, good night.  Happy anniversary.  If you could throw my pillow out, that would be great, but I could use a balled-up towel, I guess.  Good night.\n",
  "page 121": "I would have.  And you would be a little older, maybe a little more jaded from a year of experience, disappointed by Lionel or Bud or Max or Cassie.  You would have some wounds, some visible in your face, some less so.\n\n\nAnd me too.  I would have gone out with, let\u0027s say, Teresa, and then, over summer break, Quinn for a while.  But these relationships didn\u0027t last.  It doesn\u0027t really make sense that they would.  You don\u0027t fall in love with someone on the first day.  You grow together, and you grow apart, and then, if it\u0027s meant to be, you run into each other again.\n\n\nThat\u0027s what happened here, in this story.  I put your laundry down on your bed, and looked around your room.  I\u0027d never thought about your room, or about you, really, since a year ago, but this was the start of something new.\n\n\nYou smiled at me and asked me if I was going to the game, and I said yes, although I had no idea what game she was talking about (Settlers of Catan? Football?) and we agreed to meet later that night.\n",
  "page 120": "And so, with a pathetic whimper, that was it.  We passed each other, we glanced at each other, then we stopped even doing that.  It became awkward.  I started to reroute my walk to the academic quad to avoid you.  I started to make fun of you to my friends, \"oh, there\u0027s Natalie.\"  Because the moment we started ignoring each other, you seemed to be everywhere.\n\n\nI didn\u0027t know why I had found you attractive.  You were short and you wore mildly unfashionable clothes.\n\n\nAnd that was it.  One of hundreds of people I met at college, and later, years and years later at a reunion I saw you.  I looked at you across the function hall.  \"Oh, there\u0027s...hm.\"  I couldn\u0027t conjure your name up.  Nicole?  Natasha?  Didn\u0027t matter.\n\n\nI swirl my glass of brandy around.  There was a thought I\u0027d had about you a long, long time ago, but I can\u0027t remember it.  It probably wasn\u0027t important.\n",
  "page 241": "No, no, no, I was just joking.  It\u0027s not true.  I thought we were just telling stories and funny fantasies here.  That\u0027s the whole point of this storygame, to enjoy our joking love together.  You have a sense of humor, don\u0027t you.  And don\u0027t tell me you never touched anyone else, ever.\n\n\nNo, no, I don\u0027t want to hear it.  Look, just--let\u0027s just go back.  Forget I said this.  There\u0027s no Quinn.  She\u0027s just a dumb girl I liked, and yes, I could have imagined being with her if I weren\u0027t with you, but it\u0027s not important.  That path is totally closed off forever, and I don\u0027t care.  We\u0027ve gone down this road, and I\u0027m satisfied.  Actually, let\u0027s stop playing this.  I\u0027ve just realized that there might be other things in hear that might piss you off that I thought was funny at the time.\n\n\nLet\u0027s just go upstairs and I\u0027ll give you a massage, and you don\u0027t have to do anything in return.  Just a nice massage.  Close this storygame, I think.  I have to remember how to delete this tomorrow.\n",
  "page 6": "Yes, you remember!\n\n\nIt was so unlikely that you would have been there.  You, of all people.  Fate was impatient, and thrust us together as early as possible, I think.  We must have recognized each other, my Natalie.  It\u0027s funny to picture younger you--before I could rest my hand on your lower back and sweep you into a kiss, my other hand behind your head, fingers in your hair, lips on your neck.\n\n\nLike I am doing now.\n\n\nBecause we were just strangers to each other.  You walked up to the table where I was sitting.  Then what did you do, my love?\n",
  "page 145": "So I go in, and I just press this lever down that presses a sort of metal horseshoe shape on every hundredth odor-eater than comes don\u0027t the line, just to make sure the thickness is correct, and I have to be careful that it\u0027s exactly every hundreth, because of the timing of the assembly line.\n\n\nBut it\u0027s the least important job in the whole factory, even though if I mess up, I\u0027ll be fired and humiliated.\n\n\nI have to count silently to a hundred in my head, over and over, so I can\u0027t even think my thoughts for my whole fourteen-hour shift, with thirty minutes for lunch, and two five-minute bathroom breaks.\n",
  "page 266": "You\u0027re telling me.  You would giggle and shake the bed and then you\u0027d start to imitate her.  And then I would too and all three of us would be there, in the dark, snoring our hearts out, two of us laughing, one of us just plain snoring.\n\n\nShe never knew what fun we had with her at night.  It was almost like we\u0027d used her sleeping body for our secret pleasure, which, I guess we did.  But it\u0027s hard to get any erotic thrill out of it.\n\n\nAnd now all this talk is making me sleepy.  Make that snore if you can remember it.  See, this is what married life is like.  You can do that, and I still find you attractive.\n",
  "page 144": "Right, so you\u0027re in bed with burly Walter, not only post-coital, but pre-coital, because Walter is the man.\n\n\nBut in this brief refractory period in which Walter must regain his vital energies, you bend down, your chestnut curls which I have completely forgotten about embracing the side of your face, and you take our your college yearbook, and you flip through the pages, looking at everyone.\n\n\nYou flip by and remember, and then you come upon the page with my face on it.\n",
  "page 265": "Uh-huh.\n",
  "page 8": "Ha, ha, no.  I know you don\u0027t really play these sort of things, but listen, no listen.  What you do is you click the line that say the thing you actually did.  You see?\n\n\nI\u0027m going to put a link down there to the previous page, and this time make sure you click the correct one, the thing you really did, not this wrong thing that I\u0027m sure you clicked by accident. \n\n\nDon\u0027t click this one again, do you understand?  It\u0027s not that complicated.\n",
  "page 147": "Like a ghost passing over you, or the spirit of a dead future, you touch my face, or rather, the picture of my face.  My face wouldn\u0027t look quite like that any more, as time had passed.\n\n\nYou\u0027d know something had gone wrong, that you\u0027d gone down some horrible path that you couldn\u0027t return from.  But you couldn\u0027t quite identify it.  You were happy, and you didn\u0027t know me, not really, and that chill you got was like the chill of deja vu, noticed, dismisses as inexplicible, and forgotten.\n\n\nYou\u0027d keep the yearbook open to that page though, returning to it on your desk for the next week or so.  It reminded you of...something.  Some younger Natalie, I guess.  Some way that your current self has betrayed your past self.\n\n\nIt\u0027s too sad, Natalie.  I don\u0027t want to think about this.  Look at me.  We\u0027re here.  We did find each other, and there is no such person as Walter.  We can kill him with a thought.  It\u0027s just us, and Fate didn\u0027t betray us, and we can tell these ghost stories only because we know they aren\u0027t true.  Happy anniversary, my love.\n\n\n \n",
  "page 268": "Yeah, not falling for it.  But now you have to sit there while I spin this out and think it through.\n\n\nSo she\u0027s snoring and you are dying to move around, get some relief, but you are just trapped there in the twin bed--in our tiny, dollhouse-sized conjoined-twin-bed, and your hands are even pressed up against the wall.  It was a seriously narrow bed.\n\n\nSo the room is rumbling with her snores, the walls are shaking, and she\u0027s hitting that low D note, four octaves below middle C, and then she\u0027d build up higher for several notes, and then return to the lowest possible note, playing almost a scale with her snorts.\n\n\nIt\u0027s like how a soprano can hit that high note that shatters a crystal punchbowl or a window; this low, rumbling snore is giving this low-grade stimulation intangible to male parts, as if Cassie were playing a low-pitched dog whistle that only you could hear, and you were vibrating like a tuning fork.\n\n\n \n",
  "page 7": "Just like that?  Hardly.  You would never have done that.  You went to my table.  You looked at me--you must have looked at me, you freely admit that, because you can\u0027t ignore someone if you don\u0027t notice them first--and then you came over to me.\n\n\nWe joked about what if you had gone over there.  How things would have been different.  Worse.  Sadder.  Bleaker, and lonelier for both of us.  But you didn\u0027t turn away, you wouldn\u0027t have. \n\n\nSo I don\u0027t understand how you could be here on this page, why I waste the time to write it, imagining worlds in which you don\u0027t or won\u0027t remember.  Torturing myself, imagining futures and pasts that weren\u0027t, will not, must not have, can\u0027t have would, insert the tense of your choice, real.\n\n\nBut go ahead, then.  Distort our story if you insist.  Please.\n",
  "page 146": "Right, so you\u0027re in bed with burly Walter, not only post-coital, but pre-coital, because Walter is the man.\n\n\nBut in this brief refractory period in which Walter must regain his vital energies, you bend down, your chestnut curls which I have completely forgotten about embracing the side of your face, and you take our your college yearbook, and you flip through the pages, looking at everyone.\n\n\nYou flip by and remember, and then you come upon the page with my face on it.\n",
  "page 2": "So, I thought it would be fun to sort of relive or replay how we met, to remember some special thoughts, and think about what was magical about it.  So we can remember all those fun things we did a long time ago.\n\n\nSo let\u0027s remember together!  It was September, the very beginning of college, just before classes were about to begin.\n\n\nI was sitting in the cafeteria, the big one, the Flynn Cafeteria.  Try to imagine it.  I was sitting in the back, by the window, where I was feeling a little lonely.  I didn\u0027t like my roommate, I found college overwhelming so far, and I was sitting with my tray by myself.\n\n\nI think I was eating corn chowder.\n\n\nAnd I\u0027m reading a thick book.  It might have been Boswell\u0027s Life of Johnson, which I\u0027d been in the middle of when college started, and I brought it just for moments like this.  I know, I know.  It was super nerdy.  You walked in, got your food, and approached.  I remember were were wearing a loose purple linen shift and jeans.  And black boots.  Your legs looked really good.\n\n\nWhat do you remember from that moment?  Do you remember it at all?\n",
  "page 1": "I know you don\u0027t really play \"computer games\" (as you call them!) but this isn\u0027t like when I suggested you play Doom back in our freshman year, and you got really frustrated and kept shooting when you didn\u0027t want to and walking into walls, and you claimed the \"game was impossible and nobody could control a keyboard and mouse at the same time.\"  That was a debacle.  But this is just just a choose your own adventure--remember them?  Trust me, this is easy.\n\n\nSee, click your choice below, just like I did for you on the previous page.   Go on, click your choice (and there\u0027s only one to choose from here!  Later pages might have more though!)\n",
  "page 148": "I put the slice of artifical cherry in my mouth and taste the false sweetness for a moment.\n\n\nIt didn\u0027t have to be this way.  There could have been something I did to twist fate so wretchedly.  But maybe it wasn\u0027t me.  Maybe it was something you did.  Or didn\u0027t do.\n\n\nI think about you, though you don\u0027t think about me.  You are in ectasy with Walter, no doubt, screaming his name, when my name could easily have been there, touching his chest, when my chest could have, should have been there.\n\n\nThere\u0027s a whole part of your mind where I would have fit into that\u0027s missing, and you don\u0027t know it, and you\u0027ll never know it, because Walter is there, and he\u0027s good at trivia, and that\u0027s what the world would be if you hadn\u0027t approached my table that day, my Natalie.\n\n\nThat\u0027s a future that exists, and it\u0027s one I avoided because you came and saved me from it.  I don\u0027t quite understand why you wanted to hear that story, but it is a love story, and you are sick, sick, sick, Natalie, and come here and kiss me.\n",
  "page 269": "Shh, I\u0027m weaving a tale.\n\n\nHer snores had a rhythm, a slowly, slowly accelerating rhythm, that then gradually slackened in pace, as if artistically keeping you on the brink, playing you like a glockenspiel or a tympani.\n\n\nBut what you didn\u0027t realize was that every other woman in a 25-foot radius was feeling the same thing, in, it\u0027s true, a decreasing range and intensity subject to the inverse-square rule, but still.\n\n\nCassie was a sort of snore-succubus, invading the ears of every woman, who could not help responding to her--not oral, let us say, but her oral-nasal stimulation.\n\n\n \n",
  "page 4": "I have to say that I\u0027m surprised that\u0027s what you noticed most of all.  It\u0027s just funny that when I ask the question, you don\u0027t think about what you did, or what you said, how how you sat down and we connected on a deep level?\n\n\nIt\u0027s all right now.  I mean, I think I know you by now, and where your mind tends to go.  I guess we\u0027ve always been a little bit of a mismatch in certain ways.  I guess in an ideal world, both partners are matched:  their sex drive, their particular desires, their every little desire for something, matched to a desire to give that thing, like a brand-new jigsaw puzzle, solved in one particular way, and all the pieces fit, with no pieces left over or lost behind the radiator.\n\n\n \n",
  "page 3": "You looked at me, noticing me, when hundreds of people had walked past me that day.  I wasn\u0027t expecting to make friends, let alone meet the girl who would become the love of my life.  We were both so young, both eighteen, with infinite time to find each other.\n\n \n\nRemember what you did?\n",
  "page 99": "OK, fine.  We can do it your way.\n\n\nSo for some reason, the conveyor belt starts moving, I don\u0027t know why, there\u0027s no dishes or trays yet, but all right.  They are warming it up.  So now, I have a dilemma.  You are about to be pulled into the automatic dishwashing system.  But there\u0027s probably workers back there who will notice you and shut it down before you are submerged into the scalding hot water and industrial-abrasive spray and caustic chemical.  Probably. \n\n\nThey have the radio on back there, really loud, so screaming won\u0027t work.\n\n\nSo the question, really, is, since the conveyor belt is going pretty slowly, do I try to rescue you and be a big hero, or do I try to get a minute of touching in while you are being pulled into the wall?\n",
  "page 98": "We hadn\u0027t even learned each other\u0027s names, but we felt the pull of unresistible lust.\n\n\nIt is not like now, scheduled, lights set to 1, almost sterile, after a single glass of sweet wine for you.\n\n\nA to-do list on the night table in case you think of an appointment you need to make for kid #5.\n\n\nI might enter the bedroom, your sweat pants and T-shirt folded primly on the green tall-backed chair.  I don\u0027t even notice how sad this all is because of my ILF fetish, as it were.\n\n\nBut no, this isn\u0027t like that.\n\n\n \n",
  "page 9": "I looked up and saw you, and then I looked back at my book.  It would have been very easy for you to walk past, to say nothing, to ignore me entirely.  In fact, it was the obvious thing to do.  It was right at the start of school, your hair was long and rippled with chestnut curls, and your next four years stretched out before you with possibility.  But you saw me, and you decided that this was a moment to act, to approach, to find me.\n\n\nAnd then, what did you do?\n",
  "page 90": "We said our goodbyes and walked away.  I suppose we felt we\u0027d found a new friend.  Here\u0027s an old diary entry from that time.  Listen:\n\n\nAugust 31, Train to school, did errands, got cafeteria card.  Went up for honor club, don\u0027t think I\u0027ll get in.  Chatted with new people, Donna, Karen, Michael.  Dorm looks ok-ish.  Helped Irene and Max (guy with green hair) move in.  Saw Sam by mail room.  Band coming to school \"Solid State\" and I might go.  Met Natalie in cafeteria.  There\u0027s a desk in the bathroom of the dorm???  Bill on my hall plays bass.\n\n\nSo, there you are, in the middle, worth mentioning, but no more special than helping Irene and Max (with his green hair) move in.  We met, we liked each other, and from then on, we were that person we saw on the way to and from classes, a mandatory, \"Hi,\" and \"Good morning, Natalie.\"  Later it became \"Morning,\" because saying \"Good morning\" was, I guess, just too intimate.  Passing acquaintances, I think, is the term, and we were always passing, never once going in the same direction.\n",
  "page 93": "That\u0027s.. not a good fantasy.  I don\u0027t see why you\u0027d want to tell the story that way. \n",
  "page 92": "Yes, that\u0027s right.  You leaned way back on the conveyer belt.  Let\u0027s say I thought that was hot, like, even though it was kind of wet and probably had a few suds on it, you didn\u0027t care, because you were so turned on, you didn\u0027t care if you got a little messy, which I thought forebode well for my prospects.\n\n\nSo then I came closer to kiss you...\n",
  "page 94": "All right, so I\u0027m just standing back there in the dark, pants down around my ankles for some reason, and you\u0027ve already left for class, having totally forgotten about me at that point.\n\n\nAnd let\u0027s say, for some reason that professor whom I really respected and required a letter to get an internship has been eating there, and he didn\u0027t like his corn chowder, and let\u0027s also say he was diabetic, so that throws off the calculus for how long there would be privacy there.  Professor Gilman walks back into the nook and sees me, and I\u0027m trying to blend into the shadows now, but that\u0027s not going to work.  I can\u0027t pull my pants up because that\u0027s not going to do any good.  He\u0027s already seen that they are down, so my only chance is to see to it that he doesn\u0027t know who I am.  He approaches me to scold me, and I just run for it.  If I can make it out of the cafeteria, I can get up the stairs and into the bathrooms on the second floor.\n\n\nBut at this point a group of every attractive girl on campus has walked back there to bus their trays, and I run right through them to escape the nook, my pants sort of around my knees, half-hitched up, and the professor is shouting my name, and I trip and fall on the floor directly in front of the front door of the cafeteria, pants down, with, let\u0027s say, a bloody nose.\n\n\nThen everyone laughs and points at me.  Meanwhile, you have purchased a bubble tea and are sitting in your anthro class across campus.\n\n\nHow\u0027s that?  Is that a good fantasy for you?  Sort of hit all of your buttons?  Are you breathing a little heavily now, Natalie?  Well, I hope not.  I sincerely hope not. \n\n\nBut I spent the time to write this out for you just in case you have certain fetishes and desires that you\u0027ve never told me about.  I sincerly pray that, while I\u0027m standing here watching you play, you do not get to this page.\n\n\nAlthough it would, I suppose, be useful information to know.\n\n\nHappy anniversary.\n\n\n \n",
  "page 97": "We hadn\u0027t even learned each other\u0027s names, but we felt the pull of unresistible lust.\n\n\nIt is not like now, scheduled, lights set to 1, almost sterile, after a single glass of sweet wine for you.\n\n\nA to-do list on the night table in case you think of an appointment you need to make for kid #5.\n\n\nI might enter the bedroom, your sweat pants and T-shirt folded primly on the green tall-backed chair.  I don\u0027t even notice how sad this all is because of my ILF fetish, as it were.\n\n\nBut no, this isn\u0027t like that.\n\n\n \n",
  "page 96": "Are we doing slapstick comedy here?  You were kind of getting me worked up.  Seriously, Natalie.\n",
  "page 271": "Good, I hope you do.  I hope she\u0027s been treated for her deviant nostrils.\n\n\nNow you tell me a story.  It\u0027s your turn.\n",
  "page 270": "Is it gross?  Or is it kind of beautiful?  Like the way women\u0027s periods sync up; Cassie synced everyone up erotically to the sound of her breathing (if you can call it that).  She was like an Earth Mother, her exhalation filling you with life and pleasure, rushing into you, thrilling you, making you feel fertile and womanly, all together.  No men allowed, a private club. \n\n\nIt was empowering and explosive and explains why you were always so tired and rarely in the mood every morning, I bet.\n",
  "page 152": "Walter is relatable and muscular and funny and good and trivia, and Quinn is creative and artistic and funny and beautiful and lithe, and they are both completely in love with us.\n\n\nYou have a patio with driftwood furniture, and I have a greenhouse with rare orchids, and everything is right, and Walter is turned on again, and Quinn is scratching her nails on my back again, and the yearbooks fall on the floor.\n\n\nThere might have been a different world, but there isn\u0027t.\n\n\nIs that the story, you want to hear, Natalie?  How things might have been, how we might have been happy with other people?  Perhaps so.  But there is no Walter, and while there is a Quinn, I haven\u0027t heard from her in decades.  It\u0027s a fiction.  We have our real story, and it\u0027s unglamorous and has no adventure or dangerous sex or anything, just love--soft golden love that fills the day.\n\n\nIf that\u0027s enough, then kiss me now, because I understand about wanting to scare yourself with thoughts of other futures, to think of how close we come to not being here in this room together.\n\n\nAnd if that\u0027s not enough, then please, by all means, you go find your Walter, and I will look up Quinn.  We are here now, but we don\u0027t have to be.  It would be so easy to leave.\n",
  "page 151": "Right, so you\u0027re in bed with burly Walter, not only post-coital, but pre-coital, because Walter is the man.\n\n\nBut in this brief refractory period in which Walter must regain his vital energies, you bend down, your chestnut curls which I have completely forgotten about embracing the side of your face, and you take our your college yearbook, and you flip through the pages, looking at everyone.\n\n\nI\u0027m in bed with Quinn half the country away, and I\u0027m, as always, enjoying her long, long dancer\u0027s legs.  She does vinyasa yoga daily, and she makes French press coffee in the morning.  She dances ballet for city theater four days a week, and teaches at her own studio the other three.  She\u0027s busy, but undistracted, the picture of serenity.\n\n\nYou flip through the pages of your yearbook, and remember, and then you come upon the page with my face on it.\n\n\nMeanwhile, after throughly satisfying Quinn who turns out to be an energetic demon in bed with very exotic tastes and fixations, I too, coincidentally, grab my yearbook, having to reach over Quinn, grazing her body accidentally, thus provoking what is sure to be a third round between us, her with her dancer\u0027s stamina, naturally.\n\n\nI look through and happen to pause at the picture of you.\n",
  "page 272": "Oh, I know what I have in you, Natalie.  Come here.  I\u0027ll tell you some more stories.  Let\u0027s never stop making stuff up.  It keeps you young.  Happy anniversary.  Hope you liked your present.\n",
  "page 275": "I thought you\u0027d never ask.  I love you, Natalie, and I hope you don\u0027t mind if I tease a little.  I can\u0027t stop telling you stories.  It\u0027s what I do.  Now come on and get in bed with me.  I just thought of another good story about the time you were having trouble editing your English essay and decided to remove, to completely strip away, the introduction entirely.  You\u0027re going to love it.\n\n\n \n\nHappy anniversary, Natalie.\n",
  "page 153": "It\u0027s all a lie, all of it.  The house is a lie, and Walter is a lie, and even this version of Quinn is a lie.  Because we did meet, and we were in love, and fate didn\u0027t fail us.  That happy future would have been miserable, and I can\u0027t tell this story without hearing how hollow it is.\n\n\nAnd you knew that, Natalie.  It\u0027s a ghost story, but we were the ghosts.  Yes, we could easily have missed each other.  But we didn\u0027t.  We made it onto the lifeboat, and we\u0027re safe, watching everyone around us drown.  We had to find each other, and we did, and now everything is all right.\n\n\nWe are older, so only now do we realize how close we come to loss, how deep that abyss is, how sad most of the paths in life are, and how many choices lead to sorrow.  But we\u0027re safe.  We\u0027re here, and happy anniversary, my love, my Natalie.\n",
  "page 274": "Too much?\n",
  "page 134": "How about this for a fantasy.  Fuck you, Natalie.  You aren\u0027t playing right, and I don\u0027t know why you sickly want to fantasize about us never meeting, never falling in love.  Why don\u0027t you go enjoy Kevin and Paul.  Sit right next to them.  Walk home with them and do whatever you want with them.\n\n\nFine.  So we never fell in love.  Maybe we never met at all.  If we never met, I can\u0027t leave you.  I don\u0027t know whose stuff this is, or whose bed this is that I\u0027m tearing to shreds, or who car this is that I\u0027m beating the hell out of with a crowbar, but we never met, we never fell in love. \n\n\nAnd I hope you and Kevin and Paul are very happy together and you learn a lot of chemistry together.  Happy fucking anniversary, Natalie.\n\n\n \n",
  "page 255": "We\u0027d get in bed, as snug as can be--this is snug in the sense of \"way too tightly packed together,\" not \"cuddly\"  and try our best to just enjoy each other\u0027s bodies closely packed together.  There was no chance of anything sexual happening, of course, not only because you rarely wanted that, but also because that would require some modicum of movement, and if I moved in the slightest, I would fall to the floor.\n\n\nBut we enjoyed each other\u0027s nearness, anyway.  Cassie, for her part, would zonk out into a K.O.\u0027d, nearly drugged-out sleep, fueled not only by literal and liberal drug use, but also by the late hours she kept at rehearsals.\n\n\nAnd she would snore, loudly and robustly.  I\u0027m sure you remember.\n",
  "page 133": "Try to be a little more enthusiastic, Natalie.  This is your fantasy and our story.  We were--we would have been--in love.  The world was ensuring it.   Say it with some enthusiasm.\n",
  "page 254": "Yeah, on the floor!  That\u0027s called being a teenager.  I couldn\u0027t do that now.  It would destroy my back.  But I did, and we\u0027d wait until Cassie was asleep.  I didn\u0027t dare get into bed with you, though, because your bed had a squeak and we\u0027d definitely wake her up, and you didn\u0027t want to get down on the floor with me after that one time you saw a stink bug down there.\n\n\nSo you would write to me, the most erotic things, actually sometimes in rhyme or with pictures, and you\u0027d pass them to me.  But it was dark, and you couldn\u0027t see to write well, and I could see to read them, except maybe if I caught a sliver or moonlight, or if I could get a fragment of light from the hall under the door, or from the green glow of the LED numbers of the clock.  It was like phone sex over a telegraph or as if you were doing a cryptogram but you only knew that Q\u003dT and R\u003dP and L\u003dI and nothing else.\n\n\nI saw bits of what you wanted me to do and think, and it drove me crazy.  It must have been loud, you writing and me trying to silently find some light, both of us trying to use text as friction, and we couldn\u0027t do anything about it because of Cassie being there.\n\n\nOften, in the morning, the notes weren\u0027t so interesting.  One time it said \"Let\u0027s not forget to go to the lecture tomorrow for extra credit in Rel. Studies\" in the light of day, a note which, I swear, at night seemed like an invitation to use you luridly and in an exotic way that I had never dreamed of.\n\n\n \n",
  "page 136": "Maybe so.  I would have had more experience, and you would have been ready to commit fully to me.  But that\u0027s all right.\n\n\nLet\u0027s make this our story, then.  We met in chemistry class, let\u0027s say, and everything else, all the other stupid stories there could have been--just forget it.  We had a mature, older, and sweeter meeting, and our lips touched, and we were already thinking about graduation and jobs, not the new vista of college.  It was a more mellow wine, not as youthful, but that\u0027s all right.  I think it\u0027s all right.  I\u0027m a little embarrassed by my freshman year self too.\n\n\nHappy anniverary, then, Natalie, two years fewer than I thought, but happy anniversary nevertheless.\n",
  "page 257": "This is going to end up being the thing that looks erotic on first reading, but ends up a terrible disappointment, but OK, Cassie.  Let me go up those steps and have a few moments to enjoy the thought.  That\u0027s a pretty good present right there.\n\n\nGo on, you go up the stairs first.  I want to admire you.\n\n\n \n",
  "page 256": "I guess so.  Without her, we\u0027d have just been in bed, and then there\u0027d be no story to tell.  Which wouldn\u0027t have been so bad.\n\n\nNow come with me upstairs.  It\u0027s dark, and there\u0027s no Cassie here to disturb us.  I\u0027m tired of all your excuses.  It\u0027s time you made good on the notes I thought you were writing to me back then.  I have a sneaky suspicion you switched the notes in the middle of the night, and you\u0027ve got a dirtier mind than you let on.\n",
  "page 138": "Slowly, it happened.  We didn\u0027t expect it, but maybe we should have.  We drew our chairs a little closer together.  We stopped happening to sit together, and starting going to class together and sitting together on purpose, in \"our\" seats.\n\n\nWe studied together, and then one day we put the books down and looked at each other.  Do you think that\u0027s how it would have happened?  Would we have asked each other about past loves and figured out all of our past near misses?  Or would we forget that and touch lips to each other and be thankful that we\u0027d found each other, even after two years, lost, down the drain.  But that didn\u0027t really matter.  We would have been twenty, and your hips were slim and your wrists were narrow and covered in bangles, and your lips were crimson, and your hair was an impossible burst of chestnut curls, and your eyes were pale blue and young and unlined.\n\n\nI would have longed for those two years, though.  Two years!   Two full years of loving you--the sweetest, least jaded version of you I could possibly have loved, but it doesn\u0027t matter. \n\n\nPerhaps we found each other when we most needed it.\n",
  "page 259": "I remember that, and I remember that she was going to, but then she ended up leaving school.  I couldn\u0027t believe it.  It was so unlike you, and you kept saying that you had a surprise for me.  And then she ended up leaving before we could make it happen.  What an annoyance.\n",
  "page 139": "I don\u0027t go to clubs, of course, so I don\u0027t know why I would find myself in one, but let\u0027s say I stopped in on a whim, feeling a bit older--28 now!--and wanted to try to meet someone. \n\n\nThe music was pounding and violently trying to expel me, perhaps recognizing me as too old or uncool to be in here.  I screamed out my drink order, choosing something I thought was cool, a Scotch on the rocks, and then I saw you.\n\n\nYou\u0027d be dancing, looking, well, you were 28 too, but you wouldn\u0027t look it.  You\u0027d be wearing a dark green, fairly tight dress, and low heels, and larger earrings than I\u0027d ever seen you wear.  Gold circles with a bird in the middle.  And your chestnut hair would be a little shorter than before, which was a shame.  I wanted to see that mane of curls, but you didn\u0027t maintain in the way I liked it, because I wasn\u0027t a part of your life, anyway.\n\n\nYou\u0027d be dancing in the middle of the din, with some girlfriends, the lights flashing over you, and you\u0027d look up and I see you, and it would all come back to me.  The whole world, the whole universe of possibilities.  I\u0027d see you and your beautiful face.\n",
  "page 0": "Dear Natalie,\n\n\nFirst of all, happy anniversary of the day we first met, my love, my sweet darling.\n\n\nTwenty-two years is a long time to be together, to be so closely emotionally connected.  And you mean everything to me.  I know sometimes it\u0027s hard for us to say it to each other.  Long days of work, children, and just--it\u0027s just hard in the moment to pause for a second, look at each other, and say it.  But I love you.  I love you.\n\n\nI love you when you are asleep, and I love when I just look at you at breakfast.  I love you when I\u0027m at work, and I love you when you get into bed, tired from the day, letting dreams lull you, your hair settling on the pillow.\n\n\nSo I was thinking a lot about what to get you for a present this year, to celebrate.\n\n\nI made this for you.  I hope it means as much to you as it does to me.  I\u0027m right here with you, as you play, loving you.  I\u0027ll click this first link for you if you want (I know you aren\u0027t used to these things!)\n",
  "page 260": "Oh, right.  Let me remember that story.  You help if I forget some.\n\n\nSo you, and me, and Daphne, and Carla, and Gus, and Fishman, and Big Bryce, and Pauline got pretty drunk and we invited Cassie to hang out with us.  Well, actually it was in your room, so she was just there, wasn\u0027t she?\n\n\nCassie was there on her bed, studying calculus and listing to music on headphones.  We were all messing around.\n\n\nI just remembered that it actually started with Toby--remember him?  I don\u0027t remember how the joke got started, but the joke was that Toby really liked dirty movies.  Remember this was back before it was a click away.  You had to rent one, for god\u0027s sake.\n\n\nSo you and me and Big Bryce and Pauline (wasn\u0027t she Big Bryce\u0027s cousin??) found ourselves downtown, and we started talking about Toby, saying ha, ha, we should rent porn \"for Toby\" and put it on our VCR \"for him\" because \"he really needed it\" even though the obvious subtext was that we all actually wanted to.  But we were saying it like we\u0027d all just make fun of it, and what a pervert Toby was.\n",
  "page 141": "Now, why would you bring her up?  You know I don\u0027t think about her anymore.  But if you insist, I will think about her, and her soft black straight hair, and her soft skin, tall and curvy, so different from your body.  More attractive, I\u0027d say--really, anyone would say.\n\n\nBut I guess you remember that.  I kept a picture of her on my desk freshman year, specifically to make you jealous and think I was wanted by other girls, which, I guess, I was in Quinn\u0027s case.\n\n\nThat would be interesting to end up with Quinn in this story.\n",
  "page 140": "That\u0027s...horrible.  That\u0027s not how this is supposed to end.\n\n\nBut...if you want it to go that way, I guess I can imagine it.  We graduate and go our separate ways.  You move to Cleveland and get a job in a biochem firm, let\u0027s say you get married to a real estate attorney that you met in a bar on trivia night.\n\n\nYou got eleven out of fifteen questions right, tying for first place.  This real estate attorney was your randomly-assigned partner, let\u0027s call him Walter, and together you got the difficult bonus questions (Pugatorio, Archie Moore, Balboa) at the end, and you two split the winnings of free movie tickets to the premiere of some artsy foreign film, a large popcorn, a box of Sno-caps, and a Pepsi.\n\n\nThe film had some nudity in it, artistic, but you know, still nude, and you and this trivia loving Walter felt something pass between you.  You ended up with him.\n\n\nAnd as for me...\n",
  "page 261": "Yeah.  I guess there\u0027s a lot of things a person can do, and feel, and you don\u0027t get to do all of them.  But you know, in the end, I don\u0027t think about Cassie, not really.  Because I haven\u0027t seen her in years.  She was a path I could have gone done, but it\u0027s you I\u0027m with, and you I love, and you I want.  Someone else would just distract me from you, that\u0027s my whole point.\n\n\nAnother body would be fun, but I have you and our imaginations, and we can create an army of fantasy people to satisfy us in stories, and at the end of the day, I just want you.  So let\u0027s fondly remember Cassie and then forget her, and forget if I said anything to make you upset, ever.  This is about us, and about pure love, and remembering the dumb kids we were, and gazing into each other\u0027s eyes, the way we did back in the cafeteria, and remembering, always remembering.\n",
  "page 143": "Ha, ok.  I\u0027m a sleep subject test guy.  So all I do in the day is lie on an uncomfortable mattress with a catheter and electrodes on me and sleep on demand.\n\n\nThen I come home and just pretend to read or watch some stupid show.  I can\u0027t sleep because if I sleep now, I can\u0027t sleep at work.\n",
  "page 264": "Oh, yeah.  When she really got going, with that kind of raw, muddy, pebbly snore like a hydraulic drill excavating a quarry, with a sort of settling, semi-liquid froth finish.  I am not a connoisseur of snores, but this snore called for fancy adjectives to describe it, only understandable in terms of figurative language, reminding one of the sound of a cartoon bullfrog would make if his pond were suddenly being suctioned up by an industrial vacuum hose with a pinhole leak in it.\n\n\nNot to go on about it too much, there was a slurry of various liquids in there, a sort of smoothie made of, I don\u0027t know, saliva, sloe gin, and snot.\n\n\nShe was wildly attractive by day, and werewolf-like at night, turned into a adenoidal beast by moonlight, demolishing any possible erotic feelings a person could have in her vicinity.\n\n\n \n",
  "page 142": "Uh, OK, this is a really weird story to tell, and I\u0027m not sure why you are requesting it.\n\n\nBut, all right, I\u0027m sad and alone.  Let\u0027s say I live in a basement apartment in the more waterlogged part of Northern Florida, the foundation having been soaked through by horrible flooding dozens of times this month.  The walls are so sodden I could put my finger through it, and roaches and termites, and house centipedes, and I don\u0027t know, boll weevils, are infesting the place.\n\n\nI\u0027m eating a can of fruit cocktail, the kind with gelatinous pear, peach, pineapple--all one orange/beige color, with a single florescent cherry slice, a color that never existed in nature.  I\u0027m saving that dyed cherry piece for last.\n\n\nLet\u0027s say I\u0027m wearing gray socks with a hole over the big left toe, so my toe is sticking out.  And I\u0027m thinking about college.  It\u0027s actually more pathetic that I\u0027m a college graduate, and I\u0027m here, with my toe and my cherry slice.  Let\u0027s say I work in a factory.\n",
  "page 263": "Oh, right, like I\u0027ve forgotten.  Like I don\u0027t revisit you and me and Cassie every night in my fondest thoughts.\n\n\nLet me tell it to you.  I was mad, but now you\u0027ve kind of reminded me of when you did try to think about what I\u0027d like.\n\n\nCassie was your roommate--sophomore year, right?  Last year you had a roommate.  And she had pretty short red hair, cut a little dramatically, bustier than you, and she wore vests and coral necklaces.  She had round glasses and spoke in a little bit of a younger voice than you\u0027d think--not a baby voice--that would have annoyed us, but just a little bit of a tone that sounded like she was younger.  Something about her vowels, not sure.  She was really pretty, except, man, did she did to tend her eyebrows.  They were a little all over the place.  I don\u0027t as a rule care about eyebrows, but she should have plucked.\n\n\nShe was a theater geek, through and through, and she was always in the room, sprawled on her bed, reading scripts, singing, trying on different ways of walking and talking.  She never changed out of pajamas when I came over, and I remember she wore those thin soft nubbly gray pajamas.  Kind of stuck in my mind.\n",
  "page 167": "Sorry, Natalie.  I guess I\u0027ve always been a little focused on sex.  I don\u0027t think it\u0027s that weird.  I have certain desires that I know don\u0027t completely match up with yours, but that\u0027s got to be true for everyone, don\u0027t you think?  I mean, I put some of these branches in here just...just to amuse myself, not that I think you\u0027d be interested in thinking about how they might play out, but just for fun.  Just to fill out the choices, you know?\n\n\nBut they could have happened, you know.  It wouldn\u0027t have taken much.  But definitely don\u0027t click them if you see them.\n\n\nSo anyway, just try to think about coming into the cafeteria, ok?  Do you remember that?\n",
  "page 288": "She sure did.  Cassie first messed with the TV for a while until she realized it might be the tape.  She she put in some videotape--remember videotapes?--that we\u0027d gotten for free at the activities fair.  It was a documentary about Botswana.\n\n\nAnd she sat down and started watching it, pushing the headphones down around her neck.  It was really sad.  We all looked up.  There were starving dogs and sick children, and just horrible poverty.   And there was nudity, but not the kind from the other tape, but the nudity of true deprivation.\n\n\nWe all cried a lot that night, and Cassie held our hands and held us all.  And we promised that we\u0027d try to start some kind of club to fight these injustices, immediately.\n",
  "page 287": "Cassie got up, stepping carefully between the legs and arms, in her sock-covered feet, headphones still on, and she smacked the TV.  Nothing happened.\n",
  "page 169": "You looked at me, noticing me, when hundreds of people had walked past me that day.  I wasn\u0027t expecting to make friends, let alone meet the girl who would become the love of my life.  We were both so young, both eighteen, with infinite time to find each other.\n\n \n\nRemember what you did?\n",
  "page 168": "I\u0027m sure you are.  Now listen up.  Remember.  Think about that day.  Think really carefully.  I want to relive it with you.  Do you remember going into the cafeteria?  You have the weirdest smile on your face, I\u0027m sure of it, right now, but try to get your mind in the right place.  Do you remember?\n",
  "page 289": "Yes, you did.  She slapped it again, and you said harder, harder, so she smacked it around a little more, and she said her hand stung.\n\n\n\"No, you have to slap the side really hard, and it\u0027ll work again,\" you said, and it actually got funny, because Cassie was really just tapping it, and finally Cassie got frustrated, and she slammed her hand really hard against the TV.\n\n\nI know it\u0027s not funny, but she broke every single bone in her hand, some several times, and it sounded like if you took a big handful of dry linguini and you suddenly snapped them all in half.  She screamed, but we couldn\u0027t register the scream at first because the sound was so horrifying.\n\n\nAnd then, Fishman had the gall to ask if we could continue, like this was all about him.  God, Fishman was such an ass.\n\n\nThat completely broke the mood, I\u0027d say.\n",
  "page 170": "Ugh, no, I don\u0027t want to talk about Floyd with the shoulders.  You have this thing with shoulders, and it doesn\u0027t make any sense.  Shoulders aren\u0027t a primary or secondary sexual characteristic, or even tertiary.  But I know you have a thing with arms and shoulders.  You told me that right away, and started working.  I did Cuban presses, military presses, Arnold presses, all the presses.  Everything that I could press, I pressed.\n\n\nBut the results are certainly not Floyd level of shoulders.  I asked you what you thought and flexed for you and you said \"fine, good\" and I wanted to die.  But I don\u0027t think there\u0027s any point thinking about Floyd now.\n",
  "page 291": "No, I guess we didn\u0027t.\n\n\nAnyway, the mood was broken at that point.  We were up all night, Cassie with us, talking about pain and how lucky we all were to be here, together, with enough to eat, and clothes, and shelter, and the opportunity to have a decent education.  Then we hugged and cried some more, and then we all put on our clothes and went to class.\n\n\nI guess that\u0027s college.  You learn a lot, and you have to be aware of these opportunities to grow.  So I guess this is a long way of saying that I knew you were going to find your way here to this page, and I wanted to tell you what I had actually gotten you for our anniversary--but I wanted you to remember why.  I gave $1,000 in your name to a relief foundation in Botswana for starving children, and war veteran dogs who need adoption.  Kind of in honor of that night.\n\n\nHappy anniversary, my darling.\n",
  "page 290": "You did.  And she listened, and you said, \"no, pull it out until just the tip is in the little hole and then jam it in until you feel it hit bottom.  Then turn it a little bit, jiggle it.\"\n\n\nEveryone was kind of transfixed by it, because it was as if you and Cassie were suddenly involved in this very pornographic activity, but she was just fixing the TV, there was nothing dirty about it, except that we were all naked except for Cassie.\n\n\nAnd Cassie had no idea that anything she said could have been taken as anything but technical TV talk.  It suddenly occurred to us that everything, everything is sexual.  She was asking if there were other ways to turn the TV on, if she should gently play with the knobs, if you wanted to watch her while she did something with the power strip, if she needed to adjust the jack--everything out of her mouth was the filthiest possible thing, while you were encouraging her to just play with it a little more or to try different inputs in the rear.\n\n\nAnd suddenly we all lost interest in actual sex, because this was much better.  And then, as you coaxed her with the coaxial wire, the TV suddenly burst with a shower of sparks and popped with a flash, and I don\u0027t want to speak for anyone else, but I was fully satisfied at that exact moment, and I think you were too.\n",
  "page 172": "No, you don\u0027t get to \"decide\" the story.  You can only pick what I decide you can pick, like from a menu.\n",
  "page 293": "She sure did.  You\u0027ve got to give her that.\n\n\nPoor Cassie.  She had to wear that crazy cast with all the pins and things for a while.  But she left soon after that, I guess.  We should look her up and remember old times.  I wonder if she remembers us fondly.\n\n\nAt any rate, this was fun.  Good times.  I was going to ask you if you wanted to go upstairs and make love, but all I can hear is that sound of bones snapping.  It haunts me.  Maybe let\u0027s just watch a little TV.  I love you, Natalie.  I\u0027m glad you\u0027re mine, and we have all of these stories, and we were both in them.\n",
  "page 171": "You looked at me, noticing me, when hundreds of people had walked past me that day.  I wasn\u0027t expecting to make friends, let alone meet the girl who would become the love of my life.  We were both so young, both eighteen, with infinite time to find each other.\n\n \n\nRemember what you did?\n",
  "page 174": "Yeah, well that\u0027s interactive fiction.  That\u0027s the way it goes.  You don\u0027t get full choice of everything.   I\u0027m writing this out, and you\u0027re starting to piss me off now.  You should go back, go back to the previous choice before we got into this Floyd thing.  It\u0027s just frustrating that this is all about us, but you choose to bring Floyd into it.  OK?\n",
  "page 295": "I guess that would ruin it a bit.\n",
  "page 173": "Are you joking, though?  I have to wonder.  Because I happen to know exactly what happened between you and Floyd in the month between when we met and when we became an official couple, and what happened three months after that, and then over summer break, and then, crazily, at the end of junior year after we\u0027d been together for years.\n\n\nSo, this this little digression into Floyd isn\u0027t just you being cute, it\u0027s you revealing your guilty conscience.  And what you did with him.  Because I wouldn\u0027t care, honestly I wouldn\u0027t if I didn\u0027t happen to know exactly what you did with him that you never did with me.\n",
  "page 176": "Because I left tape recorders everywhere in your room, and drilled holes in your walls and left a video camera recording.  This was the pre-phone era, so I had to do it the hard way.  So, yes, I spied on you.  Obviously I had a reason to. \n\n\nAnd yes, I saw a lot of the disgusting stuff you get up to, but I didn\u0027t want to say because I really only cared about Floyd.  So, yeah, Cassie, your roommate and you, freshman year.  Fine, fine, I\u0027m sure you were just blowing off steam.  And the less we say about your toothbrush holder, the better.  But Floyd!\n\n\nI got you and Floyd from six different angles, in color, in a sort of artistic sepia, in classic black-and-white.  I recorded the sound in stereo, mono, the moment where he gave you mono in stereo, 3-D surround sound, and Dolby whatever.  I could probably make a paroramic film of it in Epcot at this point, in the international pavilion deep in the filthy country of Natalie, narrated by Stephen Fry or something\n\n\nIn fact, I have it here, for you to enjoy. \n",
  "page 175": "All right, fine.  If you want it.  But I\u0027m doing this under protest.  So you go over to Floyd, slowly.  You can feel his eyes on you as...\n",
  "page 296": "Ha, ha.  Man.  That was a hell of party.  Too bad Cassie left.  Do you have her contact info?  We should invite her over.\n\n\nNo, I\u0027m joking, Natalie.  It\u0027s only you and me, and we can tell these stories, but at the end of the day, it\u0027s us.  I love you, and happy anniversary, and get up those stairs.  I want you to fix the TV for me while I watch.\n\n\n \n",
  "page 156": "Then, goodbye, imaginary Natalie.  It could easily have so.  It\u0027s a horrible, sad, whimpering end of a story but also traumatic and all too possible.\n\n\nI would have looked after you as you disappeared into the crowd, your small body quickly out of sight hidden by the other dancers, and I would drink my Scotch on the rocks--disgusting-tasting--and be deafened by the bass, and sit on the side for a while, and gather my thoughts, and then try to chat up two girls from Jersey completely unsuccessfully, coming out fifty dollars the poorer after buying them both cosmos.\n\n\nAnd that, my Natalie, is where I would be seven years after college without you.  You would be lovely, dancing, having the time of your life, no doubt attracting a troop of sailors on leave, while I was sad and broken.  That, of course, is my point.  You are everything to me, and I know what you are, and how lucky I have to have you dance towards me, not away, to walk towards my table at the cafeteria, not past.  I know, Natalie.  And I love you, and I can\u0027t bear to think about it anymore.\n\n\n \n",
  "page 277": "Shh, that\u0027s a different story. \n\n\nSo that night, back at the dorm, in your room, I put the movie on--we actually hadn\u0027t even invited Toby, hilariously enough.  You were screaming at it, but also intrigued, and everyone else was watching and laughing but also sort of thinking that this was about to get really interesting.  Gus had just put his arm around Carla, and Fishman was breaking out some weed, and you were sitting in my lap on the bed.  And I was kind of wondering if Cassie was going to look up from her calculus textbook.\n",
  "page 279": "Yeah, it was weird.  She wasn\u0027t faking, either.  She had no poker face--she couldn\u0027t have been faking not noticing.  She did look up every once in a while, a little kind of vaguely, like she often looked, and I had the sense that she didn\u0027t even register what was going on all over her floor.\n\n\nIt got to the point where her lack of perception was preoccupying me.  I should have been paying attention to you and Carla, and Carla told me so.  Or paying attention to the aptly-named Big Bryce and Pauline (!) but I could not figure Cassie out, and it was weird.\n\n\nShe was doing these calc problems completely wrong, like completely.  And you could tell she was struggling bad, and she was tearing up.  I knew she was taking calc for the second time, and if she failed again she would have to take academic leave, and she probably wouldn\u0027t come back.  She was already on academic probation.\n\n\nShe actually came over to me and asked me for help with a problem, stepping over your legs and sort of wedging the textbook between your cheek and Carla\u0027s hips so I could see.  Cassie was really, really upset, and was starting to cry.\n",
  "page 157": "I\u0027d see that, and understand you across the dance floor, and everyone else would disappear, whisked away by the invisible stage manager.\n\n\nIt doesn\u0027t matter how long it takes, how many near misses there are, how many detours, and wrong turns, and foolish choices, and stupid miscalculations, we were meant to find each other, in this crowded club.  In this crowded world.\n\n\nAlways, Natalie. It\u0027s fun to joke about it and laugh and think about possibilities like you always do, you and your warped sense of humor, but in the end, everything leads here, here to this desk, where you sit with me.  The lights are off, and the edges of your features are lit from the computer screen like a Vermeer painting, and you are beautiful, and you are forty, and your hair is soft, and you are mine. \n\n\nAnd now I will go upstairs and take out the garbage, and load the dishwasher, and do the little daily tasks, which I can only do, and only feel happy about, because you are here, and you are mine.\n",
  "page 278": "No, no, not exactly.  It\u0027s not that she liked what she saw, it\u0027s that she noticed that the TV was messed up.  Remember?  It was getting all blurry, and scrolling up endlessly, with jagged diagonal lines across the screen.\n",
  "page 280": "She sure did.  You made Big Bryce remember he had an English paper due next morning, and then Carla said she had to study the sulcae of the brain for a big test as well, and it all became serious and studious.  We worked really hard--pulled an all-nighter, actually.\n\n\nWe never put our clothes back on, either, because there wasn\u0027t any question of modesty at that point, just that the mood had suddenly become downright scholarly.  Remember?\n",
  "page 282": "I guess we have Cassie to thank for that.  It started out pretty hot, but I actually learned that night.  Like, I really learned how to study that night, in a group.\n\n\nAnyway, just thinking about it makes me sort of want to study or read some hard poetry and do some calculus or something.  Is that weird?  I feel like that\u0027s weird.  Man, I miss college.  Come on, grab a book, and let\u0027s go upstairs.\n",
  "page 281": "Oh my god, me too!  She was drawing that long curved-at-the-ends integral symbol, and it was like seeing some new kind of genitals I\u0027d dreamed up in a fever, but never seen in real life before. \n\n\nI wanted to derive Cassie, to approach her asymptotically, so close to her, you know, her X-axis, grazing it almost but not quite, to see if her limits were infinite, to approximate the area of her curves with my mechanical pencil.\n\n\nWhen Cassie and I were done, I think everyone else but you had left.  You were naked, still, propped up on one elbow, watching.\n",
  "page 163": "I see what kind of stories you think you\u0027re going to get here.  I\u0027m trying to help you remember, and all you want to do make up some stories of a different kind.  Because I don\u0027t think you were looking at me that way.  I think you were just walking.  Now get a hold of yourself.  We can get there, and I like where you\u0027re going, but we have to work into it slowly, all right?\n",
  "page 284": "You\u0027re really cool, Natalie, you know that?  Most girls would be mad, but you were into it.  I\u0027m pretty lucky.\n",
  "page 162": "Hell, yes.  Why wouldn\u0027t I?  You looked good.  You aren\u0027t very curvy, but curvy enough, especially for someone with a small frame like you, and my eyes traced over and in your shirt\u0027s neckline, and I guarantee you that if you had walked past me I would have turned around and watch you walk away if I thought I could get away with it.\n",
  "page 285": "You got it.  Was that a metaphor for sex?  Or--you know, either way, I\u0027m up for it.\n",
  "page 189": "Obviously.  Am I going to get now-you, or young-you, or both?  Either way, I laid out your old volleyball uniform on the bed, which I found in storage.  Whichever of you it fits can wear it.\n\n\nAnd, Natalie--happy anniversary.\n",
  "page 190": "What?  No.  No, that\u0027s not cool.\n",
  "page 192": "I\u0027m somehow both attracted and annoyed, and uncertain what exactly is going on if you ever reach this page.  I think I should probably just...leave this branch done here.\n\n\nYou wouldn\u0027t really close the door, would you?  You wouldn\u0027t.  I know you wouldn\u0027t.  Would you?\n",
  "page 196": "....ok.  Deal.  But only because it\u0027s our anniversary. \n\n\nAnd only if I can call you Quinn.\n\n\n \n",
  "page 195": "Ha, ha, sorry.  You have to watch it.  I guess you don\u0027t have to watch it right now, though.\n\n\nI mailed you the Youtube link, so you can watch it whenever.  And to your friends and family.  Enjoy.  And hey, happy anniversary.  I hope you think of today fondly.  I hope you remember all the choices you made, and I hope you watch yourself with him over and over and over, by yourself, making the same mistakes again and again.  Everyone will.\n\n\nEnjoy.\n",
  "page 197": "Good.  Let me get the lights. \n\n\nHappy anniversary.  Quinn.\n",
  "page 178": "Natalie, no!  Sit down.  Now I\u0027m getting annoyed, and you are going to sit there and play this.  No, sit.  Do I need to put my hand over your hand and click the mouse for you?  Because I\u0027ll do that.\n\n\nThis reminds me of my last birthday when I got no card from you, no gift, nothing.  Just silence on the subject all day.  And I\u0027m sure you were busy, but you didn\u0027t acknowledge it.  It\u0027s our anniversary.  You understand?  I love you, and I refuse to let our two decades old love get rancid.  Try.  Try.  Try harder.\n\n\nNo?  All right.  Fine.  Go do laundry.  Go think about Floyd.  Floyd wouldn\u0027t have stayed around like I did.\n",
  "page 299": "Yes.  You sat down and stayed there, and said hello.  Who does that?  Only at certain moments, in certain contexts, and certain fragile moods and confluences of life can someone sit down with a stranger and talk to them, to actively seek out friendship, to make a connection.\n\n\nTry doing that on the subway, or at work, or at a movie theater, or a park bench.  You will be rebuffed at best, receive a restraining order at worst.\n\n\nAnd why would such an attractive girl come sit down with me, and stay there?  It was fall, and I can\u0027t get that shirt and jeans out of my mind, and the shape of your body was visible and distracting.\n\n\nI\u0027m sure you remember how I looked up, trying to assume some semblance of cool.\n\n\nI\u0027ve told you about what experience I\u0027d had to that point.  Not much.\n",
  "page 177": "Very well.  You were lying on your bed, and he came in wearing nothing but football shoulder pads, the better to tease you with his shoulders.  Then he got on top of you, but not for sex.  He was doing planks.  He was doing a damn high plank right over you, and you were squirming, totally turned on by the sight of him strengthening his core visibly.\n\n\nThen he lifted one leg, still holding that plank.  I mean, his core, his midriff was not bending.  He was totally stiff, and if I were trying to make a sexual allusion, I would, I am talking one hundred percent about core work.  Then, and I know you remember this, he lifted his opposite arm, so now he\u0027s doing a plank with one arm and one leg--the hardest plank a man can do, and you had the best seat in the house.\n\n\nHe held that plank for probably five minutes, and then switched leg and arm.  I would not have been surprised if he had lifted his other leg, and just sort of levitated over you, so buff his abs were. \n\n\nAnd that, Natalie, that is what caused you to achieve ecstasy.  It\u0027s embarassing.  Sex, I understand, but this?  It\u0027s just perverse, and I don\u0027t get it.  So, you believe me now, I assume.  There\u0027s your story.  Why don\u0027t you call 40+ year old Floyd now and see if he\u0027s up for some planks.\n\n\nAs for me, I think I\u0027m out of the mood.  I\u0027ll be home late.\n",
  "page 298": "Yes.  You sat down and stayed there, and said hello.  Who does that?  Only at certain moments, in certain contexts, and certain fragile moods and confluences of life can someone sit down with a stranger and talk to them, to actively seek out friendship, to make a connection.\n\n\nTry doing that on the subway, or at work, or at a movie theater, or a park bench.  You will be rebuffed at best, receive a restraining order at worst.\n\n\nAnd why would such an attractive girl come sit down with me, and stay there?  It was fall, and I can\u0027t get that shirt and jeans out of my mind, and the shape of your body was visible and distracting.\n\n\nI\u0027m sure you remember how I looked up, trying to assume some semblance of cool.\n\n\nI\u0027ve told you about what experience I\u0027d had to that point.  Not much.\n",
  "page 179": "I knew you were joking.  But come, on Natalie.  Play along.  This isn\u0027t like when I tried to get you to play Monkey Island and you just stared at the screen and said it didn\u0027t make any sense.  This is a story about us, ok?  Now start over and do it right.  I\u0027m sending you back, back to the start.\n",
  "page 180": "I know you don\u0027t really play \"computer games\" (as you call them!) but this isn\u0027t like when I suggested you play Doom back in our freshman year, and you got really frustrated and kept shooting when you didn\u0027t want to and walking into walls, and you claimed the \"game was impossible and nobody could control a keyboard and mouse at the same time.\"  That was a debacle.  But this is just just a choose your own adventure--remember them?  Trust me, this is easy.\n\n\nSee, click your choice below, just like I did for you on the previous page.   Go on, click your choice (and there\u0027s only one to choose from here!  Later pages might have more though!)\n",
  "page 183": "Am I?  I don\u0027t think so.  So then I get up, and go over to him, and he looks at my shoulders, and he says, \"nice shoulders bro\" just like that, no comma or anything.  I know people didn\u0027t say \"bro\" then but hear me out.  He looks at me, laughing at my shoulders.\n\n\nAnd I say, hey, Floyd, you don\u0027t know me, but I am going to kick your ass.  Right here.\n\n\nHe looks at me like, \"what\u0027s this loser gonna do\" but his boys next to him look scared.  \"No, man, this guy\u0027s crazy.  We\u0027ve only been here at college for a few days, but we know: he\u0027ll kill you.\"\n\n\nI step forward, giving him the hairy eyeball, and he gives me one back.  And then he flinches.  He steps back.  And I say, \"Natalie\"--assume I heard your name earlier--\"is my girl.  Walk away.\"\n\n\nAnd he says, \"But...\"\n\n\nAnd I say, \"Walk.  Away.\"\n\n\nAnd he says, \"Yeah, but...\"\n\n\nAnd then I give him this really serious look and I go up to him and I\u0027m like, \"Say \u0027but\u0027 again.  Say \u0027but\u0027 again.\"\n\n\nBy the way, how turned on are you right now.  Very, right?\n",
  "page 182": "These are words on a screen.  They are as slow as you want them to be.  Don\u0027t interrupt.\n\n\nSo you go over to Floyd, and he says, \"Hey, you\u0027re Natalie, right?  I saw you earlier.  And I like the way you look.\"\n\n\nSee, he\u0027s not a smooth talker.  He\u0027s a bit of a brute.  But he looks at you with appreciation.  Like, not hiding it.  And he\u0027s wearing a tank top, let\u0027s say.  And also he has a scar on his arm, a detail I\u0027m adding for interesting detail.  And he stands up, and those shoulders are massive, just like beach balls, or let\u0027s say, volleyballs.  Just these big round spheres that look like they could hold up mountains.\n\n\nAnd he says that he\u0027s got a girlfriend, but that\u0027s too bad, because you are pretty hot.\n",
  "page 185": "I thought so.  So then, just because I feel like it, and because I not only have young-you watching me, but I also have current-you watching me, I beat Floyd senseless using judo and improvised weapons (throw the pepper at him, scald his face wtih corn chowder, stab his kneecap with a ballpoint pen) and essentially humilate him until he wets his pants and runs screaming from the cafeteria.\n\n\nBecause I fight for my memory of how we met.  And if you are going to distort it like you did, I\u0027m going to wrench it back and beat the shit out of any Floyd you bring in.  Got it?  And then, your past self, 18-year old you, and your current self, 40-year old you, and I, all have sex together, because both of you need to thank me.  And you find your past self pretty hot, too.\n",
  "page 184": "Right, so everyone gathers around in a circle, and I\u0027m taking bets, and I\u0027m setting the odds 12:7 on Floyd and taking a 10% vig (I have no idea how betting works) and then you slide everything off the table and you clasp hands with Floyd.\n\n\nHe grunts and a big vein pops out on his forehead and on his arm, and probably his shoulder, too, and he looks a little worried and first, but then he takes a deep breath and slams your hand down.\n\n\nBut it doesn\u0027t get quite all the way down.  It stops one millimeter before the table, and then you slowly, slowly push his arm back, and somewhere along here your shirt came off, I guess before the wrestling started.  And you bash his knuckles down on the table, and you leap into my arms, shirtless, arms in the air, screaming victory.\n\n\nAnd I collect all the bets and I stuff the money in your bra and my pockets and there\u0027s just money everywhere, and we make love on top of the salad bar for all to see.\n\n\nRight?  Now I think that dispenses nicely with Floyd.  Are you ready to go on?  No?  You\u0027re all set?  Oh, you want to arm wrestle me? Let\u0027s go then.  Winner takes all.  No, no, weren\u0027t you listening?  Shirt off.  And when we\u0027re done, and I\u0027m victorious, I\u0027m carrying you upstairs as my prize.  It\u0027s my anniversary too, you know.\n",
  "page 187": "Well, I sort of figured on that.  Surprise, Natalie.  Open that closet door.  I looked up Floyd, who lives only two cities away.  He\u0027s older, like us, but man, look at those shoulders.  He\u0027s still doing it for you, isn\u0027t he?  Hair a little thinning on top, a little less tight around the gut, but hey, who isn\u0027t.\n\n\nAnyway, I should get going.  You said I gave you a really crappy anniversary present last year, Natalie.  I assume you\u0027ll like this one better.  I\u0027m going to go catch a late movie.  Take care, Floyd, talk to you later.\n\n\nI love you, Natalie.  Happy Anniversary.\n",
  "page 186": "Oh.  Well, I guess I gave you that opening to make that choice, didn\u0027t I.  You did choose it.  I...don\u0027t actually know why I put that choice in there.  Ok, so then he kicks my ass.  He punches me with his shoulder and I fly across the room, landing in the vat of corn chowder.\n\n\nAnd you are really feeling it.  Like, Floyd is really your man.  But then he walks away and laughs and says, later Natalie.  So you didn\u0027t get to have sex with him, even though right now you probably want to.\n",
  "page 19": "I can only assume you\u0027re having a lot of trouble with this, although it is hard for me to imagine how that could be possible.  This is reminding me too much of the time you tried top lay Might and Magic VI.\n\n\nI explained about the controls and you just got flustered, dropping your sword, assigning skill points essentially at random, spinning absurdly in a circle, fireballing yourself, and spending a full ten minutes trying to jump over a wall in the movement tutorial.  You never even made it into the game part.  You gave up in the tutorial.\n\n\nSo I guess it\u0027s possible you could be totally unable to click a link, although you seem perfectly able to navigate your farm game I see you play when I open your Facebook page.  So I don\u0027t know.  I feel like you know how to click a link.\n\n\nIf you asked directions for the library, I would have given them to you, and you would have been on your way.  Why you would have needed the library right at the start of college, before homework had been assigned, before any classes had met yet--well, it makes no sense.  Obviously.\n\n\n \n",
  "page 18": "As you know perfectly well, I was not, nor never I never been, on a basketball team, or played basketball, even \"pick-up\" basketball.  You would not have, nor did you say such a thing to me.\n\n\nI recognize that you will never actually find your way to this page because you would not be so forgetful about our meeting, about that magical day.\n",
  "page 11": "Ha, ha, no.  I know you don\u0027t really play these sort of things, but listen, no listen.  What you do is you click the line that says the thing you actually did.  You see?\n\n\nI\u0027m going to put a link to the previous page and this time make sure you click the correct one, the thing you really did, not this wrong thing that I\u0027m sure you clicked by accident. \n\n\nDon\u0027t click this one again, do you understand?  It\u0027s not that complicated.\n",
  "page 10": "Yes.  You sat down and stayed there, and said hello.  Who does that?  Only at certain moments, in certain contexts, and certain fragile moods and confluences of life can someone sit down with a stranger and talk to them, to actively seek out friendship, to make a connection.\n\n\nTry doing that on the subway, or at work, or at a movie theater, or a park bench.  You will be rebuffed at best, receive a restraining order at worst.\n\n\nAnd why would such an attractive girl come sit down with me, and stay there?  It was fall, and I can\u0027t get that shirt and jeans out of my mind, and the shape of your body was visible and distracting.\n\n\nI\u0027m sure you remember how I looked up, trying to assume some semblance of cool.\n\n\nI\u0027ve told you about what experience I\u0027d had to that point.  Not much.\n",
  "page 13": "Ouch, Natalie.  That stings.  Yeah, I guess I was pretty nerdy back there.  I didn\u0027t know what to do.  I loved books; that\u0027s all I had for company at the moment.  Listen, Boswell\u0027s Life of Johnson is very good.  No?  I shouldn\u0027t try to defend my nerdiness?  Fine.  I guess I\u0027ve always looked to words for solace in moments like that.\n",
  "page 12": "I\u0027m glad to hear it.  I thought it was painfully obvious back then.  I had no smooth talk, no \"moves\" (what was a \"move\" even?) and no idea how to improve my look or my lack of poise.  At least, that\u0027s how I thought of it.  I\u0027m always my harshest critic, though.\n",
  "page 15": "I\u0027m sure I said something like \"Hey\" or \"Are you going to the thing tonight?\"  Something like that.  It sounded good in my head, and...acceptable out loud.  But I wished I had said something better.\n\n\nBut I do remember what you said back to me, the sentence that made me fall in love with you.  I\u0027m sure you remember too.\n",
  "page 14": "I\u0027m sure I said something like \"Hey\" or \"Are you going to the thing tonight?\"  Something like that.  It sounded good in my head, and...acceptable out loud.  But I wished I had said something better.\n\n\nBut I do remember what you said back to me, the sentence that made me fall in love with you.  I\u0027m sure you remember too.\n",
  "page 17": "No, that\u0027s not what happened.  You wouldn\u0027t have done that, touched me straight away.  You\u0027ve always been reluctant to touch, a natural timidity, or delicacy, or whatever you want to call it.  You warm up, of course, letting me slide my hand into your sleeve to touch your upper arm lightly, a caress that we both know drives you crazy, and then you\u0027ll respond, perhaps, shivering and touching your lips to my jaw, telling me you love me.\n\n\nBut you would not, you would certainly not, have touched me like that, right there in the cafeteria.\n",
  "page 16": "Exactly, yes.  And I smiled at you, and you reached out to see what book I was reading at the same moment I reached out to pull it back, a little embarrassed.  Our hands almost touched.\n\n\nI remembered noting how small you were.  Just delicate all around.  It\u0027s a cliche of fiction to say some woman is delicate, and it is an annoying word, and I detest these trite novel writers devoting time to talking about a woman\u0027s delicate spray of freckles across her nose (puke) or her delicate and narrow dancer-like arms (double puke), or her slender and delicate wrists (etc.)\n\n\nYou were not fragile, far from it, but you were small, and quick and almost feline in eye and affect.  I swear, I could have circumnavigated your waist-equator with both my hands, or very nearly, just like the real Magellan.\n\n\nNow, of course, we have both suffered from the thickening indignities of middle age, and your chestnut hair is shot through with icicles.  More than shot through.  And I see you have thrown out all of your college clothes.  I would have thought you\u0027d keep some for memory\u0027s sake.  They wouldn\u0027t fit now, I suppose.  It would be pleasant if you could dress up that way again.  But I suppose it would be absurd.  But you might try that tightly woven side braid you favored.\n\n\nI hope this all comes back to you.  You are remembering well, and I love you.  Later on, in the days to come, we grew closer.  There was one conversation we had--where was it?  I want to say in a pizza place?  Getting coffee?--where we realized something deep about us. I\u0027m sure you remember what it was, that epiphany we had.\n",
  "page 29": "Listen, Natalie.  I...I can\u0027t stand here and watch you decline like this, your brain slowly turning off, turning into the bread at the bottom of French onion soup, soggy, falling to pieces, dripping and dead.  I can\u0027t watch this happen in slow motion, labeling doors for you, taking away your keys, eventually tending to your bathing and bathroom needs and pureeing food for you and feeding you with a rubber-coated spoon.\n\n\nI\u0027m sorry, Natalie.\n\n\nDarling, you don\u0027t have an Uncle Benny.  I\u0027ve been watching you play this, and I didn\u0027t want to tell you that you\u0027ve been forgetting a lot lately.  To turn off the oven.  To button your shirts.  To close the front door.  You\u0027ve been dropping words.  We went for neuropsych testing twice last week.  Do you even remember that?  You put the red blocks a line, and the white blocks in a square.  Well, most of them, you did.\n\n\nThere\u0027s a special home you can go to.  I can\u0027t watch you fail like this.  In the same way that you don\u0027t remember how we met, perhaps I don\u0027t wish to remember you like this. \n\n\nI\u0027m so sorry, Natalie.  I\u0027m so sorry.  I will visit you, and walk up to your table in the cafeteria, and you won\u0027t know who I am, and I will sit down across from you and speak to you, and it will be like the first time we met, over and over.\n\n\nI\u0027m so sorry.\n",
  "page 22": "So I don\u0027t get it.  No.  Just no.  That\u0027s not what you did.  This reminds me of when you downloaded a virus trying to play Minesweeper.  It\u0027s just unexplainable.  Minesweeper was preloaded onto the computer!  You didn\u0027t even need the internet!  Listen, I\u0027ll explain it again.\n\n\nYou did not jump up.  You stayed where you were.  And you talked to me.  That is the whole point.  You sat there.  I don\u0027t understand what your whole hurry is in this memory to get up.  Sit down, past Natalie!  You are sitting down now, just like you were then.  It\u0027s weird how memory messes with you, though.  You might have gotten up.  I\u0027m glad you didn\u0027t, though.\n\n\nDo you understand?\n\n\n \n\n \n",
  "page 21": "I didn\u0027t catch that.  What did you say?\n",
  "page 24": "I didn\u0027t catch that.  What did you say?\n",
  "page 23": "Is that right?  If you say so.  If we\u0027re going to tell this story, distorted, we can distort it.  I don\u0027t care.  Your memory is shot through with holes, but I don\u0027t care.  Tell it your way, then.\n",
  "page 26": "If you remember it, tell it right.  If it meant something, show me that.   Show me that you care, show me that you remember, show me that we at least share this much. \n\n\nWhat do you remember when you think of that time?\n",
  "page 25": "If you remember it, tell it right.  If it meant something, show me that.   Show me that you care, show me that you remember, show me that we at least share this much. \n\n\nWhat do you remember when you think of that time?\n",
  "page 28": "I didn\u0027t catch that.  What did you say?\n",
  "page 27": "Yeah, maybe you said it to someone, but not me.  So my question is, what basketball player were you flirting with on the same day, maybe the same hour that you met me?  Did you sit down with him, whoever he was, and tell him he was special, too?\n\n\nWho was he, Natalie?  See, there\u0027s a reason I said I\u0027d watch you play.  Who was he?  Move that mouse and click his name.\n\n\n \n",
  "page 20": "No, you didn\u0027t say that to me.  That\u0027s not what happened.  I was there too, you know.  This is honestly annoying me, picturing you getting to this page, arguing about what you did and said.  But I\u0027m sorry.  I\u0027m sorry, listen, I\u0027m supposed to be patient.\n\n\nAnd I\u0027m supposed to kind.  Listen, do you remember your Uncle Benny, what he always used to say about love?\n",
  "page 202": "No, I must have. I totally did.  This girl, I was in love with her.  I don\u0027t even know where to start.  I met her at an arts performance (her: dance, me: chorus) and there was this way she walked down stairs that made me realize it was her forever. \n\n\nObviously it wasn\u0027t, but I thought it was.  She would point her foot (this was in ballet slippers) and settle the toes down and then rest the foot, and then point and settle, point and settle, like a dance.  Hard to explain in words, but trust me.  She was very attractive and kind of pale, and in the full-on ballerina outfit, but with the ballerina body that goes with it.  And she was very approachable, and thought I was really funny.  I seem to remember telling a story about my friend\u0027s car that won her over.\n",
  "page 201": "I\u0027m glad you want to hear more about Quinn.  I know we talked about her a bit at the time.  Remember, she was my friend, the tall ballerina with the straight black hair, and the long legs?  You remember also my thing for ballet skirts.\n\n\nWell, yeah.  I had a pretty big crush on her senior year of high school, and I kept in touch with her even into college.  I guess it was the day before I met you that Quinn came up.  She lived nearby.\n",
  "page 204": "I\u0027ll do better than that.  I will read you something I wrote about her.  This is back in junior year of high school, though.  This is just pure lovesick teenager.\n",
  "page 203": "So? It will still be our anniversary whether I tell you about her or not.   You know, you never liked her, I noticed.  You had this weird sixth sense for when a friend I had was only a \"friend\" because she wasn\u0027t interested in me that way.  And you knew when I wanted someone.\n\n\nAnd I tried to be so good, so careful.  Do you understand what that means?  When someone is working out in a thonged leotard in front of us at the gym, I look at the ceiling or turn on the treadmill to engage you in direct conversation, or pretend to be absorbed in the news on the tiny TVs hanging above.  I live to not show you these things.\n\n\nBut you have that intuition, and you had it with Quinn.  And it made me nervous.\n",
  "page 206": "I don\u0027t know!  What is cheating anyway?  I never once touched her body, or kissed her, aside from nightly in my dreams, so no, I guess I didn\u0027t.  But I wish I had, and maybe you wish I had too, because that would have gotten her out of my system.\n\n\nInstead I wrote the stupidest things about her.\n",
  "page 205": "I didn\u0027t want you to hear me saying stuff like \"how\u0027s your brother\" and \"is that old tree dead yet\" and I would be thinking, \"oh, know I sound like I\u0027m being too casual--she KNOWS.\" But I also couldn\u0027t put that affectionate tone in my voice that I wanted, because you\u0027d flip out.\n\n\nIt wasn\u0027t the same affectionate tone we had for each other.  It was different.  But she...she liked the phone.  We talked a lot in our first two years at school.\n",
  "page 33": "Good.  That\u0027s better.  Do you think you can continue without making any more mistakes?  Between this and last night\u0027s so-called \"baked\" ziti, I don\u0027t know anymore, Natalie.  I really don\u0027t know.  How a person fucks up baked ziti is really beyond me.\n\n\nIt\u0027s pasta, sauce, and cheese.  You put some spices on it.  You put it in the oven.  It\u0027s not that fucking complicated.\n\n\nListen.  You said, \"Hey, I know you. You live in my dorm, on the top floor.\"  Now you say it, the way you said it then. \n",
  "page 208": "About Quinn\n\n\nHow long had I known her?  I must have spent less than ten minutes total with her in my entire life.  Less than .000001% of my life.   And here I was, staring out my window, thinking of her.  Maybe she was starting out her window now.  Thinking beautiful dancer thoughts.  What if she was thinking about me?  Probably not.\n\n\nThe next day I thought about going to see her, but it started thunderstorming and raining.  I decided that she knew enough to come in out of the rain.  She wouldn\u0027t be out.  But, then, maybe she was just artist enough to do it.  I headed out.  I like rain.  In fact, I think I prefer a rainy day to a sunny day.  The trees bowed under the weight of their sodden leaves.\n\n\nHad enough, Natalie?\n",
  "page 207": "Yes.  I\u0027m going to show you something I wrote about her.  At age 16. Pure, horrifying, lovesick, idiot teenager.\n",
  "page 35": "Marvin, with his scraggly half-beard and misspelled tattoo?  I\u0027m surprised.  He left school after that first year, didn\u0027t he?  I remember him falling down during a game and they said he took it like a soldier.  He said in an interview for the school paper that he can\u0027t remember the last time he cried or felt real pain.\n\n\nThat was kind of a while ago, going on twenty years, but I\u0027m going to see if Marvin still holds to those rules.  Now you stay here.  You did good clicking on his name.  I always wondered, and now I know.  When I get back, you\u0027re going to tell me everything about Marvin, and then we\u0027re going to pull those memories out of your head, like they never happened--out of our heads.  We\u0027ll take a shower and clean everything off.  This explains a lot, how I could always smell something on you, like a wolf smelling that some puppy had come browsing around its territory.\n\n\nFifteen miles away.  I\u0027ll be right back.  Don\u0027t get up from this chair. \n",
  "page 34": "Exactly, yes.  And I smiled at you, and you reached out to see what book I was reading at the same moment I reached out to pull it back, a little embarrassed.  Our hands almost touched.\n\n\nI remembered noting how small you were.  Just delicate all around.  It\u0027s a cliche of fiction to say some woman is delicate, and it is an annoying word, and I detest these trite novel writers devoting time to talking about a woman\u0027s delicate spray of freckles across her nose (puke) or her delicate and narrow dancer-like arms (double puke), or her slender and delicate wrists (etc.)\n\n\nYou were not fragile, far from it, but you were small, and quick and almost feline in eye and affect.  I swear, I could have circumnavigated your waist-equator with both my hands, or very nearly, just like the real Magellan.\n\n\nNow, of course, we have both suffered from the thickening indignities of middle age, and your chestnut hair is shot through with icicles.  More than shot through.  And I see you have thrown out all of your college clothes.  I would have thought you\u0027d keep some for memory\u0027s sake.  They wouldn\u0027t fit now, I suppose.  It would be pleasant if you could dress up that way again.  But I suppose it would be absurd.  But you might try that tightly woven side braid you favored.\n\n\nI hope this all comes back to you.  You are remembering well, and I love you.  Later on, in the days to come, we grew closer.  There was one conversation we had--where was it?  I want to say in a pizza place?  Getting coffee?--where we realized something deep about us. I\u0027m sure you remember what it was, that epiphany we had.\n",
  "page 209": "About Quinn\n\n\nHow long had I known her?  I must have spent less than ten minutes total with her in my entire life.  Less than .000001% of my life.   And here I was, staring out my window, thinking of her.  Maybe she was starting out her window now.  Thinking beautiful dancer thoughts.  What if she was thinking about me?  Probably not.\n\n\nThe next day I thought about going to see her, but it started thunderstorming and raining.  I decided that she knew enough to come in out of the rain.  She wouldn\u0027t be out.  But, then, maybe she was just artist enough to do it.  I headed out.  I like rain.  In fact, I think I prefer a rainy day to a sunny day.  The trees bowed under the weight of their sodden leaves.\n\n\nHad enough, Natalie?\n",
  "page 37": "You probably feel my hand, which was caressing your hair while you were playing, tighten, right now, as you read, wrenching your hair to the roots now.\n\n\nThis won\u0027t do, Natalie.  This isn\u0027t love.\n\n\nGo back and look at the previous page, if you can see it through tears.  What was his name?\n",
  "page 36": "You disgust me, Natalie.  But it explains why he gave me that look of ownership when we started officially dating a bit later.  Like a landlord handing over the keys of a filthy apartment he and his friends had been partying in.\n\n\nHe\u0027s dead now, of course.  He died as vilely as he lived.  Oh, you didn\u0027t know?  That\u0027s because I deleted the message from your inbox, so I could tell you here.  Let you know that someone broke into his apartment.  I understand he took ten times his usual dose.   He bled from his eyes and rolled off his bed and his jeans fell down around his knees and that\u0027s where he stayed.  For a week, I think.\n\n\nThat\u0027s what I heard.  I guess I\u0027ve gotten the confirmation I needed now.  Hope you enjoyed your game, Natalie, and had as much fun as I had making it.  Love you always.\n",
  "page 30": "OK, good.  That was a test.  As you--I suppose--you don\u0027t have an Uncle Benny.  So you remember things about your life, and fairly important things, like whether you bought a scratch-off ticket yesterday, just not things about me, and our love.\n\n\nWhat do you make of that?  I\u0027ve made us another appointment with Dr. Carson, and you\u0027d better show up this time.  Repressed hostility, and gaslighting, that\u0027s the word he used.  He also called you passive-aggressive and needy and emotionally manipulative.  If you don\u0027t come, you can\u0027t fix this.\n\n\nI can\u0027t sit opposite an empty chair while the doctor tells me everything you need to work on.  This is for us to fix.  To work on.  A house falls apart if you defer maintenance for too long.  You are the ruined wall, the cracked steps, the peeling paint.\n\n\nI will be in that chair on Friday morning.  You had better be there.  Walk down that hall, approach me, like you approached me in the cafeteria, sit down opposite me, and start talking.\n\n\n \n",
  "page 44": "Yes, we did talk about that, didn\u0027t we?  But I don\u0027t remember if we talked about it as a real thing to be considered, or just as a general notion.  Because I remember--we used to take those little trips, those overnight vacations together, in college, you and I, between the end of classes and our final exams. \n\n\nAs if we were escaping reality, we hopped on the commuter rail or a bus (neither of us with a car as yet!) and found a cute hotel or bed and breakfast, or once, a ski resort, or a dormmate\u0027s parents\u0027 unused summer cottage.\n\n\nAt hotels, we check in furtively, wondering if we ought to give false names, as if it were the 1950s.  The desk clerk didn\u0027t care.\n\n\nBut then!  To have a room to ourselves, playing house, with our own temporarily-ours bathroom, and fridge, and bed--as if we did not often share a bed in our dorm.  But this was a queen-sized bed, and in the dorm, it was a twin, with a mattress the thickness and texture of a piece of sandpaper.\n\n\nThis room was ours, sensually ours, a love nest.\n",
  "page 46": "Yes!  Yes!  You remember what I\u0027m about to say!  We were on one of these excursions, sophomore year?  We were so in love, and sitting in that pizza place.  Benito\u0027s?  Molto Bene\u0027s?  I don\u0027t remember the name, though I should.\n\n\nSomehow, and I suspect, because you ensure it would be so, the conversation turned to children.  This was not idle talk, but real questions.\n\n\n\"I can\u0027t imagine ever having children,\" I recall saying.  \"No intent.  I think of diapers and vomit, and ointment, and horrible school plays and having to watch you swell up in pregnancy, and children\u0027s teeth falling out everywhere, and falling from playground structures leading to ER visits overnight without a pillow or good coffee.  I think of having to smile with mock euphoria at their pride in achieving some cheap trinket at miserable Chuck-E-Cheese, and my face is sore just thinking of holding that dead rictus of a smile.  We ought to just be together, you and I.  I don\u0027t need anything but you.\"  And I took your hand.\n\n\nYou had asked me if I ever thought about wanting children.\n\n\nI felt I had answered the question wholly.  And then, you looked down for a moment.  I assume you recall what you said.\n",
  "page 47": "What was there to say to that, your eyes so trusting, your kittenish arms so slender, so delicate.  Your petite hips, as yet unsullied by the indignities of childbirth?\n\n\nIt was a crossroads.  A moment much like the dilemmas I suppose I am presenting to you in this amusing diversion of a quiz, as I stand here over you, admiring you as you play.  There was no equivocating, no third choice.  No looking away from this sudden stark choice before me.\n\n\nI could have you, sweet Natalie, with whom I was in love, sitting across from me, knee touching mine, gently, lips curling in a soft smile, sure that I was joking about not wanting children, poised to laugh in relief and worship at my wit and we would live happily ever after, tra la, the eight of us.  We would be matriarch and patriarch, maw and paw, and our six fat children to-be, already somehow imagined by me with mucus running down each and every one of their noses, and/or bleeding from skinned knees..\n\n\nOr I could slip away, insanely parting fro you at once, from the girl I loved, for no reason other than that an imagined future might prove nauseating.  It would be as mad as if we parted because I liked Worcestershire sauce on my steak and you eschewed meat altogether.  Strange, unaccountable, suggestive of a certain difference between us, but to part over it?\n\n\nYou recall, naturally, my response.\n\n\n \n",
  "page 49": "God, imagine if you had really said that.  Imagine it, really.\n\n\nYou know, and I know, you didn\u0027t say that.  But what a fantasy.  How things might have been.  And it\u0027s all right, I think, to fantasize about this, to imagine it.\n\n\nWe spoke of everything that day, that week, that month, for hours and h ours.  We talked and discussed everything, and you wanted a family.  It\u0027s hard to imaging you every saying that to me--that you might not want kids.  I\u0027m surprised you even clicked down this path.\n",
  "page 40": "Marvin, with his scraggly half-beard and misspelled tattoo?  I\u0027m surprised.  He left school after that first year, didn\u0027t he?  I remember him falling down during a game and they said he took it like a soldier.  He said in an interview for the school paper that he can\u0027t remember the last time he cried or felt real pain.\n\n\nThat was kind of a while ago, going on twenty years, but I\u0027m going to see if Marvin still holds to those rules.  Now you stay here.  You did good clicking on his name.  I always wondered, and now I know.  When I get back, you\u0027re going to tell me everything about Marvin, and then we\u0027re going to pull those memories out of your head, like they never happened--out of our heads.  We\u0027ll take a shower and clean everything off.  This explains a lot, how I could always smell something on you, like a wolf smelling that some puppy had come browsing around its territory.\n\n\nFifteen miles away.  I\u0027ll be right back.  Don\u0027t get up from this chair. \n",
  "page 42": "I\u0027m writing this page with tears in my eyes.  I know the only way I\u0027ll ever see it again once I close this editor is if the screen is flecked with red.  The echo of a thump still hanging in the air.\n\n\nI\u0027ll look at this screen, and push you aside, sitting in the chair you were in and look at the flecks of red, rolling down the screen, covering these letters.  Please, Natalie.  Don\u0027t make me see these words again.  Please.\n",
  "page 41": "You disgust me, Natalie.  But it explains why he gave me that look of ownership when we started officially dating a bit later.  Like a landlord handing over the keys of a filthy apartment he and his friends had been partying in.\n\n\nHe\u0027s dead now, of course.  He died as vilely as he lived.  Oh, you didn\u0027t know?  That\u0027s because I deleted the message from your inbox, so I could tell you here.  Let you know that someone broke into his apartment.  I understand he took ten times his usual dose.   He bled from his eyes and rolled off his bed and his jeans fell down around his knees and that\u0027s where he stayed.  For a week, I think.\n\n\nThat\u0027s what I heard.  I guess I\u0027ve gotten the confirmation I needed now.  Hope you enjoyed your game, Natalie, and had as much fun as I had making it.  Love you always.\n",
  "page 101": "Of course.  There was no way out of this--you were about to be fed into the boiler or the mangler, or however they cleaned things here.\n\n\nThese were your last moments on earth, and I don\u0027t see why you wouldn\u0027t want to feel some erotic pleasure in those moments.  A choice between terror and terror+pleasure seems like a no-brainer.\n\n\nSo of course I touched you.  Your clothes had to stay on, of course--that was what was snagging you into the conveyer belt, but I took pleasure in your overall shape, tracing the perimeter of your body, touching you, feeling you with firm hands, making you gasp--although it is possible that could have been the boiler or the mangler--even as each part disappeared into the chute, which was a shame, because I feel like I could have given you a really good send-off if I\u0027d had just two more minutes.  I enjoyed your feet last, actually going so far as to remove your shoe and sock and kissing your big toe.  Not really my thing, but a send-off for you.\n\n\nAfterwards, I noticed the emergency shut-off button nearby, but it was, of course, too late.  I sincerely hoped you had enjoyed those last moments.  I notice as usual, even in your fantasy, it\u0027s all me pleasuring you, not vice versa, but I\u0027ll let it slide this time.\n\n\nYou\u0027ve got a rather enticing imagination, Natalie, you know.  I didn\u0027t know you had it in you at the time.  I had to extract it from you little by little, giving you the courage to tell me what you really liked, what you really wanted.  Come on.  Let\u0027s go upstairs.\n\n\n \n",
  "page 222": "Oh, my love.  Thank you.  I guess I never really mourned.  I never really got it out of my system.  Let me make love to you, and hold you close.  It\u0027s the only thing that will help, see, now I\u0027m crying, like really crying, and it\u0027s for how much I love you and need you.\n\n\nI need you to live, and I need you to live--both meanings of that phrase operative.  But I can know you are with me if you take your clothes off and get into bed with me now, Quinn, I mean Natalie.  Because on our anniversary, we celebrate us, not mistakes or wrong turns, or lost opportunities, just us.  Together, my love.\n",
  "page 100": "It figures you\u0027d pick this, but all right, let\u0027s see what I can work with.  I pull you, but you can\u0027t be freed.  So I realize that if I run out of the nook and alert everyone, all of the students around would just look at me dumbly and you\u0027d be gone.  So my only choice is to ride the conveyor belt with you.  So I hop on, on top of you.\n\n\nRemember, we haven\u0027t really met yet.  I have no idea who you are.  We don\u0027t know each other\u0027s names, even.\n\n\nAnd we\u0027re being pulled into the wall, down the conveyor belt, being blasted with alternate blasts of acid and base, and being scrubbed and tossed around by inside-the-car-wash brushes.  I\u0027m tearing your clothes off, not erotically, just to free you from the belt, and finally the material gives way, and we are covered in first-degree burns, having fallen to the floor of the dishwashing automaton I imagine back there, and the burns are smeared in detergent and no-stain Krystal Klear solution, and you are howling in pain, naked and wet and slippery and red, and on top of me, but I\u0027ve saved you, and even when the workers finally find us, we are there, joined in love, squeaky clean and asking each other our names.\n\n\nYou have a really sick fantasy mind, Natalie, and I love it.\n\n\nHappy Anniversary.  I\u0027m going to remember this one.  Maybe some day we can make it real.\n",
  "page 221": "Yeah.  I\u0027m pretty scarred by it even still.  I was really, really traumatized.  And I felt like I couldn\u0027t... you know, I couldn\u0027t trust again.  Like everything I cared about could be taken from me.  And I had already been with you for a few years, and Quinn\u0027s death just made me want to hold on you to more, like you might be stolen out of nowhere.  Because that happens.  Fires just happen.\n\n\nSo I need to hold you now and kiss you, and take your pants off right now, because I could lose you at any moment.\n",
  "page 223": "Is that bad, though?  When it comes down to it, in the end, is that bad?  If this whole storygame is a means to an end, and that end is you finally not doing work at night for once and getting into bed with me and trying to console me for the loss of a dead 20-year old beauty,--if I can make that story compelling, then whose to say that\u0027s wrong?\n\n\nI\u0027m a storyteller, that\u0027s what I do.  And the entire purpose of stories is to get women like you in bed.  It\u0027s my anniversary, and what I say goes, and yes, I suppose it\u0027s yours too, but when you write me a billion-word storygame, you can call the shots.  I want you upstairs and in that ballerina outfit in five minutes.\n",
  "page 105": "That\u0027s interesting.  At some point we\u0027d forget all civilized norms--and why wasn\u0027t this our story, it occurs to me, being in the lawful possession of two healthy, well-functioning, 18-21 year old bodies, of our preferred respective genders and orientations?\n\n\nto find ourselves in the same time and place, with no supervision, utmost privacy, and minimal responsibilities, aside from a paltry five-page essay on the Etruscans or whatnot--why, to be very specific, did we not mark every square inch of that campus with unrestrained and fancy intercourse hour after hour?\n\n\nBut we can imagine it and think about our housemates senior year, jealously audience to us, through the paper-thin walls of our suite.\n",
  "page 104": "I\u0027m picturing button thumbed open, and clasps managed, zipped worked down, belts loosened, you leaning back against the aluminum-trimmed institutionally-gray-painted wall where in five-and-one-quarter minutes now, people will arrive to bus their trays.\n\n\nI slide my hand lightly up your upper arm, no matter that there\u0027s no possibly way past-me could now that that is your on-button, but never mind, I do it anyway.\n\n\nWe\u0027ll introduce each other later, but for now, hands, and mouths, and other parts make their introductions first, and the low din of brunchers behind the low wall serves as our background.\n\n\nWhat if that\u0027s how we met?\n",
  "page 107": "Yes, sure, in the balcony during a production of The Good Woman of Setzuan (warning in the program that this was a mature play and would involve brief nudity in the third act--a prophecy that was all too true.  Also in the first and second act.)\n\n\nLit only by colorful reflections of stage lights, your breasts pale green, some kind of forest scene on stage, not that we were watching.  The balcony was abandoned, and it was a pleasure to have you sitting on my lap here in this place of art and culture.  It was really the only way to enjoy theater.\n",
  "page 228": "Yeah.  I\u0027m pretty scarred by it even still.  I was really, really traumatized.  And I felt like I couldn\u0027t... you know, I couldn\u0027t trust again.  Like everything I cared about could be taken from me.  And I had already been with you for a few years, and Quinn\u0027s death just made me want to hold on you to more, like you might be stolen out of nowhere.  Because that happens.  Fires just happen.\n\n\nSo I need to hold you now and kiss you, and take your pants off right now, because I could lose you at any moment.\n",
  "page 106": "It would have been amazing, and we would have pulled our clothes back up or down, realizing that we had stolen something forbidden from the dragon\u0027s hoard without waking the guardian.\n\n\nI would look at you for one moment more, still tasting your mouth in mine, and then, I think, we\u0027d walk away.  I\u0027d return to my table and collect my things, abandoning my now cold corn chowder, and you would have already walked away with dignity (but you and I would know, with secret indignity).  You would walk out, a half-smile on your crimson-painted lips, and enjoyed going about your day knowing what you\u0027d just done.\n\n\nBut it was enough.  Anything afterwards would be anti-climactic, so to speak, a slow deterioration, an attempt to recapture something.\n\n\nAnd so we should remain strangers.\n",
  "page 55": "Everything was lovely between us, everything, but there there was this unspoken tension that came between us every.  Single. Night.  When we were seniors--together for three years!--we were together, having been out in the city, walking in the evening, holding hands, having watched fireworks over the river.\n\n\nWe had sat on a bench, watching the water, talking about our hopes and dreams, and I was touching your upper arm under your sleeve.  You were talking about where you wanted to travel someday, and we were laughing sadly about a favorite restaurant of ours that had closed a few years ago, and then I knew, I knew, that tonight, if I continued to walk that delicate line of maintaining your calm, of praising you, of eye contact, that later I would have your clothes off.  It felt like a parlor trick, a sleight-of-hand that I was engaged in, as if I were flexing some muscle that released pheromones, but I didn\u0027t have one-hundred percent control of that muscle, and if I lost focus, that magical haze that was surrounding us would fade away.\n\n\nAnd indeed, that is precisely what happened, and you kissed me later that night and started talking about something your grandmother had said to you when you were little (this is a bad sign) and that you were really stressed out about an exam (no, I can see this isn\u0027t happening tonight) and finally that you were really tired and a little headachy (forget it.) \n\n\nI tried to administer CPR to our dying night in bed with you, using the standard method of mouth-to-mouth and chest pressure, but no use.\n",
  "page 109": "Yes, that bathroom in the library with the graffiti, with the scrawled word, written in black marker, SEX, right on the wall as if we were being closed captioned for the hearing impaired.\n\n\nIn the student center\u0027s multi-purpose room, having filled out the proper paperwork to reserve it between 3:50-4:20 p.m., to use the multi-purpose room for our singular purpose.\n\n\nIn the fine art studio, after hours, tangled in a complex nude figure study up on the platform.  A pose too difficult for the Basic Drawing students to render.\n\n\nIn the \"Books Written by Faculty!\" aisle of the school bookstore, always empty, showing our school spirit on a cushion of T-shirts, pennants, and sweaters.\n\n\nIn our graduation robes, nothing underneath, hands still warm from shaking the university president\u0027s hand after receiving our diplomas, cum laude, behind the auditorium.\n\n\n \n",
  "page 54": "Were you though?  And are you?  You had, and have, this strangely passive, dreamlike way about you, in life, as in sex.  As if sex is a thing done to you, not by you--performed in your general vicinity, or to someone near you.  Almost as if there were a voodoo doll of you that I was caressing, and you feel what I do to it, but at a distance, while your own body remains untouched, feeling the pleasure at a remove.\n\n\nI used to ask you--perhaps this was all the way back in senior year--we had been together for three years--three years!--what you most wanted in bed, what you fantasized about, what you wanted most of all, and you would shyly stammer something actionable out after a lot of coaxing and sweet wine.\n\n\nBut never once would you ask the obvious follow-up question about me.  And naturally, you didn\u0027t because it would imply that you would do something with the information.  I have here a list that I wrote for you of desired actions on your part in order from most to least preferred.  It is to the left of the computer, Natalie.  I gave it to you in your birthday card almost twenty years ago as a sort of present to you, so you would know what I, what the person you loved wanted.\n\n\nPeruse it now.  Have you ever performed any action on that list, ever?  Look, for example, at #31.  It could be performed very quickly, with eyes closed, if you preferred.  Look at #7, which is common, I would guess, throughout this fair land amongst loving couples.  I would suggest that this list could double as a list of activities that I have never engaged in.\n\n\nAnd so, I think you understand why I have suggested you play this game now.  I know that it is important to remind you of the love you and I shared, and the passion from back then.  You must have felt something jolt within you, and the first year was *good* and more frequent--every night, sometimes!  So having played this, with my list before you, won\u0027t you choose something?  I\u0027m not even talking about the top ten.  I don\u0027t dare to dream.  But #51?  #92?  Natalie, please.  I\u0027m going to end this page.  You don\u0027t even have to rate the game or leave a comment.  Just pick *something* that involves some movement and even feigned enjoyment.\n\n\nPlease, Natalie.\n",
  "page 108": "Sure, the science labs, why not.  In the biology lab, with a captive audience of fruit flies (Drosophilia) and zebrafish (Danio rerio) we indulged in the activities that only a few hours before the basic biology students had learned about in a highly clinical way, making the sterile lab less sterile.\n",
  "page 229": "Yes.  You sat down and stayed there, and said hello.  Who does that?  Only at certain moments, in certain contexts, and certain fragile moods and confluences of life can someone sit down with a stranger and talk to them, to actively seek out friendship, to make a connection.\n\n\nTry doing that on the subway, or at work, or at a movie theater, or a park bench.  You will be rebuffed at best, receive a restraining order at worst.\n\n\nAnd why would such an attractive girl come sit down with me, and stay there?  It was fall, and I can\u0027t get that shirt and jeans out of my mind, and the shape of your body was visible and distracting.\n\n\nI\u0027m sure you remember how I looked up, trying to assume some semblance of cool.\n\n\nI\u0027ve told you about what experience I\u0027d had to that point.  Not much.\n",
  "page 56": "I didn\u0027t sit you down to listen to excuses.  I expected that you would find yourself here, pleading youth.  But I have here, to the left of the computer, a chart, or graph, I suppose.  If you will examine it carefully, you will find a pathetic line notating sexual contact by month.  You will see that in general the line does not exceed once per calender month, and that in fact, it dips to zero several times in a given 30 days.\n\n\nThis data is troubling.  You can see that the red line indicates menstrual cycle (no correlation); the blue line indicates the academic year (children\u0027s schedule and out-of-the-house-ness--no correlation); the yellow line indicates the standard American economy in case you had money woes (no correlation); the green line is the average temperature in our area (no correlation)  In short, there is no external reason that I can discern for your lack of interest.\n\n\nIt is frustrating, Natalie.  To cajole, to hope, to express delight at sweat pants, and to evince concern at headaches and sleepiness, and to facilitate late-night work for you when we should be otherwise occupied.\n\n\nAnd so, this storygame.  You have played through the logic of the situation, and you did not seem to be getting the hint.  You told me once that the surest way to get you out of the mood was to mention that I was annoyed that you were not in the mood, a crazy paradox that led me to this moment.  Playing here, reading my thoughts, do you see now, what you need to do?  The black line on the graph is dangerously low, approaching zero for several months straight.  Remember young you and young me, how we loved enough other and wanted each other.   Do it for their sakes.  What\u0027s wrong, Natalie?  What\u0027s wrong?\n\n\nYou can end the game now, and you don\u0027t even have to rate and comment.  That\u0027s not what I want from you.\n",
  "page 59": "It\u0027s pleasant to imagine, isn\u0027t it?  And I would write this if I thought anyone but you would see these words.  But if you are here, if you have clicked these links, you must want to fantasize with me, and it\u0027s just you and me, Natalie, just us, and we\u0027re just thinking about our past selves.\n\n\nPart of the fun is that they don\u0027t even know, limited by being trapped in the past as they are.\n\n\nIf you had taken my hand suddenly, and with a look, a furtive tilt of your head, a slight movement, you could have indicated that hidden nook where people bus their trays by placing them on a rather old-fashioned chain-and-gears conveyor belt that led to the automatic dishwasher.\n\n\nThe meal (was it brunch?) had just started, so nobody would be returning their trays, not yet, so the nook would be wholly abandoned.  Minimum of ten minutes before anyone could possibly be done, plus there was chocolate cheesecake that day, so add, say, three minutes for that, for a total of thirteen minutes.  Assume someone might rush or not like the food, so knock half of that off for a very conservative and enticing six-and-a-half minutes of guaranteed, pure uninterrupted pleasure in the privacy of the nook by the tiny and rather dark busing area.\n",
  "page 51": "Yes.  Although we stayed together during college, in my heart, I\u0027d already left, and I severed my attachment, memory by memory.\n\n\nWhen I touched you, I was elsewhere.  When you made plans for afterwards, I knew that it was just a story.  These children, these phantom, not-yet-existing children had managed to sever us and I hated them.\n\n\nThey were monsters, demon-children, to see love between us and kill it, Oedipus-like, heartless.\n\n\nAnd then, without a word, after graduation, I left you sleeping in our shared dorm-room bed.  The room was already packed up, boxes ready for us to move in together in some faraway city.  You\u0027d found a place, and spoke of first and last months\u0027 rent and deposits and speaking of how the apartment had an extra little room just big enough for storage or soon a crib.\n",
  "page 50": "Did I say that explicitly?  I remember that I forced my smile, willing it to turn upwards.  I wanted to be agreeable, to effortlessly be the man you wanted me to be--but more, I wanted to see that I was making an effort to be that way.\n\n\nTo agree kindly, even as you saw that I did not agree, and that, in my heart\u0027s heart, I felt unkind.\n\n\nThat I would agree to the life you imagined, making the supreme sacrifice--my life, my youth, my happiness--just to obey the hormonal juices making your mouth say what you deeply desired.\n\n\nYes, of course, my sweet Natalie.  And I promised myself that anything I said out of love or duty or momentary weakness of misplaced post-coital bliss could ever, ever overwrite this firm moment of certainty that this was not what I wanted.  That any future lies or claims of happiness were hereby declared null and void well in advance.\n\n\nThese words all ran through my mind, bitter and ice-cold, like black tea left with the teabag soaking in it overnight on the windowsill.\n\n\nBut did I come around, in the end, as you promised I would?  That when I met my children, I would fall in love with that, and look back and see that I had been wrong?\n",
  "page 53": "It\u0027s nice to think about, here from a distance of 20+ years, getting the focus of our former selves just so, to think of what our younger selves might have done, could have done, should have done.\n\n\nYou would not approve, I think, of my fantasizing about a winsome, nubile, and wasp-waisted girl of eighteen, sooty-lashed, surprisingly large-breasted in spite of her slimness--and now, perhaps you are angry at my words, but what if that girl were you, twenty-plus years ago you, that all would be well  That was the body, that is the body that I have planted my flag in, after all, and you were the moon, and I were an astronaut claiming outer space for America--I want to say Buzz Aldrin, but that might not be right.\n\n\n \n",
  "page 52": "Yes, I know.  I remember.  I worked in a library back in high school, and when I should have been working, I read all of the books on relationship and sexuality, all written, no doubt in the 1970s and 80s, aged even when I got my knowledge-seeking adolescent mitts on them.  \"Take it slow,\" they sagely says.  \"Offer massages with no thought of carnal reciprocation.\"\n\n\nThat\u0027s the phrase they used.  Carnal reciprocation. \n",
  "page 110": "Yes, that bathroom in the library with the graffiti, with the scrawled word, written in black marker, SEX, right on the wall as if we were being closed captioned for the hearing impaired.\n\n\nIn the student center\u0027s multi-purpose room, having filled out the proper paperwork to reserve it between 3:50-4:20 p.m., to use the multi-purpose room for our singular purpose.\n\n\nIn the fine art studio, after hours, tangled in a complex nude figure study up on the platform.  A pose too difficult for the Basic Drawing students to render.\n\n\nIn the \"Books Written by Faculty!\" aisle of the school bookstore, always empty, showing our school spirit on a cushion of T-shirts, pennants, and sweaters.\n\n\nIn our graduation robes, nothing underneath, hands still warm from shaking the university president\u0027s hand after receiving our diplomas, cum laude, behind the auditorium.\n\n\n \n",
  "page 231": "I guess I am too.  This is exactly the time when I would have called her and talked to her about you.  I miss her.  I need her a lot, and she\u0027s not around any more.  It\u0027s fine, I guess.  But I never was able to have any female friends, ever.  You made sure of it.\n",
  "page 230": "Sort of like this.  Pressed into her, but as a cuddle, not a fondle.  It wasn\u0027t sexual.\n",
  "page 211": "Oh, it\u0027s like that, is it?  Listen, she was amazing.  She was beautiful and sensitive and I liked her a lot.  You shouldn\u0027t be so jealous.  There can be more than one beautiful girl in the world you know.  But I chose you, and I love you, and stop making those puking sounds.\n\n\nThis is supposed to be about us, anyway.  Listen, you didn\u0027t have to follow this path, so I\u0027ll just send you back.  But I have to warn you that I\u0027ll be sort of half thinking about Quinn now.  Not my fault.\n\n\n \n",
  "page 210": "It was a day to walk to the pizza store with someone and buy a large pie with half onions and half peppers because you like onions and she likes peppers and that way, both of you are happy.  It was a day to take the pizza box hot from the over and run all the way home with it, and eat it all at the kitchen table wihtout even waiting for paper plates.  It was a day to wrap up together in blankets and eat all the marshmallows out of your hot chocolate before they even have a chance to dissolve a little.\n",
  "page 213": "No, you don\u0027t understand.  This is actually really sad about Quinn.  There was an electrical short out in her dorm and...\n",
  "page 212": "Hush, you.\n\n\nIt  started to let up.  Everything was still gray.  The leaves were dripping, and there she was inside her house.  For some reason I thought she\u0027d be dancing in the rain, but that\u0027s stupid, and I wouldn\u0027t like her anymore if she did something stupid like that.\n\n\nShe was inside, and I watched her through the picture window, but not creepy, just noticing.  She was staring into the fire, her pale skin alternately turning ruddy and then cold as she stared into the flicker of the fire.\n\n\nI wondered what she was thinking about.  Probably just hypnotized by the flames.  She looked sad.\n",
  "page 215": "Thanks.  She was pretty strong though, and you\u0027re kind of weak.  And she\u0027ll always be twenty, forever, and you\u0027re twice her age.  I think she might be able to beat you.\n\n\nAlso, she has really strong legs.  Dancer.  Not sure how that translates to ghosts.\n\n\nBut listen, if you get in a punching and wrestling match with her, it\u0027s going to be interesting either way.  I feel safe with you around, and I think we won\u0027t have any hauntings tonight.  I hope she\u0027s happy wherever she is, or feeling nothing. \n\n\nBut she\u0027s not with her love, like I am.  Here, warm, and arms around each other.  I think it must be awful to be a ghost and think about everyone you could have kissed.  You don\u0027t get to do that afterwards.  Probably we should take advantage of not being ghosts.  Now.  Often.  Always.\n",
  "page 214": "Well, she did.  She actually, weirdly died in a fire at her school in the dorms her junior year.  Which is why I always go back and look at this old story, with her looking into the fire.  I think she knew.  Well, the fictional her, in my story knew.  As far as I know, the real Quinn didn\u0027t sit around staring into fires.\n\n\nShe played tetherball and danced and did rock climbing, and she had a big brother who went to jail for a week.  So, interesting stuff.  And she liked crystals, not in a hippy-dippy way, just for pretty decoration.  And she told me she would marry me someday if she ever got married, which she never intended to, but that if she married anyone it would be me.\n\n\nI held that in my heart, you know, for a long time.   I sort of still do.  I wonder sometimes what I would do if her spirit came to me and cried and said I\u0027d betrayed her.  With you.\n",
  "page 217": "Sure.  I understand.  It\u0027s just hard sometimes.  I see someone, maybe the back of their head at a ball game or something, and it looks like her, until she turns around.  Or at the pool.  Someone will have the same exact body.  But it\u0027s not her.\n\n\nYou don\u0027t seem too comforting looking.  I\u0027m really sad here, and this brought back a lot of hard memories.  I don\u0027t know why you have to be so hard about it.  When your aunt Tillie died, I was there for you.  This is very much the same.\n\n\nI think I actually need to take a few minutes, Natalie.  I was just thinking about how she used to hold me when I was feeling sad, and what was making me sad was often you.  Not your fault, but just the usual fights we had early on.\n\n\nAnd she would come visit.  She did a lot at first, and we would just find someplace to cuddle.\n",
  "page 216": "Oh, ghost sex.  How good would that be.  And you, of course, would watch.  Obviously.  I\u0027m not even going to put a choice down there, because I know your answer.\n\n\nVery well then.  We should probably start though.  Ghost are attracted to sex of course, and have invoked her name enough to arouse her from the dead.  Let\u0027s give her something to see when she returns.  Let her see what she\u0027s missing out on.\n\n\nI\u0027m thinking about logistics, and what it would mean to have a transparent lover, and whether she is tangible at all, but even if she doesn\u0027t show, let\u0027s imagine she does, that she\u0027s there with us.  I think it would scratch an itch.  Come on, Natalie.  You take one hand, and Quinn, you take the other.  Let\u0027s go upstairs.\n",
  "page 219": "Look, it\u0027s just--she had a lot of nightmares, and I had some anxieties, and would tell me weird stuff that she thought about, and she was maybe more receptive to certain things than you were, and it was just a really good, useful phone call situation.  I needed that outlet, is all.\n",
  "page 218": "No, that\u0027s my point.  I don\u0027t need to talk about Quinn.  I want to talk about you.  So come on.  I\u0027ll send you back to where you clicked the Quinn link in the first place and then we don\u0027t need to ever talk about her again.\n",
  "page 68": "I could not put enough distance between us.  You know that, or you must have guessed.  But I never, never, never stopped loving you and thinking about you. \n\n\nEven when you moved, even when you got married a few years later to that balding ignoramus and had the children you wanted, and forgot about me, I still loved you.\n\n\nSo that\u0027s why I\u0027m here.  And that is why I am standing here, watching you, standing over you, hands in your hair, caressing you while you play my storygame.\n\n\nYour house, you will notice, is quieter than usual, and this is the last link, and you have to press it.  There is no going back.  It\u0027s our anniversary tonight, of the day we met, and I think you almost forgot.  But now you remember everything, don\u0027t you, my love, my Natalie.\n",
  "page 67": "I know.  I took one step out the door and shook my head.  What an asshole I was.  This was life.  This is love.  You were sleeping soundly, and I loved you.\n\n\nI looked outside, past the quad, and out to the street where people were walking, some of them holding hands, some of them with children.  Nobody looked tortured or miserable or about to blow the city up.  I looked back at you.  You were young, and I was young, and I had no idea that I, over twenty years in the future, would be watching me as if from above, watching young me make what I thought was a crushing decision.\n\n\nSo I\u0027d stay.  We\u0027d been together for four years.  That was long enough to know.  My father said I was too young to know, and that if he could he\u0027d try to keep me from \"jumping off that cliff.\"  I guess he felt that way about me and my brother.  But what did he know, anyway?\n\n\nYour arms were slender, stretched out, and the back of your neck was exposed, where I loved to kiss.  I kissed it, and sat next to you, and didn\u0027t realize that I was giving a gift, not to you, but to me, to older me, to me right now, standing next to you, my older but no less beautiful Natalie.\n\n\nI never told you how close I came to leaving.  But now you know, and I\u0027m sorry, and happy anniversary.\n",
  "page 60": "Yes, we just gazed at each other.  We were in public.   We\u0027d known each other for just a few minutes, but something had clicked. \n\n\nIn the months to come, I remember you saying  that you could imagine us married.\n\n\nBut what if you  had said that right then, talking about us as a unit, inseparable, a twinned set, right there, five seconds after meeting me.  You wouldn\u0027t have been wrong. \n\n\nMaybe you would have leaned forward and laughed and brushed your hair back, and you said it with that intuitive and charming way that I\u0027ve come to associate with you at your smartest.   Let\u0027s say you weren\u0027t trying to be cute or flirt with those words--although they were cute, and they were flirtatious--but merely stating with a bit of humor the facts of the case. \n\n\nWe were perfect for each other.\n\n\nThe cafeteria, let\u0027s say, was thinning out, although I suspect part of that was the way we were obviously, ostentatiously, falling love, right there in public.  It was somehow invisibly oozing all over everyone and it was too embarrassing for everyone to be around, but we didn\u0027t care, did we?\n",
  "page 62": "I\u0027m glad it takes a storygame to make you admit that, Natalie.  I told you.  I could not love them.  I told you.  But do you understand my thought process now?  I couldn\u0027t make you understand any other way.\n\n\nYou sit here clicking (painfully so--it\u0027s the top, the point of the mouse that does the job!) these choices.\n\n\nAnd the house is very quiet, isn\u0027t it?  When was the last time it was so quiet?\n\n\nThis is the last choice, Natalie.  Go into the playroom.  Tell me what you see.\n\n\n \n",
  "page 61": "Actually, it\u0027s true, and it\u0027s also true what they say:  happy wife, happy life.\n\n\nAnd I am so happy.  I was actually pretty stupid back then.  So I admit it.  I was wrong and you were right, and when I wipe their cute mouths of applesauce and they sneeze directly into my eyes, I still love them.\n\n\nBecause love doesn\u0027t work by logic, it works with a strange sense of its own, and time makes that happen, just like you said it would, and one of us had to yield, and I couldn\u0027t let you go, not when finding you in a maze of choices is so hard, and there are so many paths that lead to anger and sadness and violence and insanity, I just want to hold on to you, and I don\u0027t care about anything else.  I love you in your sweat pants.  I love you with your white-flecked hair.  I love you with your aging features.  I love you.  You.  Everything from you in good, and that means them as well.\n\n\nAnd I\u0027m happy, really happy.\n\n\nReally.\n\n\nHappy anniversary.  I love you, Natalie.\n",
  "page 64": "I looked up and saw you, and then I looked back at my book.  It would have been very easy for you to walk past, to say nothing, to ignore me entirely.  In fact, it was the obvious thing to do.  It was right at the start of school, your hair was long and rippled with chestnut curls, and your next four years stretched out before you with possibility.  But you saw me, and you decided that this was a moment to act, to approach, to find me.\n\n\nAnd then, what did you do?\n",
  "page 63": "Yes, you remember!\n\n\nIt was so unlikely that you would have been there.  You, of all people.  Fate was impatient, and thrust us together as early as possible, I think.  We must have recognized each other, my Natalie.  It\u0027s funny to picture younger you--before I could rest my hand on your lower back and sweep you into a kiss, my other hand behind your head, fingers in your hair, lips on your neck.\n\n\nLike I am doing now.\n\n\nBecause we were just strangers to each other.  You walked up to the table where I was sitting.  Then what did you do, my love?\n",
  "page 220": "She died.  In a fire.\n"
}