{"page 123":"And we fell in love forever that night.","page 244":"What do you mean \"more receptive to certain things\"?","page 122":"And we talked for a minute and then we said goodbye.","page 246":"Lol, ok, ok, I know when you\u0027re shitting me.","page 124":"But we didn\u0027t really click.","page 245":"I guess that sounds...","page 127":"No, we really didn\u0027t. Honestly I sort of just wanted you gone.","page 248":"You know, some of those are actually kind of cool. And they kind are doing it for me.","page 126":"We found ourselves sitting next to each other in chemistry class in junior year.","page 247":"...","page 129":"And we didn\u0027t talk at all. We just sat next to each other and listened to the lecture.","page 128":"But then, we slowly started connecting, whispering in class and looking at each other.","page 76":"I think I\u0027m done with this game. You\u0027re getting all angry.","page 79":"We drive fast, just the two of us.","page 71":"Just imagine with me. No kids.","page 73":"But this seems a little sad and bitter when you say it. One child would be all right.","page 72":"Imagine just us. Really imagine it.","page 75":"That\u0027s all right sounding. We could have had fun like that.","page 74":"It sounds like heaven.","page 130":"Actually, although it was nice, I wouldn\u0027t say we fell in love.","page 132":"No, we didn\u0027t talk. And we stopped sitting next to each other because there was a drip in the ceiling above my seat.","page 253":"I have to admit I kind of was attracted to her and I knew you were.","page 131":"And we were completely in love.","page 252":"We were awful to her. I actually feel bad. We were too loud.","page 233":"Oh, sweetheart, I didn\u0027t mean that. I just get jealous sometimes.","page 111":"I can think of dozens of others.","page 232":"Yeah, that\u0027s right. That\u0027s why I went out in the middle of the night and burned her building down.","page 235":"Wrong. I went out to her dorm in the middle of the night and found her in her room and poured kerosene on her and burned her alive. I stood outside the building and listened to her scream and scream, and I thought about her dancer\u0027s legs on fire.","page 113":"I can agree to that. Total strangers.","page 234":"I approached you, making right for you, a smile on my face.","page 116":"I\u0027m just not real, though, you know. I think you know there\u0027s no Natalie.","page 115":"Soon, there was nothing but each other. Everything else faded away.","page 236":"They found her on the stairwell of her building. I wonder if she stepped down those steps gracefully. I bet her ballerina outfit burned up fast. Good night. I\u0027m going out. Happy anniversary.","page 239":"A little harder, then? I bet you wanted to do this with Quinn, but you didn\u0027t because you wanted to be faithful to me, is that it?","page 238":"Oh, really. Is this sexual?","page 87":"Because you seem really furious.","page 119":"But then we were in the laundry room together, alone, a year later.","page 80":"Hhhh. Mmmm.","page 82":"I\u0027m just remembering a fight we had, but I don\u0027t want to.","page 84":"If this storygame is going to bring up bad memories, we should stop.","page 83":"Yes. We did drift apart around then.","page 86":"Are you angry?","page 85":"Yes, I remember that. You were thinking about Quinn.","page 240":"So you want me to stop?","page 121":"You would have asked me if you could carry my laundry up.","page 120":"We gradually stopped saying even \"morning.\" Just nods at one point.","page 241":"I can\u0027t believe you did that with her when we were together. I can\u0027t believe it.","page 6":"I approached you, making right for you, a smile on my face.","page 145":"Right, a factory worker in a shoe-odor-eater assembly line.","page 266":"It gave me the giggles.","page 144":"Meanwhile, back with Walter, I\u0027m looking at my college yearbook.","page 265":"I never told you this, but one time her snores hit this vibrating tone that made me feel something.","page 8":"I asked you directions to the library.","page 147":"And I feel a shiver, like something\u0027s gone horribly, terribly wrong with the universe.","page 268":"No, seriously! You know how some girls feel it on the dryer or in a rumbly car seat? Or when the bass is cranked up at a concert or a movie? Her snores once did that to me.","page 7":"I ignored you, heading for the table where all those other guys were sitting.","page 146":"Meanwhile, back with Walter, I\u0027m looking at my college yearbook.","page 2":"In the Cafeteria","page 1":"It\u0027s Very Easy, My Love","page 148":"But Walter is turned on again, and I slam the book and laugh and dive under the covers.","page 269":"Ha, ha, right. Not exactly how I would describe it. But this is pretty good.","page 4":"I mostly remember you checking me out.","page 3":"Of course I remember!","page 99":"It\u0027s funny. I\u0027m totally trapped, and then the conveyor belt starts moving.","page 98":"And I leaned forward hungrily. I wanted you.","page 9":"I sat down with you.","page 90":"Yes. We did drift apart around then.","page 93":"You went back there first, and then, I left the cafeteria, laughing at you.","page 92":"I shouldn\u0027t have leaned back on the conveyer belt. That was a mistake.","page 94":"It\u0027s funny. You go back there, anticipating, pants unbuttoned or something, and I\u0027ve already left the building.","page 97":"And I leaned forward hungrily. I wanted you.","page 96":"When my shirt and jeans belt loop both got stuck in the metal conveyer belt, trapping me.","page 271":"Lol, I\u0027m going to tell her about this story. She texted me the other day.","page 270":"OK, this got gross. I was totally kidding.","page 152":"But we get bored of looking at photographs. We have ideal partners right here in bed with us.","page 151":"So I\u0027m with Walter and you\u0027re with Quinn. We\u0027re both happy enough.","page 272":"Oh, you\u0027re a better storyteller. But see, I can get into things. You just have to tell the right story. You\u0027re lucky you found me, you know. Not every girl could listen to that and laugh.","page 275":"A little. But good story. Let\u0027s go upstairs.","page 153":"And suddenly, everything seems wrong and the world starts to fall apart.","page 274":"Ok, ok, enough, you.","page 134":"Down by the front sitting next to Kevin and Paul.","page 255":"We would squeeze into my bed and listen to her.","page 133":"All right, I guess. We might have. We might have talked and clicked and fallen in love.","page 254":"You would sleep on the floor by my bed. Must have been uncomfortable.","page 136":"It was the right time, I think. I wish it had happened then, not before.","page 257":"How do you know there\u0027s no Cassie here to disturb us? Maybe I got you a very good anniversary present. Check upstairs.","page 256":"I guess we have Cassie to thank for that. She ended up an unwillilng partner to your filthy night reading.","page 138":"And we were completely in love.","page 259":"But then I tried to get her to join us.","page 139":"We didn\u0027t see each other again until seven years after college, in a club.","page 0":"I Love You, Natalie","page 260":"Well, there was that crazy group party. Don\u0027t forget that.","page 141":"You probably ended up with Quinn.","page 140":"We never saw each other again.","page 261":"I guess it\u0027s just one of those things.","page 143":"No, a sleep study test subject. That\u0027s your job.","page 264":"I remember that it would make me laugh. It was *so* loud.","page 142":"You ended up sad and alone.","page 263":"That\u0027s not fair. We did--you know--we did have some fun with Cassie.","page 167":"Ew, no, I don\u0027t want to think about you doing that in that moment.","page 288":"Didn\u0027t she put in a new tape to see if the problem was with the tape or the TV?","page 287":"That sounds familiar, right. She fixed it, didn\u0027t she?","page 169":"Of course I remember!","page 168":"Fine. But I\u0027m thinking about it.","page 289":"Didn\u0027t I say, \"You have to smack it harder\"?","page 170":"And there was Floyd with his big shoulders, sitting there.","page 291":"We never did start that club.","page 290":"Oh, I remember. I said, \"push the silver plug in all the way.\"","page 172":"No, you said I can decide the story. I go over to Floyd.","page 293":"She did fix the TV, though.","page 171":"Of course I remember!","page 174":"Well, that sucks.","page 295":"Uh, yeah. Although the moment was a little ruined by my having to run for the fire extinguisher in the hall.","page 173":"Why are you so touchy about Floyd? I was just joking.","page 176":"But how do you know? How could you know that?","page 175":"But I know you\u0027ll let me. I tell you stories that you like, you know. I want this story.","page 296":"Nude.","page 156":"I\u0027d slightly nod, not really remembering you, and dance away. And never see you again.","page 277":"Toby *was* a pervert. He...","page 279":"No, she never even *noticed*. Drugs, man. She was so spacy.","page 157":"\"Finally. It\u0027s you,\" I\u0027d mouth. \"I\u0027ve been waiting for you.\"","page 278":"She did, and she liked what she saw, and she climbed off her bed and sat next to us.","page 280":"Yeah, Cassie sort of broke that party up, just as it was getting good.","page 282":"Yeah I remember. I got an A+ on my French test. An A+!","page 281":"You know, in some weird way I started to find the calculus problems weirdly erotic, in context.","page 163":"I was looking too.","page 284":"Heh, yeah. I learned things.","page 162":"So you looked me up and down the second you saw me?","page 285":"Hell yes you are. Now shut this stupid thing off and take me upstairs and teach me some calculus.","page 189":"OK, ok, ok, lol. Do you want to go upstairs now?","page 190":"Yes, we do that. And then just when we\u0027re getting started, we lock you out.","page 192":"*sounds of giggling*","page 196":"I\u0027ll watch it if you touch me the whole time and I can call you Floyd.","page 195":"Ha, ha, no thanks. I think I\u0027m ready to forget that.","page 197":"You\u0027re on.","page 178":"Not really. This is stupid. Forget. I have laundry to do.","page 299":"I met your eyes and said hello.","page 177":"Really, you know? I don\u0027t believe you. Tell me the story if you know.","page 298":"I met your eyes and said hello.","page 179":"Fine, fine, I was just joking around. Grow up.","page 180":"It\u0027s Very Easy, My Love","page 183":"You\u0027re really bad at fantasies.","page 182":"Say it slower.","page 185":"Actually, kind of, yeah.","page 184":"Ha, ha, yeah, and then I challenge him to an arm wrestling match.","page 187":"Uh, yeah. I kind of do.","page 186":"And then Floyd kicks your ass.","page 19":"I asked you directions to the library .","page 18":"\"You\u0027re that cute guy who plays basketball.\"","page 11":"I jumped up, suddenly realizing I was late for class.","page 10":"I met your eyes and said hello.","page 13":"No Kidding--I was just being nice.","page 12":"Nice-looking Guy","page 15":"Small Talk","page 14":"Small Talk","page 17":"\"You\u0027re taking me out tonight.\" And you touched my hand.","page 16":"\"Hey, I know you. You live in my dorm, on the top floor.\"","page 29":"Yes. Uncle Benny was pretty wise.","page 22":"I jumped up, suddenly realizing I was late for class .","page 21":"...sorry, yes.","page 24":"...sorry, yes.","page 23":"I thought I recognized you, but I was wrong, so I got up. I\u0027m sure of it.","page 26":"Don\u0027t Distort Our Story","page 25":"Don\u0027t Distort Our Story","page 28":"...sorry, yes.","page 27":"I\u0027m pretty sure I said it, though. You *were* into basketball then, I\u0027m sure of it.","page 20":"I just said it to make conversation.","page 202":"I don\u0027t think you ever told me this.","page 201":"The only real experience I\u0027d had with with Quinn, I guess.","page 204":"You can tell me a little bit more about her.","page 203":"Thanks for all the Quinn talk. But it\u0027s our anniversay.","page 206":"OK, so what are you saying? You cheated with her?","page 205":"Yeah, your phone calls with her were really awkward.","page 33":"I said, \"sorry, yes.\" I\u0027m sorry.","page 208":"About Quinn","page 207":"Oh god. Are you going to...","page 35":"Marvin.","page 34":"\"Hey, I know you. You live in my dorm, on the top floor.\"","page 209":"About Quinn","page 37":"Nobody, nobody!","page 36":"Earl.","page 30":"Not at all.","page 44":"We talked about the idea of someday having a family.","page 46":"We were sitting eating pizza.","page 47":"\"But I want six kids,\" I said.","page 49":"\"Thank god! Me too. I don\u0027t want any children either.\"","page 40":"Marvin.","page 42":"I swear, I don\u0027t know. I don\u0027t know!","page 41":"Earl.","page 101":"Of course you\u0027d touch me.","page 222":"Sweetheart. I love you. You have me. Forever.","page 100":"I think you\u0027d be a big hero.","page 221":"Oh. Damn. OK. Fine.","page 223":"She didn\u0027t die, you liar. You just want to get into my pants.","page 105":"But what if it were *always* like that? If we never stopped being that way?","page 104":"Right. This is better. Imagine if we had, really imagine it.","page 107":"In the balcony during plays.","page 228":"Oh. Damn. OK. Fine.","page 106":"I wonder...maybe we wouldn\u0027t *ever* introduce ourselves. What if we walked away and never talked again?","page 55":"It takes me a long time to warm up.","page 109":"The bathroom at the library.","page 54":"But I was worth the wait.","page 108":"In the science labs.","page 229":"I met your eyes and said hello.","page 56":"We were young, and that was just where I was at the time.","page 59":"You know there was that hidden nook in the cafeteria near where people bused their trays.","page 51":"I think you muttered something into your cup and changed the subject.","page 50":"I remember that you said you would have children with me, gladly.","page 53":"But what if I had? What if I had touched you?","page 52":"Back then, yes. I didn\u0027t like to touch back then.","page 110":"The bathroom at the library.","page 231":"I\u0027m done with this conversation.","page 230":"Cuddle? Show me what it was like.","page 211":"Sorry, I can\u0027t hear you over my puking.","page 210":"Read me a little bit more.","page 213":"Uggggghhh!!! Sad girls. Hate them. Come on. I am going to punch you in the arm and drag you upstairs and I never want to hear about Quinn again.","page 212":"Hate to tell you, but if Quinn had a \"dancer\u0027s body\" she wasn\u0027t eating pizza or marshmallows.","page 215":"If she shows up, I\u0027ll punch her. Just let me know.","page 214":"What happened to her? She died, didn\u0027t she? She died. Tell me she died.","page 217":"I think you sort of have to accept that she\u0027s gone.","page 216":"If she ever manifests, I grant you authority to have sex with her. One time.","page 219":"Did you tell her things you didn\u0027t tell me?","page 218":"I don\u0027t need to hear about it. It\u0027s making me feel weird. You probably wish you had been with her all this time.","page 68":"And you were gone when I woke up.","page 67":"But you were still there when I woke up! You didn\u0027t leave.","page 60":"But we just gazed into each other\u0027s eyes, didn\u0027t we? We were in public.","page 62":"I...hoped you would. But I don\u0027t know if you did.","page 61":"Yes, you did. You came to love them.","page 64":"I sat down with you.","page 63":"I approached you, making right for you, a smile on my face.","page 220":"If you tell me she fucking died I am going to kill you."}