[
  "51",
  "The Knight Order of the Golden Sun",
  "RNDGamer",
  "6",
  "3",
  "6.51",
  "https://chooseyourstory.com/story/The_Knight_Order_of_the_Golden_Sun.aspx",
  "In the realm of knights and kings, kingdoms rise and perish. The ever-warmongering Lorimur and the over-ambitious Karadas, are both struggling for control over the entire continent. Caught in the middle of their conflict, lies the small city-state of Valinor. Because of its strategic position between its neighbors, it\u0027s caught between a rock and a hard plate. If it were to choose to maintain its Independence, its inevitable destruction would only be a matter of time. Under the constantly increasing pressure of both sides, it decides to become a vassal to Lorimur, the one most likely to win this race.\nOn a certain day, a group of knights send by Lorimur arrive before the city gates, they call themselves the knights of the Golden Sun. They have come here in pursuit of glory and fame. But make no mistake, they\u0027re not some common knight band, they are amongst the high and mighty. They behave like the lords of the land and countless servants and soldiers follow in their wake. Some may claim a title bought with money has no value, but they\u0027ll tell you otherwise, the current market price of a knight title is a whopping 1000 gold crowns. How could anybody call that worthless?\nSome may wonder, \u0027Nobody has ever heard of them before. Are they here to help or to cause trouble?\u0027\nThen they\u0027ll politely answer, \"Don\u0027t bother us with your silly questions and move out of the way, you filthy peasant!\"\n--------\nNote: This is my first story and immediately a contest entry to boot! (Every random peasant could join without any consequences and I was making little progress in my real first story.) This is my entry to Corgi\u0027s contest \u0027The lords of the land\u0027, yes, yes, I shamelessly copied it in my description. Me and the spelling corrector have joined forces in a futile attempt to rid this story of the most obnoxious spellings-mistakes. And as you\u0027ll probably discover soon, since English isn\u0027t my native language, we failed every time there was no red line beneath the word. Although being a newbie and a non-English speaker, could be some really good excuses to get away with anything (since they\u0027re true for a chance), please tell me what you liked or hated.\nLike every CYS game demands there are multiple endings, aside from a few mid-story endings, there are 7 epilogues. B, C, and D, are a win, while E, F, and G are a loss and A is the \u0027perfect\u0027 victory. Note that when I say \u0027loss\u0027 it doesn\u0027t equal a bad ending, it simply means you failed to achieve the victory condition of the story-game. Even a few short endings, can be considered a \u0027win\u0027, while they\u0027re not \u0027happy\u0027 endings.\nAbove all, this story is meant to entertain and shouldn\u0027t be taken too seriously, that\u0027s where the \u0027humor\u0027 tag is for. In case you fail to appreciate my twisted sense of humor and start wondering whether that was added by accident or not, your question has been answered.\n\nUpdate: Bugfixes and spelling mistakes."
]