{"page 33":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 32":"Well, if you can get the freaks to side with Charley, everyone else should be pretty easy of course HOW you’re going to do that is another story. The Freak community is pretty loyal to the Ring Master and given your lowly status, you don’t know if they’re even going to listen to you.\n\nYou approach the freak side of the Carnival. The instant you enter their camp, you’re watched and studied by many eyes (And some of those many eyes belong to the same freak), but at least nobody throws anything at your head. You don’t get far before Jasmine the Bearded Lady stops you.\n\n“Hey Geek! What’re you doing here? Aren’t you supposed to be doing something for the Ring Master?”\n“Huh? How do you know about that?”\n“Because we’re his supporters obviously Geek! What he knows we know and she knows all!”\n\nObviously he doesn’t know all; otherwise the freaks would know you’re working for Charley now.\n\n“Anyway, you don’t need to come here to convince us to ally with the Ring Master, our loyalty to him is well known. Though I must admit I wonder why she chose you for this task, but I guess he has her reasons. I suggest you leave now, there’s nothing else for you here Geek.”\n","page 35":"You can’t think of anything else to do, so you wait around for the Pinheads to come running around the Carnival like they usually do. When you see them gleefully playing catch with a baseball with each other, you insist on joining in\n\nThe Pinheads look a little bewildered by your actions at first, and when you actually get a hold of the ball and toss it back at them, they start getting noticeably angry. A few of them start pushing you and attempting to trip you up. You continue to antagonize them by “playing” with them. Until one of them says something out loud surprising everyone.\n\n“GET THE FUCK OUTTA HERE GEEK! YOU’RE FUCKING STINKING UP THE PLACE!”\n\nThis one hostile sentence shows a coherency that the Pinheads have never displayed before, and shouting it in public for the rest of the Carneys to hear has outted them.\n\n“Fucking Pinheads can talk!” someone shouts.\n\nAt this point the Pinheads start arguing with themselves and attempting to cover up their mistake, but its too late now. You slip away and head back to Madam Orbec.\n\nWhen you get to Orbec’s tent, she’s talking to herself as usual (Or the “spirits” rather)\n\n“No, I don’t like that. Well if you moved a little more. NO! YOU CAN’T FUCK ME IN THE ASS! Oh fuck it then.”\n“Um, am I interrupting something intimate?”\n“The Geek returns! And I see you have been successful in your mission. The spirits thank you and you can be sure the Normals will be on your side when the time comes. Now leave us we are discussing something important.”\n“Wait, can you at least tell me why you…I mean the spirits wanted the Pinheads exposed?”\n“I suppose. Does he need an answer? Probably not. Then why tell? You’re right.” Then Madam Orbec answers you directly.\n“No, now leave before we change our mind.”\n\nNot wishing to undo your work, you leave and head back to Charley, who you see walking around looking for you.\n\n“Hey there you are Geek! What’s all this I’ve been hearing about you fucking around with the Pinheads? You’re supposed to be doin’ shit for me, I hope you’ve been making progress in that little endeavor.”\n“I have. I got the Normals to side with us.”\n\nCharley chuckles heartily and tells you to be ready after the show because the revolution is coming after the rubes leave. Not wishing to run into the Ring Master before hand you hang around Charley’s still which isn’t too pleasant since you have to endure Ajax’s abuse while Charley goes off to make his preparations.\n\nThen show time arrives, everything goes pretty much the same except the Ring Master looks a little distracted the entire time and the Pinheads don’t show up at all, apparently their exposure caused some trouble with other Carneys (All of them Normals) who didn’t like the fake act they were doing just to get paid more and taking money out of the pockets of performers who had real talents. (Tricking rubes is one thing, but fucking over other Carneys is frowned upon… if you get caught)\n","page 34":"You head towards the Freak side of the carnival and try to find the Pinheads, when you see them you notice they’re all congregated together in a relatively secluded area. Almost as if they’re in a meeting. How odd.\n\nThey haven’t seen you yet, so you take the opportunity to get closer by sneaking around behind them and hiding behind a barrel. You prop your back up against it, close your eyes and pretend to be passed out, just in case someone passes by, wondering what you’re doing. You then attempt to listen and you can’t believe what you’re hearing…\n\n“So George did you hear what’s going on in Germany?”\n“Yeah, it wouldn’t surprise me if we had to go to war with them…AGAIN.”\n“Well maybe a war would be good for the economy.”\n“Maybe, I doubt if it could get any worse.”\n“Yeah, but if we go to war that means less people coming to this Carnival, and that’s not good for our income.”\n“Oh I don’t know about that. History has shown that in hard times, people are actually more inclined to want to escape reality and that’s what this Carnival is all about; escaping reality.”\n\nThe Pinheads are discussing world matters! All this time they’ve been acting like idiot children and they’re actually intelligent! You get enthralled by more of their conversation. They begin discussing literature, science, philosophy and other topics that are far above your comprehension or even a normal person’s comprehension.\n\nUnfortunately since you’re not actually watching them and just listening, you don’t see what some of them do. The Pinheads realize you’ve been spying on them mainly due to your powerful smell which is unmistakable at this range. A couple of them did a bit of sneaking around on their own while the others continued the conversation to keep you put until they got into position.\n\n“Psst! Hey Geek, over here!”\n\nYou open your eyes just in time to see a baseball smash into your face, breaking your nose. You curl in a fetal position while holding your nose and resisting the urge to yell. You pretend you’re still drunk, hoping you can throw them off suspicion. It doesn’t work though. The Pinheads have been fooling everyone for so long they’re experts in seeing through a fake act as pathetic as yours and even if they couldn’t they still wouldn’t want to take the chance of you blabbing.\n\n“Shoulda stayed in your cell today Geek.” are the last words you hear as a crowd of angry little squinty faces stare down at you, before they beat you to death and then dump your body in the clown tent.\n\nYou really don’t want to know what happens after that.\n","page 37":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him as well as Ajax. The Ring Master has Atlas, and his usual allies, the Freaks are hanging in the darkness ready to strike if necessary. Most of the Normals though are nowhere to be seen.\n\n“Your time has come Ring Master! No longer will you exploit us! I’m taking over!”\n“And you all feel this way? You’d rather follow this criminal who’ll be corrupt? You really think he’s doing this out of some noble moral code? Obviously you must be blind if you don’t see that rule by this degenerate will be worse than anything you THINK I’m doing…but I leave it up to you…”\n“It won’t work Ringy, I got more in common with my people than you do! Blood is thicker, and yours is going to run everywhere if you don’t peaceably leave…I’m giving you this one chance you pale she-male.”\n“Not likely, I have my own friends as you know.”\n\nThe Ring Master whistles and his Freaks show up, but Charley doesn’t look impressed.\n\n“Geek?”\n“Sorry, Ring Master, but we made a better deal.” You say and show up with a bunch of Normals behind you, and then Randal shows up on the other side with a bunch of Normals behind him as well.\n“I see. So you’ve all decided to throw your lot in with petty criminal activity. I’m glad to see your hypocrisy show its true face Randal, and Geek, I’m very disappointed in you. Very well, if I die this day, it’ll be beside those who are the true heart of Carnival! ATTACK!”\n\nThe battle ensues, though it’s not really a battle. A few of the Normals side with the Ring Master, but most of them are on Charley’s side. The only thing that makes the battle last longer is the fact that the Freaks are fierce fighters. Atlas and Ajax lock horns, and while Atlas nearly kills Ajax, Randal does a couple of his magic tricks and blinds Atlas with a bright light, giving Ajax enough time to kill him.\n\nOn the side lines watching, is Pervus and his clown gang masturbating to the carnage.\n\nFinally in the last moments Charley laughs as he stands over the Ring Master’s body which is now lifeless with Charley’s sharp stick through its heart; the last “Freak” to die. Meanwhile you were hiding during all this, but Charley calls you out.\n\n“Hey Geek! Come out you fuckin’ coward! We won!”\n“Yeah come out, you fucking useless piece of shit! I’m too tired to do anything to you right now.” Ajax adds.\n“…I’m here Charley.”\n“Good, unzip the Ring Master’s pants.”\n“What?”\n“Unzip the Ring Master’s pants; I wanna see what the hell he or she was packing. I have a bet going with Ajax and we wanna see who won.”\n\nYou’re a little hesitant, but your crouch over the body and start unzipping the Ring Master’s pants. A crowd begins to form around you. Normal and Midget alike.\n\n“Come on come Geek, we ain’t got all fuckin’ night!” Ajax says while kicking you in the ribs.\n\nYou pull down the underwear…\n\n“EEEEEEEEEEEWWWWWWWWW!” the crowd shouts in unison.\n“Holy shit!” you say falling back.\n“Ha ha, I knew it! I fucking won!” Charley chuckles.\n“Shit! Fuck!” Ajax shouts and starts beating you to take his frustrations out.\n\n“Alright you lot, I want all these bodies cleaned up and disposed of before we head out to the next town, and Salina I want YOU in my new trailer to help me celebrate this glorious victory!”\n\nAnd so begins the reign of Charley the Ringmaster. Under his guidance midgets run everything and the Carnival doesn’t so much resemble a Carnival as it resembles a mobile grifting ring. While regular carnival activities still abound, they’re more of a cover than anything. In time though problems occur. Randal and Charley begin to come into conflict as Randal begins to regret his decision to side with him as well as his disapproval of what’s become of the Carnival. Another division begins to occur, but one on a smaller scale as Charley’s corrupting influence has infected most of the remaining Carneys at this point. Things really come to a head when Ajax suspects Sasha of having an affair with Randal. Eventually Randal, a few of his remaining “followers” AND Sasha are all killed in the middle of night and their bodies dumped in the river. Lacking any more “true talent” or even sideshow freaks, the Carnival is disbanded entirely and Charley and Ajax set up headquarters permanently in a sleazy small town where they primarily run the place. Proving that crime does pay.\n\nYou on the other hand don’t do so well. While the Carnival was still around, you were routinely abused by Charley or Ajax more so than you normally were. When the Carnival disbanded you didn’t really have anywhere else to go, so you became the town drunk. Not really needing you anymore and having moved on to more important things, Charley forgets all about you, which leads to one dark rainy night when Ajax comes across you sleeping behind one of his bars. Not being reined in anymore, he does to you what he’s always wanted to do.\n\nHe beats you death, laughing the whole time.\n","page 39":"“Um, Jasmine maybe you should reconsider.”\n“Reconsider what?”\n“Well maybe siding with the Ring Master isn’t the best thing for you guys.”\n\nThose words suddenly causes all the freaks that were previously spying on you from their trailers, tents, and holes to come out and surround you. There’s no way to escape. Jasmine’s eyes narrow while she strokes her beard.\n\n“Oh? And who would YOU suggest we side with?”\n“Well Charley makes this place really profitable and you know you’d have protection, even more than if the Ring Master kept running things.”\n“CHARLEY? That little obnoxious creep? He’s a fucking low life and with more power he’d be a fucking dictator! There wouldn’t be the freedom that the Ring Master gives us!”\n“How do you know? I mean he’s a midget, that’s almost like being a freak, he might understand your struggle. I mean I do and…”\n\nSuddenly you feel a crushing blow to the back of your head as Roger the Crustacean hits you with one of his claws. You then feel the stomping of various feet, hooves, talons and “other” on your body. You begin coughing up blood as your head is repeatedly kicked into the dirt.\n\nJasmine then address you again while pulling your bloody head up.\n\n“You feel that? Hundreds of feet continuing to step on you as you struggle to rise up. THAT’S our struggle everyday. And now you know it. Hope you liked being one of us Geek.”\n\nJasmine then lands a crunching blow your nose, pushing the bone up into your brain, killing you and ending your misery.\n","page 71":"The Midgets are firmly in the camp of Charley. Your only hope is to convince the Normals and that’s not going to be easy either. A lot of them don’t like you and most of them are “unified” under Randal and he doesn’t like you either.\n\nThe only thing you can of is to talk to Madam Orbec. She has the most contact with Randal, maybe you can get her help.\n\nYou approach Madam Orbec’s tent which has an air of creepiness about it. You see her gazing into a crystal ball.\n\n“Geek! You foul aura disturbs the spirits!”\n“Um, sorry…but I need your…”\n“Yes, yes, yes, I know you want my help.”\n“How did you know that?”\n“I see what the spirits see! And the spirits see all! You want me to convince Randal to convince the Normals to side with the Ring Master in the upcoming battle tonight!”\n“Uh…yeah.”\n“I suppose I could do that…but I won’t, at least not directly…”\n“So you’re not going to help me?”\n“I didn’t say that, the spirits say that you can’t get something for nothing however…since you seem to be in such a noble mood Geek, then you won’t mind performing another noble deed. A deed that will help you as well as us.”\n“Well, what is it?”\n\nMadam Orbec starts talking to herself.\n\n“Could be a suicide mission. So? Yeah, no risk to us. What about the other thing? Will solve itself.”\n\n“You must get rid of the beautiful Sasha’s abusive boyfriend Ajax once and for all. Do this and we shall help you.” Orbec says addressing you.\n“WHAT?! How the hell am I supposed to do that? And why?”\n“Do not question the spirits’ wisdom! Just DO! Now leave and don’t return until you complete this task!”\n\nYou exit Orbec’s tent. You’ve got an impossible job to do. Ajax is a vicious thug who beats you for fun on several occasions, there’s no way you can beat him even if you had the killer instinct which you don’t. You’re going to need some help.\n","page 70":"You cautiously approach Salina’s trailer, you’re nervous as hell. You stop and hide behind a nearby barrel when you see someone coming out. It’s Sasha. She looks like she’s been crying, probably about Ajax no doubt. Salina seems to be telling her something and then hugs her before closing the door. When Sasha leaves you knock on Salina’s door. She answers.\n\n“Look, I told you…UGH! Its you! Get the fuck outta here Geek! No amount of money is gonna make me degrade myself for your festering ass! And you’re upsetting my snakes with your odor!”\n“No, it’s not that, I really gotta talk to you.”\n“You don’t have anything to say that I wanna waste my time OR my sense of smell on, so…”\n“Please it s really important! It’s about Charley and the future of the Carnival!”\n\nSalina raises her eyebrow.\n\n“Hmm, very well, but you’re not coming in here, let’s go someplace secluded where nobody can see me associating with you.”\n\nYou and Salina walk to a nearby spot in the wilderness (Separately of course) to talk where you explain the situation to Salina.\n\n“Yeah, so what does all this mean to me? If Charley takes over I win and if the Ring Master stays in power I still win. I don’t see why I should get involved in this power struggle.” Salina says unemotionally.\n\n“You’re not looking at the big picture. As it stands now you got some measure of freedom, but if Charley wins, this place will cease being a Carnival and become a crime ring. And while you might do alright gift and money wise, you’ll be Charley’s girlfriend full time at that point with little freedom. You know he’s never going to let you do anything without his approval if he’s in power. And if the Ring Master wins, chances are the criminal activity here is gonna be severely diminished without Charley to run it, meaning you’ll probably be making less money.”\n“Okay…but don’t you want the Ring Master to win?”\n“Yes, but she needs allies and I’m trying to get the midgets to ally with him and they won’t if Charley’s in charge of them.”\n“So I don’t understand, what exactly are you proposing? You’re kind of all over the place here.”\n“I’m saying I want YOU to take over Charley’s position. You run all his business dealings.”\n“What? You’re crazy Geek.”\n“Why? You’re intelligent; surely you probably know all of Charley’s secrets.”\n“Well THAT’S true. The little fucker insists on bragging about everything after sex, but what makes you think the midgets will follow me? I mean I’m a Normal.”\n“Please, you’re a tall beautiful woman, the midgets will love you, didn’t you see Wizard of Oz? Just as long as you promise to uphold all the things Charley did like protection from being bullied by rubes and keeping their payment the same, I don’t think they’ll mind you in charge instead of Charley. Think about it, YOU could be in charge of the whole operation, and it’s not like the Ring Master will bother you as long as you don’t try to screw with the everyday Carnival workings.”\n\n“I’d never do that, the Carnival has been like a home to me…I…”\n\nSalina seems to stop herself before she displays too much emotion to you.\n\n“Alright Geek, I’m willing to entertain this idea, but you have to do something for ME first.”\n“Okay, what?”\n“You gotta get rid of Randal.”\n“What? Why? What did he do?”\n“To me? Nothing, but he’s competition and I can’t have that.”\n“Competition for what?”\n“Nevermind, just get rid of him. Think of it this way, if you get him out of the picture, you’ll also eliminate the leader of the third faction here which would really cement the Ring Master’s supremacy here. Surely that should be incentive enough?”\n“You want me to kill him?!”\n“Look, I don’t care HOW you get rid of him, just get rid of him before show time. If you do that, you can tell the midgets that I’ll be taking over Charley’s position when the time comes. Now don’t speak to me again until you do this.”\n\nLooks like you got MORE work ahead of you and you really don’t know how you’re supposed to get rid of Randal. You doubt if just asking him to leave is going to work, and while killing him would solve the problem, it’s not really that simple to just kill a man even if you had it in you.\n\nYou could really use a drink…\n","page 73":"You’ll have to kill him. It’s the only way, since he’ll never listen to you. You need a drink to get you ready for this though.\n\nYou sneak over to Charley’s still, thankfully it’s not being manned right now. You down a couple of bottle of the toxic swill, spilling some of it on yourself. After you’re sufficiently “prepared” you steal one of the midget’s hammers and head to Randal’s tent.\n\nIt’s now or never…\n\nYou enter Randal’s tent which seems a lot larger on the inside than it does on the outside, but you figure it’s the booze is effecting your perception. You see Randal getting dressed with his back to you. Excellent.\n\nYou creep as quietly as you can in your condition, step right behind him with the hammer raised up high and then…\n\nHe disappears before your eyes!\n\nYou do a double take, thinking it’s the booze again, but then you feel a tap on your shoulder, causing you to turn around to a fiery flash. Not very good in any case especially since Charley’s brew that you spilled on yourself earlier makes you quite flammable. You run around his tent attempting to put yourself out.\n\n“Didn’t you think I could SMELL you approaching Geek?” Randal says. “I have no idea why you would attempt something so foolish as to try to kill me, but I’ve always said the Carnival would be a lot better without the likes of you! TABAXINDOGA!”\n\nWhatever Randal just said causes all your limbs to freeze up. The good news is you aren’t on fire anymore, the bad news is you’re turning to stone! Randal looks noticeably exhausted after casting his spells, but he’s still holding all the cards.\n\n“I hate to waste such power on you, especially before showtime. (Pant) it really takes a lot out of me, but sometimes such actions are necessary when being attacked. I’ll have to inform Madam Orbec that the new spell she taught me works perfectly… I’ll take that hammer, it’ll come in handy.”\n\nAs your body becomes completely stone, the last thing you see is Randal swinging the hammer at your head before it breaks into several pieces.\n","page 72":"You can’t kill Randal, so you’re going to have to just try to convince him to leave…somehow. You think perhaps Madam Orbec can help, since she has the most contact with him.\n\nYou approach Madam Orbec’s tent which carries an air of creepiness about it. When you enter, you see her lying on the floor convulsing.\n\n“Madam! Are you alright?!” you run to her attempting to pick her up, but she pushes you away.\n\n“GEEK! Take your filthy hands off of me! My body is for the spirits only! You will not molest my person lest I call down their wrath upon you! Though I’m not sure what more they could do to such a pathetic soul such as yourself, and death would be a mercy.”\n“Sorry, I was just trying to help.”\n“Liar! You sought me out, to help yourself! But still…your mission is a somewhat good intentioned one…even if you are in the dark about some of it…”\n“What do you mean?”\n“That’s for the more enlightened to know, but I’m sure you’ll find out eventually, assuming we decide to help you that is…”\n“How do you know that I want your help?”\n“I see what the spirits see! And the spirits see all! You’re easier to read than an open book! You want to know how to get rid of Randal.”\n“How…nevermind. So how do I get rid of him? No…don’t tell me YOU want me to do something as well!”\n“Actually getting rid of Randal would serve me…he wouldn’t be around hounding me and the spirits all the time for one thing. The only reason I prefer him around is that he is a balancer of this carnival…but we see things are about to change…great changes…things would be better if he wasn’t around any longer.”\n“So?”\n\nMadam Orbec begins to talk to herself.\n\n“Should we? Maybe. What about them? Later. Yeah, let’s do it.”\n“Madam?”\n“Tell Randal to come to my tent, I will get rid of him. I shall tell him something that will give him cause to leave immediately. He won’t even be here for showtime. You have the word of the spirits and Madam Orbec. Now leave me, we must prepare.”\n\nYou leave Madam Orbec’s tent and go find Randal. When you do, he attempts to avoid you, but when you mention Madam Orbec wants to see him, he pushes you out of the way to meet her right away.\n\nYou follow him and watch Orbec’s tent, after awhile Randal leaves and heads back to his own tent. Orbec also exits and nods at you. You go back to Salina and tell her the news.\n\nSalina smiles and tells you everything has been set in motion, and she’ll be ready. She then tells you to go tell the midgets.\n\nYou go back to Bob, who’d forgotten all about your discussion with him. In fact you have to remind him what it was you even discussed.\n\n“So lemme get this straight Geek…Salina’s taking over the crime trade here?”\n“Yeah, and she says everything will stay the same, the protection and the pay. All you gotta do is side with the Ring Master, after show time tonight.”\n“…Alright Geek, I’ll tell the rest of the dwarves. I just hope all of you fuckers know what you’re doing, because I guarantee if we get fucked in any way in this arrangement, YOU will be the first to feel our wrath!”\n\nYou hope so too, a lot of this riding on the “word” of everyone. You don’t actually have any assurance by anyone that everything’s going to go as planned. You don’t tell the Ring Master that when you go back to his trailer though. (After getting Atlas’ permission to enter of course) you just tell her that he’ll have her allies when the time comes. The Ring Master seems confident in you and tells you to get ready for show time.\n\nYou spend your remaining time a little on edge, wondering if everything is going to work out. You really wish the Ring Master hadn’t put all this pressure on you.\n\nThen show time arrives, everything goes pretty much the same except you’re a little distracted the entire time until you notice Randal doesn’t show up at all. You hope that’s a good sign that your plan has worked.\n","page 75":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him as well as Ajax. The Ring Master has Atlas, and his usual allies, the Freaks are hanging in the darkness ready to strike if necessary. Most of the Normals though are nowhere to be seen. Your heart sinks…the midgets have still sided with Charley and you get so worried that you puke up the sheep testicles and pigeon heads you consumed for your act.\n\n“Your time has come Ring Master! No longer will you exploit us! I’m taking over!”\n“So you can exploit your own people of course. Charley, I’ve put up with your delusions of grandeur long enough, it ends tonight. I have allies of my own, and you might find they are much more dedicated to me than yours are.”\n“It won’t work Ringy, I got more in common with my people than you ever will! Blood is thicker, and yours is going to run everywhere if you don’t peaceably leave…I’m giving you this one chance you pale she-male.”\n“Not likely.”\n\nAt this point all of the freaks come out of hiding. Charley orders an attack, but the rest of the midgets do nothing…you cease worrying and Charley begins to get angry.\n\n“What the fuck man? I told you fuckers to attack! I’m your leader!”\n“Not anymore Charley…we got a new one.” Bob says.\n“Who? HIM? This fucking hermaphrodite bitch?” Charley yells pointing to the Ring Master.\n“No, this tattooed bitch.” Bob says calmly where upon Salina appears petting a cobra lovingly which is wrapped around her arm.\n“Yes, this tattooed snake bitch to be precise. Give it up Charley; your time here is done. You don’t have any allies anymore. I’d suggest you and the muscle bound woman beater leave NOW.”\n“You fucking back stabbing viper bitch…” Charley says in shock.\n“Hey fuck off cunt, fore I shove that snake up your ass!” Ajax yells.\n“You’re certainly welcome to try, here catch!”\n\nSalina throws here cobra at Ajax, which lands on him, he squashes its head, but not before it bites him a couple times. He runs at Salina, but the midgets trip him up and hold him down as the poison takes effect. Salina then puts out his eye, with her stiletto heel before he succumbs leaving Charley all by himself.\n\n“Well Charley, it seems all your grand plans have failed. You have nothing left. I’d say there’s no reason for you to stay. Atlas, if you would be so kind to escort this former employee of the premises…”\n\nWhen the Ring Master says that, it typically means “Atlas, after you break his neck make sure the body is properly disposed of.”\n\nAtlas grabs Charley who attempts to defend himself with his sharp stick, but instead it’s taken from him and broken. Then Charley’s spine is taken from him and broken. Atlas lumbers off in the darkness to get rid of Ajax and Charley’s bodies.\n\n“So, I trust we’ll have no problems Salina?” The Ring Master asks.\n“No problems from me, I have all I need, or I soon will have.”\n“Good, I suggest you and your new friends get some rest, we got a big show tomorrow.”\n\nWhile Salina and the munchkin brigade leave and the freaks disperse as well, the Ring Master calls you out.\n\n“Geek, you may come out of hiding, I’m sure you can see the danger is over, not that there ever was any.”\n“I can’t believe it actually worked. Everything…”\n“See? I told you, you underestimated yourself. Not only did you save the Carnival, but you stabilized it even more. I told you, I saw potential even when there was none apparent. Do you still want to be a Geek? You could be so much more if you just put in the effort. Charley used to do all my leg work, but now that he’s gone I need someone else to fit that role…would you be interested? Keep in mind that this new job would require a whole lot more responsibility and significantly less drinking as I would need you in a better frame of mind.”\n\nAt one time you’d balk, but after seeing what you accomplished first hand, maybe you DO have potential. You accept and you’re given Charley’s old trailer.\n\nTime goes by and you stumble along the way with the first few months as you still have a really bad drinking problem, but fortunately the Ring Master is slightly understanding about that, and only sends Atlas to remind you ONCE to get it under control. (That incident really sets you on the straight and narrow) you get yourself cleaned up and actually become presentable. You’re more of an organizer than a main event now, but you still go ahead and bite some chicken heads off every now and then for the kids.\n\nSalina is a pretty fair and even handed business woman when it comes to the being new leader of the midgets. Much more than Charley, and she also has Pervus and his clown crew eliminated during one night. Apparently they got rough with one of her girls. They were all found dead the next day. Nobody said anything outright, but the fact that little snake bites were found on their bodies was a pretty good idea who was responsible. However, the Ring Master said nothing since Pervus and his friends had it coming for a long time, not to mention with them gone things actually improved morale wise. (People tend to work better when their aren’t evil demented clowns lurking around)\n\nYou also see Salina and Sasha get very close in a way that makes you tingle in the nether regions. Now you know why Salina wanted you to get rid of Randal. Without Ajax to kick her around anymore, Sasha probably would’ve fell for Randal (You also found out Madam Orbec told him he needed to leave the Carnival to find some magic book in some Mayan ruins that the spirits commanded him to retrieve…he never returned) but since he wasn’t around, she ended up with Salina. They seem to be happy though.\n\nActually everyone at the Carnival seems to be a lot happier and more relaxed and it’s all due to your actions.\n\nThe Ring Master has given you a second chance at life, a life with a whole hell of lot more meaning.\n\nYou’ve gotten respect at last.\n","page 30":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him as well as Ajax. It appears that Pervus and his clowns have also decided to join him. The Ring Master has Atlas, and looks around for his usual allies, the Freaks, and to the surprise of everyone Randal appears with most of the Normals behind him. You attempt to hide directly behind Randal figuring that will be the safest place.\n\n“YOU? You’re attempting to take over? You must be joking! Go take your fairy dust and\nprance off somewhere, this is between me and the she male freak!” Charley spits.\n“No, you malignant midget! Your time and a criminal ways are at an end here today! And your too Ring Master! No longer will this Carnival be run by an exploitative tyrant!” Randal retorts.\n\nThe Ring Master sees you and shakes his head.\n\n“I’m very disappointed that you decided to betray me here today Geek. You will learn to regret that fateful decision.”\n“Enough, of this fuckin’ talk. Let’s see who’s gonna fuckin’ run this show once and for all! Attack!”\n\nCharley and his midgets begin the assault, and the other two sides follow suit. The fighting is furious and brutal. All you do is crawl away and try to hide under a trailer and hope Randal wins, which he looks like he’s doing.\n\nRandal has the upper hand in every way, he has numerical superiority for one thing, and the other thing is he’s casting actual magic spells. A couple of bolts of lightning fry Ajax and Charley. Another spell strikes down Atlas. All looks good for Randal, especially when he wipes out Pervus and all the clowns with a huge fireball and finally with one last spell he strikes down the Ring Master with a dark black light which completely disintegrates him.\n\nIts over.\n\n“Geek! You can stop hiding! We won!” Randal shouts.\n“Yes, and with the help of MY book!” Madam Orbec says appearing from nowhere. “What the hell is wrong with you Randal? Didn’t I tell you not to mess with this book?” Orbec begins hitting Randal and takes her book back.\n“Ow! I’m sorry Madam! I just wanted to prove to you that I was ready to…ow!”\n“You’ll never be ready for this book, you hear me? You’re lucky you didn’t bring the dead back to life with your careless chanting!” then she points to you. “And YOU’RE lucky I didn’t catch you stealing this for him! I would’ve turned you into a worm which probably would be a step up for you!” Orbec decides she doesn’t want to dirty herself hitting you though, so she just leaves. After this embarrassing incident Randal regains his composure.\n\n“Okay people get some rest for tomorrow, a new era of this Carnival has arrived and we have a lot of hard work ahead of us, but it’ll be worth it! Because with magic anything is possible! And don’t worry Geek, I still haven’t forgotten about you, thanks to your help, you’ll have a place in my Carnival.”\n\nTime passes and Randal “cleans up” the Carnival of all remaining criminal activity, though without Charley around, it wasn’t really a factor anymore. Salina ends up leaving though as the Carnival has gotten too “Goody” for her liking. Without Ajax around, Sasha ends up falling for Randal and the two eventually get married.\n\nThere also aren’t anymore Freaks in the Carnival anymore; the few that survived ran off to eke out meager livings elsewhere. There were quite a few Midgets left, and were allowed to stay due to the fact that they were hard workers, but their status is severely diminished. In fact they’re pretty relegated back to second class citizen status again.\n\nThe Carnival flourishes though as it becomes a truly wondrous and safe place for entire families. And your reward for your help was a complete magical transformation into…\n\nAn animal keeper.\n\nHaving no other useful skills you’re relegated to have to look after all the animals and take care of them in Randal’s new Carnival.\n\nEvery day you take your life into your hands when dealing with the lions.\nEvery day the horses fart on you whenever you’re around.\nEvery day you suffer the indignities of the monkeys throwing their shit at you. Not that it matters since you smell like shit anyway after having to clean up after the elephants.\n\nIn fact you only smell slightly better than when you were a Geek, though at least you don’t have eat various parts of the animals’ anatomies and you don’t get beat up anymore.\n\nIt’s a step up!\n","page 44":"Maybe you can talk directly to Sasha about this. Surely since she’s the one taking the abuse she’d be for getting rid of Ajax. Maybe she’ll even know some tips on weaknesses or something. You head to her trailer.\n\nShe answers the door and looks obviously disgusted.\n\n“Ew! What’re you doing here Geek? Get outta here, you’re stinky!”\n“Wait Sasha, I got a proposal for ya!”\n“Excuse me?! This isn’t Salina’s trailer! And I doubt she’d degrade herself for you either! Goodbye!”\n“WAIT! This is about Ajax! And about how to get rid of him for good!”\n\nSasha suddenly stops trying to get rid of you and seems more willing to listen.\n\n“How?”\n“I dunno, but I’ve seen how he treats you and it isn’t right. Nobody does anything, well I’m just saying I’ve had enough of seeing him push everyone around, especially you!”\n\nSasha looks a bit touched by your remark, but then quickly speaks.\n\n“Okay look, he’ll be coming soon, he always has a drink when he comes over, and I’ll drug it. He’ll get drowsy and fall asleep, BUT you’ll have to finish him off. Many times I’ve though about it, but I just can never bring myself to do it…you’ll have to do it. Please free me from this brute once and for all.”\n“I will Sasha.”\n“Thank you…I guess underneath the grime you’re alright Geek…now go hide by that barrel over there, I’ll give the signal when he’s asleep!”\n\nYou quickly run over to the barrel and hide. Soon you see Ajax enter Sasha’s trailer. While you wait, you can’t believe what just happened. Sasha actually seemed nice to you. You’ve never experienced that before. And could it be that you saw a glint of something in her eyes when she thanked you? Maybe after all this is over you and Sasha might have something. You never thought this could be possible. You feel positive and confident…you know you’ll have the strength to do in Ajax, he doesn’t deserve a beauty like Sasha anyway. He doesn’t deserve life.\n\nWhile you’re thinking about all this you see Sasha come back out of her trailer and wave at you. She has a knife in her hand, obviously what she’s going to give you to do in Ajax which you’ll take great pleasure in. After all this is over, Sasha is going to see you as her savior…\n\nNice fantasy Geek.\n\nThe sad truth is much worse though.\n\nWhen Ajax arrived he could tell you were around because your stench was still clinging to the door. Then he questioned Sasha about it. And the funny thing about abuse victims is they always side with their abuser before siding with someone who’s trying to help them. She didn’t just tell him everything, but she’s also lured you back into the lion’s den as it were…\n\nWhen you get to the doorway, Ajax pulls Sasha back inside roughly, and grabs you.\n\n“I’ve been looking for a good excuse Geek! I’m gonna enjoy this!”\n\nAjax pulls you inside, and enjoys beating you to death.\n\nOh how he enjoys it.\n","page 43":"The Midgets are firmly in the camp of Charley. Your only hope is to convince the Normals and that’s not going to be easy either. A lot of them don’t like you and most of them are “unified” under Randal and he doesn’t like you either.\n\nThe only thing you can of is to talk to Madam Orbec. She has the most contact with Randal, maybe you can get her help.\n\nYou approach Madam Orbec’s tent which has an air of creepiness about it. You see her gazing into a crystal ball.\n\n“Geek! You foul aura disturbs the spirits!”\n“Um, sorry…but I need your…”\n“Yes, yes, yes, I know you want my help.”\n“How did you know that?”\n“I see what the spirits see! And the spirits see all! You want me to convince Randal to convince the Normals to side with the Ring Master in the upcoming battle tonight!”\n“Uh…yeah.”\n“I suppose I could do that…but I won’t, at least not directly…”\n“So you’re not going to help me?”\n“I didn’t say that, the spirits say that you can’t get something for nothing however…since you seem to be in such a noble mood Geek, then you won’t mind performing another noble deed. A deed that will help you as well as us.”\n“Well, what is it?”\n\nMadam Orbec starts talking to herself.\n\n“Could be a suicide mission. So? Yeah, no risk to us. What about the other thing? Will solve itself.”\n\n“You must get rid of the beautiful Sasha’s abusive boyfriend Ajax once and for all. Do this and we shall help you.” Orbec says addressing you.\n“WHAT?! How the hell am I supposed to do that? And why?”\n“Do not question the spirits’ wisdom! Just DO! Now leave and don’t return until you complete this task!”\n\nYou exit Orbec’s tent. You’ve got an impossible job to do. Ajax is a vicious thug who beats you for fun on several occasions, there’s no way you can beat him even if you had the killer instinct which you don’t. You’re going to need some help.\n","page 45":"You figure Pervus the clown is the only possible candidate to help you in this endeavor. He’s immoral enough and doesn’t have any allegiances. You don’t relish the idea of going anywhere near the clown tent though; everyone knows what terrible things they do to trespassers in there. Fortunately you find Pervus harassing one of the acrobats. She looks terrified, by this scary overbearing clown\n\n“Aw come on, I just wanna get to know ya better. You’re so pretty and young with a nice tight ass. What I could do with that for about an hour…”\n\nSuddenly Pervus goes to grab at the acrobat, but she leaps out of the way and runs off in fear.\n\n“Fuckin’ cock teasin’ bitch…(sniff sniff) I know that smell…smells like a dead dog’s asshole after I busted a nut in it…Geek…what the hell do you want?”\n“Uh hello Pervus…I uh, need your help with something.”\n“Oh do ya now? What might that be?”\n“I need to get rid of Ajax and I need your help to do it.”\n“Whoa, hold on there first of all what makes you think I’d help you without asking for something in return, and second of all, Ajax isn’t exactly easy prey if you know what I mean.”\n“Well…what would convince you…and NOT THAT!”\n\nPervus chuckles.\n\n“Feh, maybe some of my boys might like a piece of your filthy ass, but I’m a little more discriminating…actually you got me in a unique mood. I’m willing to help you. Ajax pisses me off every time I go try to get some liquor from Charley. Walkin’ around displayin’ that perfect physique. He really needs to be taken down a fuckin’ peg. In fact he NEEDS to be pegged in the fuckin’ ass. Tell ya what, you get Ajax to come over to the clown tent and we’ll do the rest. He’s had this coming for a long time.” Pervus says stroking his crotch.\n“You gonna kill him?”\n“No, but I suggest you not ask what we ARE going to do to him. Trust me though; you’ll never see him again.”\n“Uh, okay…but how the hell am I supposed to get him to go over to your tent, nobody ever goes over there!”\n“Well I suggest you think of something, if you want our help. See you later and hopefully with a certain Strongman in tow.”\n\nFacing Ajax one on one is NOT what you had in mind! You’re going to have to do it though. You could attempt to make up a story which may or may not work, or you could go with a much dangerous approach and piss him off so he chases you there. The problem with that approach is you’re a dead Geek if he catches you.\n","page 48":"He’ll see through a lie, and even if he can’t he won’t want to listen to anything you have to say anyway. There’s nothing for it, you have to have him chase you there. He’s going to be pissed off anyway.\n\nYou look around for Ajax, but he’s nowhere around, typical. The one time you WANT to find him you can’t. Eventually you do see him entering Sasha’s trailer. You take a deep breath and start throwing stones at it, calling him out.\n\n“Hey asshole, stop hiding behind Sasha in there and get out here!”\n\nPlink! Plink! Plink!\n\n“Hey motherfucker I’m talkin’ to you! I know you ain’t still fuckin’ Sasha. Everyone knows you don’t last that long!”\n\nPlink! Plink! Plink!\n\nYou’re actually having so much fun shouting and throwing things, it almost comes to a shock to you when Ajax comes storming out like a mad bull. He is wicked pissed.\n\n“YOU’RE FUCKING DEAD GEEK!”\n\nYou throw the rest of your stones at him and run as fast as you can. You just hope you can make it to the clown tent before he catches you.\n\nSomehow despite Ajax being in better shape than you in every way, you are surprisingly faster than him, maybe its from all that protein from the pig uteruses you’ve had to consume over the years…or perhaps its just fear. Either way it gets the job done.\n\nYou arrive at the clown tent stopping right at the entrance with Ajax not far behind; you see the glinting eyes and hellish grins peering from the unnatural darkness within it. The slurping and hideous laughter makes you REALLY hesitant to actually enter. In your current situation you feel like you’re bordering on the edge of madness with fury seeking to drive you into it.\n\nAnd that’s exactly what happens, while you’re stopped at the edge of the clown tent. Ajax tackles you hard, where upon the both of you roll into the clown tent.\n\nIts pitch dark in here and you don’t know how that’s even possible, but it is. You feel Ajax’s heavy body suddenly be lifted off of you along with several bottle sounds breaking. You can feel several glass particles fall down onto you.\n\n“AGH FUCK MY HEAD! GODDAMN CLOWN FUCKERS!” Ajax yells.\n\nYou begin the crawl on the floor to get to the outside of the tent, but you’re not sure where the hell the entrance is anymore, the clowns have closed the flap. Apparently they have no intention on letting either of you escape. The only thing working to your advantage is they’re having a hard time subduing Ajax. It’s all very frightening to you though when you begin to hear Ajax scream in a high pitched falsetto voice, you never thought you’d ever hear something like that. The other sounds you hear from the clowns you don’t even want to think about.\n\nYou keep crawling in the darkness hoping to reach the edge of the tent. It seems like forever, but eventually you feel the canvas, you then grab at the bottom and pull up; a beam of daylight enters.\n\n“STOP THAT GEEK!” you hear one of the clowns yell causing you to scramble out of the tent as fast as possible. You feel a hand grab your foot and attempt to pull you back in. You kick several times with your other foot and once again luck shines down and the clown releases you long enough for you to escape.\n\nYou run back to Madam Orbec’s tent, who glances up at you from her crystal ball.\n\n“Ah, you’ve returned and from what the spirits have told me, you were successful…good. I will speak to Randal about siding with the Ring Master when the time comes. You may leave.”\n\nYou’re still a little bewildered by her attitude, but you’re not going to press the issue, you got what you wanted. Time to report back to the Ring Master.\n\nYou tell the Ring Master that he’ll have her allies when the time comes when you go back to his trailer though. (After getting Atlas’ permission to enter of course) The Ring Master seems confident in you and tells you to get ready for show time.\n\nYou spend your remaining time a little on edge, wondering if everything is going to work out. You really wish the Ring Master hadn’t put all this pressure on you.\n\nThen show time arrives, everything goes pretty much the same except Charley looks a bit distracted the whole time as Ajax is nowhere to be seen. Pervus and his clowns seem to keep waving at you and making obscene gestures whenever they can.\n","page 47":"You don’t want to piss Ajax off anymore than what’s necessary, so you decide to come up with a story that Charley needs him to go get some money the clowns to because they haven’t been paying their latest gambling debts.\n\nYou look around for Ajax, but he’s nowhere around, typical. The one time you WANT to find him you can’t. Eventually you do see him entering Sasha’s trailer, you go to knock on the door. He answers it, and already looks pissed.\n\n“You got some fuckin’ balls Geek, disturbing me while I’m tryin’ to get me some pussy! This better be REALLY important!”\n“It is, Charley wants you to go to the clown tent, apparently they gambled on something or other and didn’t pay up, so he wants you to go get the money from them.”\n\nAjax, gives you a hard look.\n\n“Why didn’t Charley come tell me himself, in fact this is the first I’m hearing about this and I certainly don’t understand why he’d send YOU to tell me.”\n“Well I just happened to be around at his still and he was ranting about some private bet he had with Pervus and well you know Charley…he ended up prodding me with his stick and ordered me to go get you to collect the debt from the clowns.”\n“I smell bullshit and I don’t like bein’ fuckin’ disturbed from fucking my bitch, let alone by the likes of you! I dunno what your fuckin’ angle is Geek, but since you seem to be so interested in the clown tent, let’s go asshole!”\n\nAjax grabs you and raises you above his head with a vice like grip. You attempt to escape, but it’s useless. He walks all the way to the clown tent, where inhuman noises are emanating.\n\n“Hey you fuckin’ clowns, here’s a new fuck toy for ya!” Ajax yells and throws you inside.\n\nPervus and his crew were working themselves up into a sexual frenzy waiting for Ajax to enter, but instead you got thrown in. They’re all a bit disappointed, but they fuck you anyway, no sense in wasting an erection.\n\nYou never return from the horrors inflicted on you in the tent that day, and you are forced to serve their twisted pleasures day in day out, never to exit the tent.\n","page 40":"Mentioning anything against the Ring Master would be a death sentence at this point, so you keep your mouth shut and leave.\n\nAs you leave the freaks, you notice a group of Pinheads congregating behind one of the trailers, when they see you they suddenly become quiet and stare at you with vacant smiles on their distorted faces.\n","page 42":"Charley leads the Midgets and you doubt if he’s going “fall in line” and even if he claimed he was, he’d just be lying. You might even be putting yourself in great danger by speaking to him directly about this, however you know the Midgets don’t really care for Charley, so if you could get him out of the way somehow, they might be more willing to ally with the Ring Master.\n\nYou decide to “test the waters” by speaking to one of the few Midgets (Actually the only one) that’s somewhat less hostile towards you. You see Bob working on hammering tent stakes in the ground and go up to him.\n\n“Hey Bob, can I talk to you?”\n“Aw hell Geek, I ain’t got no money for you to get fucking drunk! Just go steal the liquor from that sonofabitch Charley and take your goddamn chances!” he says barely paying attention to you.\n“No, its not that…so you uh think Charley’s a son of a bitch huh?”\n“I don’t think it, I know it. Everyone does.”\n“So why do you guys follow him?”\n“Because he does make things better for us. Better than the Ring Master did anyway.”\n“Yeah, but what if he’s not the best choice to lead you guys, I mean…”\n\nBob raises one eyebrow and focuses all of his attention on you now.\n\n“What the fuck are you talkin’ about Geek? You seem to be awfully interested with matters that don’t concern you.” Bob states raising his hammer menancingly.\n“Well um…I just heard that…um Charley…I mean…look there’s some shit gonna go down and the Ring Master wants me to get people on his side!”\n\nYou’re unsure of what Bob’s going to do about your revelation. You expect the worst, but for once luck is on your side.\n\n“Look Geek, I ain’t gonna lie to ya, not many of us like Charley, and sure, he’s a fucking tyrant, but he gets things done, I dunno he’s kinda like that guy in Germany, except shorter. However, if he wasn’t around, we’d go back to being second class citizens again and why? We DO keep this place running. The Ring Master claims he cares about us, but it doesn’t seem that way to us. We’re under appreciated. And if Charley does have ideas about taking over, then we’re behind him. Maybe the whole place would be run a lot better with him in charge anyway. AND I suggest you don’t talk to any other dwarves about this, you’ll find that you’ll get the same answer and they might just feel the need to tell Charley about the discussion and I don’t think that would be very good for you.”\n“So there’s nothing I can do or say to change your mind?”\n“Goddamn it, weren’t you fuckin’ listening Geek? I said no! Not unless you found someway of replacing Charley with someone a little more even tempered and with his business savvy.”\n“Well, why don’t one of you midg…I mean dwarves do it?”\n“(Sigh) Because most of us are simple laborers. We just wanna do our job with as little hassle and relax when we can, we don’t wanna be worried about extra shit. Let Charley worry about it since he wants it so bad. Besides if you haven’t noticed he’s got a mean streak a mile wide and that fuckin’ muscle bound freak Ajax around him all the time.”\n“So there’s nobody who’d want to take Charley’s place?”\n“Nope. The only one I can think of who’d even have the intelligence of running the criminal activity here smoothly anyway would be his overgrown girlfriend Salina. Now her I wouldn’t mind working under if you know what I mean! Hah! Now get the fuck outta here Geek, I got work to do and your smell is gonna stick to my clothes for days! Get!”\n\nYou back away from Bob before he hits you with his hammer or kicks you in the shin.\n\nIt wasn’t what you expected, but perhaps Bob has subtlety shown you a way to get the midgets to ally with the Ring Master, but of course this means talking with Salina. That could be even more risky though, considering she’s the object of Charley’s “love”. Not to mention she doesn’t particularly like you.\n\nBut then again, who does?\n","page 6":"Ajax the Strongman\n\nWhile Charley has delusions of grandeur, he is somewhat grounded in reality enough not to believe he’s invincible. Ajax on the other hand probably thinks he could catch a bullet in his teeth and spit it back at his assailant. The man is completely narcissistic. Undoubtedly he is in good shape, very strong and probably a lot better looking than most of the Carnies, and he takes every opportunity to let everyone know it. He sneers at all the other guys for being “lesser” than him (Save Charley, Atlas and the Ring Master) and of course shamelessly grabs at any woman that strikes his fancy. So pleased with his own body image that he basically walks around in a loin cloth at all times. Even when the Carnival is someplace cold and snowing. He’d probably walk around naked if he could get away with it.\n\nWhy he’s allied with Charley given his own arrogance and his “normie” status might cause some to wonder, but the reasons aren’t far fetched. Besides Ajax’s own criminal mentality, Ajax is an opportunist, and he’ll make more money under Charley and he thinks Charley is going to be on the winning team (Especially with him on his side) Not to mention Ajax doesn’t really like the Ring Master. Never has. His pale androgynous nature really creeps him out. And the Remarkable Randal is a pussy as far as Ajax is concerned.\n\nAnother person that Ajax definitely doesn’t like is you. While most others will simply avoid, taunt or abuse you for awhile for amusement, Ajax HATES you and has nearly beaten you to death a couple times. Presumably he sees you as a pathetic example of the male specimen that should’ve been killed at birth and while he may be right, he’s kept in check by Charley and/or the Ring Master from carrying out his desires. (As a rule Carneys are NOT supposed to kill each other…well unless there’s a good reason for it)\n\nYou’d be in a world of shit if something ever happened to both of them.\n\nAtlas the Cyclopean Giant\n\nIf there’s one person that’s possibly stronger than Ajax, it’s Atlas. (He’s certainly scarier) He’s an eight foot Cyclops that wears a hood covering everything except a single unblinking eye. He stands outside the Ring Master’s trailer at all times not letting anyone pass unless the Ring Master wishes it. Atlas has been with the Ring Master even before the Carnival.\n\nAtlas was personally brought up by the Ring Master and is utterly loyal to him. It’s commonly thought that the Ring Master found him abandoned as a baby and took him in, of course rumors also persist that he’s the Ring Master’s son. (Whether the Ring Master is the father OR the mother causes more rumors) Whatever the truth, Atlas might as well be his son as he certainly considers the Ring Master as a parental figure since he raised him.\n\nAtlas’ sole job is to protect the Ring Master and to look intimidating. A job he does very well. Atlas rarely speaks and if he does it’s usually a one word response in a low voice. Charley hopes Ajax will be his counter balance when the time comes, of course Ajax feels he’ll be able to beat Atlas with no problems.\n\nAtlas is one of the few people that has no opinion of you, he just sees you as another Carney who works for the Ring Master and aren’t allowed to see him unless he deems it so.\n\nMadam Orbec\n\nMadam Orbec is the gypsy fortune teller. Like most fortune tellers she claims to genuinely have psychic powers, but most likely she’s just really good at conning people. Still she always keeps in character at all times, so it’s possible she believes her own hype. One thing she does a lot is talk to “spirits” that aren’t there. Sometimes this results in her talking to herself for great lengths of time and often screaming to tell “them” to shut up. She doesn’t even appear to notice anyone else around while she’s doing this. All of which pretty much means most of the other Carneys consider her just mentally unstable and is listening to the voices in her own head.\n\nOddly Randal completely believes she has psychic abilities, this is probably due to Randal’s own naivety and his own desperate belief that magic is real. He consults her frequently about what she sees in the future for the carnival, it’s possible that’s why he hasn’t made any kind of move of his own because he’s guided by her visions to a certain degree. Madam Orbec likes Randal, but remains suspicious if he isn’t just trying to be friendly to gain access to an old book she has supposedly containing secrets to necromancy.\n\nBecause of this factor, unlike the Ring Master and Charley’s “right hand men”, Madam Orbec isn’t necessarily on Randal’s side. She believes a great change is coming in the carnival, but the spirits haven’t told her exactly what that is yet. Her visions and conversations have been increasing to the point where she can barely keep it together for the rubes anymore. Her sanity has been in severe question for years, but now her competency is as well.\n\nOf course she still has enough sense to not want to be near you. Apparently the spirits don’t like you anymore than the living do.\n\nPervus the Clown\n\n“Pervert” or “Pervo” is what he’s usually called and for good reason. Pervus is probably the next disgusting Carney after you, the only difference is he has a group of like minded “friends” and the other thing is he’s a clown. And clowns no matter how twisted and evil they are; they can get away with it.\n\nHe and his gang of equally demented red nosed fellows have to be the sickest bunch in the Carnival, particularly in the sex department. It’s not surprising that townie children start disappearing whenever the Carnival makes an extended visit somewhere and they certainly haven’t all run off to join, what ultimately happens to them is better left unmentioned and not dwelled upon too much. But it isn’t just children that disappear. Local farm animals will disappear as well (Strangely these poor creatures may be spared death, if the Carnival is in need of a couple new pack animals) and local graveyards may even be raided…\n\nOf course Pervus and the clowns think it’s all a big joke on the rubes.\n\nDespite being the symbols of utter depravity, they are one of the other “major groups” and as is fitting they are a wild card. They do their job when its show time and do it very well which puts them in good standing with the Ring Master. They often indulge in the prostitutes and liquor Charley provides. And while Randal barely approves of them (To be honest he probably isn’t aware of how bad they REALLY are) he does recognize them as having a talent and are an important staple of any carnival. (They also aren’t Freaks, though classifying them as “Normals” might be stretching it) Its unknown who Pervus will side with, but they see that there’s definitely benefits for any of them.\n\nPervus and his crew are the one exception concerning you. Instead of them avoiding you, YOU purposely avoid them! While they’d never kill you (They do still follow that one rule that you don’t kill a fellow Carney for no reason) that wouldn’t prevent them from having their way with you if the urge ever struck them. You have been known to resemble a rotting dead body (In smell especially) when you’re passed out after all.\n\nSasha and Salina\n\nSasha is the on/off girlfriend of Ajax. She’s not only a contortionist, but also an acrobat. She’s very beautiful, but her self-esteem isn’t really the best otherwise she wouldn’t be with Ajax. He pretty much treats her like shit, and she’ll put up with it, until he really fucks up and then she throws him out of her trailer. Upon which time he’ll continue to harass and stalk her until she takes him back for the umpteenth time and the cycle starts over again. She’s definitely the star attraction of the “normal” Carneys, besides Randal. (Who really wishes she wasn’t so close to Ajax.)\n\nSalina is Charley’s girlfriend…or at least he likes to tell everyone she is. She’s the tattooed woman and also dances with various kinds of snakes. (Imaginatively called a “Snake Lady”) She’s pretty, but has a harder look than Sasha, its obvious by her demeanor she had a rough life before the Carnival. Charley is constantly hitting on her, but he’s unsuccessful for the most part though every now and then he gets lucky, though you suspect it’s his money talking more than his “charms” at work in those cases. In any event she isn’t particularly fond of him. She’s considered a normal, but her activities and lifestyle lean more towards the criminal mindset particularly prostitution. So she has more in common with Charley than Randal who looks his nose down at her.\n\nProbably due to the partnership of Charley and Ajax, Sasha and Salina associate with each other more than they might normally would. As it turns out the two are genuinely friends and speak to each other frequently, one may wonder if they aren’t plotting something on their own together…\n\nOf course you’d never know since the two of them avoid you like the plague because you’re just icky.\n","page 19":"All that really concerns you is getting that book, because if you don’t get Randal’s help, the Ring Master is certainly going to kill you when she finds out you’ve turned traitor.\n\nPervus enters the tent and you sneak around back and begin trying to lift up a small portion of it to crawl in.\n\nYou hear a lot of noise and some protesting, while you’re doing this, when you finally get in, Pervus is having his way with Madam Orbec, completely oblivious to you and Madam Orbec isn’t making a sound…you don’t like the looks of this.\n\nYou turn to your left and see you’re right by her bed, next to that is her dresser which has the book on it. You grab it and crawl back out as quickly as you can. You run and don’t look back.\n\nWhen you get back to Randal he wonder’s why the hell you’re so worked up.\n\n“(Pant) I got the book.”\n“Phew! Well don’t breathe all over me, just gimme the thing! Excellent. I’ll study what I can tonight before show time and then afterwards we’ll see who the new master is! And what’s wrong with you Geek? Why are breathing so heavy and looking around…you didn’t let Madam Orbec see you borrow this did you?!”\n“No, not at all. I’m just winded from trying to get out there without her seeing me!”\n“Well you better make yourself scarce until showtime anyway. I’m sure you wouldn’t want to run into the Ring Master before hand. Relax, I will keep my end of the bargain. Now go.”\n\nYou leave and linger around the edges of the Carnival, staying out of sight until show time. What happened back at Madam Orbec’s tent still has you unnerved a bit. You know it’s only a matter a time before everyone finds out, before Randal finds out. She was basically like a mother figure to him. You didn’t think Pervus would kill her, unless he didn’t mean to and more likely he was just so overwhelmed with lust that he didn’t care at that point.\n\nIn fact you’re a little worried about being here by yourself with no one around. You half think Pervus is going to leap out somewhere and kill you too to shut you up. It would be exactly like him to do something like that. In fact now you think its weird to you that he HASN’T shown up to kill you.\n\nYou’ve got a lot of potential enemies right now, Pervus, the Ring Master, not to mention plain old Ajax who always wants to kill you. Randal is pretty much your only hope for survival now.\n\nEventually you wander back to the Carnival around show time. Everything goes as normal with a few exceptions. The Ring Master looks pre-occupied, Randal’s act seems to be a lot more spectacular than usual, the clowns nowhere to be seen and all throughout the show you have a dreaded feeling that something really bad is going to happen.\n\nAnd you just may be right.\n","page 5":"The Ring Master\n\nNobody knows what his real name is and if they do nobody’s telling and she’s certainly not volunteering any information about himself. Of course everyone assumes she’s male, but there’s an “air” of androgyny about him leading to rumors that he may actually be female…or possibly both. He’s very pale, his voice has an unnatural melodic tone and he wears a traditional ring master suit with a top hat. The only thing she wants people to know and remember is that he is definitely in charge. Her main concern is to keep his carnival running and turning a profit; he doesn’t really care what any of his employees do in their spare time unless it interferes or hampers the carnival.\n\nThe Ring Master is known for being “Freak friendly” after all not many would have jobs at all if it weren’t for him, but by the same token he pays them fairly. Many see her as somewhat of a savior since he’s given many of them a place in the world where they can be useful. She doesn’t hold their hand or overprotect them he just gives them a chance. A chance that they can either succeed or fail in, but a chance they might not have had otherwise without him.\n\nHe tends to stay in his trailer until show time allowing her assistant Charley to do all his leg work. She’s rarely seen walking around anywhere; instead he just suddenly “appears” and he’s never seen outside at all during the daytime. There have been the hushed rumors and semi-jokes that she’s really a vampire, but most people just think he’s just weird and suffers from albinism which makes her less inclined on wanting to be exposed to the sun.\n\nWhile not sadistic, (He doesn’t appear to get off on it like say Charley) he will make examples out of people that displease him and you’ll definitely feel it. Oh how you’ll feel it. When you have to see the Ring Master personally it’s usually not a good thing.\n\nYou met him when she found you wandering and vomiting near his trailer at night while in your usual drunken states. She saw how utterly hopeless you were. You had no job, no home, no loved ones, no future prospects, yet he saw potential where there literally was none. He made a deal with you. Become the GEEK for a place to call home and all the liquor you could drink.\n\nWell gee how could you not pass up a deal like that?\n\nCharley the Midget\n\nCharley was a criminal long before he joined the carnival. The carnival just allowed him to flourish in those activities. He’s in charge of most of the illegal activities that go on at the carnival as well as making life miserable for anyone who displeases the Ring Master. Of course he takes great delight in making people miserable whenever it suits him. He has found a like minded partner in Ajax the Strongman who acts as his muscle when the need arises. He’s a first class sonofabitch, but he probably makes the carnival more profitable than it is.\n\nMidgets represent most of labor workforce in the carnival and being the “Biggest” and toughest midget at the carnival makes him their unofficial leader which the rest of the midgets have mixed emotions about, but with all his connections and power there is little that they can do about it even if they wanted to. Charley constantly reminds them that they are the real backbone of the carnival and also reminds them how townies and rubes would often pick on them for fun and ever since he arrived they don’t do that anymore lest they suffer the consequences. Gruesome consequences.\n\nCharley definitely harbors secret plans to take over the carnival completely one day, he likes to think of himself as the “Real Ring Master” and dresses like his boss except his suit is checkered and has an especially tall top hat. (To extend his height no doubt) He feels that with Ajax and “his people” behind him he’ll be able to launch a take over when the time is right. All he needs to do is get a few more of the others to side with him.\n\nAs for you, Charley likes to take any free opportunity he has to humiliate you, which seems rather pointless given you don’t have any self-respect to begin with, still it makes him laugh. Chances are if he did take over the Carnival you’d still have a “job” since Charley wouldn’t want to get rid of his favorite whipping boy.\n\nThe Remarkable Randal\n\nRandal is the appointed spokesperson for the “normal” Carneys such as the acrobats, tightrope walkers and other performers that rely on their genuine skills rather than their genetic conditions. Randal himself is a magician, but makes no pretense that he actually has any kind of real magical powers, but he believes magic exists. He’s constantly acquiring old books hoping that someday that he can learn how to perform real magic one day. Randal is a bit of an optimistic dreamer, he believes the carnival is supposed to be a place of fun and wonder for the whole family. He IS that boy that ran away to join the circus in a sense as he did run away from his family who were fundamentalists that believed him to be dabbling in Satanic worship with his magic tricks.\n\nHe doesn’t really like the idea of the carnival having “freaks” for the sake of having them. He feels its pandering to the lowest common denominator and cheapening the other Carnies who actually have to rely on a learned skill and he really doesn’t approve of all the illegal activity that goes on (Especially in a place which is supposed to be for the children) he blames the Ring Master as much as Charley for this, since the Ring Master turns a blind eye to it when he should be stopping it.\n\nRandal is a little more open about his rebellious nature than Charley and complains to the Ring Master whenever he gets the chance, (One of the few that gets away with it without consequences) to which his last response was if he doesn’t like the way things are being run, he can either leave or make his move. So far Randal hasn’t gone anywhere, so maybe he’s going to take the Ring Master up on his challenge. Charley thinks he’s a lot of talk and doesn’t think he really has the balls to do it so he’s not worried about him.\n\nConsidering Randal’s views, you might find yourself out of a job if Randal got things his way. Shock value and Freaks wouldn’t really have a place in Randal’s carnival. Unsurprisingly Randal finds you and your act disgusting and completely unsuitable for anyone, especially children. (Even though the kiddies really like throwing chickens at you)\n","page 18":"Maybe you just want to talk to Salina because you’re creeped by Pervus or maybe you want to talk to her because you think she’s pretty, or maybe it’s a combination of both.\n\nWhatever the case the result is still the same when you bang on her trailer.\n\n“PEEYOO! Geek! Get the fuck outta here, even if you did have some money I wouldn’t debase myself!” Salina says when she answers.\n“No, its not that, I need some help.”\n“I’ll help you get your ass kicked if you don’t get outta here! I’m sure Charley wouldn’t like seeing you here lingering around me.”\n\nYou just realized that. If Charley caught you here, he’d probably torture the shit out of you and then let Ajax finish you off (Nevermind the fact that Salina IS a prostitute, but Charley isn’t always logical when it comes to her, plus you’re a punching bag anyway)\nYou need to not remain here as long as possible.\n","page 8":"Geek:\n\n1. A person regarded as foolish or clumsy.\n\n2. A person who is single-minded or accomplished in scientific or technical pursuits, but is felt to be socially inept.\n\n3. A carnival performer whose show consists of bizarre and disgusting acts.\n\n\nYour breath stinks from the foul things you’ve been eating and the rest of you stinks from not bathing in who knows when.\n\nYour head hurts from the cheap moonshine you’ve been getting “paid” in.\n\nRubes often throw stuff at you and spit on you.\n\nMost of the other Carnies find you utterly repulsive and avoid you, a couple of them just abuse you for various reasons.\n\nOn a good day, only the Pinheads come to your cell and taunt you with their gibbering laughs and mongoloid chatter.\n\nYou have absolutely no worth as a human being, you get no respect from others, and you have no respect for yourself…and why should you? You are the lowest form of life in Carney society. You’re not a real performer; what you do can’t really be considered a skill. You’re not even a real freak. At least a deformed freak can evoke an emotion of horror, or pity, or even admiration for overcoming their condition. You weren’t born “this way”. You chose to do this. All you evoke is disgust and revulsion. At best you’re laughed at and not in the good way like those pervert clowns you work with.\n\nFuck all that “Wildman of Borneo” shit that the Ringmaster tries to tell all the rubes. You’re little more than a bum with a “job”. A degrading job that involves you to debase yourself, all for the amusement and shock value of others, but hey it keeps a “roof” over your head and you pleasantly drunk enough to just barely forget how utterly pathetic your life is.\n\nYou are the GEEK.\n\nYou wake up to a bucket of piss being thrown in your face. Not the first time and certainly won’t be the last.\n\n“You like the taste of that Geek? Get up Geek! The Ring Master wants to see you!” Charley orders then he throws the empty bucket at your head. The comical sound it makes hitting your skull and the pain it causes makes Charley laugh. Then he jabs you a couple times with his pointed stick.\n\nMidgets can be so cruel…\n","page 7":"Normals\n\nNormals is really a generic term for anyone who isn’t a Freak, but its often used to describe Carneys who aren’t deformed in some way and make a living in the Carnival utilizing some skill. (“Normals” who aren’t Carneys are usually just called “Rubes” or at best “Townies”) The core of these include acrobats, tightrope walkers, game barkers and the like. Normals as always out number the Freaks, but they aren’t nearly as unified, though Randal’s been trying to, in his effort to gain power.\n\nNearly all Normals find you revolting and run you off if you get near, either verbally OR physically.\n\nFreaks\n\nThis is a generic term for Carneys who have some sort of genetic condition that separates them from the rest of society. They can range from being very hairy, have no limbs, or have a few extra ones. In any case they are one of the major carnival draws. Some learn a few skills to go along with their deformities, but it’s mainly their horrific appearance that they rely upon. Despite all their different forms, they are very unified and support the Ring Master for giving them a place in the world. Jasmine the bearded lady tends to be the Matriarch of them all\n\nFreaks are a little more tolerant of you, since they’ve also suffered scorn and ridicule too, but you’re not REALLY one of them and as such you’re still an outsider and aren’t really welcomed around them.\n\nMidgets\n\nNot quite normals and not quite freaks, but the midgets are the ones who get things done in the Carnival and keep it running. (Though everyone else refers to them as Midgets, they prefer to refer to each other as Dwarves) They make up a majority of the labor force of the Carnival, a thankless job to be sure, and one that went unappreciated until Charley arrived. Now they make a lot more thanks to his “extra curricular” activities. They are pretty much unified, though they have mixed feelings about their self appointed leader.\n\nMidgets are overworked at the best of times, so when a smelly disgusting Geek like you is around they really don’t have the tolerance or patience for it. Bob is about the only one who’ll even talk to you, the rest tend to kick you in the shins and chase you off with their work tools while shouting obscenities.\n\nPinheads\n\nAn interesting sub-society within the Freak community. They all tend to hang out together constantly laughing and babbling nonsensical ramblings. Though they may appear childlike and carefree, those qualities can mask a mean spiritedness sometimes.\n\nYou’d know since you’ve experienced this meanness first hand.\n\nClowns\n\nPure evil wrapped up in the guise of something supposedly funny and harmless. While technically classified as “normals”, there isn’t anything normal about them. One wonders if they’re actually even human underneath that make up. All intelligent right thinking people stay away from them.\n\nEven YOU stay away from clowns!\n","page 2":"You stagger to get up and attempt to kick Charley, but instead to trip over yourself and fall…right on to Charley’s pointed stick. The only good thing is you skewered yourself right through the heart killing you instantly.\n\n“Aw hell. Hey guys! Someone get me another Geek! This one’s dead.”\n","page 1":"“Agh! Alright, alright! Stop poking me…what day is it?”\n“Never mind all that geek! Get going you know how the Ring Master doesn’t like being kept waiting! Phew! You smell even more disgusting than usual! I guess that’s one way to keep Ajax from killing you, he’d probably vomit his guts out before he could lay a hand on you…then you could lick it up for the rubes! Ha ha! Move it Geek!”\n\nCharley prods you with a sharp stick periodically on your way to the Ring Master’s trailer until you arrive at which point, Atlas stops the both of you.\n\n“Stop! What business do the both of you have here?”\n“Goddamnit you fuckin’ one eyed freak! We go through this all the fucking time and its getting REALLY old! You just saw me come out of the Ring Master’s trailer earlier today when he sent me to get the Geek, you know damn well what we’re both doing here!”\n\nIgnoring Charley’s comments Atlas looks down at you and points.\n\n“You may enter, but the Ring Master doesn’t need to see you again, so you may not.”\n“Yeah, whatever enjoy the smell.” Charley says and mumbles something to himself while leaving the area.\n\nYou barely make it up the little steps to the trailer, but you do. You’re finally starting to gather your wits together; your head still hurts though and you’ve just realize you haven’t had a drink yet. What a terrible feeling. You open the door.\n\n“Close the door, you’re letting all the sunlight in.” the Ring Master orders from behind his desk. She’s siting in his chair, but has her back turned to you.\n“Uh you wanted to see me?”\n“Of course…(Sniff sniff) you really haven’t been taking care of yourself. If anything you’ve become even more repulsive than when I first took you in. Remember that day?”\n“Um, yeah I think…no, no I don’t. I mean kind of… I forget things.”\n“I’m not surprised; you’re constantly drinking that swill Charley makes. I am surprised you haven’t gone blind yet though. Oh well what you insist on doing to yourself is of little concern to me, all I require is your obedience. You are thankful for all I have provided for you aren’t you?”\n“Oh yeah. Sure I am.”\n“You seem to be one of the few nowadays then. There are some though that are ungrateful for things I’ve done for them, they plan to betray me and everything this carnival stands for. They plan to change the natural order of things. Can you imagine what might happen to this carnival if I wasn’t here? What might happen to you?”\n\nYou attempt to think about this scenario, but instead you just stand there because you can’t really form anything in your mind because it hurts really bad, you’ve been sober too damn long, and it’s about to get even longer as the Ring Master seems intent on bombarding you with talk as he finally swivels around in her chair. That pale androgynous face of the Ring Master’s is displaying a look of seriousness as usual.\n\n“Nothing good I can assure you. Which is why I’m putting YOU in charge of this task.”\n“Huh? What task?”\n“Why ensuring the survival of the carnival of course.”\n”What!? Me?! Why? How!? I’m not qualified! Can’t you or Charley do it?”\n“I fear I’ve done all I’ve can. I mean I’ve provided all of THIS to everyone here. I’ve given them purpose and a life. If that isn’t enough for them, then my words aren’t going to make a difference at this point. And as for Charley, well…I’m sure even in your usual state of drunkenness you’re aware that he has his own plans for this carnival.”\n“I guess…but agh, it’s too early for all this…why me? I mean what am I supposed to do? I’m just the Geek.”\n“Yes, and that’s exactly why I’m choosing you. You have no motive, you have no agenda, you have no friends, and as such you would probably be the best candidate to convince others to resist change and keep the status quo.”\n“You have to be joking! Nobody’s going to listen to me! I’m the fucking Geek!”\n“You might be surprised, you have far more potential than you give yourself credit for…perhaps you’ll even change some perspectives, or maybe not. The choice is yours, because the fate of THIS carnival is resting solely on your actions, you can no longer afford to hide from the world in a bottle and a cage if you wish to keep your current life. It is time for you to take some responsibility, its time to repay the debt you owe me. You have until show time.”\n“But…”\n“Now leave me, I wish to be alone.”\n\nThe Ring Master swivels his chair back to its original position. You head back outside, where upon Atlas blocks it again with his massive body.\n\nNever before in your life have you been put in this kind of position of responsibility, (Not that you can remember anyway) but you’re going to have to do something, the question is what exactly?\n","page 3":"Just because you’re all Carneys and united against the Rubes doesn’t mean there isn’t division in the ranks. You’re all like a big dysfunctional family, and you’re the scapegoat black sheep, you lucky Geek you.\n\nThe only good thing about being the GEEK, is that nobody considers you a threat or even a person! Plus you’re usually sprawled out someplace either drunk or asleep. This means while others assume you’re out of it and not competent enough to do anything except eat disgusting things, you’ve over heard some interesting information in your half conscious state of mind. Things that will probably come in handy in the ensuing power struggle you’re about to become embroiled in.\n\nSo if you keep your head down, use animal cunning, watch your ass and you might just come through this alive.\n\nAnd maybe, just maybe you’ll finally get some respect.\n\nMaybe…\n","page 11":"This mission that’s been given to you by the Ring Master has gotten you all shook up. You don’t want all this pressure, yet you’re too scared to leave. This is the only place that accepts you somewhat.\n\nYou’re too distracted to even get a drink! You’d rather not have to deal with Charley or especially Ajax right now either. Sometimes you just wish you didn’t have to live an utterly pathetic existence.\n\nWhile you’re attempting to find some place dark to crawl into and hide, you literally bump into Remarkable Randal.\n\n“Oof! Watch it you smelly, ugly, Geek! Honestly it’s bad enough this Carnival has Freaks and criminal Midgets, but honestly having YOU here defies all logic. If I ran this Carnival things would be different! What are you doing out of your cell anyway? Doesn’t the Ring Master usually keep you locked up until show time?”\n“Oh, um he wanted to talk to me about something.”\n“She did? What about?”\n“Oh about my act, and uh…doing…um…something.”\n\nRandal’s normal distain for you changes to one of interest. He studies you for a moment before speaking.\n\n“So the Ring Master has entrusted YOU to save this place? Hah! She MUST be desperate!”\n“Huh? What? How did you know?”\n“Madam Orbec has been teaching me how to contact the spirit world and read into people’s souls. And yours is an easy read indeed, such as it is…perhaps our meeting has its purpose however. After reading your soul I can see something within you that may be worth saving. I never thought it possible, but I think I may be able to help you and your situation Geek.”\n“I don’t understand.”\n“Yes you do. Maybe you try to block it out of your mind with that swill you drink from Charley, but deep down you hate what you are and your retched life. And you should. You’re a sorry excuse for a human being, in fact you aren’t really even human anymore, you’re sub-human. However, you have a chance to regain your humanity back, and even become a useful member of this Carnival again. And I’ll help you, if you help me.”\n“How am I supposed to help you?”\n“A simple task really. All I want you to do is go get Madam Orbec’s black book. She keeps it by her bed. You’ll know it when you see it.”\n“What?! You want me to steal from her? I thought she was supposed to be your mentor or something!”\n“Shhhhh! Keep it down Geek! Look. Madam Orbec IS my mentor and I’ll always be grateful for what she’s taught me. I’ve always believed in magic, but without her teachings, I wouldn’t be a magician, I’d only be an illusionist.”\n“There’s a difference?” you interrupt.\n“Oh yes, Geek. Oh yes. Anyway, you’re not stealing the book, I just need to borrow it for awhile because its time for me to learn more. I think Madam Orbec is afraid I’m not yet prepared to learn the secrets that lie inside her black book. But I know I am, and its time for me to prove it to her. She’ll be so proud when she sees what I’ll be able to do.”\n“So what’re you going to do with it?”\n“I’m going to use its powers to help me take over the Carnival of course.”\n“What?! I’m not helping you do that! I’m supposed to be helping the Ring Master anyway!”\n“Why? Seriously, what has the Ring Master really done for you? Given you a job? The Ring Master is exploiting you for his own personal gain. She cares nothing for you. He just saw a useless dreg of society and turned you into something that could somehow make money for her. Assuming you helped the Ring Master and were even successful, think about it, you’d just go back to your living your miserable life. Is mere existence just enough for you? Isn’t it time you wanted MORE out of life?”\n\nYou’re quiet. You don’t think anyone’s even asked you that question, even before you became a geek, and you’re really surprised to hear it coming from Randal. Someone who has nothing, but distaste for you.\n\n“I dunno, I think I’m pretty bad off. I don’t think there’s anything I can do to improve myself at this point.”\n“Nonsense, there’s always a way and your first step is by helping me. Look. Maybe you are what you are and I don’t like it, but I do see that underneath it all you ARE a Normal. You should be on my side anyway; I can help you be something more than a geek. With magic anything is possible! Retrieve that book for me and I’ll turn this Carnival into something much more than what it is and I’ll turn you into something much more than what you could’ve thought possible.”\n\nSomething about Randal makes you believe him. You can understand why people do tend to want to follow him. Maybe things would be better if he took over. He certainly seems more caring than the Ring Master and a hell of a lot better in general than Charley.\n\n“Okay, I’ll help you, but I dunno how I’m gonna ste…I mean borrow the book.”\n“Well I leave that up to you, but make sure you get the book to me before show time and don’t come back to me until then.”\n\nRandal leaves you to it, but you’re still not sure how you’re going to go about this. If Randal can read your intentions then Madam Orbec will certainly be able to read yours. It occurs to you, that you might need some help from the less “moral” people here. And you can’t ask Charley to help you for several reasons.\n\nYou could go to Pervus for help. If murder and sexual deviancy is no problem for him then surely a little theft won’t be either. And he’s usually up for doing anything remotely illegal.\n\nYou could also go see Salina. Besides prostitution she’s known to be good at theft as well, though her helping you is a real long shot.\n","page 55":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 10":"If you’re going to do anything you have to get a drink first, you head over to Charley’s still, you can only hope Ajax isn’t there.\n\n“What the fuck is that smell? Oh it’s the fucking lame ass Geek, why am I not surprised?” Ajax shouts when he sees you coming.\n\nWell so much for hope. Normally you’d run, but Charley’s also there and will keep Ajax from killing you (Maybe not beating you though) plus your reliance on alcohol in any form drives you on even in the presence of possible danger.\n\n“Lemme guess Geek, you want a drink?” Charley asks. “Ah good ol’ predictable Geek. Here you go.”\n\nCharley pours you some of the swill that you consider the Nectar of the Gods and drink it greedily. He pours you another when you finish it. Charley’s being unusually cool with you.\n\n“Can’t get enough eh? Here’s another…so what’d the Ring Master want to see you for?”\n“Huh?”\n“I said what the fuck did the Ring Master want to see you for? Surely it wasn’t about your act, you eat disgusting shit and that’s the end of it. So what did you talk about?”\n\nCharley’s demeanor has changed severely. He’s looking at you intently to determine if you’re going to lie to him. You’re thrown off guard and can only stutter a response.\n\n“Um, nothing much, he, um…I mean she…uh…”\n“WRONG ANSWER GEEK!” Charley yells, punching you in the nuts and at his height, he lands a good hit. You collapse like a rag doll, and then Ajax puts his foot on your neck while you hold your scrotum in pain.\n\nCharley continues his interrogation this time with his sharp stick pointed near your eye.\n\n“Now you’re gonna tell me what you and that pale she male freak talked about or you’ll have something in common with Atlas! Talk!”\n“(Groan) Alright! Okay! The Ring Master thinks change in this carnival is coming and he wants me to convince people that they should be on his side when the shit goes down!”\n\nCharley smirks and looks at Ajax.\n\n“You hear that Ajax? Some SHIT is supposed to go down! This is the first I’ve heard of any shit going down! You know about any shit going down Ajax?”\n“Nope. First I’ve heard of it. The only shit that goes down around here that is what this fucking Geek eats!”\n“Got that right…but just in case there WAS some SHIT going down, I’d say it would be in someone’s best interest to not be on the Ring Master’s side and be doing his bidding…after all they might find themselves getting hurt very badly.”\n“Charley you don’t have to worry about me! Nobody’s going to listen to me, I’m just a Geek!”\n“Of course I’m not worried about you! However…if the Ring Master asked YOU to do this, there must be a reason that I’m not readily seeing…I know! You’re working for me now!”\n“What?!” Ajax asks.\n“What?!” you repeat.\n\n“Yeah, all the shit the Ring Master told you to do; you’re doing for me now. Trust me you’ll be better off when I’m in charge. You can have all the booze you want, a bigger cell, hell I’ll even get you LAID! I know a couple of ladies who’ll debase themselves almost as much as you will!”\n\nCharley then gets in your face and whispers\n\n“And you won’t have to worry about Ajax ever hitting you again with me in charge I promise. But if you betray me, I’ll make sure Ajax breaks every bone in your goddamn body and then tosses you to Pervus and his fucked up clown army where they can skull fuck your corpse. Are we clear?”\n“Yeah, yeah, sure!” you quickly say.\n“Good. Ajax let him up.”\n\nYou get up and Charley addresses you before you leave.\n\n“Remember, you have until show time Geek, and don’t even think about trying to run away, because I’ll find you and you know what happens then.”\n\nYou stagger away with your new mission, you have no idea of how to go about this, so you just think about who might need convincing.\n\nGod you could use another drink…\n","page 54":"“So, are you guys getting ready for your act tonight?”\n\nThe Pinheads look at each other and then look at you and continue to smile vacantly.\n","page 57":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 12":"This is all just too much for you; you don’t want to be any part of this. You do what you’ve always done all your life; run away leaving the carnival behind. Nobody goes looking for you, not even the Ring Master. Geeks like you are a dime a dozen. They can get another one.\n\nYou take up “residence” in the nearest town, begging for money for booze and sleeping in the park. The townsfolk are a little less tolerant of the likes of you than the Carneys were though and besides they already have town drunks that they know and love. You’re treated worse than you were at the Carnival if such a thing were possible. At least there you served somewhat of a purpose; here you’re just a drain on the community.\n\nOne night the town’s drain is solved when you’re beaten and set on fire by the local young punks.\n","page 56":"For some reason the Pinhead’s silence makes you feel welcome, normally everyone drives you off, you decide to talk more.\n\n“Yeah I got a new act, I bite the head off of a cat, vomit it back up and then eat it again with rotten chicken livers.”\n\nThe Pinheads cease smiling, and begin to look utterly bored.\n","page 15":"Just because you’re all Carneys and united against the Rubes doesn’t mean there isn’t division in the ranks. You’re all like a big dysfunctional family, and you’re the scapegoat black sheep, you lucky Geek you.\n\nThe only good thing about being the GEEK, is that nobody considers you a threat or even a person! Plus you’re usually sprawled out someplace either drunk or asleep. This means while others assume you’re out of it and not competent enough to do anything except eat disgusting things, you’ve over heard some interesting information in your half conscious state of mind. Things that will probably come in handy in the ensuing power struggle you’re about to become embroiled in.\n\nSo if you keep your head down, use animal cunning, watch your ass and you might just come through this alive.\n\nAnd maybe, just maybe you’ll finally get some respect.\n\nMaybe…\n","page 59":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 9":"You feel you don’t really have a choice in this situation. The Ring Master is in charge and whatever he says goes and you DO owe a lot to her. As bad as it can be here sometimes, it would probably be worse if you didn’t have the protection of the Carnival.\n\nAs tempted as you are to get a drink to get you through this test you have before you, you realize you need to stay sober for this. What a terrible thing. Now you have to figure out who you need to convince.\n\nThe Freaks are firmly on the side of the Ring Master, so you don’t need to talk to them. That just leaves the Midgets and the Normals, both of those present some problems.\n","page 14":"Just because you’re all Carneys and united against the Rubes doesn’t mean there isn’t division in the ranks. You’re all like a big dysfunctional family, and you’re the scapegoat black sheep, you lucky Geek you.\n\nThe only good thing about being the GEEK, is that nobody considers you a threat or even a person! Plus you’re usually sprawled out someplace either drunk or asleep. This means while others assume you’re out of it and not competent enough to do anything except eat disgusting things, you’ve over heard some interesting information in your half conscious state of mind. Things that will probably come in handy in the ensuing power struggle you’re about to become embroiled in.\n\nSo if you keep your head down, use animal cunning, watch your ass and you might just come through this alive.\n\nAnd maybe, just maybe you’ll finally get some respect.\n\nMaybe…\n","page 58":"“Yeah, I remember one time I ate a dog bladder, kind of a bitter taste.”\n\nThe Pinheads are now starting to get annoyed with you as you insist on telling them your “interesting” list of past dinners.\n\nYou might want to stop. While the Pinheads aren’t normally abusive to you, you don’t exactly have a nice history with them and they have been known to get mean when something displeases them, much like young children do.\n","page 17":"You decide Pervus would be a better choice. Probably not the safest, but he’s more likely to help you.\n\nYou’re hesitant to go anywhere near the clown tent to get him though, however for once luck is with you and you see him around the animals talking to a horse.\n\n“Hmmm, yeah. You’re a pretty filly. Yes you are. Let me tell you what I’m gonna do…(sniff) you smell different than usual.” Pervus then turns around. “Oh it’s you Geek. What the fuck do you want? Can’t you see I’m with a lady?”\n“Hey um, Pervus I need your help with something.”\n“Oh do ya now?”\n“I need to borrow a black book from Madam Orbec, and I need you to distract her.”\n“Hmm, normally I wouldn’t help you do shit, but I’m kinda in the mood for some OLD pussy right now. Yeah I’ll distract her, I know exactly how to distract her.” Pervus say while stoking his crotch.\n“Um hold on, you’re not gonna rape and kill her are ya?”\n“I won’t kill her…oh fine I won’t rape her either. Probably won’t be necessary anyway, I’ve always had a way with the ladies…sorry old girl, but I’ll have to be fucking you some other time.” Pervus remarks and pats the horse on the head before following you.\n\nYou both approach Madam Orbec’s tent which has an air of creepiness about it. Pervus has a look of crazed lust in his eyes. He’s starting to breathe heavily and doing a lot of slurping.\n\n“Oh fuck yeah, this is gonna be soooooooo good.”\n\nHe said he wasn’t going to do anything excessive, but now you’re not so sure…\n","page 16":"Just because you’re all Carneys and united against the Rubes doesn’t mean there isn’t division in the ranks. You’re all like a big dysfunctional family, and you’re the scapegoat black sheep, you lucky Geek you.\n\nThe only good thing about being the GEEK, is that nobody considers you a threat or even a person! Plus you’re usually sprawled out someplace either drunk or asleep. This means while others assume you’re out of it and not competent enough to do anything except eat disgusting things, you’ve over heard some interesting information in your half conscious state of mind. Things that will probably come in handy in the ensuing power struggle you’re about to become embroiled in.\n\nSo if you keep your head down, use animal cunning, watch your ass and you might just come through this alive.\n\nAnd maybe, just maybe you’ll finally get some respect.\n\nMaybe…\n","page 50":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him. The Ring Master has Atlas, and his usual allies, the Freaks are hanging in the darkness ready to strike if necessary. Most of the Normals though are nowhere to be seen. You hope Madam Orbec did her job, because even without Ajax, Charley still has a numerical superiority and a pissed off midget can do a lot of damage.\n\n“Your time has come Ring Master! No longer will you exploit us! I’m taking over!”\n“So you can exploit your own people of course. Charley, I’ve put up with your delusions of grandeur long enough, it ends tonight. I have allies of my own, and you might find they are much more dedicated to me than yours are.”\n“It won’t work Ringy, I got more in common with my people than you ever will! Blood is thicker, and yours is going to run everywhere if you don’t peaceably leave…I’m giving you this one chance you pale she-male.”\n“Not likely.”\n\nAt this point all of the freaks come out of hiding, and then Randal and most of the Normals appear as well. Pervus also shows up with his clown crew, and that’s when you see Ajax, or what’s left of him. He’s dressed in a weird leather getup and has a chain around his neck which one of the clowns is holding. There’s also a black leather mask covering his face now and some sort of ball gag…he looks completely docile and broken.\n\nSuddenly Charley seems to get a little less hostile, the rest of the midgets also look less than willing to fight now, though he’s still not backing down completely.\n\n“…so that’s what happened to Ajax…(Sigh)…alright Ringy you win. I can see I can’t beat you…I’ll leave. BUT! I’m taking my people with me!”\n“No you won’t, they work for me.”\n“The fuck I can’t! They’re still fuckin’ free people! You don’t fuckin’ OWN them Ringy! They ain’t your slaves!”\n“Oh and I suppose they’re YOUR slaves eh?”\n“Fuck it, let’s settle this.” Charley turns around to his fellow midgets. “Hey, do you want to work for me and make some serious money doing something a lot less menial? Or do ya wanna work for this hypocritical slave driving bitch bastard who claims everyone is free to do what they want and has his protection, but in reality she doesn’t do shit for anyone but herself and just expects everyone to obey him?”\n\nThe midgets talk to each other for a moment and then reply with a uniformed answer that they want to stay with Charley. The Ring Master actually looks surprised, she even gets mad claiming all of what he’d done for them, but it doesn’t work. Charley was right they have more in common with him than they do the Ring Master. Charley leaves with his midget gang. The Ring Master looks like he’s going to order an attack, but decides against it. Instead he just assigns some Normals to do the job of the midgets and orders the rest to seek out new recruits in the next town.\n\nEveryone disperses leaving just the Ring Master, Atlas and you alone. The Ring Master for once looks a bit despondent. Not knowing what else to do, you attempt to lighten the situation.\n\n“Well you won, I’m just glad I didn’t mess things up for you.”\n“Yes, for now, but there will only be problems in the future. What happened to tonight was just a temporary patch for the situation…I suppose you did your best within your capabilities Geek. No more could be expected of you. The Carnival will survive, just like it always has though…return to your cell, we have a big show to do tomorrow and significantly less help.”\n\nAnd you do exactly that and continue on as usual\n\nTime passes and while nothing really changes for you, things do change…\n\nWithout the midgets around to do most of the manual labor of setting things up, some of the less talented Normals like game barkers and such have to double as laborers. This causes some bad feelings initially until the Ring Master orders the Freaks to start helping as well. The Freaks seem to dislike the fact that the Ring Master isn’t “favoring” them as much anymore, but she’s just trying to keep things fair so his Carnival stays together. The criminal activity goes down quite a bit. (Though someone’s always still making hooch so happily you still have a steady supply of booze to grab)\n\nWith Ajax out of the way Sasha grows closer to Randal who returns these feelings. This new relationship makes him a little less “uptight” and more willing to take chances and less likely to go running to Madam Orbec before he does anything. His “threats” of taking over start becoming more likely. Another rift in the Carnival is expected to occur and finally does, starting with the fiery death of Pervus and his clowns.\n\nSince the Ring Master was always looking for more help, Pervus and his clown crew took it upon themselves to start “recruiting” unsuspecting townies and rubes to come work for the Carnival, this causes them to start engaging in debauchery on a bigger scale than before, to an extent that they become a liability and more obvious. Randal, still having a great sense of ethics and morality could not stand by and let it go on any longer. He and several other Normals set fire to the entire tent in the middle of the night killing them all. (And putting the “Gimpjax” out of his misery.)\n\nThe Ring Master was furious that Randal would take such a liberty. Another battle comes close to occurring, but fortunately for the Ring Master,(Who would’ve been greatly outnumbered) Randal doesn’t want to fight over the Carnival, instead he convinces his followers to leave while they started their OWN Carnival. One that was more family friendly and without Freaks all over the place. He leaves with Sasha and most of the other Normals in tow.\n\nThe Carnival becomes much smaller and is little more than a traveling Freak show as they are practically the only ones still left. The Ring Master doesn’t seem to mind though, as he said, the Carnival would survive, maybe not in the same way, but its still around.\n\nAnd you still remain the GEEK.\n","page 53":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 52":"The Pinheads are behaving very oddly, normally they’re gibbering or playing, they’re hardly ever this quiet. You approach them.\n\n“Hey, what’s going on?” you ask.\n\nThey look up at you still vacantly smiling at you.\n","page 66":"You don’t want to risk waking him, so you just let him finish...the sucking and slurping sound is unnerving.\n\n“Hmmm, yeah, your clit tastes so good…mmm.”\n\nYou shutter to think what clits he’s been sucking and licking if he thinks YOUR toe is one and that it tastes good!\n\nSoon he seems to stop and mumbles something about being sorry for pissing the bed again. You safely move your foot away. Not wishing to have anything else of yours molested, you grab a bottle dowse the box, and then set it on fire with one of the lighters here and get out as fast you can. You can hear some of the clowns cursing and yelling from the tent in the distance.\n\nWhen you get back to the Pinheads they’re playing with a ball and laughing. Upon seeing you, George nods in your direction, as its safe to talk with nobody around.\n\n“I did it.”\n“Yes, I know, I had Frank follow you. Good job.”\n“So about your side of the deal…”\n“Yes, don’t worry, we’ll honor it. Charley’s a good business man, he’ll make this place even more money…which means more money for us too, we don’t mind if he takes charge. You can go report to your new master the good news, but don’t you fucking DARE say shit about our true nature to anyone, EVER.”\n\nYou agree and leave, you tell Charley the news before show time who chuckles heartily and tells you to be ready after the show because the revolution is coming after the rubes leave. Not wishing to run into the Ring Master before hand you hang around Charley’s still which isn’t too pleasant since you have to endure Ajax’s abuse while Charley goes off to make his preparations.\n\nThen show time arrives, everything goes pretty much the same except the Ring Master looks a little distracted the entire time and the clowns seem to be off their game tonight. The Pinheads take the opportunity to show them up in from of everyone.\n","page 21":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him as well as Ajax. The Ring Master has Atlas, and looks around for his usual allies, the Freaks, and to the surprise of everyone Randal appears with most of the Normals behind him. You attempt to hide directly behind Randal figuring that will be the safest place.\n\n“YOU? You’re attempting to take over? You must be joking! Go take your fairy dust and\nprance off somewhere, this is between me and the she male freak!” Charley spits.\n“No, you malignant midget! Your time and a criminal ways are at an end here today! And you too Ring Master! No longer will this Carnival be run by an exploitative tyrant!” Randal retorts.\n\nThe Ring Master sees you and shakes his head.\n\n“I’m very disappointed that you decided to betray me here today Geek. You will learn to regret that fateful decision.”\n“Enough, of this fuckin’ talk. Let’s see who’s gonna fuckin’ run this show once and for all! Attack!”\n\nCharley and his midgets begin the assault, and the other two sides follow suit. The fighting is furious and brutal. All you do is crawl away and try to hide under a trailer and hope Randal wins, which he looks like he’s doing.\n\nRandal has the upper hand in every way, he has numerical superiority for one thing, and the other thing is he’s casting actual magic spells. A couple of bolts of lightning fry Ajax and Charley. Another spell strikes down Atlas. All looks good for Randal…until Pervus and his clown crew show up.\n\nWhen you first see them, they look like they’ve already been in a fight. They’re walking in a shambling motion and have wounds on them. When they get closer those wounds look like mortal one. In fact they are.\n\nPervus and the clowns are no longer among the living.\n\nIt takes awhile for anyone else to recognize this. Randal just thinks he’s got more allies until they start biting other Normals (as well as some remaining Midgets and Freaks). Upon seeing this, he tries to cast another spell to destroy them, but is stopped when one of the previously dead bodies on the ground rises up and bites his leg. When he cries out, he sees another familiar face. Madam Orbec, who while dead, looks obviously displeased by the theft of her book.\n\n“I TOLD YOU NOT TO USE THIS BOOK! NOW SUFFER ALONG WITH THE REST OF US!” she shouts and bites a chunk of Randal’s throat out. He falls to the ground to be consumed by more of the dead and the book goes flying out of his hand.\n\nAll of the bodies have risen now. They’re attacking everyone living, you take this as your moment to escape, when you scramble from under the trailer you feel a very strong grip tighten around your shoulder. You look up and see the Ring Master.\n\n“My poor sad Geek. I told you that you would learn to regret your decision to betray me. I have to thank you though, while my Carnival may be no more, perhaps it was time for a change, and with this book (The Ring Master shows you the black book that Randal lost) I think I can make a lot of them.”\n\nYou try to struggle, but its no use. The Ring Master has an unnaturally strong grip on you. He walks directly towards the zombie horde, dragging you along.\n\n“Why?! Why aren’t they attacking you?” is the last thing you cry out.\n“Silly Geek, haven’t you at least figured that one out by now? Zombies don’t attack other undead.”\n\nWith a sharp fang protruding in a grinning smile at you, the Ring Master hurls you to the zombies, who eat you alive.\n","page 65":"As you attempt to remove your foot the clown’s grip tightens, and then he wakes up completely.\n\n“What the…Hey fellas! Look what we got here! It’s the Geek! Let’s fuck the shit out of his ass and make him our permanent fuck toy!”\n\nThe clowns suddenly all get up from their drunken slumber and surround you, there is no escape. The horrors that are unleashed upon you that day are best left unmentioned, but you never leave that tent ever again. You are no longer known as a Geek anymore, you are something much worse…\n\nYou are now the GIMP.\n","page 24":"“Look, I just need your help to ste…I mean borrow something! I heard you were good at borrowing things, so…”\n“Go steal it yourself Geek! I’m not your personal thief! And it’s time for you to fucking go!”\n“Listen! It’s…”\n\nAs you aggressively begin to step inside the trailer, you suddenly hear some hissing and a couple snakes appear by Salina’s foot. Before you have time to react, both of them dart their heads at your legs, giving you a bite.\n\nYou fall back on the ground, as the poison begins to take effect. First you feel paralysis set in then your organs shut down completely.\n\n“Hey, somebody come pick up this Geek! He’s gonna smell even worse while dead!” is the last thing you hear Salina shout.\n","page 68":"A dark moonlit night.\n\nCharley confronts the Ring Master with his army of midgets behind him as well as Ajax. The Ring Master has Atlas, and looks around for his usual allies, the Freaks, but they’re nowhere around. The Normals seem to be staying out of the fight for the most part, but chances are some of them will take one side or the other.\n\n“Your time has come Ring Master! No longer will you exploit us! I’m taking over!”\n“And you all feel this way? You’d rather follow this criminal who’ll be corrupt? You really think he’s doing this out of some noble moral code? Obviously you must be blind if you don’t see that rule by this degenerate will be worse than anything you THINK I’m doing…but I leave it up to you…”\n“It won’t work Ringy, I got more in common with my people than you do! Blood is thicker, and yours is going to run everywhere if you don’t peaceably leave…I’m giving you this one chance you pale she-male.”\n“Not likely, I have my own friends as you know.”\n\nThe Ring Master whistles and you arrive with all the Freaks behind you. He looks surprised to see you.\n\n“Geek?”\n“Sorry, Ring Master, but we made a better deal.” You say and the Freaks advance.\n“NO! Atlas, it’s just me and you now!”\n\nThe battle ensues, though it’s not really a battle. A few of the normals side with the Ring Master, but sensing Charley’s got the winning hand most of them either just stay out of it or directly side with him. The only thing that makes the battle last longer is the fact that Pervus and his clowns side with the Ring Master as they still were mad about the Pinheads embarrassing them at show time. Atlas and Ajax lock horns, and while Atlas kills Ajax in the struggle, he is easily taken down by the midgets afterwards. Pervus and the clowns do some damage, but likewise they too are taken down.\n\nOn the side lines watching, the bloodshed is too much for Randal and he leaves during the battle which has forever destroying his love of the carnival. Sasha leaves with him seeing that Ajax is no longer alive to hold power over her.\n\nFinally in the last moments Charley laughs as he stands over the Ring Master’s body which is now lifeless with Charley’s sharp stick through its heart. Meanwhile you were hiding during all this, but Charley calls you out.\n\n“Hey Geek! Come out you fuckin’ coward! We won! Come out, you ain’t gotta worry about Ajax anymore his goddamn neck is twisted all the way around, damn shame.”\n“…I’m here Charley.”\n“Good, unzip the Ring Master’s pants.”\n“What?”\n“Unzip the Ring Master’s pants, I wanna see what the hell he or she was packing. I had a bet going with Ajax and while I’m just gonna take everything from his trailer anyway, I still wanna see if I would’ve won fairly.”\n\nYou’re a little hesitant, but your crouch over the body and start unzipping the Ring Master’s pants. A crowd begins to form around you. Normal, Midget and Freak alike.\n\n“Come on come Geek, we ain’t got all fuckin’ night.” Charley says while kicking you in the ribs.\n\nYou pull down the underwear…\n\n“EEEEEEEEEEEWWWWWWWWW!” the crowd shouts in unison.\n“Holy shit!” you say falling back.\n“Ha ha, I knew it!” Charley chuckles before continuing.\n\n“Alright you lot, I want all these bodies cleaned up and disposed of before we head out to the next town, and Salina I want YOU in my new trailer to help me celebrate this glorious victory!”\n\nAnd so begins the reign of Charley the Ringmaster. Under his guidance midgets run everything and the Carnival doesn’t so much resemble a Carnival as it resembles a mobile grifting ring. While regular carnival activities still abound, they’re more of a cover than anything. In time, most of the high maintenance acts are done away with and eventually only thing that stays completely the same is the freak show, just to upkeep the front for what’s really going on. The Pinheads get their own special attraction since they take up the clown vacancy.\n\nYou do somewhat better under the new management. You still do your act as it’s still a big draw; you get lumped in with the Freak Show. You don’t need to put up with Ajax’s abuse anymore so fearing for your life isn’t a factor. (Though the Pinheads still verbally warn you every now and then to ensure your secrecy) Charley uses you as a gopher, so you’re actually making money now (If little). He still kicks you around for his amusement, and is prone to dump a bucket of piss in your face to wake you up, but it’s better than what a Geek like you could’ve hoped for.\n","page 25":"Being pitiful has always been something you’ve been good at, sometimes it even works to your advantage. You collapse on the little piece of stairs you’re standing on and start pleading.\n\n“Please Salina you gotta help me! (sob) I don’t have anyone else to turn to! I need to sneak in Madam Orbec’s tent and get a book from without her knowing (sob) or I’m gonna die! (sob)”\n\nSalina doesn’t completely understand what the hell you’re babbling about, but she just wants you to leave and stop stinking up the place. Salina goes back inside and grabs a bottle and dumps the entire contents on you. The shit burns like hell on the sores you have on your skin. You roll off the stairs and on to the ground in irritated pain.\n\n“I dunno what the hell you’re on about Geek, but you ain’t sneaking anywhere as long as you smell the way you do. I just dumped a strong perfume on you. Normally you’d smell like flowers, but with your disgusting odor all it’s gonna do is cancel out your usual foulness and even then only for a little while giving you time to do whatever it is you have to do. And this is ALL the help you’re getting from me! Now get outta here I got customers coming!” Salina says and then slams her trailer door.\n\nNot exactly what you had in mind, but more help than you expected. You head to Madam Orbec’s tent. When you arrive there’s a distinct air of creepiness about it. You can’t afford to waste too much time so you head around the back of the tent and start trying to pull up so you can sneak in and get the book. You only hope she doesn’t happen to be looking in your direction while you’re attempting to do this.\n\nAs luck would have it, she isn’t, in fact when you crawl inside you see you’re right near her bed where she’s fast asleep. Next to the bed you see a small table with a black book on it. That must be it. You grab it.\n\nMadam Orbec then begins to stir. She starts sniffing in her sleep. The perfume must be wearing off!\n","page 28":"You figure you don’t want anyone else seeing you run out of her tent with the book or else they’ll only rat you out later. You lift up the tent and try to crawl back out. You waste too much time though; she wakes up when you’re halfway through. She’s not happy!\n\n“GEEK! YOU DARE STEAL FROM ME! I CALL UPON THE SPIRITS TO CURSE YOU TO RESEMBLE THE LOWLY WORM YOU ARE!”\n\nYou don’t think too much of those words at first, until you get fully out of the tent and find that you can’t stand up to run anymore. You look behind yourself and to your horror you see that your legs have fused together into one fleshy mass. Soon the rest of you begins to transform. You gradually start to shrink as you try to crawl away in a hopeless attempt to escape your fate.\n\nWhen you’ve fully transformed, Madam Orbec finally arrives to retrieve her book and sees you squirming around in the grass. She laughs and remarks how leaving you in that state is what you really deserve.\n\nBut she decides to show mercy for your plight by stepping on you and putting you out of your misery.\n","page 27":"No time to mess around lifting and crawling you just need to get out of here! You run out of the tent and don’t stop until you reach Randal who wonders why you’re breathing so hard.\n\nWhen you get back to Randal he wonder’s why the hell you’re so worked up.\n\n“(Pant) I got the book.”\n“Phew! Well don’t breathe all over me, just gimme the thing! Excellent. I’ll study what I can tonight before show time and then afterwards we’ll see who the new master is! And what’s wrong with you Geek? Why are breathing so heavy and looking around…you didn’t let Madam Orbec see you borrow this did you?!”\n“No, not at all. I’m just winded from trying to get out there without her seeing me!”\n“Well you better make yourself scarce until showtime anyway. I’m sure you wouldn’t want to run into the Ring Master before hand. Relax, I will keep my end of the bargain. Now go.”\n\nYou leave and linger around the edges of the Carnival, staying out of sight until show time. You just hope Randal does live up to his bargain and manages to take control, because if he doesn’t, you’re going to be in a world of shit with the Ring Master.\n\nEventually you wander back to the Carnival around show time. Everything goes as normal with a few exceptions. The Ring Master looks pre-occupied, and Randal’s act seems to be a lot more spectacular than usual.\n","page 60":"“So one time…”\n“Geek will you shut the fuck up? Shit, I can smell your rotten breath from here!” one of the Pinheads shouts, you’re absolutely stunned.\n\n“You…you can talk?!”\n\nThe lead Pinhead gives a dirty look to the one who shouted at you, and then looks back.\n\n“Yeah we can talk, and now YOU know we can thanks to big mouth over here! Thanks a lot Frank!”\n“Well he was getting on my nerves George!”\n“But…if you can talk, why do you act like idiots?”\n“Why do you eat all that nasty shit? For the money of course or in your case for the booze. You think we’d make as much if we didn’t act like little retarded children? We’re fucking ugly just like any freak, but by acting like simple minded children we come across as charming and harmless…cute even. Which makes us rube favorites. Nobody knows the truth, not even the other freaks, nobody except you…I guess we’ll have to kill you.”\n“Hold on wait wait! Can’t we come to an agreement here? I mean I’m not going to tell anyone! And even if I did, who’d believe me?”\n“Can’t take that chance.”\n\nYou suddenly crumple to the ground and beg pathetically for your life at the feet of the George. He gives you a disdainful squinted expression.\n\n“Get off my feet Geek! Sheesh, you’re pathetic! We probably wouldn’t have killed you, maybe just cut out your tongue.”\n“So you’ll let me live?”\n“Yeah, but you’re still not getting off that easy. You gotta do something for us to make us trust you.”\n“What?”\n“Go to the clown tent and destroy all their sex toys.”\n“WHAT?!”\n“Shhhh! Stop fucking drawing attention!”\n“You want me to go to the clown tent? But nobody in their right mind goes in there!”\n“Duh, that’s why we’re sending you.”\n“Why do you want me to do this?”\n“Because those pedophile ass clowns are direct competition, they always draw all the children away from our act, and we’d like to get back at them in some way. It’ll really piss off Pervus when he sees his cock ring in pieces heh heh heh.”\n“I don’t wanna touch those things! Who knows where they’ve been!”\n“You’re kidding me right? This coming from the guy who eats cow ass for his grand finale. Look they’re mostly all in a big wooden box anyway so just set fire to the box or something. It’s not like you have a choice in this matter.”\n“I dunno, I think death might be preferable to getting caught by the clowns.”\n“(Sigh) Alright, I know you’re working for Charley you wanted to convince the Freaks to side with him in this ensuing struggle coming up…don’t ask us how we know, we just do. And it’s mainly because since much like you we hear a lot more because we’re considers idiots and non-threatening. If you do this, we’ll convince the Freaks to side with Charley, again don’t ask us how…we have our ways…do we have a deal now?”\n\nKnowing this is probably your best shot and if the Pinheads don’t kill you, Charley certainly will for your failure to get people to side with him, so you agree.\n\n“Good, return when you’ve completed the job, we’ll be playing around in this area until show time.”\n\nYou leave the Pinheads who resume their pretend act of being morons while you resume your completely real act of being a moron for getting yourself into this mess. You don’t know how you’re going to do this.\n\nAs you approach the tent, you notice how quiet it is. Normally loud insane rowdy laughter can be heard from within, but it’s silent which almost makes it scarier. You wonder if you shouldn’t just set the WHOLE tent on fire. In some ways you’d be doing the world a favor. You do wonder about how the Ring Master can just let such evil go unchecked.\n","page 62":"You make up your mind and decide to save yourself some risk and set the whole tent on fire. You head back the Charley’s still, which luckily is unattended right now. You steal three bottles of his stuff and his Zippo lighter that he foolishly left near the volatile concoction. Before you leave you take another drink to calm your nerves.\n\nYou return to the clown tent and start dowsing it with Charley’s booze trying not to be noticed and hopping no clown suddenly comes out of the tent. You continue to do this until you encircle the entire tent and run out of booze. You light it up…\n\nThe entire tent goes up like tinder box, you didn’t expect it to go up so fast, and you’re a little singed yourself, as you fall backwards. You scramble away as other Carneys notice what’s happened and start calling for water. The clowns soon come running out screaming horribly while burning alive. Their faces literally melting off with all the makeup they were wearing.\n\nYou are about to go see the Pinheads, but the carnival is in too much chaos, as your act of arson has had an unintended side effect. The burning clowns end up running hither, thither and yon, setting everything else on fire as well in their torment. Soon the entire Carnival is up in flames and its every man, woman, and freak for itself.\n\nHaving no other options, you keep running until you reach the nearest town. You spend a couple days just bumming around the town and sleeping in the park until one night…\n\n“Hello, Geek.” You hear melodic voice say. Before you can reply a huge foot steps on your throat. It’s Atlas and the Ring Master.\n“It wasn’t enough that you attempted to betray me, but you had to destroy my beloved Carnival. The Carnival that brought so much joy to others and gave jobs to the outcasts. Outcasts like you…well do you have anything to say?”\n\nAtlas relaxes his foot on your throat for just a bit for you to answer.\n\n“It…it…was an accident…”\n“Hmm, an accident. Yes I made an accident too, time to correct it. Atlas.”\n\n“N…”\n\nBefore you can get out the “o” Atlas brings his massive foot down on your throat utterly destroying your windpipe, your larynx, and your life.\n","page 61":"Since the Freaks are firmly behind the Ring Master, you might as well talk to the Normals, the problem is you have to talk to someone with some pull with most of them, and Remarkable Randal is the only one who has that in any great capacity and getting him to side with Charley is out of the question.\n\nAt least directly.\n\nIt’s possible you could talk with Madam Orbec and get her to convince Randal to change his stance since he follows anything she says; also she’s less likely to throw something at your head when she sees you approach.\n\nYou head towards Madam Orbec’s tent, which has an air of creepiness surrounding it. You enter the tent and immediately get your usual welcome.\n\n“Geek! Begone from this place! Do not assault the spirits with your foulness!” Madam Orbec commands.\n“They’re dead; I don’t really see how my smell can affect them.”\n“It’s not your odor that offends the spirits, it’s your aura! We do not want you in our presence! Away with you, we have no wish to be involved in your underhanded dealings!”\n“How do you know what I’m here for?”\n“Fool! I am Madam Orbec! I see all that the spirits see! You’re working with that miscreant Charley in an attempt to take over the Carnival and you’re hoping to influence me so that I may in turn influence Randal to convince the normals to side with him.”\n“Well since you know…Madam?”\n\nMadam Orbec begins to clutch her head and writhe on the floor talking to herself.\n\n“Yes. But no! Maybe? Perhaps. If he can pull it off. Is he capable? I doubt it. We must try. Whatever, just get him out of here!”\n\nMadam Orbec suddenly stops and slowly sits up.\n\n“You need to expose those of the small craniums.”\n“What?”\n“The Pinheads. You need to show their true nature to the public.”\n“True nature? What’re you talking about? Why”\n“That is all the spirits have told me, their reasons are not to be questioned, but I have been advised to help you in your treacherous endeavor if you accomplish this objective. Now leave and do not return unless you are successful.”\n\nAt this point Madam Orbec seems to go into a cationic trance. You take your opportunity to leave and ponder what the hell her cryptic ramblings were about. All you know for certain is that you have to do something to the Pinheads. Expose their true nature, though you can’t imagine what that could be.\n\nYou could try spying on them and see what you can find out, or maybe a more direct approach would work.\n","page 20":"“Hold on Pervus. I got a better idea.” You say stopping Pervus from entering.\n“Geek, that’s the second time you’ve interrupted my dick from finding happiness. If you do it again, it’s gonna find happiness in YOU!”\n“Um…well look, I was just thinking that it would be better if you got the book, I dunno if I’m up for it. I’ll distract Madam Orbec instead.”\n“The ONLY reason why I agreed to this, was because of the possibility of getting some Granny pussy, and now you’re fuckin’ sayin’ no? Fuck you Geek! I’m doin’ this shit now!”\n\nPervus knocks you to the ground and enters Madam Orbec’s tent. You begin to hear some weird noises. Some of it sounds like screams, but not of the human kind. You sit in shock unsure of what to do, and then soon Pervus comes back out with the black book. There’s blood all over his clown costume.\n\n“I’m not sure what the fuck you wanted this for, but you ain’t gettin’ it now Geek. See ya at show time.”\n\nYou don’t want to check, but you do anyway. You go inside Madam Orbec’s tent and see a gruesome sight. Something else is here though. You feel a force hit you several times. You see sheer depravity in your mind! It overwhelms you, you begin to cry, and laugh at the same time. You immediately run back out to hide somewhere utterly mad from what you saw.\n\nYou run off to the nearest town hoping nobody comes looking for you, and nobody does due to what happens at show time…\n\nWith the black book in his possession, Pervus goes back to his own tent and begins reading it, wondering what you wanted it for. Soon he begins to discover the power contained inside. The reason why Madam Orbec never wanted Randal to use it is due to the evil contained within and didn’t want that evil unleashed lest it destroy him. Of course Pervus isn’t a choir boy like Randal, he embraces the evil and the evil embraces him. It’s a match made in hell.\n\nWhen show time comes around he and his whole degenerate clown crew begin chanting from the book unleashing horrible powers. Many in the audience are killed as they attempt to escape, the Ring Master attempts to restore order, but with one utterance by Pervus, a burning black light annihilates her. The next blast destroys Atlas.\n\nRandle attempts some sort of cheap magic defense, but he’s powerless against the sheer destruction Pervus is wreaking. Eventually some of the clowns surround and capture him and do unspeakable things to him until he’s literally an empty husk.\n\nCharley and Ajax attempt to escape, but are run down and torn apart by strange shadow creatures that were summoned up.\n\nThe ones that manage to survive that terrible night become part of this twisted new Carnival that now travels the night seeking to pull more victims into its dreaded den of wickedness and suck their souls dry, with Pervus as the new crazed ring master.\n\nAnd while you weren’t there for the event, you SAW it all, in your mind back at Madam Orbec’s tent. One last curse by the spirits for your involvement in the death of Madam Orbec.\n\nYou are doomed to forever see the on going horrors committed by Pervus’ Carnival, and yet can do nothing about it. You’re eventually picked up off the street while during one of your screaming jags and thrown into a mental asylum, straight jacked and doped up with morphine.\n\nBut it doesn’t help.\n\nYou still see.\n\nAnd you can’t stop the screaming.\n","page 63":"You cautiously enter the tent, fearing for your ass (Literally).\n\nAs it turns out, all the clowns are all passed out from the night before. Looks like it was necrophilia this time, judging from the rotting corpses lying on the floor. In fact if you weren’t so rank yourself, the smell might actually bother you. Pervus doesn’t seem to be here though.\n\nLiquor bottles are everywhere; in fact you could probably grab one and dowse the box (Which is open and crammed full of whips, shackles and “insertion objects”) then take one of the Zippos lying on a table and light the box up easy.\n\nThis is going to be simpler than you…\n\nSuddenly you feel a hand grab around your foot.\n\n“Hmm, yeah come here baby…”\n\nBefore you can do anything one of the clowns has curled his face up next to your foot and began sucking your BIG TOE.\n\nThis is REALLY disgusting, even for you. The only good thing is the clown seems to still be somewhat asleep.\n","page 0":"Geek:\n\n1. A person regarded as foolish or clumsy.\n\n2. A person who is single-minded or accomplished in scientific or technical pursuits, but is felt to be socially inept.\n\n3. A carnival performer whose show consists of bizarre and disgusting acts.\n\n\nYour breath stinks from the foul things you’ve been eating and the rest of you stinks from not bathing in who knows when.\n\nYour head hurts from the cheap moonshine you’ve been getting “paid” in.\n\nRubes often throw stuff at you and spit on you.\n\nMost of the other Carnies find you utterly repulsive and avoid you, a couple of them just abuse you for various reasons.\n\nOn a good day, only the Pinheads come to your cell and taunt you with their gibbering laughs and mongoloid chatter.\n\nYou have absolutely no worth as a human being, you get no respect from others, and you have no respect for yourself…and why should you? You are the lowest form of life in Carney society. You’re not a real performer; what you do can’t really be considered a skill. You’re not even a real freak. At least a deformed freak can evoke an emotion of horror, or pity, or even admiration for overcoming their condition. You weren’t born “this way”. You chose to do this. All you evoke is disgust and revulsion. At best you’re laughed at and not in the good way like those pervert clowns you work with.\n\nFuck all that “Wildman of Borneo” shit that the Ringmaster tries to tell all the rubes. You’re little more than a bum with a “job”. A degrading job that involves you to debase yourself, all for the amusement and shock value of others, but hey it keeps a “roof” over your head and you pleasantly drunk enough to just barely forget how utterly pathetic your life is.\n\nYou are the GEEK.\n\nYou wake up to a bucket of piss being thrown in your face. Not the first time and certainly won’t be the last.\n\n“You like the taste of that Geek? Get up Geek! The Ring Master wants to see you!” Charley orders then he throws the empty bucket at your head. The comical sound it makes hitting your skull and the pain it causes makes Charley laugh. Then he jabs you a couple times with his pointed stick.\n\nMidgets can be so cruel…\n"}