{"page 123":"I enter the holding cells. The guard\u0027s armor has virtually been removed, and the lights are completely off. I forcibly wake him up, and as he looks around, I make sure he sees my green glowing eyes.\n\n\"You work for the Alliance?\"\n\nThe man says nothing.\n\n\"You work for the people that justify the killing and incarceration of the innocent, with fear?\"\n\nThe man still says nothing, so I channel myself into him and induce pain, until he can\u0027t prevent himself from screaming. His scream however soon turns into laughter.\n\n\"You find something funny?\"\n\nThe man looks at me again and says \"this place, this whole place, along with the monsters that dare refer to themselves as people will be razed to the ground.\"\n\n\"Killing mutants is against the law here.\"\n\n\"You think that\u0027ll hold after what you done? You\u0027re constantly showing the world what a danger you freaks are. All this conflict is doing is proving us wrong.\"\n\n\"We\u0027re fighting back. We\u0027re defending ourselves.\"\n\n\"And what, the best defense is a good offense? Do you know how many people you\u0027ve killed?\"\n\n\"Do you?\"\n\n\"Those things we\u0027ve killed aren\u0027t people.\"\n\n\"At least they\u0027re not monstrous murderers like you.\"\n\n\"No? Do you even know what kind of monsters they are?\"\n\n\"You mean like the sort of people that give someone who\u0027s done nothing but give to this society, the option to fight back or die, and then punish her for fighting back? Those kinds of monsters???\"\n\n\"If one of ours killed someone, then that someone deserved it. You all deserve what\u0027s coming to you.\"\n\n\"And what\u0027s coming to us?\"\n\nThe man smiles at me and says \"they\u0027re coming. All of them. Paladin too.\"\n\n\"Impossible. They have no idea where we are.\"\n\n\"They do now. You were supposed to take me captive. You were supposed to take me to this base, so Paladin could track the transmitter that\u0027s been planted into my body.\"\n\n\"That\u0027s...no. I would have detected it.\"\n\n\"You can\u0027t detect all kinds of frequencies. We used our time while you were imprisoned to study you. We know how you tick.\"\n\nI then hear the sound of a loud explosion coming from deeper inside the base.\n","page 122":"I enter the holding cells. The guard\u0027s armor has virtually been removed, and the lights are completely off. I forcibly wake him up, and as he looks around, I make sure he sees my green glowing eyes.\n\n\"You work for the Alliance?\"\n\nThe man says nothing.\n\n\"You work for the people that justify the killing and incarceration of the innocent, with fear?\"\n\nThe man still says nothing, so I channel myself into him and induce pain, until he can\u0027t prevent himself from screaming. His scream however soon turns into laughter.\n\n\"You find something funny?\"\n\nThe man looks at me again and says \"this place, this whole place, along with the monsters that dare refer to themselves as people will be razed to the ground.\"\n\n\"Killing mutants is against the law here.\"\n\n\"You think that\u0027ll hold after what you done? You\u0027re constantly showing the world what a danger you freaks are. All this conflict is doing is proving us wrong.\"\n\n\"We\u0027re fighting back. We\u0027re defending ourselves.\"\n\n\"And what, the best defense is a good offense? Do you know how many people you\u0027ve killed?\"\n\n\"Do you?\"\n\n\"Those things we\u0027ve killed aren\u0027t people.\"\n\n\"At least they\u0027re not monstrous murderers like you.\"\n\n\"No? Do you even know what kind of monsters they are?\"\n\n\"You mean like the sort of people that give someone who\u0027s done nothing but give to this society, the option to fight back or die, and then punish her for fighting back? Those kinds of monsters???\"\n\n\"If one of ours killed someone, then that someone deserved it. You all deserve what\u0027s coming to you.\"\n\n\"And what\u0027s coming to us?\"\n\nThe man smiles at me and says \"they\u0027re coming. All of them. Paladin too.\"\n\n\"Impossible. They have no idea where we are.\"\n\n\"They do now. You were supposed to take me captive. You were supposed to take me to this base, so Paladin could track the transmitter that\u0027s been planted into my body.\"\n\n\"That\u0027s...no. I would have detected it.\"\n\n\"You can\u0027t detect all kinds of frequencies. We used our time while you were imprisoned to study you. We know how you tick.\"\n\nI then hear the sound of a loud explosion coming from deeper inside the base.\n","page 125":"I grab a random table from deeper within the base and put it at close to Paladin without the light emitting from his armor interfering with me. The cannon hits the table, and the table absorbs the baryons instead of me and so it is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n","page 124":"I channel myself to where the explosions are coming from, and I see Paladin enter the base along with several armored troopers.\n\nThe other Imperfects quickly arrive to see what\u0027s going on.\n\n\"All of you. I am required by law to take you in. Surrender, or I will be forced to put you down\" he says.\n\n\"Required by law, huh? Just like we\u0027re required by law to crawl into a hole and die?\" Grove says.\n\n\"I don\u0027t write the law. That doesn\u0027t give me the right to ignore them.\"\n\n\"The moment the law take away people\u0027s freedom regardless of whether they deserve it or not, something has gone wrong.\"\n\n\"Don\u0027t turn this into a conflict. I don\u0027t want to have to hurt any of you.\"\n\n\"Like how you didn\u0027t want to hurt Eve? She trusted you, you know?\"\n\nPaladin pauses for a bit, but then says \"she gave me no choice. Don\u0027t do the same mistake.\"\n\n\"Like defend our rights to be human beings? That mistake?\"\n\nPaladin aims the cannon grafted to his arm at Grove and says \"last chance. Surrender now!\"\n\nBrute yells and leaps at Paladin. Paladin fires the baryonic cannon at him, and Brute momentarily turns into a black hole before vanishing completely. Due to Brute\u0027s leading charge, the rest of the Imperfects attack Paladin and the rest of his troops. Paladin blasts an Imperfect off himself and then aims his cannon at me.\n","page 127":"I throw a random table at him, which is hit by the cannon instead of me. The table absorbs the baryons and is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n\n \n","page 126":"I try to move myself out of his firing range, but even so, his attack seems to hit me. My entire body absorbs the baryons fires from his cannon, forcibly materializes, shrinks to human size and collapses onto the floor.\n\nPaladin approaches me and says \"you know, the great thing about shooting a target that\u0027s everywhere, is that you can\u0027t miss.\"\n\nHe then steps towards me and fires. With me forcibly materialized, the attack kills me just as much as anyone else.\n","page 129":"I grab a random table from deeper within the base and put it at close to Paladin without the light emitting from his armor interfering with me. The cannon hits the table, and the table absorbs the baryons instead of me and so it is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n","page 77":"Obviously, they\u0027re not going to change this law during the night, but I have to make sure to everyone who has a say in it that knows that laws issuing the deaths of innocent people will be met with most severely. I am not going to force them to change it, just notify them of the consequences. However, as I make my way there, I encounter a barrier, of some sort, a barrier that is not constructed of light. I try removing baryons from my body, but even so, I am unable to phase through it. As I touch the barrier, wondering what it is, I feel that it is making frequent movements. A pair of green eyes then appear in the barrier and they stare at me. This barrier, it is a person. A person like me.\n\n\"Who are you?\" I ask the other baryonic individual, but he doesn\u0027t respond. Just keeps twitching and looking at me. Soon, He extends around me and we are both enveloped in an impenetrable darkness, darkness that I seem unable to connect with, even though I can\u0027t feel the barrier even more. I then feel my mass decreasing, like everything about me is slowly vanishing, and then there is nothing.\n","page 76":"Obviously, they\u0027re not going to change this law during the night, but I have to make sure to everyone who has a say in it that knows that laws issuing the deaths of innocent people will be met with most severely. I am not going to force them to change it, just notify them of the consequences. However, as I make my way there, I encounter a barrier, of some sort, a barrier that is not constructed of light. I try removing baryons from my body, but even so, I am unable to phase through it. As I touch the barrier, wondering what it is, I feel that it is making frequent movements. A pair of green eyes then appear in the barrier and they stare at me. This barrier, it is a person. A person like me.\n\n\"Who are you?\" I ask the other baryonic individual, but he doesn\u0027t respond. Just keeps twitching and looking at me. Soon, He extends around me and we are both enveloped in an impenetrable darkness, darkness that I seem unable to connect with, even though I can\u0027t feel the barrier even more. I then feel my mass decreasing, like everything about me is slowly vanishing, and then there is nothing.\n","page 79":"I focus on the outside, anywhere else. I try picturing several places in my mind, but I don\u0027t vanish and reappear there like the other baryonic individual did. I open my eyes, and I\u0027m still in the vat. If I can teleport, then there must be a reason behind it.  Until I understand what it is about my physique that allows me to teleport, I can\u0027t do it.\n","page 78":"I find myself encased in the same glass cage the Imperfects stored me in. No, not the same. It has the same design, but the whole place looks and feels different.\n\nWhoever that other dark-matter individual was must have put me here. But who made him? There was no data of a second subject at any of Thorne\u0027s computers, and his people were the first ones that created something like me. His twitching also indicated that he was a failed version of me, or an improved one. I have never been able to teleport, but the fact that I am in an area that is not connected to any shadow indicates that teleportation is exactly what he did. Maybe the Novarran government created another me, to combat me, and gave him additional abilities. No, creating me takes years, and I only became a threat to them last night. There\u0027s no way they\u0027d be able to create someone equal to me in that amount of time.\n\nThen that can only mean one thing, he\u0027s not working for the Novarran government. But then, was he there by coincidence? Did he thwart me from fighting against this new bill without supporting it? No, him being there at that moment to fight me can\u0027t be a coincidence. He must be an independant vigilante that supports believes supporting the law through anything is the right thing to do. But if so, if he wasn\u0027t developed to combat me, then we must be equal. Perhaps teleportation is just something I haven\u0027t learned yet. Well, if it could enable me to escape from here, it would be worth a shot.\n","page 71":"Satisfied that Overlord has met a deserving fate, I leave the facility. Now it\u0027s time to turn back to the matter at hand after this little side-track. Still, I won\u0027t have Leksiah at my side anymore. She deserved a better fate than she got. I failed her, I failed to provde her with what she deserved. At least her death has been avenged.\n","page 70":"\"You did the same thing that this monster did. You are just as bad as he was\" I say as I crush their heads.\n","page 73":"\"Alright, so you\u0027ve been in Novarra. What should my next move be.\"\n\n\"Our next move. I\u0027m going with you, you know. Wherever you go, I\u0027ll be there to help\" Leksiah says.\n\nI give a quick smile, although she probably can\u0027t see it. \"Then what should out  next move be?\"\n\n\"Well...err...the Novarran government is pushing a new bill. Mutants are no longer to be incarcerated. They are to be exterminated.\"\n\n\"What??? Why didn\u0027t you mention this earlier?\"\n\n\"I...ehh...I knew you wouldn\u0027t even consider taking out the brain enhancing facility if you knew about this.\"\n\nI don\u0027t have time to be pissed at her right now. I just have to make sure I put an end to this.\n","page 72":"Satisfied that Overlord has met a deserving fate, I leave the facility. Now it\u0027s time to turn back to the matter at hand after this little side-track. Still, I won\u0027t have Leksiah at my side anymore. She deserved a better fate than she got. I failed her, I failed to provde her with what she deserved. At least her death has been avenged.\n","page 75":"\"Alright, so you\u0027ve been in Novarra. What should my next move be.\"\n\n\"Our next move. I\u0027m going with you, you know. Wherever you go, I\u0027ll be there to help\" Leksiah says.\n\nI give a quick smile, although she probably can\u0027t see it. \"Then what should out  next move be?\"\n\n\"Well...err...the Novarran government is pushing a new bill. Mutants are no longer to be incarcerated. They are to be exterminated.\"\n\n\"What??? Why didn\u0027t you mention this earlier?\"\n\n\"I...ehh...I knew you wouldn\u0027t even consider taking out the brain enhancing facility if you knew about this.\"\n\nI don\u0027t have time to be pissed at her right now. I just have to make sure I put an end to this.\n","page 74":"I yank a Novarran newspaper from the streets of Endrun and read it. I am both disgusted and angered by what I see. The Novarran government is altering the anti-mutant law. They\u0027re not just going to incarcerate them. They\u0027re going to exterminate them.\n","page 130":"I throw a random table at him, which is hit by the cannon instead of me. The table absorbs the baryons and is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n\n \n","page 132":"I channel myself into the floor, and although the light emitting from him renders me unable to manipulate it as perfectly as I otherwise could, I am able to render the floor weaker, causing it to collapse under the weight of his heavy metallic armor. Paladin crashes through the floor, and lands in the power area. He fires his cannon upwards however, and as he hits the floor, a portion of it vanishes in a black hole, causing the mutants on it to get sucked in as well. Seeins as how I\u0027m going to have to defeat him, and save my allies from him, I go down to the power area to face him.\n\n \n","page 131":"I channel myself into the roof above Paladin, which is far above him enough not to be significantly illuminated by the light emitting from him. The ceiling comes crashing down at him, but he fires his cannon at it and it is vaporized. He then charges his cannon up again and approaches me.\n\n \n","page 112":"\"We\u0027re trying to free everyone, and that\u0027s exactly what we\u0027ll do.\"\n\n\"Alright. We\u0027ll travel in groups consisting of no fewer than two members. Haste, Claymore, you\u0027ll be travelling with Baryon. He\u0027ll need to be protected from the light.\n\n\"Gotcha\" Haste says and looks at Claymore.\n","page 233":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 111":"Grove assembles a strike team and I transport them to Zuchthaus prison. The team consists of me, Grove, Brute, Haste, Claymore, Carrie, the woman with the minor case of Muscle\u0027s mutation, and  reptile-man that looks a lot like Scales, although he is called Reptile.\n\n\"Why aren\u0027t we just taking an army? We\u0027ve got thousands of mutants here.\"\n\n\"It\u0027d be too obvious. Besides, if the mission is blown, we won\u0027t loose too many people. The main purpose of the rest of us is to keep you covered. You\u0027re the Liberator, we\u0027re just here to keep the bad guys from taking advantage of your weaknesses.\"\n\n\"Thanks. I don\u0027t feel expendable or anything\" Haste says.\n\nI transport all of us to Zuchthaus prison. I know exactly where it is due to my time as an Imperfect, the original Imperfects that is. The whole thing is larger now, and much more illuminated of course. The Alliance has been fighting a tough fight against me it seems, so everything they make that is to take part in this war has to be able to counteract me in some way.\n\nHaste superspeeds in front of us, taking out the lights so that I can keep the rest of us concealed in the shadows. The place is gigantic, much bigger that Zuchthaus prison was eight years ago, when it was a normal prison. I can feel electricity surging through the cells, and the weapons there are powerful enough to hurt even Brute. Luckily, I am able to destroy them before they can hurt any one of us, and they\u0027re not fast enough to hit Haste. Which is surprising. Haste has surely been an Imperfect since this war began. It\u0027s strange they haven\u0027t developed anything that can defeat him.\n\n\"There\u0027s a lot of area to cover\" Grove says.\n\n\"Should we split up?\"\n\n\"No...I don\u0027t know. Maybe. We\u0027d be able to free a lot more people, wouldn\u0027t we?\"\n\n\"Why can\u0027t we just take our time and move through the entire place?\"\n\n\"Once they know we\u0027re here, they\u0027ll send everything they\u0027ve got to strike us down.\"\n\n\"Like the Paladin?\"\n\n\"Most likely.\"\n\n\"Good. We\u0027ll face him.\"\n\n\"Baryon. He defeated you outside in the middle of the night, while you were more experienced than you are now. There\u0027s no way you\u0027d be able to defeat him down here. No, we\u0027ll have to be gone by the time he shows up.\"\n\nGrove hands all of us some sort of watches, except for me, as that watch won\u0027t be able to dematerialize with me.\n\n\"I\u0027ve set the timer on those watches. As soon as it rings, everybody gets out. Baryon. I am not sure whether we should split up or not. It leaves us in more danger, but at the same time it increases the amount of mutants we can free.\n","page 114":"We return to the base, and the guard is placed in a some sort of holding cell.\n\nAfter putting the guard in the holding cell, Grove leaves the room and approaches me.\n\n\"Is your memory returning to you?\"\n\n\"No. I still remember nothing since that night, two years ago.\"\n\n\"What happened then?\"\n\n\"I saw someone like me, he was twitching, and then I woke up in that vat.\"\n\n\"Twitching? Like you were?\"\n\n\"Were?\"\n\n\"Oh. I guess you don\u0027t remember it. You were twitching more and more before you were captured. You don\u0027t seem to be twitching now though.\"\n\n\"I\u0027m not.\"\n\n\"Oh, well, maybe it was a problem that your body resolved in the solitude of the vat. Anyway, the sooner you interrogate that guard, the better.\"\n","page 235":"I channel myself in front of Futuree Baryon, trying to trick him into thinking that Paladin is going to hit me, where really, I am ready to retreat and have Paladin hit Future Baryon, who is partially directly behind me. I evade the hit, and Future Baryon is hit, however, he grabs me, and the baryons he absorbs seem to circuit into me as well. We both collapse to the floor, but Future Baryon seems to have anticipated this, as he has placed himself where he falls into a crate of some sort, whereas I lie exposed directly before the Paladin. Paladin then grabs around my neck and snaps it, as I am forcibly materialized.\n\n \n","page 113":"\"Maintaining those we have is more important than liberating those that have already been imprisoned. We\u0027ll try to free as many as we can, but we won\u0027t go seperate ways.\"\n\nGrove nods, and we continue making our way down the base, freeing mutants who are locked up in their cells.\n\nWe manage to free up eight of the twenty four cell blocks before the watches beep.\n\n\"We\u0027ve got to get out of here now\" Grove says.\n\n\"But there are so many...\"\n\n\"Carrie, we can\u0027t help them now. Maybe next time. This war isn\u0027t over with yet\" he says as we make our way out. Haste superspeeds us out one by one, but he can\u0027t carry more than one at a time, and he can\u0027t carry Brute either, so I have to carry the rest of the team. We see an unconscious guard outside the prison as we leave.\n\n\"Hold on! What\u0027s that?\" Grove asks. I levitate the guard to him and he says \"he\u0027s unconscious. Who did this? We didn\u0027t do this.\"\n\n\"Must have been some of the mutants we freed.\"\n\nGrove nods and says \"take him back to the base. Baryon, you\u0027re the best interrogator in the world. When he wakes up, you\u0027re going to squeeze the location of their main base out of him.\"\n","page 116":"\"Shall we?\" Haste says and we proceed, using the same system as before, only just with me and him.\n\nWe enter the cell-block we\u0027re supposed to liberate, and see guards there, who notice us as well. They start shooting at us, but theyr bullets seem to reflect light, rendering me unable to deflect them, and so, they pierce through me and through Haste, who did not expect the bullets to pass through me. In anger, I then tear off the floors, convert them into thousand razor sharp spikes and hurl them at the guards, killing them outright.\n\nI am then forced to carry on alone, without Haste, with no one but myself to blame for his death. At least he didn\u0027t die for nothing. I successfully free all of the prisoners in the cell-blocks.\n","page 115":"As soon as we return to the base, Leksiah approaches me and tells me to join her in her room, as she has something she wants to discuss. I follow her and ask \"what is it? What\u0027s going on?\"\n\n\"You asked me to investigate why you were twitching, right? Well, even though you\u0027re not twitching anymore, I continued to check it out anyway, fearing that it might return. Using the sample of you you gave me, I think I\u0027ve been able to analyse what it is.\"\n\n\"Oh? What is it?\"\n\n\"You...how do I put this. You have your own way of aging. Your entire physique is...unstable, and because of that, it is constantly deteriorating.\"\n\n\"Deteriorating?\"\n\n\"Yes. You are slowly becoming more and more unstable. Eventually, you\u0027ll completely unravel. And that\u0027s not all. I tried introducing the sample of you to baryons, which the sample of course absorbed...it deteriorated more while it was absorbing them. Once it had absorbed the baryons, it deteriorated at a normal speed.\"\n\n\"And what does that mean?\"\n\n\"It means that the more you use your powers, the faster you deteriorate. One thing that puzzles me is why you aren\u0027t twitching any more. The twitching was caused by the instability in your body, and it\u0027s impossible for it to just become more stable all of a sudden.\"\n\n\"Well, I can regenerate while in the...\"\n\n\"You\u0027re body can\u0027t create stability. No matter how much of you it regenerates, it\u0027ll always be as unstable.\"\n\n\"Maybe...I don\u0027t know. Maybe this is somehow dependant on my memories?\"\n\n\"No. This is physical, not mental.\"\n\n\"So...what, the Alliance fixed me?\"\n\n\"That\u0027s the only thing that comes to mind. Maybe they...I don\u0027t know, created another you and used memories from the original Baryon, only the memories were copied at that point eight years ago and put into you. If that were the case, then your last memory should be of your memories being copied...unless you were unconscious at the time. What was your last memory eight years ago?\"\n\n\"I encountered another Baryon, that was twitching, and then I woke up in the vat.\"\n\n\"That\u0027s...odd...if he was twitching before you were, then that must mean that he was created before you were created. But there\u0027s no record of a second Baryon.\"\n\n\"I don\u0027t know where he came from. He just showed up, didn\u0027t said anything, and the next thing I remember was being in that vat.\"\n\nThere is a knock on the door then, and Grove enters the room. \"Baryon, the sooner you get information from that guard, the better.\"\n","page 236":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 118":"Except for Haste, everyone makes it out of there alive, and the first thing I see when I exit the prison is Grove, examining an unconscious guard.\n\n\"What happened?\" I ask and approach him.\n\n\"I don\u0027t know. None of our guys did this.\"\n\n\"One of the escaping mutants must have done it.\"\n\nGrove nods and says \"we\u0027ll take him back to the base. Baryon, you can introduce a level of pain far above anyone else in the world. You\u0027ll get him to talk about the location of their main base.\"\n","page 117":"Claymore looks at me. I remember him from when I freed him, eight years ago. I never did find out whether it was true that he took people\u0027s faces, but I guess he\u0027s on my side and that\u0027s good enough for me.\n\n\"Don\u0027t worry about him. He smells a bit but he has a heart of gold. Now, should we continue?\"\n\nI nod and we carry on, using the same technique of Haste taking out the lights and me keeping Claymore, myself and Haste on the occasion that he\u0027s out of lights to destroy and returns to my veil.\n\nWe enter the cell-blocks we\u0027re supposed to free, and see a group of guards, aiming at us. They fire guns that seem specifically created to ignore me, must project light off them or something, and so, I am unable to shield them from it. Claymore leaps on them, and unleashes his brutality on the guards, violently leaving them massacred.\n\nWe then carry on to free all the prisoners in the cell-blocks.\n","page 88":"I channel a portion of myself into her, stimulating her entire body and causing her brain to release endorphines. I don\u0027t imagine kissing me is very comfortable, I must feel very dry, but for me, the feeling is both exotic and wonderful at the same time. I\u0027ve always been curious about how this would feel, I\u0027ve always wanted to experience it. I can\u0027t physically have sex, but this is close enough for me.\n\nAfter we\u0027re done, Leksiah looks at me, smiles and says \"are you sure you\u0027ve lost your memory?\"\n\n\"We\u0027ve done this before?\"\n\n\"Lots of times. You should go back to the others now. You\u0027re the leader of the base, and the rest of the team need you\" she says and I leave the room, where Brute, Grove and Haste are talking to some other mutants. They look at me and Grove says \"good. You\u0027re done catching up I take it.\"\n","page 87":"\"Show me the base\" I say to Grove, and he nods.\n\n\"Well, it\u0027s not exactly a large facility, but its enough. The place splits into three areas, the civilian area, the Imperfects area and the power area. The Imperfects area is for the mutants that take part in the war, like me, you, Brute, Haste and such. The civilian area is for people that don\u0027t take part in the war. Children, old people, mutants whose mutation leave them unable to move without difficulty and such. And the power area is where the generators are. That\u0027s where our power comes from.\"\n\n\"How many people are here.\"\n\n\"Imperfects and civilians alike? Around sixty-thousand.\"\n\n\"And this place is small?\"\n\n\"Compared to the fact that it is basically a mutant city, yeah. There are more of them, but this is the capital. Russia is perhaps the country that has put the least concentration on hunting down mutants. That\u0027s why we\u0027re based here and that\u0027s why you chose to battle the Paladin here.\"\n\n\"When I fought the Paladin, was it night-time?\"\n\n\"It was.\"\n\n\"And he defeated me?\"\n\n\"He did.\"\n\n\"How. He can\u0027t possibly have illuminated the entire night.\"\n\n\"Lights are just one of the things he uses against you. He has this gun, which fires baryons...or something like that, and when he hits you, your body soaks them up and becomes temporarily materialized, allowing him to touch you and...well...knock you out.\"\n\n\"You said that there are children here. Is Eve\u0027s child here?\"\n\n\"Yeah. The little rascal\u0027s somewhere in the civ area\" Brute says.\n\n\"But...if Eve is dead...\"\n\n\"I know, but it\u0027s been difficult on all of us. World War 3 isn\u0027t exactly what I had in mind when I joined the Imperfects. Still, if I hadn\u0027t, I\u0027d probably be dead right now\" Grove says.\n\n\"Alright, then on to the matter at hand. What do we do?\"\n\n\"Well, you\u0027re the leader, you know. I\u0027m just your substitute. So what do we do Liberator?\"\n","page 119":"Except for Haste, everyone makes it out of there alive, and the first thing I see when I exit the prison is Grove, examining an unconscious guard.\n\n\"What happened?\" I ask and approach him.\n\n\"I don\u0027t know. None of our guys did this.\"\n\n\"One of the escaping mutants must have done it.\"\n\nGrove nods and says \"we\u0027ll take him back to the base. Baryon, you can introduce a level of pain far above anyone else in the world. You\u0027ll get him to talk about the location of their main base.\"\n","page 89":"\"Leksiah...\"\n\n\"What\u0027s wrong?\"\n\n\"I don\u0027t know, what the two of us had, but I can\u0027t just jump into something I have no memory of. There is a global crisis going on, and if I\u0027m supposed to be the leader of this base, I\u0027m going to have to stay focused.\"\n\nLeksiah nods, clearly disappointed, but I know she understands.\n\n\"Can you at least calm my headaches? They\u0027ve been getting really painful in your absence.\"\n\nI nod, channel myself into her head and suppress the pain from her headache, before leaving the room and regrouping with Grove, Brute and Haste.\n","page 80":"The night has passed, and in the evening, most of the Novarran citizens sit down in front of their televisions to watch the news. However, the news switch to Baryon\u0027s twitching green eyes.\n\n\"People of Novarra. I am disheartened, and I can imagine you are as well. Lately, there has been a conflict, between right and wrong in your country, and as usual with such conflicts, both voices are being shouted so loudly that neither is being heard. Across the entire world, I have seen a lot of people attack the innocent and take away their freedom, and people always cheer my name when I put a stop to it. Why shouldn\u0027t they? Enforcing what is right is the highest virtue of all, is it not? However, when the assailants hide behind the laws, people seem to cheer their names, instead of those fighting for the freedom of the innocent. People support wrongful incarceration, and soon, they will even cheer as the innocent are publicly executed before their eyes. You see, the unjust in this matter are not the mutants you fear, not the monsters you have nightmares about, not even me. The unjust are you, the people of Novarra, who support this monstrous law, seeing its victims as animals that should be put down simply because their existance inconveniences you. Every night, I will visit Novarra, and every time I come here, finding that this law still exists, I will annihilate a Novarran city, until either you see the light or nothing remains. And in case you don\u0027t believe me...\"\n\nThe camera he seems to be levitating is then raised into the air, revealing the shattered remains of Haengal, a former Novarran city. The screen then switches back to the news.\n","page 82":"For hours, there is not a single sound. Just me, trapped in this vat, in this dull metallic room.\n\n \nSoon, I hear loud thumps, coming froun outside. At first, it sounds like they\u0027re far away, but then they get louder, indicating that they\u0027re getting closer to my location. It almost sounds like someone is knock down walls. The sound becomes more and more familiar as it gets closer. I\u0027ve heard these thumps before.\n\nBrute then knocks down the wall next to me, and Haste superspeeds to his side.\n\n\"Do you ever try knocking?\"\n\n\"That was me knocking.\"\n\nHaste sighs, superspeeds to a console next to my vat and starts skimming through it on superspeed.\n\n\"Hey. Who\u0027d ever thought we\u0027d be liberating the Liberator?\"\n\n\"Twenty bucks says Paladin\u0027s on his way.\"\n\n\"Oh yeah? We better hurry then.\"\n\n\"Hurry? But then we might miss him.\"\n\n\"You wanna fight the guy that put Liberator in there? Be my guest. We can go much faster than you anyway. Speaking of being faster, you didn\u0027t loose the leader, did you?\"\n\n\"He can handle himself.\"\n\n\"Oh yeah, because he always excels at combat\" Haste responds and seems to be finished with the console, as the vat opens.\n\n\"Right. I\u0027ll go find Treebeard, you get him out of here.\"\n\nHaste then vanishes on superspeed and Brute approaches me.\n\n\"I was right, wasn\u0027t I? Getting captured alive is way worse than dying in a proper fight.\"\n\n\"I...what?\"\n\n\"You\u0027re confused? Ah, what the heck. The talking guys will be able to get your mind straight. We\u0027ll just get out of here, and if we\u0027re lucky, we\u0027ll run into Paladin.\"\n\n\"Who\u0027s the Paladin?\"\n\n\"You don\u0027t remember the guy who sorely kicked your ass? He\u0027s the reason you were captured.\"\n\n\"This Paladin...he\u0027s the guy who\u0027s like me?\"\n\n\"Like you? You don\u0027t really think they\u0027d use freaks to fight for them, right? Naw, he\u0027s just a guy in a suit. A suit that\u0027s made to fight against you. Now, are we gonna get the hell out of here or what?\"\n\n\"Are we going to meet Eve?\"\n\n\"Yeah, if the Paladin has his way.\"\n","page 81":"For hours, there is not a single sound. Just me, trapped in this vat, in this dull metallic room.\n\n \nSoon, I hear loud thumps, coming froun outside. At first, it sounds like they\u0027re far away, but then they get louder, indicating that they\u0027re getting closer to my location. It almost sounds like someone is knock down walls. The sound becomes more and more familiar as it gets closer. I\u0027ve heard these thumps before.\n\nBrute then knocks down the wall next to me, and Haste superspeeds to his side.\n\n\"Do you ever try knocking?\"\n\n\"That was me knocking.\"\n\nHaste sighs, superspeeds to a console next to my vat and starts skimming through it on superspeed.\n\n\"Hey. Who\u0027d ever thought we\u0027d be liberating the Liberator?\"\n\n\"Twenty bucks says Paladin\u0027s on his way.\"\n\n\"Oh yeah? We better hurry then.\"\n\n\"Hurry? But then we might miss him.\"\n\n\"You wanna fight the guy that put Liberator in there? Be my guest. We can go much faster than you anyway. Speaking of being faster, you didn\u0027t loose the leader, did you?\"\n\n\"He can handle himself.\"\n\n\"Oh yeah, because he always excels at combat\" Haste responds and seems to be finished with the console, as the vat opens.\n\n\"Right. I\u0027ll go find Treebeard, you get him out of here.\"\n\nHaste then vanishes on superspeed and Brute approaches me.\n\n\"I was right, wasn\u0027t I? Getting captured alive is way worse than dying in a proper fight.\"\n\n\"I...what?\"\n\n\"You\u0027re confused? Ah, what the heck. The talking guys will be able to get your mind straight. We\u0027ll just get out of here, and if we\u0027re lucky, we\u0027ll run into Paladin.\"\n\n\"Who\u0027s the Paladin?\"\n\n\"You don\u0027t remember the guy who sorely kicked your ass? He\u0027s the reason you were captured.\"\n\n\"This Paladin...he\u0027s the guy who\u0027s like me?\"\n\n\"Like you? You don\u0027t really think they\u0027d use freaks to fight for them, right? Naw, he\u0027s just a guy in a suit. A suit that\u0027s made to fight against you. Now, are we gonna get the hell out of here or what?\"\n\n\"Are we going to meet Eve?\"\n\n\"Yeah, if the Paladin has his way.\"\n","page 84":"I transport myself and Brute to the base Haste goes to: an abandoned underground base in Siberia. I don\u0027t realize that we\u0027re there until I channel myself around the surrounding area. As I enter the base along with Brute, I feel that the whole place is very vaguely illuminated. Clearly designed not to inconvenience me. There, I see hundreds of mutants, some I have seen before, and some I haven\u0027t.\n\nGrove approaches me, and he appears to be the leader of this place.\n\n\"Baryon. Glad to have you back. The Imperfects aren\u0027t the same without you.\"\n\n\"Imperfects? I\u0027m an Imperfect again?\"\n\n\"Again? No. Unfortunately, this can hardly be called the same team. We just use the name. The Imperfects symbolize everything we stand for. Mutants that make the world better. Mutants that deserve to coexist with the rest of the world.\"\n\n\"And you were made leader?\"\n\nGrove looks at Brute and says \"what happened to his memory?\"\n\n\"No idea.\"\n\n\"Well, yes, I was made leader in your absence.\"\n\n\"What about Eve, Freakshow or the Amphibian? Surely, they would have made better leaders?\"\n\nGrove looks down uncomfortably. \"Ah, yes. They would have.\"\n\n\"Wha...what happened? Tell me what happened.\"\n\n\"Do you know about the anti-mutant laws?\"\n\n\"Yes. They started in Novarra and now they\u0027ve spread globally.\"\n\n\"Exactly. When they hit America, the Gorgonian people tried to have the Imperfects  be accepted as exceptions to this rule, as they\u0027ve proven that they\u0027re not a threat to anyone, but Eve refused. In fact, we all refused. We wanted to be treated as mutants, hoping that it would cause the country to reconsider this, but they didn\u0027t. When all mutants were made illegal, agents came knocking on the base. Freakshow gave up without a fight and walked into his cell voluntarily. He died there of old age two years ago. Amphibian was never a powerful combatant, so he was killed in the attack.\"\n\n\"And Eve? What happened to Eve?\"\n\n\"Paladin\u0027s first victim.\"\n\n\"The Paladin killed her?\"\n\n\"Yes. She was the leader, which made her Paladin\u0027s prime target. After he killed her, you went after him, and he defeated you as well.\"\n\n\"Why did he kill her? Why didn\u0027t he take her alive if he did that to me?\"\n\n\"Because she fought him in Novarra.\"\n\n\"That matters?\"\n\n\"The law has spread globally, but not all countries state that mutants are to be executed. Some only incarcerate them, which is why you fought him in Russia. If you lost, then at least you\u0027d still be alive.\"\n\nI listen to what Grove has to say, but I am still trying to accept that Eve and Freakshow, two of my best friends, are dead. We may not have departed on good terms as far as I remember, but they deserved more.\n","page 83":"Brute and I go back the way he came, through the entire facility. and I stay underneath him to use his extremely large body to shield me from the light.\n\n\"So where are we?\" I ask Brute as we make our way through the compund.\n\n\"This is one of their largest prisons.\"\n\n\"Their?\"\n\n\"Wow, they really did a number on your memory, didn\u0027t they? The alliance. All the countries teaming up to fight against you.\"\n\n\"Me?\"\n\n\"Well, us. You primarily. You\u0027re the Liberator after all.\"\n\n\"Why am I called that?\"\n\n\"Well, freaks like us mostly call you that, but its true. You\u0027ve been freeing keeping mutants safe on a global scale for years.\"\n\n\"Wait, this law...it\u0027s global?\"\n\nBrute nods, and I then add \"I thought it was only in Novarra.\"\n\n\"Yeah, like 8 years ago. Then you started kicking their asses, and they didn\u0027t like getting their asses kicked, and they used your ass-kickery to convince the rest of the world that freaks are monsters and should be exterminated.\"\n\nBrute then looks up into the ceiling, and says \"alright, we should be close enough to the ground now. Come on, hold on tight.\"\n\nI then grab Brute\u0027s arm as he leaps through the ceiling and into the night above, allowing me to connect with it.\n\n\"Haste and Grove should be around here somewhere\" Brute says, and then a blur leaves the compound, which looked like Haste carrying Grove.\n\n\"Follow them. I don\u0027t recon you remember where our base is.\"\n","page 86":"After they\u0027ve gone, Leksiah touches my hand again.\n\n\"You\u0027re not twitching anymore?\"\n\n\"What?\"\n\n\"Lately, you\u0027ve been twitching a lot. How did you fix it?\"\n\n\"I...I\u0027ve been twitching?\"\n\n\"Yes. I\u0027ve been studying it like you asked, but so far, I haven\u0027t come to a conclusion. I might be close to something though.\"\n\n\"Have I...have I ever possessed the ability of teleportation?\"\n\n\"No. Not that I know of. That cage wouldn\u0027t have held you if that had been the case, would it?\"\n\n\"No. I guess not. It\u0027s just...the last thing I remember is that I was going to confront the government officials that supported mutant-extermination, and then I encountered someone like me, only he was twitching, and he could teleport. The next thing I knew, I was in that vat, and eight years had passed.\"\n\n\"That\u0027s strange. I mean, if they would wipe out your memory, why wouldn\u0027t they just clear it? Why would there be something left. Also, I\u0027ve never heard of another Baryon. Are you sure this happened? Someone would have heard of him.\"\n\n\"You\u0027re the hyper-intelligent one here. Not me.\"\n\n\"Actually, you are. I don\u0027t imagine you remember that any better, but the brain activity of regular human beings is limited due its organic tissue, which you don\u0027t have.\"\n\n\"Interesting. What else did we learn about how I work?\"\n\nLeksiah smiles, approaches me until her face is just inches away from mine.\n\n\"Well. We learned that you can induce pleasure, just as you can induce pain.\"\n","page 85":"I transport myself and Brute to the base Haste goes to: an abandoned underground base in Siberia. I don\u0027t realize that we\u0027re there until I channel myself around the surrounding area. As I enter the base along with Brute, I feel that the whole place is very vaguely illuminated. Clearly designed not to inconvenience me. There, I see hundreds of mutants, some I have seen before, and some I haven\u0027t.\n\nGrove approaches me, and he appears to be the leader of this place.\n\n\"Baryon. Glad to have you back. The Imperfects aren\u0027t the same without you.\"\n\n\"Imperfects? I\u0027m an Imperfect again?\"\n\n\"Again? No. Unfortunately, this can hardly be called the same team. We just use the name. The Imperfects symbolize everything we stand for. Mutants that make the world better. Mutants that deserve to coexist with the rest of the world.\"\n\n\"And you were made leader?\"\n\nGrove looks at Brute and says \"what happened to his memory?\"\n\n\"No idea.\"\n\n\"Well, yes, I was made leader in your absence.\"\n\n\"What about Eve, Freakshow or the Amphibian? Surely, they would have made better leaders?\"\n\nGrove looks down uncomfortably. \"Ah, yes. They would have.\"\n\n\"Wha...what happened? Tell me what happened.\"\n\n\"Do you know about the anti-mutant laws?\"\n\n\"Yes. They started in Novarra and now they\u0027ve spread globally.\"\n\n\"Exactly. When they hit America, the Gorgonian people tried to have the Imperfects  be accepted as exceptions to this rule, as they\u0027ve proven that they\u0027re not a threat to anyone, but Eve refused. In fact, we all refused. We wanted to be treated as mutants, hoping that it would cause the country to reconsider this, but they didn\u0027t. When all mutants were made illegal, agents came knocking on the base. Freakshow gave up without a fight and walked into his cell voluntarily. He died there of old age two years ago. Amphibian was never a powerful combatant, so he was killed in the attack.\"\n\n\"And Eve? What happened to Eve?\"\n\n\"Paladin\u0027s first victim.\"\n\n\"The Paladin killed her?\"\n\n\"Yes. She was the leader, which made her Paladin\u0027s prime target. After he killed her, you went after him, and he defeated you as well.\"\n\n\"Why did he kill her? Why didn\u0027t he take her alive if he did that to me?\"\n\n\"Because she fought him in Novarra.\"\n\n\"That matters?\"\n\n\"The law has spread globally, but not all countries state that mutants are to be executed. Some only incarcerate them, which is why you fought him in Russia. If you lost, then at least you\u0027d still be alive.\"\n\nI listen to what Grove has to say, but I am still trying to accept that Eve and Freakshow, two of my best friends, are dead. We may not have departed on good terms as far as I remember, but they deserved more.\n\nI then see a familiar face as Leksiah enters the room, smiles and runs towards me.\n\n\"Baryon! You\u0027re back!\"\n\nBefore I realize it, Leksiah has grabbed my hand and kisses me. I could phase through her, but why would I do that?\n\n\"Ahem, he probably doesn\u0027t remember you Lexie\" Brute says and Leksiah looks at him. She then looks at me again and says \"what? What happened?\"\n\n\"You two seem to have a lot of catching up to do\" Grove says and notes the rest of them to leave the room, which they do.\n","page 121":"As soon as we return to the base, Leksiah approaches me and tells me to join her in her room, as she has something she wants to discuss. I follow her and ask \"what is it? What\u0027s going on?\"\n\n\"You asked me to investigate why you were twitching, right? Well, even though you\u0027re not twitching anymore, I continued to check it out anyway, fearing that it might return. Using the sample of you you gave me, I think I\u0027ve been able to analyse what it is.\"\n\n\"Oh? What is it?\"\n\n\"You...how do I put this. You have your own way of aging. Your entire physique is...unstable, and because of that, it is constantly deteriorating.\"\n\n\"Deteriorating?\"\n\n\"Yes. You are slowly becoming more and more unstable. Eventually, you\u0027ll completely unravel. And that\u0027s not all. I tried introducing the sample of you to baryons, which the sample of course absorbed...it deteriorated more while it was absorbing them. Once it had absorbed the baryons, it deteriorated at a normal speed.\"\n\n\"And what does that mean?\"\n\n\"It means that the more you use your powers, the faster you deteriorate. One thing that puzzles me is why you aren\u0027t twitching any more. The twitching was caused by the instability in your body, and it\u0027s impossible for it to just become more stable all of a sudden.\"\n\n\"Well, I can regenerate while in the...\"\n\n\"You\u0027re body can\u0027t create stability. No matter how much of you it regenerates, it\u0027ll always be as unstable.\"\n\n\"Maybe...I don\u0027t know. Maybe this is somehow dependant on my memories?\"\n\n\"No. This is physical, not mental.\"\n\n\"So...what, the Alliance fixed me?\"\n\n\"That\u0027s the only thing that comes to mind. Maybe they...I don\u0027t know, created another you and used memories from the original Baryon, only the memories were copied at that point eight years ago and put into you. If that were the case, then your last memory should be of your memories being copied...unless you were unconscious at the time. What was your last memory eight years ago?\"\n\n\"I encountered another Baryon, that was twitching, and then I woke up in the vat.\"\n\n\"That\u0027s...odd...if he was twitching before you were, then that must mean that he was created before you were created. But there\u0027s no record of a second Baryon.\"\n\n\"I don\u0027t know where he came from. He just showed up, didn\u0027t said anything, and the next thing I remember was being in that vat.\"\n\nThere is a knock on the door then, and Grove enters the room. \"Baryon, the sooner you get information from that guard, the better.\"\n","page 120":"We return to the base, and the guard is placed in a some sort of holding cell.\n\nAfter putting the guard in the holding cell, Grove leaves the room and approaches me.\n\n\"Is your memory returning to you?\"\n\n\"No. I still remember nothing since that night, two years ago.\"\n\n\"What happened then?\"\n\n\"I saw someone like me, he was twitching, and then I woke up in that vat.\"\n\n\"Twitching? Like you were?\"\n\n\"Were?\"\n\n\"Oh. I guess you don\u0027t remember it. You were twitching more and more before you were captured. You don\u0027t seem to be twitching now though.\"\n\n\"I\u0027m not.\"\n\n\"Oh, well, maybe it was a problem that your body resolved in the solitude of the vat. Anyway, the sooner you interrogate that guard, the better.\"\n","page 6":"No matter how much I dislike this law against mutants, these guys are not to blame. It\u0027s this Unon guy. He\u0027s the one giving these orders.\n\n\"If I ever catch you hurting innocents again, I will introduce you to a level of pain you never believed existed\" I say to the agents as they run away.\n\nLeksiah approaches me and asks \"You...you are that Karma thing I keep reading about?\"\n\n\"Among other things.\"\n\n\"Do you...do you have a name?\"\n\n\"My creators named me Baryon, so I guess that\u0027s my name.\"\n\n\"Your creators?\"\n\n\"Yes. As you can no doubt see, I am one of the \u0027freaks\u0027 as well. I am made of dark-matter, and my power is only limited by the amount of light I am exposed to. That\u0027s it in a nutshell.\"\n\n\"How...what\u0027s your story?\"\n\n\"The full story? My mother was killed while pregnant with me, carved open and then, when they had removed the embryo that would later develop into a happy little boy, they fed her to a cannibalistic mutant and grew me in a tub full of dark-matter, only to issue my project as flawed. How\u0027s that for a bed-time story?\"\n\n\"I\u0027m sorry. I didn\u0027t...\"\n\n\"Don\u0027t worry about it. What about you? Telekinesis doesn\u0027t just spring from nowhere, does it?\"\n\n\"Well, I am the results of a man\u0027s attempt to heighten human intelligence.\"\n\n\"So you are hyper-intelligent?\"\n\n\"Yes, sort of. I know I haven\u0027t forgotten anything I experienced since my escape four months ago.\"\n\n\"And the telekinesis?\"\n\n\"Not sure. The containments were not sufficiently equipped to defend against telekinesis, so I imagine it was an unforseen side-effect of whatever it is they did to my mind.\"\n\n\"You were kidnapped then? Before that you had a normal life?\"\n\n\"Yes. I did. I even had a family until they called those agents after the law was initiated.\"\n\n\"That...I am sorry.\"\n\n\"Don\u0027t worry about it. But...are you going to do something about this whole thing? This law?\"\n\n\"Yes. I\u0027ll have to do something. I can\u0027t just sit by and watch as people are being put behind bars just for being different.\"\n\n\"Well, what are you going to do?\"\n","page 145":"\"Don\u0027t you get it? The night doesn\u0027t make you stronger, not against me. It just makes it easier for me to hit you\" Paladin says as he has his hand around my neck. He can\u0027t choke me, as I don\u0027t breathe in the traditional manner, but holding me so close to the light emitting from his armor for so long is slowly causing me to evaporate.\n\nSeeing as how the baryons he forced into me are slowly retreating fro my body, Paladin decides not to waste any more time, but Haste arrives on superspeed, and rams Paladin away from me. Haste receives the killing blow instead however, but the baryons leave my body and I am free once more.\n","page 5":"The agents suddenly find themselves trapped in a jail-cell. Not in Novarra, but in Egypt. They\u0027ll get to know the feeling of being wrongfully incarcerated, well, wrongfully to their point of view at least.\n\nLeksiah approaches me and asks \"You...you are that Karma thing I keep reading about?\"\n\n\"Among other things.\"\n\n\"Do you...do you have a name?\"\n\n\"My creators named me Baryon, so I guess that\u0027s my name.\"\n\n\"Your creators?\"\n\n\"Yes. As you can no doubt see, I am one of the \u0027freaks\u0027 as well. I am made of dark-matter, and my power is only limited by the amount of light I am exposed to. That\u0027s it in a nutshell.\"\n\n\"How...what\u0027s your story?\"\n\n\"The full story? My mother was killed while pregnant with me, carved open and then, when they had removed the embryo that would later develop into a happy little boy, they fed her to a cannibalistic mutant and grew me in a tub full of dark-matter, only to issue my project as flawed. How\u0027s that for a bed-time story?\"\n\n\"I\u0027m sorry. I didn\u0027t...\"\n\n\"Don\u0027t worry about it. What about you? Telekinesis doesn\u0027t just spring from nowhere, does it?\"\n\n\"Well, I am the results of a man\u0027s attempt to heighten human intelligence.\"\n\n\"So you are hyper-intelligent?\"\n\n\"Yes, sort of. I know I haven\u0027t forgotten anything I experienced since my escape four months ago.\"\n\n\"And the telekinesis?\"\n\n\"Not sure. The containments were not sufficiently equipped to defend against telekinesis, so I imagine it was an unforseen side-effect of whatever it is they did to my mind.\"\n\n\"You were kidnapped then? Before that you had a normal life?\"\n\n\"Yes. I did. I even had a family until they called those agents after the law was initiated.\"\n\n\"That...I am sorry.\"\n\n\"Don\u0027t worry about it. But...are you going to do something about this whole thing? This law?\"\n\n\"Yes. I\u0027ll have to do something. I can\u0027t just sit by and watch as people are being put behind bars just for being different.\"\n\n\"Well, what are you going to do?\"\n","page 144":"I start to channel the air currents in a circular motion around him, trying to form a tornado. However, before I can do that, I am hit by his baryonic cannon and I shrink back to human size. Unable to remove tha baryons in my body for a little while, I collapse to the ground and Paladin grabs around my neck.\n","page 8":"\"Philias Unon is responsible for this, isn\u0027t he?\"\n\n\"He initiated this law, yes.\"\n\n\"Then he will suffer for the harm he has brought onto innocents.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us.\"\n","page 147":"I channel myself to inside the base, where Paladin follows, and he aims his cannon at me. At least now I\u0027ve learned that fighting him in the night is a mistake.\n\n \n","page 7":"\"There are innocent people being arrested? Just for being mutants?\"\n\n\"They claim it\u0027s because of the damage they can cause.\"\n\n\"They\u0027re not even given the chance to prove them wrong. They deserve more, they deserve to be free. I am going to free them.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us. We mutants have to stick together, have each other\u0027s backs.\"\n","page 146":"\"Don\u0027t you get it? The night doesn\u0027t make you stronger, not against me. It just makes it easier for me to hit you\" Paladin says as he has his hand around my neck. He can\u0027t choke me, as I don\u0027t breathe in the traditional manner, but holding me so close to the light emitting from his armor for so long is slowly causing me to evaporate.\n\nSeeing as how the baryons he forced into me are slowly retreating fro my body, Paladin decides not to waste any more time, but Haste arrives on superspeed, and rams Paladin away from me. Haste receives the killing blow instead however, but the baryons leave my body and I am free once more.\n","page 2":"I channel an abandoned newspaper from the streets of Edinborough to me, and see the headlines: \"Karma in the flesh\". That seems to be what they\u0027re calling me: Karma. Most people have no idea what it is that attacks criminals in the night, but they\u0027re definately talking about it, forming theories. This is good, this is very good. If everyone starts to believe this is a natural phenomenon that strikes criminals at all times, then perhaps, my work will be over, and people will stop inflicting pain onto others that they themselves don\u0027t want to endure. It is also good that people are confused whether it is a force of good or a force of evil. I don\u0027t want people to get the misconception of me being evil, but this way, people might fear me while still acknowledge me as beneficial to the society.\n\nI put the newspaper back to where it was, and then start to channel myself through Europe, picking up on everything that\u0027s going on there at once, aside from that which is illuminated of course. I usually encounter a lot of violence when I channel myself through such a large area at once. Much justice to be distributed. In Spain, I see a mugger, taking a man\u0027s wallet. I don\u0027t return the wallet yet. I wait for him to return home, and see that his apartment has been stolen, literally. I am still careful to leave enough of a foundation for the rest of the building not to crash, and then I slowly channel the wallet back to its rightful owner. Everytime the mugger tries to grab the wallet, floating in the air, I inflict great pain to his hand.\n\nAt the same time, the bullet fired by a hit-man in France goes back and pierces through his head, and a man trying to hijack a plain moves, unfortunately for him, into a shadowed area, and gets thrown out of the plain. At least he lands where he wanted to go. However, when I channel myself into Novarra, I find a peculiar scenario, where men, marked as government agents, are attacking an unarmed woman. I channel myself there, but she project a telekinetic wave from her body that knocks the attackers away. One of them stands up, and then sees my eyes. He aims his gun at me and yells \"Stay put mutant!\"\n\n\"Your bullet does nothing, but show hostility, and you will receive the same\" I say. The man shoots at me anyway, and the bullet just goes through me. As I had warned, I then crush his gun into an orb and smack him with it, knocking him unconscious.\n","page 149":"I try to move myself out of his firing range, but even so, his attack seems to hit me. My entire body absorbs the baryons fires from his cannon, forcibly materializes, shrinks to human size and collapses onto the floor.\n\nPaladin approaches me and says \"you know, the great thing about shooting a target that\u0027s everywhere, is that you can\u0027t miss.\"\n\nHe then steps towards me and fires. With me forcibly materialized, the attack kills me just as much as anyone else.\n","page 1":"The sun has risen in Gorgon city, so I can\u0027t visit the Imperfects again. Last time there was night there, I came to visit, and Eve informed me that she was with child. She even claimed that I was the one that told her that, although I am sure I would remember it if that was the case.  Apparently, the child is a 100% Homo Perfectus, but I never got the story behind that. Bringing the child\u0027s father up seemed to make her sad, so I never asked.\n\nI\u0027ve noticed some new members there too. A plant-human hybrid that goes by the name Grove, an android, or an armored individual called Hyper, and Jonathan Skage. Eve always did try to make his mental state fit enough to join the Imperfects in her frequent visits to the Isolation, and I guess that worked.\n\nFreakshow is still with his girlfriend, Gabrielle. I heard he proposed to her recently. I\u0027m glad he\u0027s finally happy. He deserves it after all the pain he\u0027s gone through. I wonder if I\u0027ll be invited to the wedding. I probably wouldn\u0027t come. Weddings usually aren\u0027t held in darkness. I\u0027d just be uncomfortable.\n","page 148":"I grab a random table from deeper within the base and put it at close to Paladin without the light emitting from his armor interfering with me. The cannon hits the table, and the table absorbs the baryons instead of me and so it is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n","page 4":"These people, think they can just take other people\u0027s freedom, even though they\u0027ve done nothing to deserve anything on that scale. These people, like this Leksiah, deserve to keep their freedom, and for attacking that, these men don\u0027t even deserve their lives, so I tear out their hearts and place them in their hands, where they look upon them before collapsing motionless to the ground.\n\nLeksiah approaches me and asks \"You...you are that Karma thing I keep reading about?\"\n\n\"Among other things.\"\n\n\"Do you...do you have a name?\"\n\n\"My creators named me Baryon, so I guess that\u0027s my name.\"\n\n\"Your creators?\"\n\n\"Yes. As you can no doubt see, I am one of the \u0027freaks\u0027 as well. I am made of dark-matter, and my power is only limited by the amount of light I am exposed to. That\u0027s it in a nutshell.\"\n\n\"How...what\u0027s your story?\"\n\n\"The full story? My mother was killed while pregnant with me, carved open and then, when they had removed the embryo that would later develop into a happy little boy, they fed her to a cannibalistic mutant and grew me in a tub full of dark-matter, only to issue my project as flawed. How\u0027s that for a bed-time story?\"\n\n\"I\u0027m sorry. I didn\u0027t...\"\n\n\"Don\u0027t worry about it. What about you? Telekinesis doesn\u0027t just spring from nowhere, does it?\"\n\n\"Well, I am the results of a man\u0027s attempt to heighten human intelligence.\"\n\n\"So you are hyper-intelligent?\"\n\n\"Yes, sort of. I know I haven\u0027t forgotten anything I experienced since my escape four months ago.\"\n\n\"And the telekinesis?\"\n\n\"Not sure. The containments were not sufficiently equipped to defend against telekinesis, so I imagine it was an unforseen side-effect of whatever it is they did to my mind.\"\n\n\"You were kidnapped then? Before that you had a normal life?\"\n\n\"Yes. I did. I even had a family until they called those agents after the law was initiated.\"\n\n\"That...I am sorry.\"\n\n\"Don\u0027t worry about it. But...are you going to do something about this whole thing? This law?\"\n\n\"Yes. I\u0027ll have to do something. I can\u0027t just sit by and watch as people are being put behind bars just for being different.\"\n\n\"Well, what are you going to do?\"\n","page 3":"\"What is your name?\" I ask the woman as she stands up and she looks at my eyes.\n\n\"I...thank you. My name is Leksiah.\"\n\n\"Leksiah? Is that Novarran?\"\n\n\"It is.\"\n\n\"These men, they work for the government, don\u0027t they?\"\n\nShe nods and I then add \"why were they after you?\"\n\nIn response, Leksiah levitates the orb I bent the gun into and lifts it in between us. She then fixes it, forming the original gun from it.\n\n\"You are telekinetic then?\"\n\nShe nods again.\n\n\"But you still didn\u0027t tell me what these men wanted from you.\"\n\n\"That was why. I am telekinetic.\"\n\n\"What? They were trying to kill you because of your abilities?\"\n\n\"Well, they were just going to lock me up, but I refused, and so they started shooting.\"\n\n\"But why were they going to lock you up?\"\n\n\"You don\u0027t watch politics much, do you?\"\n\n\"I can pay attention to a lot of things, but what happens in every single government in every single country is not easy, especially since I just visit at night-time.\"\n\n\"Well...you heard about the monster attack in Endrun, a few months ago?\"\n\n\"I did. It was unfortunate that it was at day time. Otherwise I could have helped.\"\n\n\"Well, everyone in Novarra has been afraid of...of freaks ever since\" she says and looks down.\n\n\"You mean mutants.\"\n\n\"Is there a difference?\"\n\n\"A man killed two thousand people once trying to answer that question.\"\n\n\"Well, recently, there were presidential elections here, and one of the candidates, named Philias Unon took advantage of the fear people had of fre...of people like me, and so he promised to make everyone safe. This is him, fulfilling his promise.\"\n\n\"What? People are incarcerated for being victims of genetic alterations?\"\n\nLeksiah nods, and I freeze one of the agents, as he tries to stand up. This sort of thing, taking people\u0027s freedom, not just for being different, but for being someone else\u0027s victim really gets on my bad side.\n","page 99":"I grab chunks from the nearby mountains and start hurling them at the battlefield beneath me, aiming for the armored troopers. I get a lot of them, which seems to make the whole battle easier, however, Haste, as he superspeeds across the battle-field, fails to realize that, when he superspeeds towards a trooper and knocking him out, he placed himself directly in path of one of the boulder I threw. Haste never was too careful about things like this. Suddenly, a familiar sight leaps at Haste and pushes him out of the boulder\u0027s way: Claymore the alleged mutant face-collector I rescued.\n\n \n","page 98":"For approximately two hours, all the mutants hiding on the ground wait there, lying absolutely still, while I make sure that my green eyes are visible in the air, to help lure the Paladin in. Soon, I detect a large powerful light enter the night, and approach this location rapidly.\n\n\"I think it\u0027s him\" I whisper to all the Imperfects, but I then realize that I\u0027m wrong. The light is an illuminated vessel of some sort, that lights up the immediate area, and from it, a horde of men wearing some sort of power armors leap off. However, they\u0027re not headed towards me, they\u0027re headed towards the mutants. They seem to know it\u0027s a trap, and because of the lights, I can\u0027t defend the Imperfects.\n\nGrove however seems to realize this, as the light shining all around them is fairly visible, so he commands all the Imperfects to attack the armored attackers. I may be cut-off from the fight, but like I did with Virus, there are still things I can do from range.\n","page 9":"\"There are innocent people being arrested? Just for being mutants?\"\n\n\"They claim it\u0027s because of the damage they can cause.\"\n\n\"They\u0027re not even given the chance to prove them wrong. They deserve more, they deserve to be free. I am going to free them.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us. We mutants have to stick together, have each other\u0027s backs.\"\n","page 91":"\"Show me the base\" I say to Grove, and he nods.\n\n\"Well, it\u0027s not exactly a large facility, but its enough. The place splits into three areas, the civilian area, the Imperfects area and the power area. The Imperfects area is for the mutants that take part in the war, like me, you, Brute, Haste and such. The civilian area is for people that don\u0027t take part in the war. Children, old people, mutants whose mutation leave them unable to move without difficulty and such. And the power area is where the generators are. That\u0027s where our power comes from.\"\n\n\"How many people are here.\"\n\n\"Imperfects and civilians alike? Around sixty-thousand.\"\n\n\"And this place is small?\"\n\n\"Compared to the fact that it is basically a mutant city, yeah. There are more of them, but this is the capital. Russia is perhaps the country that has put the least concentration on hunting down mutants. That\u0027s why we\u0027re based here and that\u0027s why you chose to battle the Paladin here.\"\n\n\"When I fought the Paladin, was it night-time?\"\n\n\"It was.\"\n\n\"And he defeated me?\"\n\n\"He did.\"\n\n\"How. He can\u0027t possibly have illuminated the entire night.\"\n\n\"Lights are just one of the things he uses against you. He has this gun, which fires baryons...or something like that, and when he hits you, your body soaks them up and becomes temporarily materialized, allowing him to touch you and...well...knock you out.\"\n\n\"You said that there are children here. Is Eve\u0027s child here?\"\n\n\"Yeah. The little rascal\u0027s somewhere in the civ area\" Brute says.\n\n\"But...if Eve is dead...\"\n\n\"I know, but it\u0027s been difficult on all of us. World War 3 isn\u0027t exactly what I had in mind when I joined the Imperfects. Still, if I hadn\u0027t, I\u0027d probably be dead right now\" Grove says.\n\n\"Alright, then on to the matter at hand. What do we do?\"\n\n\"Well, you\u0027re the leader, you know. I\u0027m just your substitute. So what do we do Liberator?\"\n","page 90":"\"Show me the base\" I say to Grove, and he nods.\n\n\"Well, it\u0027s not exactly a large facility, but its enough. The place splits into three areas, the civilian area, the Imperfects area and the power area. The Imperfects area is for the mutants that take part in the war, like me, you, Brute, Haste and such. The civilian area is for people that don\u0027t take part in the war. Children, old people, mutants whose mutation leave them unable to move without difficulty and such. And the power area is where the generators are. That\u0027s where our power comes from.\"\n\n\"How many people are here.\"\n\n\"Imperfects and civilians alike? Around sixty-thousand.\"\n\n\"And this place is small?\"\n\n\"Compared to the fact that it is basically a mutant city, yeah. There are more of them, but this is the capital. Russia is perhaps the country that has put the least concentration on hunting down mutants. That\u0027s why we\u0027re based here and that\u0027s why you chose to battle the Paladin here.\"\n\n\"When I fought the Paladin, was it night-time?\"\n\n\"It was.\"\n\n\"And he defeated me?\"\n\n\"He did.\"\n\n\"How. He can\u0027t possibly have illuminated the entire night.\"\n\n\"Lights are just one of the things he uses against you. He has this gun, which fires baryons...or something like that, and when he hits you, your body soaks them up and becomes temporarily materialized, allowing him to touch you and...well...knock you out.\"\n\n\"You said that there are children here. Is Eve\u0027s child here?\"\n\n\"Yeah. The little rascal\u0027s somewhere in the civ area\" Brute says.\n\n\"But...if Eve is dead...\"\n\n\"I know, but it\u0027s been difficult on all of us. World War 3 isn\u0027t exactly what I had in mind when I joined the Imperfects. Still, if I hadn\u0027t, I\u0027d probably be dead right now\" Grove says.\n\n\"Alright, then on to the matter at hand. What do we do?\"\n\n\"Well, you\u0027re the leader, you know. I\u0027m just your substitute. So what do we do Liberator?\"\n","page 93":"\"We should assassinate all the world leaders that support this.\"\n\n\"They are fighting a war with superhumans. Every last one of them is provided with maximum security that counters the skills of nearly all of us. Besides, to keep the others oblivious to the fact that they are being hunted down, we\u0027d have to target them all at the same time, and there is no chance we could succeed without you, and as you probably know, night can\u0027t be everywhere at the same time.\"\n\n\"Alright. Then we\u0027ll do something else.\"\n","page 92":"\"The first step is clear. We go after the Paladin.\"\n\n\"The Paladin?\"\n\n\"He killed Eve, our leader, our friend. He put me in a vat and took away my memories. We have to take him out, we have to show everyone that no one will stand against us.\"\n\n\"Alright. How will we do that?\"\n\n\"There\u0027s a lot of us. His weapons are designed to target me, not you or Brute or Haste.\"\n\n\"He\u0027s not defenseless against us, you know.\"\n\n\"As Imperfects, we\u0027ve taken down gigantic titans. How? Not because we were powerful, but because we worked together.\"\n\n\"Actually, we defeated Hybrid because you were powerful\" Haste says.\n\n\"And Virus\" Grove then adds.\n\n\"You\u0027re missing the point. Together, we can easily defeat him, and he needs to be defeated. Eve deserves to be avenged.\"\n\n\"She wouldn\u0027t like you trying to avenger her, you know?\"\n\n\"Even so, the Paladin must die. Where is he?\"\n\n\"Just show your face and he\u0027ll be there. His primary objective is to take you out. That\u0027s what his suit was made for.\"\n","page 95":"\"I\u0027m not the leader of this team, you are. I don\u0027t remember what\u0027s been going on, what has happened. You do.\"\n\n\"You are the Liberator. The mutants need you to...\"\n\n\"I\u0027ll be at your side, but I think you should be the leader. You\u0027ve done okay so far.\"\n\n\"Alright. This fight is not about killing Alliance people. This fight is about mutants allowing to be themselves without having to spend their lives in a cell. The citizens need to see that we\u0027re not trying to attack them, we\u0027re just trying to free our own.\"\n\n\"We\u0027re attacking a prison then?\"\n\n\"Night has moved over Gorgon. As you might know, Gorgon is sort of the mutant capital of the world, so Zuchthaust prison was converted into a giant mutant prison facility. That\u0027s where we\u0027ll strike.\"\n","page 94":"\"We need to free more mutants. Bolster our ranks and give all those innocent mutants out there the freedom they deserve.\"\n\n\"I agree, and  I know just where to strike. The sun has gone down in Gorgon, and because we all know that\u0027s virtually the mutant capital of the world, Zuchthaus prison has been turned into a giant prison complex. I\u0027ve been meaning to strike there, but I don\u0027t think we can do it without our dark-god. You didn\u0027t get the name Liberator for nothing.\"\n","page 97":"As Haste directed, I raise the camera into the air, channel my eyes in front of it but make sure that I\u0027m transpherent enough for the Ural mountains to be visible.\n\n\"Alliance people. This is to all those out there who persecute others for no other reason that they are different. The name you know me under can be different. I have been called Baryon, Karma, Demon, Liberator and probably more, but no matter what people call me, it is clear that all you out there fear me. Why do you fear me? Because of what I can do? Perhaps, but I think that I, same as with everything else, am feared simply because you lack the intelligence to understand me. It is amazing how often people think they\u0027re problems go away  simply by locking them up. Well, they don\u0027t. I am no longer in that cage, and I challenge you to try and understand me, and end this fighting once and for all. But we all know that\u0027s not going to happen, don\u0027t we?\"\n\nI then switch the camera off, and while I was recording it, I try to do what Haste said and channel the video as a frequency and have it replace the transmissions the Russian televisions are sending. I obviously can\u0027t do it globally, as the night only covers half of the planet. Haste vanishes in a blur, and then returns, giving me a thumbs up, indicating that my attempts to broadcast the transmission was a success.\n","page 96":"I decide to do what I\u0027m supposed to have done and challenge Paladin to fight us in Russia. Around three-hundred Imperfects lie in wait, while Zachary superspeeds away and gets a camera, which he hands me.\n\n\"What\u0027s this for?\"\n\n\"You probably don\u0027t remember it, but you often video-taped you talking about stuff and then broadcasted it around the world.\"\n\n\"I broadcasted it?\"\n\n\"Yeah. Something about electro-pulses something something dark side. Anyway, now, you\u0027re going to broadcast a message, stating that you have been freed and are back in action. Hopefully, the Alliance leaders will realize that those are the Ural mountains in the background, and send Paladin to dispatch you. He\u0027ll then run into all of us, and we\u0027ll kick his ass. Capiche?\"\n\nI nod at Zachary and he hides himself as well. We\u0027ll have to have Paladin think he\u0027s coming to find me alone.\n","page 150":"I throw a random table at him, which is hit by the cannon instead of me. The table absorbs the baryons and is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n\n \n","page 152":"I try to move myself out of his firing range, but even so, his attack seems to hit me. My entire body absorbs the baryons fires from his cannon, forcibly materializes, shrinks to human size and collapses onto the floor.\n\nPaladin approaches me and says \"you know, the great thing about shooting a target that\u0027s everywhere, is that you can\u0027t miss.\"\n\nHe then steps towards me and fires. With me forcibly materialized, the attack kills me just as much as anyone else.\n","page 151":"I grab a random table from deeper within the base and put it at close to Paladin without the light emitting from his armor interfering with me. The cannon hits the table, and the table absorbs the baryons instead of me and so it is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n","page 153":"I throw a random table at him, which is hit by the cannon instead of me. The table absorbs the baryons and is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n\n \n","page 134":"I channel myself into the roof above Paladin, which is far above him enough not to be significantly illuminated by the light emitting from him. The ceiling comes crashing down at him, but he fires his cannon at it and it is vaporized. He then charges his cannon up again and approaches me.\n\n \n","page 133":"I channel myself around a some sort of deactivated computer and hurl it at Paladin, utilizing Newton\u0027s first law, causing it to continue motioning towards him at the great speed I threw it at, and as his cannon is still charging, the computer strikes the Paladin and throws him through the horde of troopers and to the outside. He\u0027s still alive, unfortunately, but I definately hurt him.\n\n \n","page 136":"I channel myself around a some sort of deactivated computer and hurl it at Paladin, utilizing Newton\u0027s first law, causing it to continue motioning towards him at the great speed I threw it at, and as his cannon is still charging, the computer strikes the Paladin and throws him through the horde of troopers and to the outside. He\u0027s still alive, unfortunately, but I definately hurt him.\n\n \n","page 135":"I channel myself into the floor, and although the light emitting from him renders me unable to manipulate it as perfectly as I otherwise could, I am able to render the floor weaker, causing it to collapse under the weight of his heavy metallic armor. Paladin crashes through the floor, and lands in the power area. He fires his cannon upwards however, and as he hits the floor, a portion of it vanishes in a black hole, causing the mutants on it to get sucked in as well. Seeins as how I\u0027m going to have to defeat him, and save my allies from him, I go down to the power area to face him.\n\n \n","page 138":"I grab a random table from deeper within the base and put it at close to Paladin without the light emitting from his armor interfering with me. The cannon hits the table, and the table absorbs the baryons instead of me and so it is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n","page 137":"I am not sure who has the advantage here in the power area. There\u0027s more light here than in the rest of the base, but it seems light isn\u0027t too much of a disadvantage for me in this fight, for as long as I have some shadow, because that makes it more difficult for him to hit me.\n\n\"You seem to be learning Baryon. You always thought that the night would keep you safe from me.\"\n\n\"Learning? How could you expect me to learn when you take away your memories?\"\n\n\"Your memories? Why would we care whether you remember something or not? You weren\u0027t supposed to escape in the first place. It seems the only way to permanently remove you from the battle is by killing you\" he says and aims his cannon at me.\n","page 139":"I try to move myself out of his firing range, but even so, his attack seems to hit me. My entire body absorbs the baryons fires from his cannon, forcibly materializes, shrinks to human size and collapses onto the floor.\n\nPaladin approaches me and says \"you know, the great thing about shooting a target that\u0027s everywhere, is that you can\u0027t miss.\"\n\nHe then steps towards me, but Haste then rams him on superspeed, causing the attack to miss me, as I am no longer everywhere. However, some of the baryons his fired enter Haste, and, like Brute, he turns into a black hole and vanishes. This however gives me the chance to dematerialize again and connect with the shadows once more.\n","page 0":"The man screams a high-pitched scream, as I throw him off the girl. I transport clothes instantly to her hands. She doesn\u0027t deserve being bare here in this dark alley. I then remove all the blood from the attempted rapist off her, and suggest her to leave, which she does. I then approach the man, who is still screaming in agony. I don\u0027t want him to die, so I stop the bleeding and raise him up into the air. I then locate his testicles, which are lying to my side, and levitate them in front of his eyes.\n\n\"Do you know why this has happened to you?\" I ask him, but he is still sobbing and crying. \"Answer me!\"\n\n\"Pl...please...don\u0027t kill me.\"\n\n\"Is that why this has happened to you? because please don\u0027t kill me?\"\n\n\"I want to live.\"\n\n\"Do you know why this has happened to you?\"\n\n\"Be...be...because I...\"\n\n\"Yes?\"\n\n\"I was trying to...I was...\"\n\n\"I am a busy man. Give me an answer!\"\n\n\"Because I was trying to rape her, alright!?!\"\n\nI put the man down. He is still sobbing, but as I channel myself through him, I can feel his pain going away.\n\n\"Yes. And tell me, how could you have avoided this?\"\n\nHe continues to sob and then says \"by being good?\"\n\n\"Yes. Clearly, you can\u0027t handle the responsibilities of manhood, but don\u0027t worry, those responsibilities have been taken off your shoulders, permanently\" I say as I channel myself away from him. He\u0027s learned his lesson, so there\u0027s nothing more for me to do here.\n","page 141":"This isn\u0027t over until one of us lies dead, so I channel myself to the darkness of the night, where he was thrown. Paladin gets up, and it is clear the fight is resuming.\n\n \n","page 140":"I throw a random table at him, which is hit by the cannon instead of me. The table absorbs the baryons and is converted into a black hole before disappearing utterly. Now I should concentrate on attacking before his cannon charges up again.\n\n \n","page 143":"I channel myself towards a mountain, but before I can do that, I am hit by his cannon and shrink back to human size. I then fall down, unable to remove the baryons in my body for now, and Paladin grabs around my neck.\n","page 142":"Paladin should be out for a little bit now, so I should concentrate on keeping my allies safe. After all, if the Paladin returns and his troopers are out, he\u0027ll have to take us all on simultaneously, so I stay inside and help the Imperfects combat the troopers until the Paladin returns.\n","page 167":"I nod and say \"yes. You are right. The world needs this. The world needs you\" as I transport myself back to the future. The future he will take the world to will undoubtedly be a different, but hopefully, I can make everything better in this time-line.\n\n \n","page 166":"As soon as my future self returns after sending me to the future, I appear behind him. He turns around and says \"welcome back.\"\n\nHe is twitching. This is definately the guy.\n\n\"You were expecting me?\"\n\n\"Of course. I learned to do it, so it was quite obvious you would as well.\"\n\n\"I have seen what you will do. Do you know what you\u0027re going to do?\"\n\n\"Whatever I must.\"\n\n\"Did you know that you\u0027ll kill the Imperfects?\"\n\nHe pauses for a little moment and then says \"then they gave me no choice. You have been to the future, my future. You have seen what I am fighting for.\"\n\n\"And the people you\u0027re going to kill? All those innocents?\"\n\n\"And what about the innocents that die in the war? Innocents killed by their own governments? Innocent kind people forced to fight for their lives because of the ignorance and stupidity of others? What about them?\"\n\n\"That doesn\u0027t give you the right to kill...\"\n\n\"Why not? Why not kill the ignorant ones that caused all this? Are they not to blame? Is that not the fate they deserve, Karma? You saw what is going to happen. You witnessed a future where heroes were killed for standing up for what\u0027s right. I sent you there to show you the truth. Did you learn nothing?\"\n\n\"Is that why you sent me there? To show me what was going to happen?\"\n\n\"In part, yes. I knew you\u0027d learn to time travel eventually and that you\u0027d return as soon as you did.\"\n\n\"You knew? I guess that\u0027s what you did? If I\u0027m encountering myself from the future, then surely, you must have encountered yourself from the future once.\"\n\n\"No. That is not how time works. The universe does not expect time travel. I never encountered myself from the future, and if I had, I would have let him continue his work and go back to the future.\"\n\n\"Go back to the future? Why? If you\u0027d truly agree with him, then why wouldn\u0027t you just stay and support him?\"\n\n\"That\u0027s the second reason I sent you away. The universe consists of a certain amount of energies, systematically growing, but constantly reusing its energies for everything that it consists of. Rain evaporates and turns to clouds, clouds then morph into rain or snow and go back to the earth, where they refil the waters, or the snow melts. Either way, they turn to water again, just to evaporate all over again. An antilope eats grass, and then gets eaten by a lion. The lion dies of old age and turns to dirt. From the dirt, grass grows and antilopes eat the grass, and are then eaten by other lions. Everything is recycled. But when we time-travel, we don\u0027t use energies from the point of time we are going to, we take the energies we consist of from our point in time and are constructed of the very same energies once we arrive.\"\n\n\"What does that...\"\n\n\"What that means is that right now, the universe consists of too much energy, as we are both at the very same moment. When I replaced you, my energies fulfilled the gap the lack of your energies created, and your energies did the same when you took my place in the prison.\"\n\n\"And what happens then?\"\n\n\"Eventually, the universe collapses. I considered killing you, to make sure you couldn\u0027t interfere with my work, but if I did that, your energies would still exist in this universe, spread around as you had evaporated. Rain would have become clouds, and if I did that, I wouldn\u0027t be able to send the correct amount of energies out of this universe to create a suitable gap for me to fulfil. Besides, we are the same person. Surely, you must agree with me. Let me stay, and return to the future. Perhaps there is still something you can do to fix it.\"\n","page 168":"\"I have experienced much in my life-time, considering how short it is. Three years ago, I was freed from that vat. I hadn\u0027t experienced anything, my ideology wasn\u0027t developed, and since then, I have soaked information, constantly trying to determine what I think \u0027right\u0027 is. But no matter how much I have changed, no matter what I believed in, I always swore to myself I would never cross this threshold. I have always promised myself never to become a tyrant.\"\n\n\"You think I\u0027ve crossed that line? I\u0027ve not.\"\n\n\"You\u0027re basically saying \u0027do what I want you to or die\u0027. How is that not tyranny?\"\n\n\"I am not doing this for selfish reasons. I am doing this for the good of mankind. Do you want a third world war? Do you want Eve to die? Do you want to have to kill innocent people or watch other innocent people die?\"\n\n\"What I want is irrelevant. You can\u0027t just force people to agree with you!\"\n\n\"The world is full of idiots, and it is destroying itself. If I have to be aggressive to make sure the society doesn\u0027t eat itself up, then I will.\"\n\n\"You think this justifies a massacre?\"\n\n\"I am older, I am more experienced. I know how the world works and what is necessary far better than you do. What you need to learn is that evil is sometimes necessary to achieve good results. You don\u0027t have to like it, but that\u0027s how it is. Before you proclaim me a villain, let me show you what I mean\" he says, grabs gently around my hand and transports both of us through time.\n","page 170":"We appear on the second floor of an ordinary house. It looks like it\u0027s around 1994, which would make it approximately 70 years ago.\n\nFuture Baryon enters a room, where the lights are turned off, and I see a small boy sleeping in the bed there.\n\n\"What is this?\"\n\n\"This is a bedroom. In five hours, this boy\u0027s alarm clock will ring, waking him up in time for his first day at school. There, he will grow an affinity for mathematics, and then later on, for science. He will graduate with examplary grades, and marry a co-worker of his, named Georgia. The two of them will have a daughter, and she will be named Dorothy. He becomes the head of the bio-division of Gorgon labs, working with Michael Thorne, and educating him in genetic modification. The boy will then help the police apprehend Thorne once it has become clear that he has been abusing his position, and shortly after that, religious extremists will burn down the lab, along with Georgia and Dorothy. He will make sure everyone believes he died in the fire as well, and makes a secret Gorgon labs facility in the desert his own private lab. There, he developes project Eden, but I think you know the story from this point.\"\n\n\"Meckard?\"\n\n\"Yes. This is a six year old Henry Meckard. He teaches Thorne all he needs to create his monstrosities, us included. He has part in the Reanimator incident and he starts project: Eden. You can end it, all of it. All you need to do is kill a currently innocent six year old boy.\"\n\n\"Why are you...\"\n\n\"I\u0027m trying to teach you, show you my point. If you kill him, you acknowledge that evil is often necessary to achieve good results.\"\n","page 171":"I channel myself into Meckard and kill him as painlessly as I can. Future Baryon smiles and says \"see? You killed him while he was innocent, to stop everything he will create.\"\n\n\"Why are we still here? Shouldn\u0027t we fade?\"\n\n\"As I said. The universe doesn\u0027t expect time travel. We won\u0027t be created in the future, but we still exist. We have created a new time-line, although we are still part of our own.\"\n\nI nod and teleport myself back to the future. He\u0027s right. I need to stay out of his way while he makes everything better.\n","page 174":"We appear on a rooftop in Gorgon city. Everything looks like it\u0027s been around 20 years since this was.\n\n\"Where are we?\"\n\n\"Look there\" Future Baryon says and points towards the street. I look down, and see a pregnant woman being attacked by thugs.\n\n\"What\u0027s going on?\"\n\n\"Those men work for Michael Thorne. Jeremy Reinhorn and Robert Gharus need an embryo for their attempt to construct a dark matter individual\" he says, looks at me and smirks.\n\n\"That...mom?\"\n\n\"Yes. Those men will kidnap her, Reinhorn will carve her up, feed her remains to Freakshow and turn the embryo into us. Not killing Meckard may have been a morally obvious decision here, but can you look upon them and stand by while they do this? You\u0027ve always felt her death was your fault. After all, if she hadn\u0027t been pregnant, she wouldn\u0027t have been targeted, would she? She was killed for being your mother.\"\n\n\"Stop it.\"\n\n\"You can\u0027t hide things from me Baryon. I know your thoughts. All of them. Don\u0027t hide from the truth, and save her!\"\n","page 173":"\"No. I refuse to kill him.\"\n\n\"But you can end everything...\"\n\n\"I won\u0027t kill someone innocent.\"\n\n\"So you would wait until after he\u0027s committed his atrocities? You would let people die before you strike, even though it changes nothing?\"\n\n\"It changes me. I am not a tyrant.\"\n\n\"Very well\" he says and grabs around my hand again, pulling us both into a vortex.\n","page 176":"\"Why haven\u0027t you saved her? How can you look upon this and not act? There is something you\u0027re not telling me.\"\n\n\"So I am right then? You are acknowledging that there is something that could cause you to let her meet her gruesome fate? If not, then why are you asking? If evil is not necessary to achieve good results, then you should rescue her no matter the consequences, right?\"\n","page 175":"I tear the skeleton out of one of the thugs, causing the rest of his jelly-like body to wriggle down and collapse. The other thug looks at his friend\u0027s remains, as I tear his eyeballs out and shove them down his throat. I then pop both of his eyeballs and use their insides to choke him to death. They deserved something more gruesome, but it was all I had at the moment.\n\nFuture Baryon then appears at my side as mother, understandable frightened by the whole event, runs away.\n\n\"Don\u0027t even try to tell me that was the wrong thing to do\" I growl at him.\n\nHe simply grabs my hand again and says \"lets see\" before we both vanish into a worm-hole again.\n","page 156":"I hurl a generator in his way, and the cannon causes a portion of the generator to vanish, not all of it however, and the missing portion causes the remains to explode in blinding light, temporarily giving me human form and allowing him to shoot me.\n","page 155":"I channel an electric wire of some sort to the portion of me that Paladin is firing at, causing that part of me to be illuminated and the baryonic shot goes through me and hits a wall behind me. The wall vanishes and reveals a giant power station behind it. Now he\u0027s charging his cannon so I should strike.\n","page 158":"With great force, I hurl a power generator at Paladin, and as his cannon is still charging, he is unable to vaporize it, so the generator hits him. Upon impact, the generator shatters, delivering a powerful electric jolt to him and throwing him into a wall. Paladin then falls to his knees but gets up quickly. He aims his cannon at me, but as he fires, he finds out that the electric shock has caused it to overload. He is helpless against me now.\n\n \n","page 159":"I channel myself at Paladin, grab around him and try throw him out. However, getting so close to his light-emitting armor forces me to materialize enough for him to bash me and take me out with a single hit.\n","page 161":"I connect the Paladin to the power station behind that vaporized wall, causing his entire armor to overload, and it fries him inside it. Paladin and his charred armor then collapse motionless to the floor, and the rest of the Imperfects cheer from above. The fight is over. Eve has been avenged.\n\n \n","page 163":"I transport myself back to the main area of the base, where I see Leksiah, smiling.\n\n\"You did it Baryon. You stopped him.\"\n\n\"It came with a cost.\"\n\n\"It always does.\"\n\n\"When Paladin shot someone other than me, they vanished. Why?\"\n\n\"You use baryons to control your mass, to control how atomized you are. When something fully atomized is filled with baryons, the mass becomes to much and it essentially forms a black hole, although the black holes are very small and so they are unable to sustain themselves.\"\n\n\"But...I can absorb baryons.\"\n\n\"Yes?\"\n\n\"So if I absorbed too much, I could turn into a black hole?\"\n\n\"Yes. You build up mass with it so your mass can go over the top as well.\"\n\n\"But what if I could survive it? They can\u0027t, all the others. They aren\u0027t made of dark-matter, but I am. What if I could survive a journey through a black hole?\"\n\n\"Then...I don\u0027t know. No one has done that...\"\n\n\"I think I have. Me from this future. You said I was twitching, and that twitching comes automatically when I grow older. The only way I could have stopped twitching, is if I am a younger version of the me you knew.\"\n\n\"So...you time travelled?\"\n\n\"Yes. What if I can absorb baryons to the point where I convert myself into a wormhole, and I can travel through it to another point in time? It explains everything, doesn\u0027t it? My lack of memories, my lack of twitching and it explains the other Baryon that there have never been any records of. The reason for that is that there is no second Baryon. That was me.\"\n\n\"Well, what are you going to do?\"\n\n\"I\u0027m going back to the past.\"\n","page 162":"I channel myself towards Grove, who is smiling.\n\n\"It\u0027s done. The Paladin\u0027s dead.\"\n\n\"Not without cost.\"\n\n\"It never is.\"\n\n\"Who was the Paladin?\"\n\n\"He used to be a friend. Hell, he even used to be my bodyguard. But it doesn\u0027t matter now. He was one of the bad guys and he\u0027s dead.\"\n\n\"When he shot things, they vanished in a black hole, why?\"\n\n\"Well, your amount of baryons controls your mass, doesn\u0027t it? Removing them allows you to walk through walls and ignore gravity, and absorbing them allows you to touch things and punch bad guys? I imagine that when something fully atomized is filled with baryons, it\u0027s mass becomes too great for itself and it becomes a black hole, although the black holes created from a chair seem to small to sustain themselves, so it vanishes immediately.\"\n\n\"I...what happens to them?\"\n\n\"People that go through a black hole? They die?\"\n\n\"And me?\"\n\n\"Well, you\u0027ve never gone through a black hole. Paladin\u0027s cannon didn\u0027t do that to you.\"\n\n\"But I can absorb baryons. I can build up too much mass on my own, but I am made of dark-matter. What if I can survive it?\"\n\n\"Survive a black hole?\"\n\n\"The last thing I saw was a twitching version of me, and then I woke up in the vat, the very same place Paladin took a twitching version of me after the fight between the two of them. I think...I think I understand it now. I never had my memories removed. Me from the future learned to turn himself into a wormhole and travel through time. He switched places, put me in the future and went into my past.\"\n\n\"Then what are you going to do?\"\n\n\"I\u0027m going back to the past.\"\n","page 165":"As soon as I absorb an amount of baryons far beyond anything I have done before, I feel exactly the same thing I felt when my future self transported me to the future. I am absorbed into nothingness, and for a while, I almost feel non-existant. There are...like thousands of screens before me. No, more, much more. In fact, the highest number conceivable by a human mind couldn\u0027t even describe a fraction of how many they are. And they\u0027re not screens, not exactly. They are more of projections of the universe. Each one as large as the universe is at any given moment, and even despite how large each of the projections are, I have perfect oversight over each inch of the universe at each moment. These projections, they display every moment as a still \u0027frame\u0027 the universe has ever experienced, and I quickly spot the one I\u0027m heading to, the moment by future self sent me back in time. I can see, as I skim through the projections, that in the future, he\u0027s going to annihilate a city, trying to force Novarra to change the law. As most countries, they don\u0027t take kindly to terrorism, so they try to fight back, and when he returns, he both annihilates another city, as he had promised, and kills everyone trying to attack him. Soon, the Imperfects get wind of what\u0027s going on, and they strike. Eve is not physically able to enter combat due to her pregnancy, so Freakshow acts as field commander. Future Baryon kills them, even though he could easily just render freeze them in the night. I\u0027ve seen enough. I have to stop him.\n","page 164":"As soon as I absorb an amount of baryons far beyond anything I have done before, I feel exactly the same thing I felt when my future self transported me to the future. I am absorbed into nothingness, and for a while, I almost feel non-existant. There are...like thousands of screens before me. No, more, much more. In fact, the highest number conceivable by a human mind couldn\u0027t even describe a fraction of how many they are. And they\u0027re not screens, not exactly. They are more of projections of the universe. Each one as large as the universe is at any given moment, and even despite how large each of the projections are, I have perfect oversight over each inch of the universe at each moment. These projections, they display every moment as a still \u0027frame\u0027 the universe has ever experienced, and I quickly spot the one I\u0027m heading to, the moment by future self sent me back in time. I can see, as I skim through the projections, that in the future, he\u0027s going to annihilate a city, trying to force Novarra to change the law. As most countries, they don\u0027t take kindly to terrorism, so they try to fight back, and when he returns, he both annihilates another city, as he had promised, and kills everyone trying to attack him. Soon, the Imperfects get wind of what\u0027s going on, and they strike. Eve is not physically able to enter combat due to her pregnancy, so Freakshow acts as field commander. Future Baryon kills them, even though he could easily just render freeze them in the night. I\u0027ve seen enough. I have to stop him.\n","page 189":"I channel myself towards day-time, and he follows me, just like I had anticipated. We are approximately above the Atlantic ocean, where I come to a halt. I am just a few feet from the sun-light, and the plan is to lure him into it, permanently defeating him. However, he seems to realize this, and instead, he channels himself directly at me and rams me into the light, causing me to evaporate.\n","page 190":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 192":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 191":"I channel myself at Future Baryon until I come into direct contact with him. Then, I transport us both so far into the future, it might as well be millions of years. And when we arrive there, we see that it very well might be. Humanity may not have been elimenated by Virus anymore due to Future Baryon, but it seems humanity went extinct at some point anyway, and now dolphins seem to have evolved into the next intellectual creatures. Whatever happened to humanity seems to have taken all land-creatures with them, leaving just the subsurface ones left.\n\n \n","page 194":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 193":"With most land-creatures still in very early stages of evolution, the entire surface is virtually open for us to fight, so I stay in the air as I battle it out with my future self.\n\n \nWe channel ourselves at one another periodically, until I end beneath him and he slams himself on top of me.\n","page 196":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 195":"I channel myself and Future Baryon as low as I can, where there is absolutely no light, but at the same time, there is no oxygen either. I hope this will work to kill him, but then I realize that this might kill me as well. Refusing to die, Future Baryon transports himself, and therefore me as well, through a vortex.\n\n \n","page 198":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 197":"We appear in the middle of Italy during the Renaissance.\n\n\"Ah. The Renaissance. We\u0027ve always been fond of the Renaissance, haven\u0027t we?\" Future Baryon says as he pauses the battle for a little bit. He then adds \"it is a wonderful sight, isn\u0027t it?\" before channeling himself at me, ramming me away and knocking me into a building.\n\nI channel myself away from the building, grab around him and we both go flying away from Italy. Suddenly, we hit something we seem unable to phase through, although I don\u0027t exactly see what it is, and I can\u0027t pay attention to it as the fight continues. The impact freed him from my grasp however, and he then rams me and transports us a minute back in time.\n\n We continue the fight, but he hurls me away, directly into myself from earlier in the fight, allowing the past me to let go of the Future Baryon he\u0027s fighting, and they both then go back in time, to reach the same moment we\u0027re in now. He\u0027s playing it smart. I\u0027m going to have to play it smart too.\n","page 178":"I nod and say \"yes. You are right. The world needs this. The world needs you\" as I transport myself back to the future. The future he will take the world to will undoubtedly be a different, but hopefully, I can make everything better in this time-line.\n\n \n","page 177":"I tear the skeleton out of one of the thugs, causing the rest of his jelly-like body to wriggle down and collapse. The other thug looks at his friend\u0027s remains, as I tear his eyeballs out and shove them down his throat. I then pop both of his eyeballs and use their insides to choke him to death. They deserved something more gruesome, but it was all I had at the moment.\n\nFuture Baryon then appears at my side as mother, understandable frightened by the whole event, runs away.\n\n\"Don\u0027t even try to tell me that was the wrong thing to do\" I growl at him.\n\nHe simply grabs my hand again and says \"lets see\" before we both vanish into a worm-hole again.\n","page 179":"We materialize in an empty destroyed world. It\u0027s earth, but there is not a living soul on it. Cars, houses, cities are still here, but no living people. Just corpses.\n\n\"What happened here?\"\n\n\"You rescued your mother. That\u0027s what happened.\"\n\n\"How does that...\"\n\n\"In doing so, you removed yourself from this time-line. Everything else still happens. Project-Eden, the reanimator incident, cloning. It all happens without you. Including Virus.\"\n\n\"Virus?\"\n\n\"The death of Andrew Carlyle had nothing to do with you, so it happens exactly like it did in your time-line. Frederick Carlyle\u0027s cloning of his son also had nothing to do with you, so that happens as well. The failure that occurred in the cloning also had nothing to do with you, so Andrew\u0027s first clone becomes Grove, despite your inexistance, and Frederick Carlyle reclones his son, as you had nothing to do with that either. Virus is still created.\"\n\n\"But without me, that generator is never...\"\n\n\"Virus doesn\u0027t need the generator. Without it, the process is slow, but, like a virus, he drains everything of energy until there is nothing left, and then he wriggles up and dies due to nothing being left. He kills the Imperfects, at least the ones that didn\u0027t die in the fight with Hybrid. Both Brute and Freakshow died in that fight due to your absence. Everyone on the entire planet has had his brainwaves drained. All because you weren\u0027t here to stop him. All because you had to save your mother. What a selfish thing to do, right?\"\n\n\"But...\"\n\n\"But what? But it was the right thing to do? Sometimes the wrong thing to do is the right thing to do, and sometimes, the right thing to do is the wrong thing to do. Things aren\u0027t as simple as you\u0027d like them to be. Now all you have to do, is go back in time and make sure your mother meets her gruesome fate.\"\n\n\"No. You can\u0027t ask me to...\"\n\n\"You are a time traveller Baryon! You changed the fate of the world for the worse, and now it is your responsibility to change it back.\"\n\n\"But...no...I can\u0027t...\"\n\n\"You must. You created this situation. This is on you. Perform a single act of evil, and save humanity from extinction.\"\n","page 181":"\"No. I\u0027ll find another way. Maybe someone else can become Baryon...\"\n\n\"You\u0027re telling me you would spare our mother and have another woman go through her gruesome death? Another child has his future taken away from him, as he is turned into a dark-matter monster like us? Who\u0027s being the bad guy now Baryon? Does anyone else deserve this? You can\u0027t just move the problem somewhere else. You have to face it!\"\n\n\"Not by doing the wrong thing!\"\n\n\"You\u0027re telling me that your idea of right is to let humanity die just because you can\u0027t accept that your mother has to die!\"\n\n\"No one has to die!\"\n\n\"Then what do you intend to do?\"\n\n\"I...I\u0027ll stop Virus myself.\"\n\n\"I am trying to teach you here! You are so insistant upon avoiding the problem that you can\u0027t learn. No wonder nobody could teach me properly, if this is what they had to deal with. You are not from the time-line you are creating here. This time-line has no Baryon.\"\n\n\"That doesn\u0027t mean I can\u0027t interfere.\"\n\n\"Then you\u0027ll never learn! You\u0027ll never learn that evil is necessary to achieve good!\"\n\n\"That\u0027s because you\u0027re wrong. You have nothing to teach!\"\n\n\"Was I ever so ignorant? Was I like this? Refusing to see the truth? Refusing to accept the cold, harsh truth? Whether our mother of this time-line lives or dies is irrelevant. Whether Virus kills the people of this time-line is also irrelevant. All that matters is that you acknowledge that it was good that created this problem, and only evil can solve it.\"\n\n\"No. Good can solve it. Good will solve it. The right thing is always the right thing and the wrong thing is always the wrong thing. There is no other truth. There is no simpler or more complicated way of putting it.\"\n\n\"You won\u0027t accept my teachings, will you? I didn\u0027t want it to come to this, but you leave me no choice. I can\u0027t have someone interfere with my work. I will prevent the war no matter the cost. I will teach Novarra not to oppress mutants no matter the cost. I will educate the world no matter the cost. Even if it means killing you.\"\n","page 180":"I know that he\u0027s right. I don\u0027t like it, but I created this situation, and so fixing it is my responsibility. I transport myself back to the moment where I stopped the thugs, and this time, I keep myself from attacking the thugs.\n\n\"No! What are you doing?\" Past Baryon shouts, but I make sure I suppress the soundwaves so the others don\u0027t hear it.\"\n\n\"You can\u0027t do this. I know how painful it is...but she has to die.\"\n\n\"No. You can\u0027t...\"\n\n\"If she doesn\u0027t die, then humanity as a whole will perish.\"\n\nHe hesitates a little, but then he nods. Future Baryon from that moment approaches both of us and says \"he is right. Now we should hurry and separate before the universe unravels due to three of us being in the same moment of time.\"\n\nHe then transports himself to the future I am from, and I return to the apocalyptic future of the mutant war. Future Baryon was right. I should just let him deal with this.\n","page 183":"We clash directly at one another and soar into the sky above, He punches me, and I try to phase through it, but he can turn to the same level of existance that I can, and so he hits me regardless. I\u0027m not used to getting hit with such power. The hit nearly shatters my head, but we\u0027re in the night, so it regenerates almost instantly. I channel myself at him, ramming him, and pushing him away from a certain area, freeing it up for me, so I channel myself there. However, the night is infinite, so it\u0027s not like either one of us has done anything to push the battle into our favor yet.\n","page 185":"I rip up a mountain and throw it at him. He simply phases through it and ignores it. He doesn\u0027t try to use it as me, as he realizes that I could phase through it just as easily as he can.\n","page 187":"We\u0027re in the future where Virus has annihilated everything, so I take Future Baryon to the past of that time-line, where Virus is at the peak of his power, hoping to use Virus to combat him. We appear close to Virus, and he is obviously confused by us, as nothing like us exists in this time-line. He however says nothing and tries to blast us both with his electricity. While combating both me and Virus, Future Baryon lifts up the Pacific ocean and throws it directly onto Virus, killing him exactly the same way I did all those years ago. If only I had realized to do that back then.\n\n \n","page 186":"I channel myself towards day-time, and he follows me, just like I had anticipated. We are approximately above the Atlantic ocean, where I come to a halt. I am just a few feet from the sun-light, and the plan is to lure him into it, permanently defeating him. However, he seems to realize this, and instead, he channels himself directly at me and rams me into the light, causing me to evaporate.\n","page 199":"We appear in the middle of Italy during the Renaissance.\n\n\"Ah. The Renaissance. We\u0027ve always been fond of the Renaissance, haven\u0027t we?\" Future Baryon says as he pauses the battle for a little bit. He then adds \"it is a wonderful sight, isn\u0027t it?\" before channeling himself at me, ramming me away and knocking me into a building.\n\nI channel myself away from the building, grab around him and we both go flying away from Italy. Suddenly, we hit something we seem unable to phase through, although I don\u0027t exactly see what it is, and I can\u0027t pay attention to it as the fight continues. The impact freed him from my grasp however, and he then rams me and transports us a minute back in time.\n\n We continue the fight, but he hurls me away, directly into myself from earlier in the fight, allowing the past me to let go of the Future Baryon he\u0027s fighting, and they both then go back in time, to reach the same moment we\u0027re in now. He\u0027s playing it smart. I\u0027m going to have to play it smart too.\n","page 19":"With that said, I give the bullets a momentum exactly as fast as when I stopped it, towards the body guards, causing them to pierce through their bodies and kill them. I then drop the car, still suppressing the soundwaves.\n","page 18":"The look on the faces of those bodyguards when the car-doors fly off and the car starts hovering about twelve feet above the ground. In panic, they look around, and I materialize my green glowing eyes just outside the car, to give them a face to connect to their fears. They start shooting at me, but I stop the bullets in mid-air and suppress any soundwaves, to make sure no one is alert to what is going on.\n\n\"Its a funny thing isn\u0027t, the human nature? It seems that everyone has one of two automatic responses to something they find horrifying. They either scream, alerting whatever it is they are scared of to their position with as loud a noise as they can possibly conjure, or respond with violence, hoping to kill it before it kills them. No one ever considers that maybe, if you ignore it, it ignores you. You see, everything you do has a reaction. The stronger the act, the stronger is the reaction.\"\n\n\"Who...who are you?\"\n\n\"The press seems to call me Karma. You do know what Karma is, don\u0027t you?\"\n\n\"I...it...\"\n\n\"Karma is a negative reaction that reacts to negative actions. So tell me, if you shoot at Karma, what do you think Karma does to you?\"\n","page 11":"\"There are innocent people being arrested? Just for being mutants?\"\n\n\"They claim it\u0027s because of the damage they can cause.\"\n\n\"They\u0027re not even given the chance to prove them wrong. They deserve more, they deserve to be free. I am going to free them.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us. We mutants have to stick together, have each other\u0027s backs.\"\n","page 10":"\"Philias Unon is responsible for this, isn\u0027t he?\"\n\n\"He initiated this law, yes.\"\n\n\"Then he will suffer for the harm he has brought onto innocents.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us.\"\n","page 13":"\"I\u0027m not going to stop you, so sure, you can come along. Can you keep up?\"\n\nLeksiah closes her eyes and starts to concentrate. She then begins to float over the ground, and levitates herself further up. However, I can feel her mind hurting, and she is forced to let go of herself. She falls down, but I keep her from landing on the ground.\n\n\"Nice, but if you\u0027re going to come along, I\u0027ll have to take you with me.\"\n\nLeksiah nods, and then she asks \"it\u0027s night-time, and I don\u0027t know where Unon lives.\"\n\nWhile she says this, I channel myself around every corner of Novarra, that isn\u0027t lit up, listening to everything everyone has to say. Most people ar asleep, but Unon has bodyguards specifically hired to guard him during the night, and they have to stay awake. I locate them, in the Novarran capital of Sanroe, as I hear them mention Unon by name. I transport Leksiah there, who immediately starts looking around as if confused. She is quick to realize what happened though. Possibly due to her hyper-intelligence.\n","page 12":"\"Philias Unon is responsible for this, isn\u0027t he?\"\n\n\"He initiated this law, yes.\"\n\n\"Then he will suffer for the harm he has brought onto innocents.\"\n\n\"Can...can I come with you?\" Leksiah asks me.\n\n\"You want to come with me?\"\n\n\"Yes. To them, we\u0027re just freaks, to them, we are the same. This is my fight too, and if we fight it together, then perhaps we can give them a message that if they want to take on one of us, they\u0027ll have to take on all of us.\"\n","page 15":"I walk through the wall outside Unon\u0027s house, and go to his bedroom. He\u0027s sleeping there, next to his wife, but by the time he wakes up, he finds himself in the center of the Antarctica. I keep enough cold outside the dome I have formed around us, but still allow enough cold inside to give him the feeling of being in the Antarctica.\n\nUnon wakes up, and looks around. He then looks at my floating green eyes.\n\n\"Wha...what\u0027s going on?\" he says and sits up in his bed.\n\n\"That\u0027s what I was going to ask you. Innocent people are being attacked, and I\u0027ve heard you\u0027re responsible.\"\n\n\"What are you talking about? You mean the freaks?\"\n\nI channel myself into Unon\u0027s body and inflict pain to him. It\u0027s not much compared to what I can do, but to a snob like him, it\u0027s complete hell. I then say \"Are you or aren\u0027t you responsible?\"\n\n\"I...I am protecting the people of Novarra.\"\n\n\"What happens when you have to protect them from yourself?\"\n\n\"Do you have any idea how many people have been hurt...\"\n\n\"Do you have any idea how many innocent people have lost their freedom because of you? Do you even care?\"\n\n\"Of course I...\"\n\n\"You know, I was just going to kill you and call it a day...well...call it a night. But you never killed anyone, did you? You just took away their freedom.\"\n\n\"So...so what are you going to do?\" he says, and I can feel by his heartbeat that he is scared shitless.\n\nI start channeling myself and Unon back towards his house.\n\n\"By the time your wife wakes up, you\u0027ll be in lying next to her in your bed. At first, she\u0027ll think you\u0027ll be sleeping, but later, she\u0027ll realize that you are wide awake, unable to move any part of your body. I am going to trap you in your own body. You\u0027ll be able to think, and see, and hear, but you won\u0027t be able to move or talk for the rest of your life. A fitting fate for someone like you\" I say and then disconnect his brain from most of the functions of his body. I then go back to his house and put him back into his bed.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 14":"\"I work on my own.\"\n\n\"But...then...where can I go? Should I go back to my family?\"\n\n\"In my opinion, they don\u0027t deserve to be called that anymore.\"\n\nLeksiah looks around, and I say \"listen, if you go to Gorgon city, you\u0027ll find a group of mutants that will provide shelter, and more importantly, a family for you.\"\n\n\"The...The Imperfects?\"\n\n\"You have heard of them?\"\n\n\"Most people have.\"\n\nI am surprised she hasn\u0027t heard of me, but then again, I haven\u0027t been part of the team for several months, and it sounded like she only got away from the man who warped her mental activity after I had been imprisoned in the Isolation.\n\nI then leave Leksiah, and channel myself around every corner of Novarra, that isn\u0027t lit up that is, listening to everything everyone has to say. Most people are asleep, but Unon has bodyguards specifically hired to guard him during the night, and they have to stay awake. I locate them, in the Novarran capital of Sanroe, as I hear them mention Unon by name.\n","page 17":"The look on the faces of those bodyguards when the car-doors fly off and the car starts hovering about twelve feet above the ground. In panic, they look around, and I materialize my green glowing eyes just outside the car, to give them a face to connect to their fears. They start shooting at me, but I stop the bullets in mid-air and suppress any soundwaves, to make sure no one is alert to what is going on.\n\n\"Its a funny thing isn\u0027t, the human nature? It seems that everyone has one of two automatic responses to something they find horrifying. They either scream, alerting whatever it is they are scared of to their position with as loud a noise as they can possibly conjure, or respond with violence, hoping to kill it before it kills them. No one ever considers that maybe, if you ignore it, it ignores you. You see, everything you do has a reaction. The stronger the act, the stronger is the reaction.\"\n\n\"Who...who are you?\"\n\n\"The press seems to call me Karma. You do know what Karma is, don\u0027t you?\"\n\n\"I...it...\"\n\n\"Karma is a negative reaction that reacts to negative actions. So tell me, if you shoot at Karma, what do you think Karma does to you?\"\n","page 16":"I walk through the wall outside Unon\u0027s house, and go to his bedroom. He\u0027s sleeping there, next to his wife, but by the time he wakes up, he finds himself in the center of the Antarctica. I keep enough cold outside the dome I have formed around us, but still allow enough cold inside to give him the feeling of being in the Antarctica.\n\nUnon wakes up, and looks around. He then looks at my floating green eyes.\n\n\"Wha...what\u0027s going on?\" he says and sits up in his bed.\n\n\"That\u0027s what I was going to ask you. Innocent people are being attacked, and I\u0027ve heard you\u0027re responsible.\"\n\n\"What are you talking about? You mean the freaks?\"\n\nI channel myself into Unon\u0027s body and inflict pain to him. It\u0027s not much compared to what I can do, but to a snob like him, it\u0027s complete hell. I then say \"Are you or aren\u0027t you responsible?\"\n\n\"I...I am protecting the people of Novarra.\"\n\n\"What happens when you have to protect them from yourself?\"\n\n\"Do you have any idea how many people have been hurt...\"\n\n\"Do you have any idea how many innocent people have lost their freedom because of you? Do you even care?\"\n\n\"Of course I...\"\n\n\"You know, I was just going to kill you and call it a day...well...call it a night. But you never killed anyone, did you? You just took away their freedom.\"\n\n\"So...so what are you going to do?\" he says, and I can feel by his heartbeat that he is scared shitless.\n\nI start channeling myself and Unon back towards his house.\n\n\"By the time your wife wakes up, you\u0027ll be in lying next to her in your bed. At first, she\u0027ll think you\u0027ll be sleeping, but later, she\u0027ll realize that you are wide awake, unable to move any part of your body. I am going to trap you in your own body. You\u0027ll be able to think, and see, and hear, but you won\u0027t be able to move or talk for the rest of your life. A fitting fate for someone like you\" I say and then disconnect his brain from most of the functions of his body. I then go back to his house and put him back into his bed.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 29":"I levitate all the guards into the air, as they struggle helplessly to free themselves.\n\n\"There are innocent people locked up in here you know. You accept money for keeping them imprisoned? You make money on their misery? You people are despicable\" I say as I tear them inside out.\n","page 22":"I walk through the wall outside Unon\u0027s house, and go to his bedroom. He\u0027s sleeping there, next to his wife, but by the time he wakes up, he finds himself in the center of the Antarctica. I keep enough cold outside the dome I have formed around us, but still allow enough cold inside to give him the feeling of being in the Antarctica.\n\nUnon wakes up, and looks around. He then looks at my floating green eyes.\n\n\"Wha...what\u0027s going on?\" he says and sits up in his bed.\n\n\"That\u0027s what I was going to ask you. Innocent people are being attacked, and I\u0027ve heard you\u0027re responsible.\"\n\n\"What are you talking about? You mean the freaks?\"\n\nI channel myself into Unon\u0027s body and inflict pain to him. It\u0027s not much compared to what I can do, but to a snob like him, it\u0027s complete hell. I then say \"Are you or aren\u0027t you responsible?\"\n\n\"I...I am protecting the people of Novarra.\"\n\n\"What happens when you have to protect them from yourself?\"\n\n\"Do you have any idea how many people have been hurt...\"\n\n\"Do you have any idea how many innocent people have lost their freedom because of you? Do you even care?\"\n\n\"Of course I...\"\n\n\"You know, I was just going to kill you and call it a day...well...call it a night. But you never killed anyone, did you? You just took away their freedom.\"\n\n\"So...so what are you going to do?\" he says, and I can feel by his heartbeat that he is scared shitless.\n\nI start channeling myself and Unon back towards his house.\n\n\"By the time your wife wakes up, you\u0027ll be in lying next to her in your bed. At first, she\u0027ll think you\u0027ll be sleeping, but later, she\u0027ll realize that you are wide awake, unable to move any part of your body. I am going to trap you in your own body. You\u0027ll be able to think, and see, and hear, but you won\u0027t be able to move or talk for the rest of your life. A fitting fate for someone like you\" I say and then disconnect his brain from most of the functions of his body. I then go back to his house and put him back into his bed.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 21":"I walk through the wall outside Unon\u0027s house, and go to his bedroom. He\u0027s sleeping there, next to his wife, but by the time he wakes up, he finds himself in the center of the Antarctica. I keep enough cold outside the dome I have formed around us, but still allow enough cold inside to give him the feeling of being in the Antarctica.\n\nUnon wakes up, and looks around. He then looks at my floating green eyes.\n\n\"Wha...what\u0027s going on?\" he says and sits up in his bed.\n\n\"That\u0027s what I was going to ask you. Innocent people are being attacked, and I\u0027ve heard you\u0027re responsible.\"\n\n\"What are you talking about? You mean the freaks?\"\n\nI channel myself into Unon\u0027s body and inflict pain to him. It\u0027s not much compared to what I can do, but to a snob like him, it\u0027s complete hell. I then say \"Are you or aren\u0027t you responsible?\"\n\n\"I...I am protecting the people of Novarra.\"\n\n\"What happens when you have to protect them from yourself?\"\n\n\"Do you have any idea how many people have been hurt...\"\n\n\"Do you have any idea how many innocent people have lost their freedom because of you? Do you even care?\"\n\n\"Of course I...\"\n\n\"You know, I was just going to kill you and call it a day...well...call it a night. But you never killed anyone, did you? You just took away their freedom.\"\n\n\"So...so what are you going to do?\" he says, and I can feel by his heartbeat that he is scared shitless.\n\nI start channeling myself and Unon back towards his house.\n\n\"By the time your wife wakes up, you\u0027ll be in lying next to her in your bed. At first, she\u0027ll think you\u0027ll be sleeping, but later, she\u0027ll realize that you are wide awake, unable to move any part of your body. I am going to trap you in your own body. You\u0027ll be able to think, and see, and hear, but you won\u0027t be able to move or talk for the rest of your life. A fitting fate for someone like you\" I say and then disconnect his brain from most of the functions of his body. I then go back to his house and put him back into his bed.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 24":"\"I\u0027m not going to stop you, so sure, you can come along. Can you keep up?\"\n\nLeksiah closes her eyes and starts to concentrate. She then begins to float over the ground, and levitates herself further up. However, I can feel her mind hurting, and she is forced to let go of herself. She falls down, but I keep her from landing on the ground.\n\n\"Nice, but if you\u0027re going to come along, I\u0027ll have to take you with me.\"\n\nLeksiah nods, and then she asks \"Do you know where the prison is?.\"\n\nAfter channeling myself around the entire country, I say \"I do now.\"\n","page 23":"As I channel myself around Asia and Australia, punishing the unjust, I start to wonder what effects my actions will have. I start to wonder if people can accurately guess what caused Unon\u0027s sudden paralysis, and wonder if they\u0027ll classify it as irrelevant to this anti-mutant law. Unon still got what he deserved, but I had hoped I would be able to use his fate to provide an impact to those that support this monstrous law.\n\n \nI then feel the sun pull away from America, and Gorgon city. I could visit the Imperfects if I wanted.\n","page 26":"I channel myself into the Novarran prison. The lights are on inside the prison, of course, so I have to focus on taking them out by throwing things from the shadows at them before unleashing my full devestation onto the guards trying to stop me. I eventually levitate one of the guards into the air, seeking to have a little chat with him.\n\n\"The mutants, where are the mutants you keep you here?\"\n\nThe man just looks around in a panic, an expected reaction to his current situation. But as he does not answer, I repeat the question: \"Where are the mutants? There must be special cells created for them.\"\n\nThe man hesitantly points towards the left cell-block.\n","page 25":"\"I work on my own.\"\n\n\"But...then...where can I go? Should I go back to my family?\"\n\n\"In my opinion, they don\u0027t deserve to be called that anymore.\"\n\nLeksiah looks around, and I say \"listen, if you go to Gorgon city, you\u0027ll find a group of mutants that will provide shelter, and more importantly, a family for you.\"\n\n\"The...The Imperfects?\"\n\n\"You have heard of them?\"\n\n\"Most people have.\"\n\nI am surprised she hasn\u0027t heard of me, but then again, I haven\u0027t been part of the team for several months, and it sounded like she only got away from the man who warped her mental activity after I had been imprisoned in the Isolation.\n\nI then leave Leksiah, and channel myself around every corner of Novarra, that isn\u0027t lit up that is, until I find the prison. That must be where the mutants are.\n","page 28":"I throw the doors inwards, crushing one of the guards there, lying in wait after he heard the noise of the little ruckus here. I then approach the cells, and see several mutants behind bars. I tear open all the cells, and the mutants leave their cells. One of them, a woman that appears to have a weak mutation of the Muscle mutagen Stephan Lite had developed, approaches me.\n\n \n\"You...you are an Imperfect?\"\n\n\"Not anymore.\"\n\n\"I knew people wouldn\u0027t just let this happen.\"\n\nI then notice another cell, one that seems more reinforced than the others. It\u0027s nothing against me, but it seems this mutant was considered more dangerous than the others.\n\n\"Who\u0027s in there?\" I ask the woman.\n\n\"That\u0027s a mutant called Claymore. He...collected faces...I\u0027m told.\"\n","page 27":"I channel myself into the Novarran prison. The lights are on inside the prison, of course, so I have to focus on taking them out by throwing things from the shadows at them before unleashing my full devestation onto the guards trying to stop me. I eventually levitate one of the guards into the air, seeking to have a little chat with him.\n\n\"The mutants, where are the mutants you keep you here?\"\n\nThe man just looks around in a panic, an expected reaction to his current situation. But as he does not answer, I repeat the question: \"Where are the mutants? There must be special cells created for them.\"\n\nThe man hesitantly points towards the left cell-block.\n","page 20":"I pause for a moment, and then add \"given the fact that you are just doing your job, and have no incentive otherwise to associate yourself with this monster of a man that calls himself Philias Unon, I am going to ignore the fact that you shot at me and let you live. However, I suggest you find yourselves a new line of work, and if not, then at least familiarize yourselves with your client\u0027s actions and motives.\"\n\nI then put the car down, and the two men go running away.\n","page 200":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 202":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 201":"We appear in the middle of Italy during the Renaissance.\n\n\"Ah. The Renaissance. We\u0027ve always been fond of the Renaissance, haven\u0027t we?\" Future Baryon says as he pauses the battle for a little bit. He then adds \"it is a wonderful sight, isn\u0027t it?\" before channeling himself at me, ramming me away and knocking me into a building.\n\nI channel myself away from the building, grab around him and we both go flying away from Italy. Suddenly, we hit something we seem unable to phase through, although I don\u0027t exactly see what it is, and I can\u0027t pay attention to it as the fight continues. The impact freed him from my grasp however, and he then rams me and transports us a minute back in time.\n\n We continue the fight, but he hurls me away, directly into myself from earlier in the fight, allowing the past me to let go of the Future Baryon he\u0027s fighting, and they both then go back in time, to reach the same moment we\u0027re in now. He\u0027s playing it smart. I\u0027m going to have to play it smart too.\n","page 204":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 203":"I transport us to my battle with the Paladin, where the Alliance troopers are attacking the Imperfect base. Paladin defeated him at some point, although he had not learned to time travel then. Hopefully, I can use the Paladin to defeat him here.\n\nPaladin is fighting Past Baryon, but sees me and Future Baryon, and tries to shoot us too.\n\n\"What is this? More of them?\"\n\nPaladin charges his cannon and seems to be aiming for any of us Baryons. Before, he always hit me because I was everywhere. Here however, there are three of us. He can\u0027t hit us all, and I\u0027ve got to make sure he hits Future Baryon.\n","page 206":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 205":"Future Baryon and I grab around one another and I lead the fight into the ground. I phase through it, and in order to keep the battle going, so does he, as otherwise he wouldn\u0027t be on the same plain of existance I was on and therefore wouldn\u0027t be able to touch me.\n\nWe keep going closer to the center, whilst grappling one another, until we reach the very core of the Earth. The intense light emitting from the core annihilates both of us, but at least he won\u0027t hurt anyone anymore.\n","page 33":"Claymore deserves to have his freedom taken, so I leave him in his cell.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 208":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 32":"I tear open Claymore\u0027s cell and enter it.\n\n\"So, I heard you like tearing people\u0027s faces off?\"\n\nClaymore looks at me and gives a psychotic but vicious grin. His grin vanishes as I slowly peel the flesh from his skull, pull his eyes out of his sockets, while keeping him alive for as long as possible. He starts screaming put of pain, but soon dies due to lack of blood.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 207":"I channel myself at Future Baryon and transport us to the universe before the big bang occurred. It is just a void. Nothing in it. Just darkness, and now the two of us. The feeling of omnipotence is entoxicating, orgasmic even. But I can\u0027t afford to enjoy that right now.\n\nI channel myself towards Future Baryon and he channels himself towards me as well, resulting in an infinately growing clash. There is no limit for our power here, so we are constantly increasing the power we use as we try to overpower one another. Our power ncreases equally, so neither one of us succeeds.\n\n\"Give it up. I am older. I am more experienced. I know more about how we work. I am better trained, and I am fighting for the just cause. You can\u0027t stand against me.\"\n\n\"You\u0027re right. You are better trained. You are more experienced. You are older. You are closer to our inevitable demise.\"\n\nIronically, he never witnessed his own future, but I did. I was the one Leksiah told about our deterioration, so our power increases without him knowing the consequences. The limit his unstable body can take is lower than mine, so he unravels, whereas I do not. I am alive...but weakened. Severely weakened. I can feel that I will only be able to time-travel once without killing myself, but that\u0027s all I need.\n","page 35":"As I channel myself around Asia and Australia, punishing the unjust, I start to wonder what effects my actions will have. I start to wonder if people can accurately guess what caused Unon\u0027s sudden paralysis, and wonder if they\u0027ll classify it as irrelevant to this anti-mutant law. Unon still got what he deserved, but I had hoped I would be able to use his fate to provide an impact to those that support this monstrous law.\n\n \nI then feel the sun pull away from America, and Gorgon city. I could visit the Imperfects if I wanted.\n","page 34":"As I channel myself around Asia and Australia, punishing the unjust, I start to wonder what effects my actions will have. I start to wonder if people can accurately guess what caused Unon\u0027s sudden paralysis, and wonder if they\u0027ll classify it as irrelevant to this anti-mutant law. Unon still got what he deserved, but I had hoped I would be able to use his fate to provide an impact to those that support this monstrous law.\n\n \nI then feel the sun pull away from America, and Gorgon city. I could visit the Imperfects if I wanted.\n","page 209":"I wait until he tries to ram me and then channel myself around him, enveloping him entirely, and suppressing any attempts he makes to free himself. He transports himself to another point in time, trying to free him, but I go through the wormhole with him and stay around him. However, he then transports himself, and therefore me as well, to the sun, and doesn\u0027t transport himself back until I have been vaporized, and he has not.\n","page 37":"I keep watch over the rooftop that the elevator in the Imperfects headquarters reaches, until I see Eve exit to the rooftop. I then channel myself there, and have my eyes appear before her.\n\n\"Do you never sleep at night?\" I say to her.\n\n\"There have been reports from Novarra. Their president was found permanently paralyzed, all across his body. You wouldn\u0027t know anything about that, would you?\"\n\n\"What do the reports say? Do they have a some sort of idea who or what was behind it?\"\n\n\"They say it was a mutant.\"\n\nThis is great news. Things are going exactly as they are supposed to go.\n\n\"Baryon? Did you do this?\"\n\n\"Do you know what\u0027s going on there? There\u0027s been a ban on mutants. They\u0027re being imprisoned, simply for being who they are. They would imprison you, for having been created by Meckard, or my, because of the horrors Thorne inflicted upon my mother. Don\u0027t try to tell me this isn\u0027t something I should fight.\"\n\n\"You can\u0027t just tackle a country\u0027s laws like that. This is not an enemy you are fighting. You have to be...\"\n\n\"Be what? Passive? Diplomatic? Those people are so afraid of people like me that they would run away screaming before even consider giving me the chance to talk. Whether this is the law there or not is irrelevant. Anyone who attacks the innocent, law enforcer or not, will have to answer to me, and he better have a better answer than \u0027they told me to do it\u0027.\"\n\n\"They voted on this. The entire country voted...\"\n\n\"The majority of the people there are ignorant and scared unaltered human beings. What chance does the mutant minority have?\"\n\n\"Is this...what you warned me about?\"\n\n\"What?\"\n\n\"You said you had to do something wrong, to set something right, and asked me not to involve myself. Is this it?\"\n\n\"I never said that, and if I had, then this wouldn\u0027t have been what I was talking about. Why? Because I am not doing anything wrong.\"\n\n\"I thought right and wrong were just a matter of perspective?\"\n\n\"They are, and this whole thing comes from the people\u0027s lack of perspective. If Skage\u0027s mutagen had been released onto the world, the people would have the perspective of being a mutant, and this law would never have been made. That\u0027s what i was trying to do, stop something like this, and I was punished for it.\"\n","page 36":"As I channel myself around Asia and Australia, punishing the unjust, I start to wonder what effects my actions will have. I start to wonder if people can accurately guess what caused Unon\u0027s sudden paralysis, and wonder if they\u0027ll classify it as irrelevant to this anti-mutant law. Unon still got what he deserved, but I had hoped I would be able to use his fate to provide an impact to those that support this monstrous law. Maybe the fact that Claymore was freed as well will cause them not to see that. Despite whether he was innocent or not, he was a mutant charged with more than just \u0027being mutant at the wrong time in the wrong country\u0027.\n\n \nI then feel the sun pull away from America, and Gorgon city. I could visit the Imperfects if I wanted.\n","page 39":"I continue to extract justice upon North and South America, as the sun moves away from Europe. As soon as night falls in Novarra, I transport myself there instantly, eager to see how the situation has developed. Suddenly, a high-piercing light emerges from the square of Sanroe, and someone shouts \"show yourself Demon!\".\n\nSomeone is referring to me as a demon?\n","page 38":"I see Eve exit the elevator and to the rooftop, but I don\u0027t talk to her. She asks me to come and talk to her, but I don\u0027t. No doubt, she heard about what happened in Novarra, and I know she doesn\u0027t like it. She has too much of a self-image to maintain to claim to be against another country\u0027s laws.\n\n \n","page 31":"\"They say a lot of things\" I say and tear open Claymore\u0027s cell. Claymore leaves his cell and looks around.\n\n\"I don\u0027t believe these rumors about you, but remember, you will receive what you give\" I say to him as he leaves.\n\nThe sun is approaching, morning comes for Novarra. I\u0027ll have to  leave it for now, and see what has transpired as a result of my actions.\n","page 30":"I throw the doors inwards, crushing one of the guards there, lying in wait after he heard the noise of the little ruckus here. I then approach the cells, and see several mutants behind bars. I tear open all the cells, and the mutants leave their cells. One of them, a woman that appears to have a weak mutation of the Muscle mutagen Stephan Lite had developed, approaches me.\n\n \n\"You...you are an Imperfect?\"\n\n\"Not anymore.\"\n\n\"I knew people wouldn\u0027t just let this happen.\"\n\nI then notice another cell, one that seems more reinforced than the others. It\u0027s nothing against me, but it seems this mutant was considered more dangerous than the others.\n\n\"Who\u0027s in there?\" I ask the woman.\n\n\"That\u0027s a mutant called Claymore. He...collected faces...I\u0027m told.\"\n","page 44":"Leksiah is smart, she doesn\u0027t fear the darkness, so I find her at an abandoned place that she did not go through any effort to illuminate, allowing me to channel myself into it with ease. I see her there, sitting on a chair and rubbing her forehead, as if trying to get rid of a headache. I channel myself inside her, and feel her headache.\n\n\"Are you alright?\" I ask her, and she stands up and looks at me.\n\n\"Baryon? Or is that Karma?\"\n\n\"Or Demon, whichever suits you.\"\n\n\"You met Valor then? He\u0027s been screaming his artificial lungs out all day about how he\u0027s going to smite you.\"\n\n\"I know, I heard the speech.\"\n\n\"What happened to him?\"\n\n\"That moron was practically begging for me to end his life.\"\n\n\"So you killed him?\"\n\n\"Yes. I\u0027m surprised he wasn\u0027t behind bars. This law is supposed to apply all mutants, right?\"\n\n\"This law only applies to genetically altered humans. Valor is a cyborg, so genetically, he is still human.\"\n\n\"Hypocrites. He\u0027s just as dangerous as an average mutant. Part of me wants to create an army of crazed cyborg soldiers and have them attack a Novarran city, just so they see this.\"\n\n\"Will you?\"\n\n\"No. I don\u0027t hurt innocents. I am a lot of things, but a tyrant is not one of them. All my life, I\u0027ve tried to avoid that.\"\n\n\"Being  tyrant? Is that so hard to avoid?\"\n\n\"When you\u0027ve got enough power to force everyone into doing what you want? Yes.\"\n\n\"Isn\u0027t that sort of what you do? I mean, you clearly don\u0027t respect the law, not saying that\u0027s a bad thing though.\"\n\n\"I respect the laws if they are worthy of my respect, and they usually are. The law and I have the same purpose, to give people incentive not to wrong one another. I never force people to do what I want, I don\u0027t force people not to hurt one another, I just make sure they get hurt as well. If they are willing to risk that, then they are free to do whatever it is they want. I provide consequences for their actions, but I don\u0027t force opinions. That\u0027s why I don\u0027t force people to change this law, I just fight against it.\"\n\n\"I see\" she says and sits down and starts rubbing her forehead again.\"\n\n\"You have a pounding headache, why?\"\n\n\"A side-effect to my enhanced intellect. My brain wasn\u0027t adapted well enough to its power, so the more I think, the more it hurts.\"\n\nAfter a moment of silence, I say \"stand up\", and she does. I then channel myself inside her, and mainly, inside her head. Just as I can induce pain, I can also suppress it, so I give her a mental massage, temporarily eliminating her headache.\n\n\"I...how did you...thank you.\"\n\n\"Feeling better?\"\n\n\"Yes. That\u0027s...wow, I can think so clearly now.\"\n\n\"You don\u0027t deserve the pain. You deserve to be able to think clearly, and I provide what people deserve. The head-ache won\u0027t be gone forever though.\"\n\n\"Still, thank you.\"\n\n\"But now, onto the matter at hand. Besides Valor trying to fight an invisible demon, what reactions have there been to Unon\u0027s paralysis?\"\n\n\"They know its about the anti-mutant laws, but instead of being motivated to remove the law, the Novarran people seem more firm in their belief that all mutants need to be neutralized.\"\n\n\"If any one of them lays his hand on a single mutant, they will regret it.\"\n\n\"What are you going to do?\"\n\n\"I don\u0027t know. I have to show them that this will not be tolerated.\"\n\n\"Governments usually don\u0027t take too kindly to terrorism.\"\n\n\"Neither do I. Everyone I hurt deserves it. As a Novarran, perhaps you have a better idea of who deserves my wrath?\"\n\n\"Well...there is a personal favor you might do for me.\"\n\n\"What\u0027s that?\"\n\n\"The man who made me...like this. The man who changed my mind. I was the only one that escaped, but he had hundreds of subjects. After I got out, he must have made sure that the others couldn\u0027t use the telekinetic powers they were developing to escape like I did, so they are still trapped there. I know where it is, but I was always too afraid to go there. You could take that place apart, free the others, and make the man who did it face justice.\"\n","page 43":"This idiot, fighting nothing to look like a hero in front of the cameras, is nothing more than a big child, unworthy of my attention, so I turn my gaze away from him as he continues to pretend to be fighting me. He points upwards to my green eyes disappearing in the distance and yells \"you haven\u0027t seen the last of me! Run where you can, I will find you!\" and the crowd behind him cheers.\n","page 46":"Leksiah is smart, she doesn\u0027t fear the darkness, so I find her at an abandoned place that she did not go through any effort to illuminate, allowing me to channel myself into it with ease. I see her there, sitting on a chair and rubbing her forehead, as if trying to get rid of a headache. I channel myself inside her, and feel her headache.\n\n\"Are you alright?\" I ask her, and she stands up and looks at me.\n\n\"Baryon? Or is that Karma?\"\n\n\"Or Demon, whichever suits you.\"\n\n\"You met Valor then? He\u0027s been screaming his artificial lungs out all day about how he\u0027s going to smite you.\"\n\n\"I know, I heard the speech.\"\n\n\"What happened to him?\"\n\n\"That moron was practically begging for me to end his life.\"\n\n\"So you killed him?\"\n\n\"Yes. I\u0027m surprised he wasn\u0027t behind bars. This law is supposed to apply all mutants, right?\"\n\n\"This law only applies to genetically altered humans. Valor is a cyborg, so genetically, he is still human.\"\n\n\"Hypocrites. He\u0027s just as dangerous as an average mutant. Part of me wants to create an army of crazed cyborg soldiers and have them attack a Novarran city, just so they see this.\"\n\n\"Will you?\"\n\n\"No. I don\u0027t hurt innocents. I am a lot of things, but a tyrant is not one of them. All my life, I\u0027ve tried to avoid that.\"\n\n\"Being  tyrant? Is that so hard to avoid?\"\n\n\"When you\u0027ve got enough power to force everyone into doing what you want? Yes.\"\n\n\"Isn\u0027t that sort of what you do? I mean, you clearly don\u0027t respect the law, not saying that\u0027s a bad thing though.\"\n\n\"I respect the laws if they are worthy of my respect, and they usually are. The law and I have the same purpose, to give people incentive not to wrong one another. I never force people to do what I want, I don\u0027t force people not to hurt one another, I just make sure they get hurt as well. If they are willing to risk that, then they are free to do whatever it is they want. I provide consequences for their actions, but I don\u0027t force opinions. That\u0027s why I don\u0027t force people to change this law, I just fight against it.\"\n\n\"I see\" she says and sits down and starts rubbing her forehead again.\"\n\n\"You have a pounding headache, why?\"\n\n\"A side-effect to my enhanced intellect. My brain wasn\u0027t adapted well enough to its power, so the more I think, the more it hurts.\"\n\nAfter a moment of silence, I say \"stand up\", and she does. I then channel myself inside her, and mainly, inside her head. Just as I can induce pain, I can also suppress it, so I give her a mental massage, temporarily eliminating her headache.\n\n\"I...how did you...thank you.\"\n\n\"Feeling better?\"\n\n\"Yes. That\u0027s...wow, I can think so clearly now.\"\n\n\"You don\u0027t deserve the pain. You deserve to be able to think clearly, and I provide what people deserve. The head-ache won\u0027t be gone forever though.\"\n\n\"Still, thank you.\"\n\n\"But now, onto the matter at hand. Besides Valor trying to fight an invisible demon, what reactions have there been to Unon\u0027s paralysis?\"\n\n\"They know its about the anti-mutant laws, but instead of being motivated to remove the law, the Novarran people seem more firm in their belief that all mutants need to be neutralized.\"\n\n\"If any one of them lays his hand on a single mutant, they will regret it.\"\n\n\"What are you going to do?\"\n\n\"I don\u0027t know. I have to show them that this will not be tolerated.\"\n\n\"Governments usually don\u0027t take too kindly to terrorism.\"\n\n\"Neither do I. Everyone I hurt deserves it. As a Novarran, perhaps you have a better idea of who deserves my wrath?\"\n\n\"Well...there is a personal favor you might do for me.\"\n\n\"What\u0027s that?\"\n\n\"The man who made me...like this. The man who changed my mind. I was the only one that escaped, but he had hundreds of subjects. After I got out, he must have made sure that the others couldn\u0027t use the telekinetic powers they were developing to escape like I did, so they are still trapped there. I know where it is, but I was always too afraid to go there. You could take that place apart, free the others, and make the man who did it face justice.\"\n","page 45":"I yank a Novarran newspaper from the streets of Endrun and read it. I am both disgusted and angered by what I see. The Novarran government is altering the anti-mutant law. They\u0027re not just going to incarcerate them. They\u0027re going to exterminate them.\n","page 48":"\"The man who did this deserves to be punished, and his victims deserve to be free, and I give people what they deserve. Show me where this facility is.\"\n\nLeksiah nods and I carry her outside, she points the way, until we come to a shack in the middle of nowhere.\n\n\"This is it?\"\n\n\"Yes. This is it. They\u0027ve fixed it since I got out. Beneath it, is a passageway to the facility.\"\n\n\"This man, do you know what his name is?\"\n\n\"No. I just remember him as a nameless overseer.\"\n\nI nod and levitate the shack away from the entrance to the facility.\n\n\"I\u0027m coming too. There are bound to be lights down there. You\u0027ll need someone that can keep the light off you.\"\n\nI nod and we both head down. As Leksiah had thought, the place is well illuminated, but she shatters the lightbulbs as we make our way forward in the facility. She can\u0027t shatter them all simultaneously though, so I can\u0027t channel myself throughout the entire facility. Because of this, we\u0027ll have to explore this place one room at a time.\n","page 47":"I yank a Novarran newspaper from the streets of Endrun and read it. I am both disgusted and angered by what I see. The Novarran government is altering the anti-mutant law. They\u0027re not just going to incarcerate them. They\u0027re going to exterminate them.\n","page 49":"\"I wish I could, but I have to put an end to this first.\"\n\n\"But doesn\u0027t the man who kidnaps people and experiments on them for his own gain deserve your justice?\"\n\n\"He does, but this is on a much larger scale. This is the law, and I am the only one capable of fighting them. This could grow larger than either one of us can imagine, and I have to stop it as fast as I can.\"\n\n\"You could just make them change the law, you know.\"\n\n\"No. I don\u0027t force people\u0027s opinions. I am not a tyrant, and I intend to keep it that way.\"\n\n\"But that would enable you to stop the man who...\"\n\n\"I\u0027ll do it when I have time, I promise you, I won\u0027t let the man behind it get away with it, but right now, there are more important matters to attend to.\"\n","page 40":"I continue to extract justice upon North and South America, as the sun moves away from Europe. As soon as night falls in Novarra, I transport myself there instantly, eager to see how the situation has developed. Suddenly, a high-piercing light emerges from the square of Sanroe, and someone shouts \"show yourself Demon!\".\n\nSomeone is referring to me as a demon?\n","page 42":"Suddenly, I suppress Valor\u0027s movements, and look him directly in the eyes.\n\n\"So, Valor, you want to fight me, do you? You want to punish me for defending the innocent, for keeping the minority safe from the ignorant majority? You want to lock mutants up, despite the fact that you are just as dangerous as they are? Your genetics may still be human, but these machines make you more of a freak than I am, and yet you claim to act on behalf of the humans. If you truly claim to be less of a monster than I am, then how about I turn you back into the human you think you are\" I say and tear out everything non-organic in his body, causing the remainder of his corpse to fall down motionless before me. The people gasp in terror. Hopefully, they\u0027ll think twice before persecuting mutants again.\n","page 41":"I turn my gaze towards the voice calling out to me, and see a man, implanted with cybernetics all around his body. He looks at my eyes, and I then notice that there are people following him with cameras, taking pictures of me and him, and he seems to be posing as if he is a hero about to slay a dragon. Little does he know that the flashes the cameras have cause me to disconnect from the area whenever I am illuminated, which means the pictures are just of him posing in front of nothing. I wish I could see his face when he gets a look at those photos.\n\n\"You finally show your cowardly face. Accept your fate demon, for you are about to be smitten by the mighty Valor!\"\n\n\"I\u0027ll be smitten, will I?\"\n\n\"Did you think your actions against Philias Unon would go unpunished? Valor keeps the citizens of Novarra safe from all threats, including you!\"\n\nI find it a pleasant surprise that the Novarran people know as much as they do about what happened last time I was here. Valor releases a blast of light in my direction, having no idea that he has to illuminate just about the entirety of Europe and Africa to be able to destroy me. I then reappear before him again as soon as his flash of light has gone.\n\n\"Ah, you might prove to be a worthy foe after all\" Valor says and leaps at me, punching into the air. I can swear he also imitates me fighting back, and shouts out battle cries, indicating that what he is doing is hurting me, although he is just fighting the air. He is actually pretending to be in an epic battle with me.\n","page 101":"As I have now learned to detect frequencies, I pick up on the communications being sent from and too the vessel, suppressing them and forbidding them from going to where they are supposed to, although I am unable to track where the base that sent the vessel is, as that would take me to the sunlight.\n\nHowever, they seem to have expected this, probably because I knew how to do this while I was fighting them before, which of course I don\u0027t remember right now, so this doesn\u0027t limit their fighting as much as I had hoped. However, the Imperfects are too many for them, not to mention too powerful, so they get through the fight with minimum casualties. One of those casualties however was Haste. It is not often that he is hit, but it seems the Alliance has been developing ways to counter all of our abilities.\n","page 222":"I piece something together quickly from the clothing of the dead people in the base. I then cover myself with it and go to the power area. I can feel the light upon me, but I am able to endure it and I destroy the power generator, shutting off all the lights in the base, and allowing me to reach the gun. The gun has a battery, so it\u0027s power is not determined by the power of the base. However, Future Baryon did not follow me to the power area, so he is closer to the gun. Due to this, he reaches the gun before I do and fires it at me, utterly vaporizing me.\n","page 100":"I rip chunks from the nearby mountains and hurl them towards the vessel that carried the troopers here. Both because it is generating the light that renders me unable to bring a swift end to the whole thing and also because there is no Imperfect attacking the vessel, minimizing the chances of friendly fire. It doesn\u0027t take many boulders to utterly crush the vessel, shutting off the lights and allowing me to tear all the troopers inside out.\n","page 221":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 103":"We didn\u0027t loose that many, but any casualties are unacceptable.\n\nI channel myself towards Grove, who seems to be making a body-count.\n\n\"This didn\u0027t go like we wanted it to, did we?\"\n\n\"Why didn\u0027t they send the Paladin? Why would they send people that can barely do anything against me in response to my message, instead of sending someone specially outfitted to be able to defeat me?\"\n\n\"Isn\u0027t it obvious? They knew it was a trap. They knew we were trying to draw the Paladin out and they knew that we\u0027d be lying in wait. Seems they incorrectly guessed how many we\u0027d be though.\"\n\n\"How would they know?\"\n\n\"Paladin is a good tactician. Maybe he felt the hints towards where the message was sent from were too obvious. Maybe he thought we\u0027d never unintentionally make that mistake. I don\u0027t know.\"\n\nClaymore then approaches and says \"we captured one of them alive.\"\n\nGrove nods and says \"We need to interrogate him. Let\u0027s go back to base. Baryon, you can inflict more pain than anyone else in the world. You\u0027ll interrogate him whenever you\u0027re ready.\"\n","page 102":"We didn\u0027t loose that many, but any casualties are unacceptable.\n\nI channel myself towards Grove, who seems to be making a body-count.\n\n\"This didn\u0027t go like we wanted it to, did we?\"\n\n\"Why didn\u0027t they send the Paladin? Why would they send people that can barely do anything against me in response to my message, instead of sending someone specially outfitted to be able to defeat me?\"\n\n\"Isn\u0027t it obvious? They knew it was a trap. They knew we were trying to draw the Paladin out and they knew that we\u0027d be lying in wait. Seems they incorrectly guessed how many we\u0027d be though.\"\n\n\"How would they know?\"\n\n\"Paladin is a good tactician. Maybe he felt the hints towards where the message was sent from were too obvious. Maybe he thought we\u0027d never unintentionally make that mistake. I don\u0027t know.\"\n\nClaymore then approaches and says \"we captured one of them alive.\"\n\nGrove nods and says \"We need to interrogate him. Let\u0027s go back to base. Baryon, you can inflict more pain than anyone else in the world. You\u0027ll interrogate him whenever you\u0027re ready.\"\n","page 223":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 105":"We return to the base, and the guard is placed in a some sort of holding cell.\n\nAfter putting the guard in the holding cell, Grove leaves the room and approaches me.\n\n\"Is your memory returning to you?\"\n\n\"No. I still remember nothing since that night, two years ago.\"\n\n\"What happened then?\"\n\n\"I saw someone like me, he was twitching, and then I woke up in that vat.\"\n\n\"Twitching? Like you were?\"\n\n\"Were?\"\n\n\"Oh. I guess you don\u0027t remember it. You were twitching more and more before you were captured. You don\u0027t seem to be twitching now though.\"\n\n\"I\u0027m not.\"\n\n\"Oh, well, maybe it was a problem that your body resolved in the solitude of the vat. Anyway, the sooner you interrogate that guard, the better.\"\n","page 104":"We didn\u0027t loose that many, but any casualties are unacceptable. Especially if it\u0027s someone like Haste.\n\nI channel myself towards Grove, who seems to be making a body-count.\n\n\"This didn\u0027t go like we wanted it to, did we?\"\n\n\"Why didn\u0027t they send the Paladin? Why would they send people that can barely do anything against me in response to my message, instead of sending someone specially outfitted to be able to defeat me?\"\n\n\"Isn\u0027t it obvious? They knew it was a trap. They knew we were trying to draw the Paladin out and they knew that we\u0027d be lying in wait. Seems they incorrectly guessed how many we\u0027d be though.\"\n\n\"How would they know?\"\n\n\"Paladin is a good tactician. Maybe he felt the hints towards where the message was sent from were too obvious. Maybe he thought we\u0027d never unintentionally make that mistake. I don\u0027t know.\"\n\nClaymore then approaches and says \"we captured one of them alive.\"\n\nGrove nods and says \"We need to interrogate him. Let\u0027s go back to base. Baryon, you can inflict more pain than anyone else in the world. You\u0027ll interrogate him whenever you\u0027re ready.\"\n","page 225":"I need something that can defeat him, but if something can defeat him, then it\u0027ll be able to defeat me as well, won\u0027t it? After all, we are the same person. Perhaps that\u0027s what it takes to win this battle. Perhaps there is a way for me to win without giving my own life, perhaps not.\n\nThe first thing that comes to mind is taking him to the future of the time-line I was at, and try to use the Paladin against him.\n\nAnother thing that comes to mind is to take him to the end of the Cretaceous period and try to have the meteor strike him, although this would probably cause it to strike me as well.\n\nBut what about the center of the earth? If I could transport us both there, then the light would...kill us both, I guess, unless I can somehow expose him to the light without exposing myself. How would I do that though?\n\nI\u0027m not sure it would work to take him to a path in the future and then cut it off from the present. Maybe it would erase the path he\u0027s on and him with it? It might be worth a shot.\n\nI wonder if I should go to before the big bang. The complete lack of light would make my power limitless, but then again, it would do the same to him, so I guess that\u0027s no good. I mean, there\u0027s no advantage I know of that both of us having unlimited power would give me.\n\nI heard the police excavated a light-emitting weapon specially designed to destroy me at Lite\u0027s base. If I take the fight there, I might be able to use that weapon against him.\n\nWhat if I can imprison him somehow? Like in the vat...no...that won\u0027t work on someone who can teleport, will it? What if the prison could travel with him? I remember Freakshow defeated his other self by completely enveloping him with himself and suffocating him. I can travel through the wormholes with him, so he couldn\u0027t escape from a containment if it was constructed of me.\n\nSpeaking of the Imperfects, Eve defeated me once while I was working with Skage. Perhaps I can take him to the moment and have her defeat him as well.\n","page 107":"\"The first step is clear. We go after the Paladin.\"\n\n\"The Paladin?\"\n\n\"He killed Eve, our leader, our friend. He put me in a vat and took away my memories. We have to take him out, we have to show everyone that no one will stand against us.\"\n\n\"Alright. How will we do that?\"\n\n\"There\u0027s a lot of us. His weapons are designed to target me, not you or Brute or Haste.\"\n\n\"He\u0027s not defenseless against us, you know.\"\n\n\"As Imperfects, we\u0027ve taken down gigantic titans. How? Not because we were powerful, but because we worked together.\"\n\n\"Actually, we defeated Hybrid because you were powerful\" Haste says.\n\n\"And Virus\" Grove then adds.\n\n\"You\u0027re missing the point. Together, we can easily defeat him, and he needs to be defeated. Eve deserves to be avenged.\"\n\n\"She wouldn\u0027t like you trying to avenger her, you know?\"\n\n\"Even so, the Paladin must die. Where is he?\"\n\n\"Just show your face and he\u0027ll be there. His primary objective is to take you out. That\u0027s what his suit was made for.\"\n","page 228":"I start pushing Future Baryon towards Paladin, trying to make him the Baryon closest to him and therefore, making the target Paladin hits. However, as soon as Paladin fires his cannon at Future Baryon, he stops trying to push back, and lets me channel myself into the area he\u0027s at, causing the Baryonic cannon to hit me. Future Baryon then slams himself on top of me, and as I am temporarily rendered powerless, he crushes me.\n","page 106":"As soon as we return to the base, Leksiah approaches me and tells me to join her in her room, as she has something she wants to discuss. I follow her and ask \"what is it? What\u0027s going on?\"\n\n\"You asked me to investigate why you were twitching, right? Well, even though you\u0027re not twitching anymore, I continued to check it out anyway, fearing that it might return. Using the sample of you you gave me, I think I\u0027ve been able to analyse what it is.\"\n\n\"Oh? What is it?\"\n\n\"You...how do I put this. You have your own way of aging. Your entire physique is...unstable, and because of that, it is constantly deteriorating.\"\n\n\"Deteriorating?\"\n\n\"Yes. You are slowly becoming more and more unstable. Eventually, you\u0027ll completely unravel. And that\u0027s not all. I tried introducing the sample of you to baryons, which the sample of course absorbed...it deteriorated more while it was absorbing them. Once it had absorbed the baryons, it deteriorated at a normal speed.\"\n\n\"And what does that mean?\"\n\n\"It means that the more you use your powers, the faster you deteriorate. One thing that puzzles me is why you aren\u0027t twitching any more. The twitching was caused by the instability in your body, and it\u0027s impossible for it to just become more stable all of a sudden.\"\n\n\"Well, I can regenerate while in the...\"\n\n\"You\u0027re body can\u0027t create stability. No matter how much of you it regenerates, it\u0027ll always be as unstable.\"\n\n\"Maybe...I don\u0027t know. Maybe this is somehow dependant on my memories?\"\n\n\"No. This is physical, not mental.\"\n\n\"So...what, the Alliance fixed me?\"\n\n\"That\u0027s the only thing that comes to mind. Maybe they...I don\u0027t know, created another you and used memories from the original Baryon, only the memories were copied at that point eight years ago and put into you. If that were the case, then your last memory should be of your memories being copied...unless you were unconscious at the time. What was your last memory eight years ago?\"\n\n\"I encountered another Baryon, that was twitching, and then I woke up in the vat.\"\n\n\"That\u0027s...odd...if he was twitching before you were, then that must mean that he was created before you were created. But there\u0027s no record of a second Baryon.\"\n\n\"I don\u0027t know where he came from. He just showed up, didn\u0027t said anything, and the next thing I remember was being in that vat.\"\n\nThere is a knock on the door then, and Grove enters the room. \"Baryon, the sooner you get information from that guard, the better.\"\n","page 227":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 55":"I raise Overlord into the air, as he is helpless to stop me.\n\n\"No. Please! Don\u0027t kill me. Think of what a waste it would be!\"\n\n\"Waste? I am doing humanity a favor.\"\n\n\"Think about everything I\u0027m doing. I\u0027m making everything better. I\u0027m making everyone smarter.\"\n\n\"You\u0027re making yourself better at the expense of everyone else. You know who you remind me of? Michael Thorne. You heard of him?\"\n\nOverlord shakes his head, and I say \"Thorne was trying to perfect humanity. To speed up evolution where there would literally be impossible to improve upon it. Among his subjects was me. You know how he created me? He brutally killed my mother and then fed her to a cannibal. He did that to my mother. And you know what the worst part is? As soon as I had been created, he disqualified me as a candidate for his perfection, locked me up and threw away the key. He killed an innocent woman, and prevented me from having a happy normal life for nothing! That\u0027s who you remind me of. You are exactly as ruthless, cold-hearted and selfish as he was, and he is the last person you\u0027d want to resemble right now.\"\n\nAs his pain rises, he starts to scream. I can feel his attempts to free himself become more and more desperate, but they are all equally ineffective.\n\n\"Tell me something, Overlord. Did you intend for your brain to grow so large?\" I say to him, but he doesn\u0027t respond. He just keeps screaming and writhing in pain. I decrease it, just a little bit, which is more than he deserves, so that he can respond.\n\n\"Answer my question.\"\n\n\"No...no...I...no...that was....I didn\u0027t....\"\n\n\"So I suppose you want to find a way to decrease it.\"\n\n\"Well...maybe after I\u0027d...\" but then I see a lovely sight as his pupils grow larger, as he realizes the purpose of my question. After all, that sort of thing is what his intelligence is for, isn\u0027t it? His heartbeat rises even higher than it was, and he is sweating like I\u0027ve never seen before. \"No. Please. Don\u0027t do it.\"\n\nI savor the moment. I squeeze as much terror from him, as he knows the fate that awaits him, and he begs me for mercy. I don\u0027t answer any of them, I just stare into his cruel, heartless eyes, and wait for his heartbeat to go down again. Perhaps my moment of pause has given him hope, perhaps he thinks I am actually considering to let him live. Good, then I can inflict more pain upon him as I crush his last feeling of hope.\n\nHis look of terror resumes as he feels a powerful force touch his mind. I channel myself around his entire brain, but I don\u0027t kill him yet. I just make sure that he feels as much of it as possible, so I compress his brain slowly. He cries and begs all he cans, until he is rendered motionless. I then toss his remains aside. There is no use in punishing him anymore.\n","page 109":"\"I\u0027m not the leader of this team, you are. I don\u0027t remember what\u0027s been going on, what has happened. You do.\"\n\n\"You are the Liberator. The mutants need you to...\"\n\n\"I\u0027ll be at your side, but I think you should be the leader. You\u0027ve done okay so far.\"\n\n\"Alright. This fight is not about killing Alliance people. This fight is about mutants allowing to be themselves without having to spend their lives in a cell. The citizens need to see that we\u0027re not trying to attack them, we\u0027re just trying to free our own.\"\n\n\"We\u0027re attacking a prison then?\"\n\n\"Night has moved over Gorgon. As you might know, Gorgon is sort of the mutant capital of the world, so Zuchthaust prison was converted into a giant mutant prison facility. That\u0027s where we\u0027ll strike.\"\n","page 54":"I rip off a wall further down the corridor and block the light he\u0027s redirecting at me with it.\n\n\"What are you trying to accomplish? I am connected to the entire night. Surely your mutated brain can come to the conclusion that you can\u0027t illuminate the night.\"\n\n\"I am invincible! You can\u0027t defeat me! No one can!\" he shouts back from behind the barrier I have put up. I make a small hole, and see that he has stepped back into the shadowed area, beneath the lights Leksiah had destroyed earlier. I then morph the metallic wall into a pipe, and throw it towards him. He blocks it, but the hole through the pipe goes from the shadow I am connected with to the shadow he is in, allowing me to enter the shadow he is in and grab him. He tries to break free, but he can\u0027t. He\u0027s in my domain now.\n","page 108":"\"We need to free more mutants. Bolster our ranks and give all those innocent mutants out there the freedom they deserve.\"\n\n\"I agree, and  I know just where to strike. The sun has gone down in Gorgon, and because we all know that\u0027s virtually the mutant capital of the world, Zuchthaus prison has been turned into a giant prison complex. I\u0027ve been meaning to strike there, but I don\u0027t think we can do it without our dark-god. You didn\u0027t get the name Liberator for nothing.\"\n","page 229":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 57":"I throw a desk at Overlord, which he tears in half, rendering the attack harmless to him. However, multitasking did not seem to be part of his mutation, as I feel the light between me and the shadows outside vanish. He is unable to redirect the light there and tear the table apart at the same time, so it gives me a brief moment to act wile connected to the light.\n","page 56":"I raise Overlord into the air, as he is helpless to stop me.\n\n\"No. Please! Don\u0027t kill me. Think of what a waste it would be!\"\n\n\"Waste? I am doing humanity a favor.\"\n\n\"Think about everything I\u0027m doing. I\u0027m making everything better. I\u0027m making everyone smarter.\"\n\n\"You\u0027re making yourself better at the expense of everyone else. You know who you remind me of? Michael Thorne. You heard of him?\"\n\nOverlord shakes his head, and I say \"Thorne was trying to perfect humanity. To speed up evolution where there would literally be impossible to improve upon it. Among his subjects was me. You know how he created me? He brutally killed my mother and then fed her to a cannibal. He did that to my mother. And you know what the worst part is? As soon as I had been created, he disqualified me as a candidate for his perfection, locked me up and threw away the key. He killed an innocent woman, and prevented me from having a happy normal life for nothing! That\u0027s who you remind me of. You are exactly as ruthless, cold-hearted and selfish as he was, and he is the last person you\u0027d want to resemble right now.\"\n\nAs his pain rises, he starts to scream. I can feel his attempts to free himself become more and more desperate, but they are all equally ineffective.\n\n\"Tell me something, Overlord. Did you intend for your brain to grow so large?\" I say to him, but he doesn\u0027t respond. He just keeps screaming and writhing in pain. I decrease it, just a little bit, which is more than he deserves, so that he can respond.\n\n\"Answer my question.\"\n\n\"No...no...I...no...that was....I didn\u0027t....\"\n\n\"So I suppose you want to find a way to decrease it.\"\n\n\"Well...maybe after I\u0027d...\" but then I see a lovely sight as his pupils grow larger, as he realizes the purpose of my question. After all, that sort of thing is what his intelligence is for, isn\u0027t it? His heartbeat rises even higher than it was, and he is sweating like I\u0027ve never seen before. \"No. Please. Don\u0027t do it.\"\n\nI savor the moment. I squeeze as much terror from him, as he knows the fate that awaits him, and he begs me for mercy. I don\u0027t answer any of them, I just stare into his cruel, heartless eyes, and wait for his heartbeat to go down again. Perhaps my moment of pause has given him hope, perhaps he thinks I am actually considering to let him live. Good, then I can inflict more pain upon him as I crush his last feeling of hope.\n\nHis look of terror resumes as he feels a powerful force touch his mind. I channel myself around his entire brain, but I don\u0027t kill him yet. I just make sure that he feels as much of it as possible, so I compress his brain slowly. He cries and begs all he cans, until he is rendered motionless. I then toss his remains aside. There is no use in punishing him anymore.\n","page 59":"I raise Overlord into the air, as he is helpless to stop me.\n\n\"No. Please! Don\u0027t kill me. Think of what a waste it would be!\"\n\n\"Waste? I am doing humanity a favor.\"\n\n\"Think about everything I\u0027m doing. I\u0027m making everything better. I\u0027m making everyone smarter.\"\n\n\"You\u0027re making yourself better at the expense of everyone else. You know who you remind me of? Michael Thorne. You heard of him?\"\n\nOverlord shakes his head, and I say \"Thorne was trying to perfect humanity. To speed up evolution where there would literally be impossible to improve upon it. Among his subjects was me. You know how he created me? He brutally killed my mother and then fed her to a cannibal. He did that to my mother. And you know what the worst part is? As soon as I had been created, he disqualified me as a candidate for his perfection, locked me up and threw away the key. He killed an innocent woman, and prevented me from having a happy normal life for nothing! That\u0027s who you remind me of. You are exactly as ruthless, cold-hearted and selfish as he was, and he is the last person you\u0027d want to resemble right now.\"\n\nAs his pain rises, he starts to scream. I can feel his attempts to free himself become more and more desperate, but they are all equally ineffective.\n\n\"Tell me something, Overlord. Did you intend for your brain to grow so large?\" I say to him, but he doesn\u0027t respond. He just keeps screaming and writhing in pain. I decrease it, just a little bit, which is more than he deserves, so that he can respond.\n\n\"Answer my question.\"\n\n\"No...no...I...no...that was....I didn\u0027t....\"\n\n\"So I suppose you want to find a way to decrease it.\"\n\n\"Well...maybe after I\u0027d...\" but then I see a lovely sight as his pupils grow larger, as he realizes the purpose of my question. After all, that sort of thing is what his intelligence is for, isn\u0027t it? His heartbeat rises even higher than it was, and he is sweating like I\u0027ve never seen before. \"No. Please. Don\u0027t do it.\"\n\nI savor the moment. I squeeze as much terror from him, as he knows the fate that awaits him, and he begs me for mercy. I don\u0027t answer any of them, I just stare into his cruel, heartless eyes, and wait for his heartbeat to go down again. Perhaps my moment of pause has given him hope, perhaps he thinks I am actually considering to let him live. Good, then I can inflict more pain upon him as I crush his last feeling of hope.\n\nHis look of terror resumes as he feels a powerful force touch his mind. I channel myself around his entire brain, but I don\u0027t kill him yet. I just make sure that he feels as much of it as possible, so I compress his brain slowly. He cries and begs all he cans, until he is rendered motionless. I then toss his remains aside. There is no use in punishing him anymore.\n","page 58":"There is light emitting from the helmet those people have so I say \"go free those people\" to Leksiah. Overlord tries to stop her, but any telekinetic wave he tries to project at Leksiah has to go through my shadows, so I immediately snuff them out. Soon, Overlord\u0027s victims are freed, and they all look at him with hatred in their eyes.\n\n\"That man experimented on you. Go get him\" I say, and with all their power plus Leksiah\u0027s they overpower him and bring him out in my shadows. He\u0027s in my domain now.\n","page 51":"If I leave, Overlord will kill Leksiah, so I stay in the room, hoping to stop him before he can cut me off from shadows entirely. He starts redirecting light closer towards me. Leksiah tries to push him back, but his telekinetic barrier blocks her from him, and the light blocks me from him.\n\nLeksiah looks at me and says \"what are we going to do?\"\n","page 50":"Leksiah clears the corridor of lights and I tear through the door. We come to a room which appears to be the main area. There, we see hundreds of cells, and in them, are people, with a some sort of helmet around their heads.\n\n\"What are those things?\" I ask Leksiah.\n\n\"I don\u0027t know. They didn\u0027t put them on me.\"\n\n\"You said you escaped due to the telekinetic ability that you developed as a side-effect to your enhanced intellect, correct?\"\n\n\"Yes. This must be a response to that, them trying to keep them from escaping with their telekinesis.\"\n\n\"So those helmets block out telekinetics?\"\n\n\"Yes. My brain sends out a...sort of frequency that it uses to manipulate items, it is virtually undetectable to human beings, but that must be a some kind of jammer for it.\"\n\n\"But why would they go through the trouble? Why wouldn\u0027t they just alter their transformations so the subjects would have enhanced intellect, but wouldn\u0027t send those frequencies, and therefore wouldn\u0027tn be telekinetic?\"\n\n\"It would be a waste, wouldn\u0027t it?\" we hear a voice say from our side and we both turn towards it. We see a man, who\u0027s brain clearly has been mutated to a severely abnormal level. He\u0027s standing in the light, which is why I couldn\u0027t detect him.\n\n\"It seems our prototype has returned\" he then says and looks at Leksiah.\n\n\"That\u0027s him, that\u0027s the nameless overseer. That\u0027s the guy behind this place.\"\n\n\"Seems like he\u0027s been taking some of his own medicine\" I say, in reference to his mutated brain.\n\n\"Your dark-matter friend here is right. What an interesting thing you are. Where were you made?\"\n\n\"At a place far too much like this one, by a man far too similar to you.\"\n\n\"Who are you anyway?\"\n\n\"I had a name once, a regular name, like any other, but I find it unsuitable for my current magnificence. Now, I am called: the Overlord.\"\n\n\"You know, the Ammunition would have loved you.\"\n\n\"I don\u0027t want to talk anymore, I want to kill him. Punish him for what he\u0027s done!\" Leksiah says and projects a telekinetic wave at Overlord. He laughs at her, and reflects the wave back at her, magnifying it with his own power. As it approaches her, it enters the shadows, so I prevent it from hurting her, although blocking it proved surprisingly difficult. His power is on a much higher scale than Leksiah\u0027s, and the fact that he\u0027s under the light, and can protect it from Leksiah\u0027s attacks means I can\u0027t take him out.\n\n\"Impressive. You have great power\" he says and looks at me.\n\n\"You have no idea.\"\n\n\"I detected though that the baryonic dark matter that funneled from your body retreated from the light. It seems like you have a weakness\" he says and telekinetically redirects the light from the corridor at me. Seems like this guy will pose as more of a threat than I thought. If he can illuminate every shadow I am connected to, he\u0027ll kill me. Luckily, the way we came from is shadowed, and leads to the night, so doing so would be virtually impossible. He seems to realize this too, coming to a successful conclusion about how my powers work with his enhanced intellect, and he redirects light to the entrance of the room. I cannot stay connected to both shadows, so I\u0027ll have to choose whether to stay in here, where he has me boxed in with light, risking my life, as then it would be possible for him to totally illuminate me, or leave the room, and stay connected to the night. It makes me safe, but I won\u0027t be able to protect Leksiah, who doesn\u0027t stand a chance against Overlord on her own.\n","page 53":"I hurl a chair towards Overlord with extreme force, causing it to continue motioning towards him after I am forced to release it, due to the light. Before it reaches him however, the chair is shattered in two pieces, one going to his left and one going to his right, leaving him unhurt. However, he is forced to use his telekinesis on the chair instead of keeping the path to him illuminated, so I channel myself towards him, as he is now in the shadows. He tries to break free, but he can\u0027t. He\u0027s in my domain now.\n","page 52":"I decide to leave the room, just before he redirects the light to block the entrance to the room. He then steps into the shadows of that room, seeing as how I can no longer access it. He grins and looks at Leksiah, who is incapable of hurting him with her telekinesis, as everything she does, he overpowers.\n\n\"And think about it, you were out, you could have stayed away from here forever. I wouldn\u0027t have sent anyone for you, all you had to do is ignore me, and I would do the same. But you came back. You were anrgy, and now your anger has lead you to your doom\" Overlord says as he telekinetically twists Leksiah\u0027s neck. He then looks at me and says \"that is the results of actions made without thinking. I suppose I have myself to blame. I didn\u0027t make her intelligent enough.\"\n\n\"You are going to pay for that. I can introduce you to pain even your monster-sized mind couldn\u0027t imagine.\"\n\nOverlord simply laughs and approaches me, although careful not to enter my shadows.\n\n\"I\u0027ve heard about you. You are the reason people fear the night.\"\n\n\"I\u0027m the current reason. People have always feared the night.\"\n\n\"Even down here, a man gets wind of your actions. Some of my co-workers insisted that the place was properly illuminated, because they feared that Karma would strike from the shadows, and punish them for their work. I suppose that is why you have come, yes?\"\n\n\"Your co-workers insisted? Why the past tense?\"\n\n\"Oh. I didn\u0027t kill them, if that\u0027s what you think. Why would a man kill his own resources. Not the acts of an intelligent mind, are they? No, I am simply making them smarter, to rid them of their silly superstitions\" he says and looks at the people trapped with the mental blocking helmets on them.\n\n\"So your associates have been introduced to the pain they brought onto others? Good. You\u0027ve almost done my job for me. All that remains is you.\"\n\nOverlord\u0027s grin grows wider, and he starts redirecting light towards me.\n","page 110":"Grove assembles a strike team and I transport them to Zuchthaus prison. The team consists of me, Grove, Brute, Haste, Claymore, Carrie, the woman with the minor case of Muscle\u0027s mutation, and  reptile-man that looks a lot like Scales, although he is called Reptile.\n\n\"Why aren\u0027t we just taking an army? We\u0027ve got thousands of mutants here.\"\n\n\"It\u0027d be too obvious. Besides, if the mission is blown, we won\u0027t loose too many people. The main purpose of the rest of us is to keep you covered. You\u0027re the Liberator, we\u0027re just here to keep the bad guys from taking advantage of your weaknesses.\"\n\n\"Thanks. I don\u0027t feel expendable or anything\" Haste says.\n\nI transport all of us to Zuchthaus prison. I know exactly where it is due to my time as an Imperfect, the original Imperfects that is. The whole thing is larger now, and much more illuminated of course. The Alliance has been fighting a tough fight against me it seems, so everything they make that is to take part in this war has to be able to counteract me in some way.\n\nHaste superspeeds in front of us, taking out the lights so that I can keep the rest of us concealed in the shadows. The place is gigantic, much bigger that Zuchthaus prison was eight years ago, when it was a normal prison. I can feel electricity surging through the cells, and the weapons there are powerful enough to hurt even Brute. Luckily, I am able to destroy them before they can hurt any one of us, and they\u0027re not fast enough to hit Haste. Which is surprising. Haste has surely been an Imperfect since this war began. It\u0027s strange they haven\u0027t developed anything that can defeat him.\n\n\"There\u0027s a lot of area to cover\" Grove says.\n\n\"Should we split up?\"\n\n\"No...I don\u0027t know. Maybe. We\u0027d be able to free a lot more people, wouldn\u0027t we?\"\n\n\"Why can\u0027t we just take our time and move through the entire place?\"\n\n\"Once they know we\u0027re here, they\u0027ll send everything they\u0027ve got to strike us down.\"\n\n\"Like the Paladin?\"\n\n\"Most likely.\"\n\n\"Good. We\u0027ll face him.\"\n\n\"Baryon. He defeated you outside in the middle of the night, while you were more experienced than you are now. There\u0027s no way you\u0027d be able to defeat him down here. No, we\u0027ll have to be gone by the time he shows up.\"\n\nGrove hands all of us some sort of watches, except for me, as that watch won\u0027t be able to dematerialize with me.\n\n\"I\u0027ve set the timer on those watches. As soon as it rings, everybody gets out. Baryon. I am not sure whether we should split up or not. It leaves us in more danger, but at the same time it increases the amount of mutants we can free.\n","page 230":"I channel myself to Paladin\u0027s side and say \"let\u0027s get them. They don\u0027t stand a chance against...\" but I can\u0027t finish, as Paladin fires his baryonic cannon at me and forces me to materialize.\n\n\"You\u0027re a mutant. You\u0027re a lawbreaker. I\u0027m not taking your side.\"\n\nHe then stomps on me, and as I am forcibly materialized, I am unable to phase through his foot, so he crushes me.\n","page 211":"I transport myself to the present of the time-line I originally belong to.\n\nEve is on the rooftop which the Imperfects headquarters leads to, and I materialize behind her.\n\n\"Eve?\"\n\nShe turns around and faces me.\n\n\"Baryon? You\u0027re twitching again.\"\n\n\"Long story. Listen, I have something I want to talk to you about.\"\n\n\"Yes? What\u0027s wrong?\"\n\n\"You...you were right. You\u0027ve always been right. I never wanted to admit it. I just went my own path. But now I\u0027ve seen the monster I was becoming. All my life, I\u0027ve been afraid of one thing. No, it\u0027s not light. Light is too...clear-cut for me to actually fear. The thing I\u0027ve always feared is myself, my power, what I can do. I\u0027ve feared what I could become. My path...what I\u0027ve been doing...it\u0027s turning me into that. It\u0027s turning me into something ugly, a monster, a tyrant. I don\u0027t want to be that, Eve, but I need a teacher. Someone who can make sure I don\u0027t turn into something ugly. If there\u0027s no one who can be that person for me, then I\u0027m afraid what I\u0027ll end up as. There\u0027s only been one person who can teach me everything I need. I had the perfect teacher from the begin with, but I ignored you, I refused to listen to you. Could you...could you accept me back into the Imperfects?\"\n\nEve removes her Shade mask, looks at me and smiles. \"I\u0027ve been waiting for you to say that for a long time. We all have. You\u0027re part of the family. Welcome back Baryon.\"\n","page 210":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 215":"I need something that can defeat him, but if something can defeat him, then it\u0027ll be able to defeat me as well, won\u0027t it? After all, we are the same person. Perhaps that\u0027s what it takes to win this battle. Perhaps there is a way for me to win without giving my own life, perhaps not.\n\nThe first thing that comes to mind is taking him to the future of the time-line I was at, and try to use the Paladin against him.\n\nAnother thing that comes to mind is to take him to the end of the Cretaceous period and try to have the meteor strike him, although this would probably cause it to strike me as well.\n\nBut what about the center of the earth? If I could transport us both there, then the light would...kill us both, I guess, unless I can somehow expose him to the light without exposing myself. How would I do that though?\n\nI\u0027m not sure it would work to take him to a path in the future and then cut it off from the present. Maybe it would erase the path he\u0027s on and him with it? It might be worth a shot.\n\nI wonder if I should go to before the big bang. The complete lack of light would make my power limitless, but then again, it would do the same to him, so I guess that\u0027s no good. I mean, there\u0027s no advantage I know of that both of us having unlimited power would give me.\n\nI heard the police excavated a light-emitting weapon specially designed to destroy me at Lite\u0027s base. If I take the fight there, I might be able to use that weapon against him.\n\nWhat if I can imprison him somehow? Like in the vat...no...that won\u0027t work on someone who can teleport, will it? What if the prison could travel with him? I remember Freakshow defeated his other self by completely enveloping him with himself and suffocating him. I can travel through the wormholes with him, so he couldn\u0027t escape from a containment if it was constructed of me.\n\nSpeaking of the Imperfects, Eve defeated me once while I was working with Skage. Perhaps I can take him to the moment and have her defeat him as well.\n","page 214":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 217":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 66":"Satisfied that Overlord has met a deserving fate, I leave the facility. Now it\u0027s time to turn back to the matter at hand after this little side-track. Still, I won\u0027t have Leksiah at my side anymore. She deserved a better fate than she got. I failed her, I failed to provde her with what she deserved. At least her death has been avenged.\n","page 219":"The strain dealt to the universe by us co-existing in the same moments of time for this long causes the entire universe to collapse, along with everything in it. Including us.\n\n \n","page 65":"Upon removing the telekinetically-blocking helmets from the subjects, they all start gathering around me.\n\n\"We...thank you. That man was a madman.\"\n\n\"He said you worked for him. Is that true?\"\n\n\"Ah...yes, we did.\"\n\n\"You experimented on people? Did the same things to them that Overlord did to you?\"\n\n\"Yes. I didn\u0027t understand how wrong it was until he put me in there\" one of them says, and the rest of them nod. These people hurt others. They were Overlord\u0027s accomplishes, but then again, perhaps they have received a just punishment. They felt what they did to others. Perhaps I should just let them go.\n","page 218":"I remember where the power room is, but getting there requires me to go through an illuminated area. It\u0027s not as lit up as the room with the gun, so I could find some clothing to cover my while making my way to the power area, and there, I can deactivate the power in the base, causing all the lights to go off.\n","page 68":"Satisfied that Overlord has met a deserving fate, I leave the facility. Now it\u0027s time to turn back to the matter at hand after this little side-track. Still, I won\u0027t have Leksiah at my side anymore. She deserved a better fate than she got. I failed her, I failed to provde her with what she deserved. At least her death has been avenged.\n","page 67":"Upon removing the telekinetically-blocking helmets from the subjects, they all start gathering around me.\n\n\"We...thank you. That man was a madman.\"\n\n\"He said you worked for him. Is that true?\"\n\n\"Ah...yes, we did.\"\n\n\"You experimented on people? Did the same things to them that Overlord did to you?\"\n\n\"Yes. I didn\u0027t understand how wrong it was until he put me in there\" one of them says, and the rest of them nod. These people hurt others. They were Overlord\u0027s accomplishes, but then again, perhaps they have received a just punishment. They felt what they did to others. Perhaps I should just let them go.\n","page 69":"\"Go. You\u0027ve suffered enough\" I say and the people leave.\n","page 60":"I find an island that I don\u0027t detect any life-forms on, lift it up from the sea, compress it into a building-large boulder, which still contains the island\u0027s mass and drop it onto the ground above where Overlord is located. It instantly tears through the ground, and almost drops onto his head, but he manages to keep it suspended above him. It is extremely heavy for him however, and he is unable to maintain his telekinetic barrier while holding the boulder up, so Leksiah pulls him towards me. He tries to keep me away from him, but he\u0027s in my domain now.\n","page 62":"I raise Overlord into the air, as he is helpless to stop me.\n\n\"No. Please! Don\u0027t kill me. Think of what a waste it would be!\"\n\n\"Waste? I am doing humanity a favor.\"\n\n\"Think about everything I\u0027m doing. I\u0027m making everything better. I\u0027m making everyone smarter.\"\n\n\"You\u0027re making yourself better at the expense of everyone else. You know who you remind me of? Michael Thorne. You heard of him?\"\n\nOverlord shakes his head, and I say \"Thorne was trying to perfect humanity. To speed up evolution where there would literally be impossible to improve upon it. Among his subjects was me. You know how he created me? He brutally killed my mother and then fed her to a cannibal. He did that to my mother. And you know what the worst part is? As soon as I had been created, he disqualified me as a candidate for his perfection, locked me up and threw away the key. He killed an innocent woman, and prevented me from having a happy normal life for nothing! That\u0027s who you remind me of. You are exactly as ruthless, cold-hearted and selfish as he was, and he is the last person you\u0027d want to resemble right now.\"\n\nAs his pain rises, he starts to scream. I can feel his attempts to free himself become more and more desperate, but they are all equally ineffective.\n\n\"Tell me something, Overlord. Did you intend for your brain to grow so large?\" I say to him, but he doesn\u0027t respond. He just keeps screaming and writhing in pain. I decrease it, just a little bit, which is more than he deserves, so that he can respond.\n\n\"Answer my question.\"\n\n\"No...no...I...no...that was....I didn\u0027t....\"\n\n\"So I suppose you want to find a way to decrease it.\"\n\n\"Well...maybe after I\u0027d...\" but then I see a lovely sight as his pupils grow larger, as he realizes the purpose of my question. After all, that sort of thing is what his intelligence is for, isn\u0027t it? His heartbeat rises even higher than it was, and he is sweating like I\u0027ve never seen before. \"No. Please. Don\u0027t do it.\"\n\nI savor the moment. I squeeze as much terror from him, as he knows the fate that awaits him, and he begs me for mercy. I don\u0027t answer any of them, I just stare into his cruel, heartless eyes, and wait for his heartbeat to go down again. Perhaps my moment of pause has given him hope, perhaps he thinks I am actually considering to let him live. Good, then I can inflict more pain upon him as I crush his last feeling of hope.\n\nHis look of terror resumes as he feels a powerful force touch his mind. I channel myself around his entire brain, but I don\u0027t kill him yet. I just make sure that he feels as much of it as possible, so I compress his brain slowly. He cries and begs all he cans, until he is rendered motionless. I then toss his remains aside. There is no use in punishing him anymore.\n","page 61":"I tear the roof, and the ground above the facility off, pulling the lights off as well and leaving him exposed to the night. The only light around is miles away, not that it matters. He\u0027s in my domain now.\n","page 64":"\"He deserved that\" Leksiah says.\n\n\"It feels good, doesn\u0027t it? Witnessing someone receiving his just desserts.\"\n\nLeksiah nods and looks at the other subjects.\n\n\"Yes. It\u0027s nice. It feels right\" she then says and looks at me.\n","page 63":"I raise Overlord into the air, as he is helpless to stop me.\n\n\"No. Please! Don\u0027t kill me. Think of what a waste it would be!\"\n\n\"Waste? I am doing humanity a favor.\"\n\n\"Think about everything I\u0027m doing. I\u0027m making everything better. I\u0027m making everyone smarter.\"\n\n\"You\u0027re making yourself better at the expense of everyone else. You know who you remind me of? Michael Thorne. You heard of him?\"\n\nOverlord shakes his head, and I say \"Thorne was trying to perfect humanity. To speed up evolution where there would literally be impossible to improve upon it. Among his subjects was me. You know how he created me? He brutally killed my mother and then fed her to a cannibal. He did that to my mother. And you know what the worst part is? As soon as I had been created, he disqualified me as a candidate for his perfection, locked me up and threw away the key. He killed an innocent woman, and prevented me from having a happy normal life for nothing! That\u0027s who you remind me of. You are exactly as ruthless, cold-hearted and selfish as he was, and he is the last person you\u0027d want to resemble right now.\"\n\nAs his pain rises, he starts to scream. I can feel his attempts to free himself become more and more desperate, but they are all equally ineffective.\n\n\"Tell me something, Overlord. Did you intend for your brain to grow so large?\" I say to him, but he doesn\u0027t respond. He just keeps screaming and writhing in pain. I decrease it, just a little bit, which is more than he deserves, so that he can respond.\n\n\"Answer my question.\"\n\n\"No...no...I...no...that was....I didn\u0027t....\"\n\n\"So I suppose you want to find a way to decrease it.\"\n\n\"Well...maybe after I\u0027d...\" but then I see a lovely sight as his pupils grow larger, as he realizes the purpose of my question. After all, that sort of thing is what his intelligence is for, isn\u0027t it? His heartbeat rises even higher than it was, and he is sweating like I\u0027ve never seen before. \"No. Please. Don\u0027t do it.\"\n\nI savor the moment. I squeeze as much terror from him, as he knows the fate that awaits him, and he begs me for mercy. I don\u0027t answer any of them, I just stare into his cruel, heartless eyes, and wait for his heartbeat to go down again. Perhaps my moment of pause has given him hope, perhaps he thinks I am actually considering to let him live. Good, then I can inflict more pain upon him as I crush his last feeling of hope.\n\nHis look of terror resumes as he feels a powerful force touch his mind. I channel myself around his entire brain, but I don\u0027t kill him yet. I just make sure that he feels as much of it as possible, so I compress his brain slowly. He cries and begs all he cans, until he is rendered motionless. I then toss his remains aside. There is no use in punishing him anymore.\n","page 220":"I remember where the power room is, but getting there requires me to go through an illuminated area. It\u0027s not as lit up as the room with the gun, so I could find some clothing to cover my while making my way to the power area, and there, I can deactivate the power in the base, causing all the lights to go off.\n"}