{"page 123":"\"Hey stranger.\" Sophia\u0027s familiar face, that beautiful face that haunted my every dream and memory, finally appeared. \"I guess I have a lot of explaining to do.\"\n\nShe sighed softly and shook her head slightly. \"I wanted to tell you...a million times. Everyday, I wanted to tell you. That day I got diagnosed, all I could think of was how I could tell you.\"\n\nShe paused and for a second, her chin trembles. Her bangs covering her eyes so I can\u0027t possibly see them. But she takes a second to breathe in and looks up with a smile. \"I guess I wanted to be selfish in the end. I\u0027m sorry about that. But, I wanted to be with you. Every day, I wanted to be with you. I knew...that the treatment had such little chance of working and I\u0027d never get to see you and I was so scared and...\"\n\nTears fill her eyes and I can tell she\u0027s widening them as much as possible so not a single tear falls. Before it can possibly fall, she places both her fingers on her cheeks and smiles widely. \"Please, forgive me? I want you to remember me like this. Healthy and always, loving you.\"\n\nThe tape ended and I looked through the box. There were only one piece of notebook paper.\n\nWas it her handwriting? Or was it someone else?\n\nAll it said was a hospital and a room number.\n","page 122":"I pick the flower so quickly that I don\u0027t even stop to look at her face. But when I look up and see her expression, already I feel like I made a terrible mistake.\n\n\"Thank you.\" She smiles back at me, but her eyes don\u0027t light up the way I expected them to.\n\n\"Thank you.\" I repeat as I watch the light fade slowly from her chest.\n\nShe\u0027s back to normal now.\n\nThe tape can be played.\n\nSuddenly I hear the static noise start up again and Sophia starts to walk away. Her face has a knowing smile, a smile that won\u0027t reach up to her eyes.\n\nThose eyes won\u0027t hold a light anymore.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nI\u0027m sorry Sophia.\n","page 124":"I slowly drop my hands and realize that I was carrying nothing.\n\nI had already watched that tape.\n\nMy hands are no longer the hands of a younger boy, but of a man. The well-worn hands of an adult man.\n\n\"Hey, are you looking over Sara?\" A soft voice in the background. It wasn\u0027t Sophia though...at least, not my Sophia.\n\n\"Of course.\" I laugh back and my voice is so deep and crackly that it takes some time getting used to hearing.\n\n\"Jeez. You\u0027re still holding her wrong.\" Telly walks in and gently rubs Sara\u0027s face. \"I can\u0027t understand how you can hold her like a football and still have her be a daddy\u0027s girl.\"\n\nLooking down with a smile, I feel an odd sense of peace.\n\n\"What can I say?\" I reply back \"Sophia loves me.\"\n","page 127":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 126":"\"Hey stranger.\" Sophia\u0027s familiar face, that beautiful face that haunted my every dream and memory, finally appeared. \"I guess I have a lot of explaining to do.\"\n\nShe sighed softly and shook her head slightly. \"I wanted to tell you...a million times. Everyday, I wanted to tell you. That day I got diagnosed, all I could think of was how I could tell you.\"\n\nShe paused and for a second, her chin trembles. Her bangs covering her eyes so I can\u0027t possibly see them. But she takes a second to breathe in and looks up with a smile. \"I guess I wanted to be selfish in the end. I\u0027m sorry about that. But, I wanted to be with you. Every day, I wanted to be with you. I knew...that the treatment had such little chance of working and I\u0027d never get to see you and I was so scared and...\"\n\nTears fill her eyes and I can tell she\u0027s widening them as much as possible so not a single tear falls. Before it can possibly fall, she places both her fingers on her cheeks and smiles widely. \"Please, forgive me? I want you to remember me like this. Healthy and always, loving you.\"\n\nThe tape ended and I looked through the box. There were only one piece of notebook paper.\n\nWas it her handwriting? Or was it someone else?\n\nAll it said was a hospital and a room number.\n","page 128":"\"Coward.\" My little sister wasn\u0027t the type that minced her words, biting as they may be.\n\n\"You have to understand it from a guy\u0027s perspective.\" I shoot back \"What if she pushed me away?\"\n\n\"Sophia?\" Emily laughed, her eyes stil glued to her NDS \"Well, as long as we\u0027re playing the \u0027what if\u0027 scenarios...what if she didn\u0027t?\"\n\n\"This doesn\u0027t help Em...\" Leaning back with a heavy sigh, I ask \"What can I do?\"\n\n\"Run to her house with a boombox and play a song by Peter Gabriel?\" Emily laughed \"Or maybe you could visit her. Sophia texted me that she\u0027s sick and I think you can step it up and maybe change this.\"\n","page 77":"Sophia\u0027s jaw dropped and she smacked me hard on the side of my shoulder. \"You jerk!\" Her words are devoid of anger, but it had just the right amount of shock to make me feel guilty.\n\n\"You can\u0027t judge a book by its cover.\" I tease, but already I can tell she isn\u0027t happy.\n\n\"I didn\u0027t mean it.\" I say in my most sincere voice.\n\n\"I don\u0027t care.\" She\u0027d pout heavily.\n\nEventually the silence between us grew and she would sigh heavily.\n\n\"Sophia....you make me smile.\" I sing in a silly voice.\n\n\"You\u0027re an awful singer.\" She smiled and I have to admit, my voice probably was off-key the entire time. \n\n\"Better than Kermit the frog?\" I ask hopefully.\n\n\"Worse.\" She laughed.\n\n\"Well, I\u0027ll keep practicing then.\" I kiss the top of her forehead softly and she blushed gently.\n\n\"Does this mean I have to keep listening?\"\n\n\"I wouldn\u0027t want to sing for anyone else but you.\"\n","page 76":"A beautiful blush spreads rapidly across her face and she bit her lip softly as she looked away. The sun was setting, we always walked slowly after school.  Not because either one of us was lazy or out of shape, but because this made the time we spent everyday longer.\n\n\"You always say the right things.\" She whispered, her words carried to me by the wind. \"But why is that?\"\n\n\"Hmm?\" I cock my head confusedly \"Isn\u0027t it obvious?\"\n\n\"Is it really that easy?\" Sophia\u0027s voice was becoming so soft that I could barely hear her. It almost like she wasn\u0027t there at all. \"To say those things and really mean it?\"\n","page 79":"It was like I was driving a car in a circle and finally made a sharp turn off of a cliff.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nI had to stop this cycle.\n\n\"Hey...what\u0027s wrong?\" Sophia came close to me and rested her warm forehead against mine \"You\u0027re acting strange.\"\n\n\"Just...\" I want to say everything and only have her listen and tell me that it\u0027ll be all right. But I know she won\u0027t answer that way and because of that certainty, I can\u0027t ask her anything. \"...nothing.\"\n\nShe smiled softly \"C\u0027mon. Let\u0027s go to sleep. I need my arm pillow.\"\n","page 78":"I try to get her to look back at me, but she won\u0027t look back until the sun is gone. Somehow the light is still there...something is off about this moment. I can feel it, like watching a video tape with the sequence mixed up.\n\n\"I guess you\u0027re right.\" She says the words, but the feeling isn\u0027t there. \"Hey, the sun\u0027s gone.\"\n\nShe walks away and for a second, it feels like everything is resetting.\n\nThe tape will still play.\n\n\"Hey, wait up!\" I yell after her and she begins to teasingly break out into a sprint. \"C\"mon Sophia!\"\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n","page 130":"I didn\u0027t want to risk it.\n\nFalling asleep next to her was the epitome of suffering. I mean, the most wonderful possible suffering there is, but still...suffering.\n\nHow could I sleep?\n\nShe lay on top of me with her tiny body, her arms wrapped gently around my waist. That familiar scent of cinnamon mint wafting into my nose and overwhelming my senses.\n\nAs I stared up at her beautiful face, I could see a tiny drool slowly leak out of her mouth. I laughed gently, but could hear her softly grumble as her pillow (me) shifted around and made her spot less comfortable.\n\nWhat if things were different?\n\nLet\u0027s change the story now.\n\nWhat if I could save her?\n","page 132":"\"She\u0027s amazing.\" A content smile spread across Sophia\u0027s beautiful face and I can\u0027t help but stare. At her and the world\u0027s luckiest cat.\n\n\"Are you feeling better?\" I gingerly ask and for a second, a shadow crosses her face. Her eyes lower and she ponders the question.\n\n\"Hmm, now I am.\" Kissing the cat gently on the forehead, Sophia laughed \"What\u0027s a good name for a cat like this?\"\n\n\"Err...Sophia II?\" \n\n\"That\u0027s a terrible name!\" \n\n\"What? I\u0027ve been calling her that ever since she was a kitten.\" Staring at her with mock horror, I reply \"I\u0027m pretty sure that cat already thinks that\u0027s her name.\"\n\n\"You\u0027re joking.\" Sophia looks at me with hopeful eyes, but as I shake my head reluctantly, she sighs \"Well...at least there\u0027ll always be a Sophia around you.\"\n\nShe looked so sad for a moment that I had to ask \"What, you\u0027re already abandoning the cat? Just because of a bad name?\"\n\nShe looks up and smiles at my bad joke \"You know I didn\u0027t mean that.\"\n\nThen, what did you mean? The question is on the tip of my tongue, but I swallow it back.\n\nShe wouldn\u0027t answer it.\n\nNo, she wouldn\u0027t.\n","page 131":"\"Why are you here?\" Sophia\u0027s voice was stuffy and she was completely covered in tissues. I had to wipe away the mound to get to the pretty girl underneath.\n\n\"A little bird told me I had to bring chicken noodle soup and tea.\" I hold out the bag \"It\u0027s your favorite kind.\"\n\n\"What a messed up little bird.\" Sophia grinned back, but her eyes still look miserable. \"I didn\u0027t want you to see me like this.\"\n\nSitting down next to her, I had to smile. She was looking down and blushing as though she was a complete mess. But even as a mess, Sophia could make my heart skip a beat any day.\n\n\"I\u0027ve seen you covered in mud before. Remember when we caught Freddy?\"\n\n\"So you still remember how awful I looked even though it was years ago?\" Sophia\u0027s eyes grew wide with horror. \n\n\"C\u0027mon, let me make up for this constant foot in my mouth.\" I plead with her.\n\nShe looks at me straightforwardly with those brillant emerald eyes. \"How?\"\n\nGood question.\n","page 112":"\"You\u0027re heavy!\" I groan heavily, but that only made Sophia hug me more tightly from behind. She was actually as light as a feather, but I liked how she would tighten her grip every time I complained.\n\n\"Mmm...do you hate girls like me?\" Suddenly, her voice grew sad and I can tell she\u0027s still worried about what had happened earlier. It wasn\u0027t her fault that every guy was surrounding her like a piece of meat, but it still made me angry thinking about how they undressed her with their eyes.\n\nEven back then, she was mine.\n\nIt wasn\u0027t something I questioned. Just like she never had to question that I was hers.\n\nThat\u0027s just how it was and how it\u0027d always be.\n\n\"Hey! You never answered!\" Sophia gently hit the back of my shoulder \"What kind of girl do you like?\"\n\n\"Hmm...\" I paused with a silly smile \"I guess I like shorter hair\"\n\nActually, it didn\u0027t matter to me. She\u0027d look just as beautiful bald in my eyes.\n\n\"Hmph.\" Sophia turned and pouted \"Well, so do I.\"\n\nI know she didn\u0027t care either.\n\nBut the next day, we both got haircuts.\n\n\"Just a coincidence?\" I ask her skeptically as she tied her hair in a tiny ponytail.\n\n\"Just a coincidence.\" She agrees as I absent-mindedly tug at my short buzz cut.\n\nAs I was telling the story, Sophia\u0027s hand was slowly falling out of mine. No matter how tightly I held her hand, there was no strength left.\n\nHer eyes were closed and they would never open.\n\nShe was gone.\n\n\"Sophia?\" I whisper \"It really wasn\u0027t a coincidence.\"\n\nNothing about you and me was a coincidence.\n","page 199":"It was out of nowhere.\n\n\"Sophia?\" The side of the bed that belonged to her was empty. It was so cold that she must have left a long time ago. \"Sophia, where are you?\"\n\nPhone calls that were never answered. Family members that would shut the door in my face.\n\nSophia vanished off the face of the Earth so easily, it was almost like she wasn\u0027t there in the first place.\n\nBut whenever that terrible thought crosses my mind, I remember. Those nights she fell asleep in my arm. Those nights she held me close.\n\nThat night when she was finally mine.\n\nIt would be months before I found out what happened to her.\n","page 115":"\"I\u0027m ready.\"\n\n She tried so hard to seem like an adult. Even the lingerie she bought was clearly for someone much older.\n\nMy mouth was dry and I could feel a gallon of sweat begin to pour down my forehead. But she was absolutely perfect.\n\nAbsolutely perfect.\n\nIn my arms, she was so tiny. Was Sophia always this small? Before I can ask, she stops me with a kiss. Any kind of comprehensible thought in my brain stops and all I can do is react.\n\nTo kiss her when she kisses me back.\n\nTo slip off that one-piece off her shoulder.\n\n\"Are you sure?\" I ask her hoarsely.\n\nShe nods softly and I give in.\n","page 118":"\"I\u0027m ready.\"\n\n She tried so hard to seem like an adult. Even the lingerie she bought was clearly for someone much older.\n\nMy mouth was dry and I could feel a gallon of sweat begin to pour down my forehead. But she was absolutely perfect.\n\nAbsolutely perfect.\n\nIn my arms, she was so tiny. Was Sophia always this small? Before I can ask, she stops me with a kiss. Any kind of comprehensible thought in my brain stops and all I can do is react.\n\nTo kiss her when she kisses me back.\n\nTo slip off that one-piece off her shoulder.\n\n\"Are you sure?\" I ask her hoarsely.\n\nShe nods softly and I give in.\n","page 117":"\"Hey stranger.\" Sophia\u0027s familiar face, that beautiful face that haunted my every dream and memory, finally appeared. \"I guess I have a lot of explaining to do.\"\n\nShe sighed softly and shook her head slightly. \"I wanted to tell you...a million times. Everyday, I wanted to tell you. That day I got diagnosed, all I could think of was how I could tell you.\"\n\nShe paused and for a second, her chin trembles. Her bangs covering her eyes so I can\u0027t possibly see them. But she takes a second to breathe in and looks up with a smile. \"I guess I wanted to be selfish in the end. I\u0027m sorry about that. But, I wanted to be with you. Every day, I wanted to be with you. I knew...that the treatment had such little chance of working and I\u0027d never get to see you and I was so scared and...\"\n\nTears fill her eyes and I can tell she\u0027s widening them as much as possible so not a single tear falls. Before it can possibly fall, she places both her fingers on her cheeks and smiles widely. \"Please, forgive me? I want you to remember me like this. Healthy and always, loving you.\"\n\nThe tape ended and I looked through the box. There were only one piece of notebook paper.\n\nWas it her handwriting? Or was it someone else?\n\nAll it said was a hospital and a room number.\n","page 88":"Her jaw dropped.\n\n\"I\u0027ll prove you wrong!\" She said in a teasing voice, but I saw the fire of determination in her eyes. Sophia was the type of person who would do anything if she said it.\n\nShe was special like that.\n\nBut the next day, when we were enjoying an order of sherbert, I could tell that Sophia wanted a bite. Her eyes lit up and I could see her fingers tapping impatiently on her sides.\n\n\"Eat up, it\u0027s delicious.\" I enthusiastically take a bite of mine, but she shakes her head. Her eyes never leaving the bowl of sherbert.\n\nIt was like there were an angel and a devil on her shoulder. Both whispering encouragement.\n\n\"He\u0027s too nice to mention that statement you made.\" The angel advised Sophia while the devil laughed heartily and whispered \"He\u0027s just waiting for you to take a bite and then he\u0027ll mention it.\"\n\n\"They\u0027re both wrong.\" I accidently say out loud and after Sophia shoots me a quizzical stare, I lift my hands up and swear \"I meant to say, you\u0027re a complete twig. Please, don\u0027t let delicious sherbert go to waste because of my drawing.\"\n\nShe laughed and nibbled at the bowl. At the time, I thought maybe she was feeling nevous or wasn\u0027t hungry. I should have noticed how rail thin her arms were even then. How easily the bone stuck out and how fragile her entire body was beginning to become.\n\nMaybe if I had noticed, I could have saved her.\n","page 87":"It wasn\u0027t easy to say, but it was the truth.\n\n\"Why?\" She flashed me a brillant grin as she carefully dried off her hair. \"You know I only have eyes for you.\"\n\nI want to avert my face so she can\u0027t see that huge grin that spreads on my face, but she caught it anyways. \"I hate seeing them around you though.\" \n\n\"Why?\" She walks up close to me, her body still dripping water. That familiar scent of cinnamon mint, I\u0027d breathe it in all day long if I could.\n\n\"They\u0027re always all over you.\"I look away with a pout. Partially to make my point, partially to catch my breath.\n\n\"Hey.\" She stops me with her hand and turns my head towards her. \"Even when they\u0027re around, I don\u0027t see them. I only see you.\"\n\n\"Always?\" I can\u0027t help but ask.\n\nShe smiles, but there is a hint of sadness as she replies \"Well...as long as always can last.\"\n","page 119":"I\u0027m not supposed to be here? I look to the side and all of a sudden, I see her.\n\nSophia...and me?\n\n\"God, get a room you too!\" Angie, Sophia\u0027s sister, was always teasing us.\n\n\"C\u0027mon, it\u0027s sweet.\" Stephanie laughed.\n\n\"Yeah, it\u0027s sweet how whipped he is.\" Alex smirked as he looked to the sky.\n\nHow is this possible? Unless...\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nThis happened before.\n\nYes.\n\nIf I\u0027m here, where is she?\n","page 89":"Sophia didn\u0027t look convinced.\n\n\"Here.\" I quickly reveal my second sketch, the real reason I had kept her waiting for so long. \"I think this one is more like you.\"\n\n\"I still have a sweet in my hand!\" She laughed, knocking her shoulder against mine. It was that moment when I noticed how thin she was becoming. Her shoulders were beautiful, every part of her was. But, they were so thin. So incredibly thin that it felt like she\u0027d break into a million pieces if I wasn\u0027t careful enough.\n\n\"For someone else though.\" I smile back \"Remember? The last time you baked a tray of cupcakes?\"\n\n\"Last month?\" Sophia always made the same face when she was thinking back. Her forehead would crinkle just slightly in the middle and she\u0027d tilt her head to the right. \"Why?\"\n\n\"You made twelve and gave away twelve.\" I poke her gently in the belly \"This thing barely exist.\"\n\n\"I eat a lot.\" Sophia\u0027s voice cracks a little bit more than normal and for long moment, an awkward silence lingers. As though I had mentioned something that couldn\u0027t be mentioned.\n\nAs though I was reminding her of something she wanted to forget.\n","page 80":"I can\u0027t help but ask. The way Sophia\u0027s been acting, it makes me feel like there\u0027s a little pit forming in the bottom of my stomach. Like she\u0027s planning to leave. Leave to somewhere I can\u0027t possibly follow.\n\n\"Ah...\" A shadow crosses her face and before she can hide it, a flicker of sadness shows. As though she was caught. \"We\u0027re all going somewhere eventually. \n\nThat\u0027s not an answer though.\n\nI want to press further, but she won\u0027t look me in the face. As though she knows and I know that any other question would ruin everything.\n\nWhy is that?\n\nI try to think and can only hear an odd static sound.\n\n\"I\u0027ve got to go.\" Sophia starts to walk away and I walk next to her, holding her hand.\n\nI guess I was hopeful she\u0027d explain what she meant.\n\n But the entire time, she didn\u0027t say a single word.\n","page 82":"How many times did I have to drag her to the swimming pool? Probably a million. I loved being her life preserver, but there were always haunted houses and scary movies to replace the old swimming days. \n\nPlus, what if she was all alone in a pool by herself?\n\n\"I can\u0027t believe you finally know how to swim.\" We both resurface and I smile back at her. She grins back and eagerly dives into the ocean.\n\nWait, how much time has passed?\n\nI quickly dive in and see her watching a group of turtles swim beneath her feeth. Her hair floating in the air softly around her peaceful face.\n\nWhy did she only look peaceful at moments like these?\n\nWe both resurface, gasping for air. After heading off to the beach to dry off, I can hear the hooting and hollering of the local boys. Sophia always got a lot of interest wherever she went, it should have been something I have gotten used to by now. But my face turns a telltale red and Sophia asks teasingly \"What, are you jealous?\"\n","page 81":"\"I can do this.\" Sophia was determinedly chewing away on her spare pencil as she erased her sketching. The deadline was moved up and she was staying up all night.\n\n\"You need to rest. C\u0027mon, the bed is soft and comfy.\"\n\n\"You can go without me.\" She doesn\u0027t even shift her gaze off the paper. \"I\u0027m going to finish this.\"\n\nI already knew what she would say before she said it. Most nights, I would go ahead and impatiently wait for her to slip next to me. But tonight, I wanted to be next to her. I had to do something while I waited.\n\n\"Let me show off.\" I make a big show of getting some pens and markers.\"I\u0027ll draw you just as I see you.\"\n\nA tiny smile appeared on her lips as she answered \"I\u0027ll be looking forward to it.\"\n","page 84":"It was surprisingly easy to sketch and only took a few hours to ink. By then, Sophia had long finished her art project and was waiting impatiently.\n\n\"Here you are.\" I smile innocently as she stared at  herself nibbling on fruits covered in chocolate.\n\n\"Hey!\" She\u0027s smiling as she knocks my shoulder \"that\u0027s how you really see me?\"\n\n\"Exactly.\"\n\n\"Hmm...\" She leans down and her hair grazes my arm. Soft and silky, I want to scratch at my arm all of a sudden but a bigger part of me just wants to stay still. Just in case the slightest movement scares her off. \"Do I really eat sweets all the time?\"\n","page 83":"It was surprisingly easy to sketch and only took a few hours to ink. By then, Sophia had long finished her art project and was waiting impatiently.\n\n\"Here you are.\" I smile innocently as she stared at the little chibi version of herself eating a huge cupcake.\n\n\"Hey!\" She\u0027s smiling as she knocks my shoulder \"that\u0027s how you really see me?\"\n\n\"Exactly.\"\n\n\"Hmm...\" She leans down and her hair grazes my arm. Soft and silky, I want to scratch at my arm all of a sudden but a bigger part of me just wants to stay still. Just in case the slightest movement scares her off. \"Do I really eat sweets all the time?\"\n","page 86":"Sophia didn\u0027t look convinced.\n\n\"Here.\" I quickly reveal my second sketch, the real reason I had kept her waiting for so long. \"I think this one is more like you.\"\n\n\"I still have a sweet in my hand!\" She laughed, knocking her shoulder against mine. It was that moment when I noticed how thin she was becoming. Her shoulders were beautiful, every part of her was. But, they were so thin. So incredibly thin that it felt like she\u0027d break into a million pieces if I wasn\u0027t careful enough.\n\n\"For someone else though.\" I smile back \"Remember? The last time you baked a tray of cupcakes?\"\n\n\"Last month?\" Sophia always made the same face when she was thinking back. Her forehead would crinkle just slightly in the middle and she\u0027d tilt her head to the right. \"Why?\"\n\n\"You made twelve and gave away twelve.\" I poke her gently in the belly \"This thing barely exist.\"\n\n\"I eat a lot.\" Sophia\u0027s voice cracks a little bit more than normal and for long moment, an awkward silence lingers. As though I had mentioned something that couldn\u0027t be mentioned.\n\nAs though I was reminding her of something she wanted to forget.\n","page 85":"Her jaw dropped.\n\n\"I\u0027ll prove you wrong!\" She said in a teasing voice, but I saw the fire of determination in her eyes. Sophia was the type of person who would do anything if she said it.\n\nShe was special like that.\n\nBut the next day, when we were enjoying an order of sherbert, I could tell that Sophia wanted a bite. Her eyes lit up and I could see her fingers tapping impatiently on her sides.\n\n\"Eat up, it\u0027s delicious.\" I enthusiastically take a bite of mine, but she shakes her head. Her eyes never leaving the bowl of sherbert.\n\nIt was like there were an angel and a devil on her shoulder. Both whispering encouragement.\n\n\"He\u0027s too nice to mention that statement you made.\" The angel advised Sophia while the devil laughed heartily and whispered \"He\u0027s just waiting for you to take a bite and then he\u0027ll mention it.\"\n\n\"They\u0027re both wrong.\" I accidently say out loud and after Sophia shoots me a quizzical stare, I lift my hands up and swear \"I meant to say, you\u0027re a complete twig. Please, don\u0027t let delicious sherbert go to waste because of my drawing.\"\n\nShe laughed and nibbled at the bowl. At the time, I thought maybe she was feeling nevous or wasn\u0027t hungry. I should have noticed how rail thin her arms were even then. How easily the bone stuck out and how fragile her entire body was beginning to become.\n\nMaybe if I had noticed, I could have saved her.\n","page 121":"\"Thank you.\" A huge smile broke free on Sophia\u0027s face and I could hear all the relief in the world in those two words.\n\nShe let go of her hands and now I can finally see. That light, that bright light was shining from within.\n\nSophia...you aren\u0027t really with me?\n\nHer body begins to fade slowly. Her hands are the first to go, then the legs, and then the torso.\n\nThe last time I see before she disappears completely is a smile. Her beautiful smile as she disappeared completely from my side.\n\nLooking down at my hands, I see a well worn tape.\n\nDid I see this tape? \n\nDoes it matter?\n","page 120":"There were flowers lining the pathway.\n\n \"Sophia?\" I ask gingerly, as though everything made sense. It didn\u0027t, it was a convoluted mess. But, somehow I knew that something was wrong. \n\n\"Can I go?\" She asks me softly and for a second, I see a light linger on her chest. So brightly, I can\u0027t believe I didn\u0027t see it in the first place.\n\n\"Go where? Are you holding a flashlight?\" I ask her, but there is no conviction in my words. As though I was a bad actor reading from a silly script.\n\n\"I need to rest. Or do you need me?\"\n\nThe static noise was getting so loud that I could barely hear her soft and silky voice. The familiar scent of cinnamon mint is now overpowering me and I feel so sick that it is a miracle I don\u0027t vomit.\n\n\"What if I was selfish?\" I can\u0027t help but ask her \"What can I do to keep you with me?\"\n\nShe smiled sadly \"Just give me a flower. I need to rewind.\"\n\nThis isn\u0027t a funny joke. If it was a joke. My mind can\u0027t think straight because of that damn static noise. I have to make a choice and I just....\n","page 6":"Of course she\u0027d be standing right behind me when I was saying this. Staring at me with sad eyes that brimmed with tears as I stupidly told the guys that there\u0027s no chance I\u0027d like a girl as childish as Sophia. In her hands was an art book that she read each day, Sophia was an artist ever since she was a child. I would joke that I was her muse, but her brillance never relied upon me really.\n\n\"Ah...\" She smiled softly, her stricken eyes staring straight into mine \"I just wanted to show you...nothing. Never mind me.\" Her hands clenched tightly around the book as she spoke. She had grown up a lot since childhood. Considering how much of a shrimp she was as a kid, she grew up like a bean sprout.  But I was still always taller, thankfully because I had a few years on her.  She was always looking up to me and I was always looking down on her.\n\n\"I\u0027ve got to go.\" She won\u0027t even give me a chance to speak.  Instead, she turns and leaves so quickly that it looks ilke she\u0027s running away from me. Next period is art class, but I could just skip. Skip and figure out what to do next.\n","page 19":"I think I wanted to do this from the very beginning.\n\nThe weather turned from sunny to rainy in what seemed like a few seconds. Or maybe hours...or days.\n\nTIme stood still when I was kissing Sophia.\n\nIt was incredibly addicting.\n\nSoft, her lips and her body was so silky soft.\n\nThat familiar scent of cinnamon mint...all it took was one whiff and I was burying her neck against my face.\n\n\"Why can\u0027t I stop kissing you?\" My words are muffled against her neck, but she laughs as though she could understand every word.\n\n\"You have to stop eventually.\" She teases and as I shook my head fervently, she asks \"Nothing lasts forever.\"\n\nThe way she said those last three words made me pause and for a moment, the chill that went down my spine wasn\u0027t from the rain water.\n","page 5":"Some excuse, right? Yeah, they didn\u0027t buy it either. Maybe it would have worked if she wasn\u0027t only two years older and stunningly beautiful to match.  But, I worked out every day, not just because I wanted to be able to fight back. That was a reason, of course I wanted to cream every guy who looked at Sophia with dirty eyes. But being younger than Sophia automatically made things more difficult. Being shorter and smaller than the girl you like? C\u0027mon.\n\nWaking up with a heavy sigh, I see the same demon face that graced the angel\u0027s body in my dream. Sophia had slipped into my bed without me noticing. The scent of cinnamon mint washing over me and already I feel intoxicated. She was a few inches away and despite crawling into bed in her ratty pjs, she easily took my breath away.\n\n Looking over at the clock, I can tell the alarm is only a few minutes from going off. Even though Sophia sneaks into my bed each morning, it always feels so short.\n","page 18":"It was a silly response.\n\nBut she turned bright red and wouldn\u0027t look my way.\n\n\"I didn\u0027t mean it.\" I say in my most sincere voice.\n\n\"I don\u0027t care.\" She\u0027d pout heavily.\n\nEventually the silence between us grew and she would sigh heavily.\n\n\"Sophia....you make me smile.\" I sing in a silly voice.\n\n\"You\u0027re an awful singer.\" She smiled and I have to admit, my voice probably was off-key the entire time. \n\n\"Better than Kermit the frog?\" I ask hopefully.\n\n\"Worse.\" She laughed.\n\n\"Well, I\u0027ll keep practicing then.\" I kiss the top of her forehead softly and she blushed gently.\n\n\"Does this mean I have to keep listening?\"\n\n\"I wouldn\u0027t want to sing for anyone else but you.\"\n","page 8":"Before I could memorize everything, every curve of her lips or sigh as she snuggles against the pillow, the alarm rings and it is over. The stupidly loud alarm that jolts her awake and causes her to tumble clumsily out of bed with a loud crash.\n\n\"Ow...\" Sophia sleepily groans, her eyes still shut tightly \"that hurts!\" I can already anticipate her accusing eyes staring straight into mine, so I manage to cover myself with the blanket as though an instant protective barrier would fool her.\n\n\"Hmm, really asleep?\" Sophia\u0027s voice became mischievous and already I feel regret rushing through my system. But, it is too late to give up on the charade and I\u0027m already devoted to shutting my eyes as tight as possible.  But hearing a rustle as she turned off the alarm made me curious and smelling that familiar scent of cinnamon mint became too much. I peeked and saw a beautiful smile form on Sophia\u0027s face as she caught me.\n\n\"Gotcha!\" She poked my cheek with her finger and I feel like this has happened a million times before. The first time was when we were kids. I was determined to help her draw and she was more interested in the new sticker set she got for her birthday.\n\n\"You don\u0027t have a sticker on your finger this time.\" I yawn exaggeratedly and by her expression, I can tell she doesn\u0027t quite fall for it. \"I was dreaming of us as kids.\"\n\n\"Oh?\" A curious light filled her eyes \"Fond memories of yours truly?\"\n\nBack then, I always knew Sophia was beautiful. Even though all my guy friends warned of the deadly cooties that girls carried, I\u0027d get the cootie shot a million times over as long as I could stay near Sophia.\n\n\"Just remembering how you stuck permanent glue on the sticker and how that made the removal the most painful experience of my life.\"\n\n\"Most painful experience of your life so far.\" She shoots back, completely unfazed.\n\nBack at school, it was always like that. I cam remember that day perfectly. After a long separation, I remember walking in and seeing her instantly. The other people just melted into the background.  That tended to happen when Sophia was around.\n","page 147":"\"I can do this.\" Sophia was determinedly chewing away on her spare pencil as she erased her sketching. The deadline was moved up and she was staying up all night.\n\n\"You need to rest. C\u0027mon, the bed is soft and comfy.\"\n\n\"You can go without me.\" She doesn\u0027t even shift her gaze off the paper. \"I\u0027m going to finish this.\"\n\nI already knew what she would say before she said it. Most nights, I would go ahead and impatiently wait for her to slip next to me. But tonight, I wanted to be next to her. I had to do something while I waited.\n\n\"Let me show off.\" I make a big show of getting some pens and markers.\"I\u0027ll draw you just as I see you.\"\n\nA tiny smile appeared on her lips as she answered \"I\u0027ll be looking forward to it.\"\n","page 7":"\"I\u0027m sorry.\" The loud conversations going around us in the school cafeteria somehow muted enough for us to whisper, I tried to lean in close to a very unhappy Sophia. Her hair was in a messy ponytail and her clothes were whatever she could find in the two minutes available to dress before school started.\n\n\"You\u0027re not.\" Sophia wouldn\u0027t even look at me. Her lips in a permanent pout that hadn\u0027t faded from the morning. Still, she looks beautiful. Even in messy jeans and hair that stuck out in all the wrong places.\n\n\"I must have been asleep when I turned the alarm off.\" I insist with earnest eyes. But of course, Sophia can see right through me. \"Let me make it up to you. You can\u0027t stay mad at me forever over this.\"\n\n\"Maybe I can.\" She stuck out her tongue slightly and I can\u0027t help but stare. Stare as her bubblegum tongue slowly darts in between her lips that perfectly formed a slight pout. \"But how would you make it up to me?\"\n\nI lean closer to her, slowly resting my hand on the small of her back. \"Easy. Why don\u0027t we...?\"\n","page 146":"She wasn\u0027t somone you could replace.\n\nI can\u0027t imagine being someone else\u0027s life preserver. Or placing a sticker on some random girl\u0027s cheek and feeling even close to the way I\u0027d feel with Sophia.\n\nSecrets, they were driving me crazy...\n\nBut in the end, she was the one I wanted.\n\nShe was the one I needed.\n\nI shake my head and laugh at the thought that I had any doubts.\n\nAs though I could possibly be happy without my Sophia.\n\nDo you remember her?\n\nThat static and voice, why did it pop up so randomly? As though the tape had skipped suddenly. But now, it was falling into place.\n\nThe tape will be heard.\n\n\"Of course, I remember her.\"\n","page 2":"The angel in front of me disappears and in her place is an alluring devil whose barely clad body beckons me closer.\n\nYet despite the fact that there are only a few layers that separate me from her, I feel a great distance between the two of us. As though that smile was a steel barrier that I had no shot of breaking through.\n\n\"Silly question.\"  She laughs softly, as though the answer should already be known.\n\nBefore I can ask, her hand beckons me closer and I feel the softest kiss brush against my lips. As though she cared about me. As though she knew I cared about her.\n\nThose eyes were still open when she kissed me.\n\nWas she looking at me?\n\nOr beyond?\n","page 149":"\"This is amazing!\" Sophia laughed and her bright smile matched mine as I stared back at her stunning emerald eyes.\n\n \"I aim to please.\" I smile back and feel a wave of relief wash over me as she smiles back. It was a brillant idea, even if my wallet was weeping tears of Jeffersons and Franklins along the entire island.\n\n\"C\u0027mon, we have to see everything.\" She tugged on my arm and for the entire day, we became one with the island. I ate enough pineapple to last me several lifetimes.\n\nFinally when the sun was setting and fatigue kicked in, Sophia turned to me with a smile.\n\n\"I\u0027ve got an idea.\" She laughed \"Let\u0027s draw each other.\"\n","page 1":"She smiled softly and I could see relief in her eyes. Just a flash before she shut those emerald eyes and covered her face bashfully.\n\n\"I\u0027m so relieved.\" She admitted so softly that I couldn\u0027t help but grin back. Because she spoke those words only for me to hear.\n\nBut soon the wings melted off her back and the angel in front of me disappeared. In her place was a girl, a beautiful girl with a coquettish smile and dark garb. In her hands was a barely lit candle and her eyes that had been glinting with happiness now had a knowing resignation.  \n\n\"But is it because I\u0027m gone? Or is it because you don\u0027t like being alone?\" Her voice was growing more distant and all of a sudden the air grows cold.\n\nBut before I could answer, before I could even think of what she could possibly mean, I woke up from that terrible dream.\n","page 148":"How many times did I have to drag her to the swimming pool? Probably a million. I loved being her life preserver, but there were always haunted houses and scary movies to replace the old swimming days. \n\nPlus, what if she was all alone in a pool by herself?\n\n\"I can\u0027t believe you finally know how to swim.\" We both resurface and I smile back at her. She grins back and eagerly dives into the ocean.\n\nWait, how much time has passed?\n\nI quickly dive in and see her watching a group of turtles swim beneath her feeth. Her hair floating in the air softly around her peaceful face.\n\nWhy did she only look peaceful at moments like these?\n\nWe both resurface, gasping for air. After heading off to the beach to dry off, I can hear the hooting and hollering of the local boys. Sophia always got a lot of interest wherever she went, it should have been something I have gotten used to by now. But my face turns a telltale red and Sophia asks teasingly \"What, are you jealous?\"\n","page 4":"It was a bit of a running gag in town how my parents met, how doggedly he pursued her without caring a bit about his pride or her rather formidable boyfriend whose right punch could knock out a giant for days.\n\nHe was the gangly new kid of the block and she was the beautiful princess who already had her Prince Charming.  It was like imagining Sleeping Beauty ditching her guy for the court jester.\n\n\"When you find someone who you can love completely...\" My dad fondly wrapped his arm around my mom and smiled \"You\u0027ve got to believe in the impossibility of being ecstatically happy.\"\n\nSappy words from a sappy guy. Still, it was easy to see why he\u0027d talk like that. His first love was a miracle.  Even he couldn\u0027t believe it worked out.\n\nBut Sophia and I was different. We were always together and always linked together. Back in the day when I was interrogated by all the big kids whose eyes inevitably fell on Sophia, I gave the same excuse over and over again. Not that I didn\u0027t care about her, but I did care about getting beat up by the same group of guys each day.\n","page 3":"It was a bit of a running gag in town how my parents met, how doggedly he pursued her without caring a bit about his pride or her rather formidable boyfriend whose right punch could knock out a giant for days.\n\nHe was the gangly new kid of the block and she was the beautiful princess who already had her Prince Charming.  It was like imagining Sleeping Beauty ditching her guy for the court jester.\n\n\"When you find someone who you can love completely...\" My dad fondly wrapped his arm around my mom and smiled \"You\u0027ve got to believe in the impossibility of being ecstatically happy.\"\n\nSappy words from a sappy guy. Still, it was easy to see why he\u0027d talk like that. His first love was a miracle.  Even he couldn\u0027t believe it worked out.\n\nBut Sophia and I was different. We were always together and always linked together. Back in the day when I was interrogated by all the big kids whose eyes inevitably fell on Sophia, I gave the same excuse over and over again. Not that I didn\u0027t care about her, but I did care about getting beat up by the same group of guys each day.\n","page 11":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 99":"\"Let me draw around you.\" I stare back at her and she smiled back at me. Her eyes were still cloudy and before I can say anything else, she eagerly stands up and nods her head.\n\n\"Wait a second.\" She runs into the closet and grabs a dress. But before I can say anything, she changes out of her Christmas attire and into the dress she picked out of the closet. It was so quickly, you could blink and miss it.\n\n\"How did...?\" Before I can ask another question, my mind goes to static. It must be the wine, surely I had too much to drink. \"Just sit down there.\"\n\nShe sits down eagerly and I carefully draw clouds behind her.\n\nAfter taking a picture, she turns to me and asks \"why clouds?\n\n \"They fit.\" I can\u0027t think clearly. Not when she was so close to me.  Looking down and breathing that familiar cinnamon mint.\n\nWhat should I do?\n","page 10":"The moment I walked into the room, I could feel her eyes avert to the other side of the room. She wouldn\u0027t look at me, even as I sat right next to her and waited for the slightest opening to speak.\n\n \"Why\u0027d you change your outfit?\" Mentally, I\u0027m already hitting my forehead. As though asking an unhappy girl about her clothes would help the situation.\n\n\"I wanted to change.\"  She won\u0027t even look my way as she speaks. Her eyebrows furrowed in concentration as she draws childish butterflies and puppies.\n\n\"I wish you didn\u0027t.\" Scooting next to her, I draw a crude girl in red whose clothes cover her entire body \"You know all the boys in the class are looking at you, right?\"\n\n\"Who\u0027d look at a child?\" Sophia\u0027s pout deepens and I feel a slightly relieved smile as she responds back. At least getting her to talk was a start.\n\n\"Other children perhaps.\" Drawing in blue this time, I draw a cuddly couple and smile back at her \"You know, we\u0027re still kids Sophia. The guys before were a lot older, they even had scraggly beards and moustaches.\"\n\nA tiny smile crept across her face as she spoke \"You\u0027re growing one already.\"\n\nShe smiled! I can\u0027t help it as a huge grin cracks across my face and I laugh \"I\u0027ll shave it off. I\u0027ll never be too old for you Sophia.\"\n","page 98":"\"You look great!\" I can\u0027t speak well with the fake vampire teeth in my mouth, but I manage to at least sound somewhat understandable.\n\nBut Sophia was staring at her reflection in the mirror with an odd expression.  It wasn\u0027t an expression I remember seeing before. Her eyes were wide and a strange fascination lit those beautiful emerald eyes.\n\n\"....so this is how I\u0027d look in the end.\" The words were spoken so softly I could barely hear them. An odd feeling of trepidation filled me and I couldn\u0027t let the silence fill up the space between us.\n\n\"Yeah, undead buddy!\" I lean heavily against her shoulder and for a moment, I feel her crumple against my weight. Luckily, I kept most of my weight on my other leg and manage to regain my balance before we both topple over. \"Sheesh Sophia, you used to be able to carry me on your back!\"\n\n\"We were kids back then! Things...change.\" She bit her lip as she said those last two words. As though they were the beginning words to a torrent of others that would ruin everything.\n\nI hated that. I mean, I was getting used to those odd silences, those secrets that were forming between her and me.  But that night, I wanted it to be over. But that night, Sophia still wouldn\u0027t look away from her reflection.\n\nThat reflection of a girl long dead.\n","page 13":"\"How is this making up for anything?\" Sophia huffed and puffed as she dilligently ran to keep up with my light jogging.\n\n\"Weren\u0027t you always complaining about how out of shape you\u0027ve gotten?\" I try to slow down to seem like I\u0027m helping, but a little bit of me feels happy. Before it was always me desperately chasing her, doing anything to keep up.\n\n\"Okay...so I was a total mess today and I\u0027m fat?\" Sophia laughs incredulously, but a smile still lingers on her face. Like even she knew that her as a total mess was still stunningly beautiful and that any fat on her body would be perfectly placed so you wouldn\u0027t be able to tell that she eaten a few more slices of pie than what was wise.\n\n\"You know I didn\u0027t mean it that way.\" \n\n\"Yeah, but you always say things that people misunderstand. You\u0027re going to get in a lot of trouble with girls if you don\u0027t shape up.\"\n\nApparently I was always being misunderstood by her. My dad always told me that you have to be ridiculously open to failure when it came to girls. Even though it was terrifying to make the first step, you\u0027ll make it if the girl is worth it and Sophia was worth it.\n\n It wasn\u0027t like I didn\u0027t try to give her signs. I always kept looking at her lips. Imagining how it would feel, how amazing it would feel to kiss them the first time...and the second...and the millionth.\n\n\"Hmm? \" Sophia paused in front of me and leaned forward. Her face slightly covered with a sheen of sweat \"Did you fall in love with me?\" She laughed a little at the end, certain that I hadn\u0027t.\n\nIt was kinda suprising how clueless Sophia could be. Or maybe cruel would be a better word.\n","page 15":"\"Coward.\" My little sister wasn\u0027t the type that minced her words, biting as they may be.\n\n\"You have to understand it from a guy\u0027s perspective.\" I shoot back \"What if she pushed me away?\"\n\n\"Sophia?\" Emily laughed, her eyes stil glued to her NDS \"Well, as long as we\u0027re playing the \u0027what if\u0027 scenarios...what if she didn\u0027t?\"\n\n\"This doesn\u0027t help Em...\" Leaning back with a heavy sigh, I ask \"What can I do?\"\n\n\"Run to her house with a boombox and play a song by Peter Gabriel?\" Emily laughed \"Or maybe you could visit her. Sophia texted me that she\u0027s sick and I think you can step it up and maybe change this.\"\n","page 9":"Back when we were kids, I had a system worked out whenever I messed up around Sophia.  It wasn\u0027t something that happened often, thank goodness. I couldn\u0027t stand it if Sophia was upset with me. It was back at an age when girls and boys didn\u0027t really hang out together.  But, Sophia was different. It was just her and me. It was something I never questioned, like the air I breathed.  So when she wasn\u0027t happy....\n\n\"I won\u0027t forgive you next time.\" Sophia would say each time she bit angrily into her favorite toasted bagel.\n\nOddly enough, it was charming. As she tried to appear angry as she bit into her toasted bagel, I\u0027d find myself hiding a smile the entire time. She\u0027d always forgive me, no matter what screw-up I made.\n\nEven though I felt comforted that she had forgiven me in the past, it didn\u0027t make the memory of Sophia\u0027s hurt face feel any better. I had to do something, but what?\n","page 14":"To this day, I don\u0027t know how I had the courage to do it. For anyone thinking movies portray a first kiss correctly, then I\u0027m very sorry to let you all down. Because as I leaned forward to kiss the girl of my dreams, I watch her blank expression only turn to a look of complete surprise. I kept waiting for the moment where her eyes closed and a blush spread across those perfect angular cheeks, but she looked like she had seen a ghost.  All I could do was close my eyes and very quickly kiss her lightly on the lips, a kiss where I\u0027m fairly certain my teeth had been exposed accidently and gave her a slight bite instead of a caress.\n\nFor a girl who smells just like cinnamon mint, she tasted completely different. She must have drank cherry soda at lunch because my first kiss tasted exactly like cherry coke. Sweet with a sparkle of electricity running through my system. There was even a buzzing noise...wait a second, what?\n\n\"I...have to go.\" Before I could open my eyes, I can hear Sophia open her cell phone and feel her entire demeanor change. It was not a friendly everyday text message, not at all.\n\nOpen your eyes you idiot! I want so badly to see her expression, I do. But there is something so terrifyingly vulnerable about this moment, this magical moment when I finally got to kiss Sophia that makes opening my eyes suddenly impossible. By the time I manage to get the strength, she\u0027s gone. Her running figure making me all the more curious as to what could possibly have been sent in that annoying text.\n\nMentally, I had a much different reaction from her. She was smiling back into my eyes with a growing smile, one that was nearly as wide as mine.\n\n\"Hey!\" Before I can fully sink into the ground in my misery, I hear Sophia\u0027s voice. She\u0027s far enough that I can\u0027t quite see her face, but I hear her perfectly. \"Leave your window unlocked!\"\n\nA wave of relief rushes over me and I try not to grin like an idiot.\n\nTried and probably failed miserably.\n\nThat night, I didn\u0027t sleep a wink. Not when I heard the window slowly creak open and feel Sophia slowly slip right next to me.  \n","page 17":"She would always have the same reaction to that statement. First, she\u0027d look away with a feigned haughty air, as though she wanted me to believe that she knew I\u0027d answer that way. But, I would always catch a glimpse of her face before she turned. I would see her smile and it was beautiful.\n\nHow could anyone see her and not see a beautiful girl?\n\n\"Hey, what are you thinking of?\" Sophia was munching on a tasty treat and I couldn\u0027t help but lean my head against hers.\n\n\"You.\"\n\nShe blushed and honestly, I kept thinking how lucky I was. How perfect these days were all the time.\n\nWait, is that possible?\n\nStatic in the background and it feels like my eyes are getting a little blurry. But I shake my head and try to ignore that dizzy feeling.\n\nIt\u0027ll be all right as long as Sophia is with me.\n\n \"Hey stranger.\" I guess I had been silent too long and Sophia poked my cheek gently \"Penny for your thoughts?\"\n\nTo be honest, all I could think of was one thing.\n","page 16":"\"This place is amazing!\" Sophia smiled widely, her eyes dancing with excitement as she stared at the beautiful sea life swimming before our eyes.\n\n\"Well, I aim to please.\" Sticking out my chest, I match her smile perfectly. \"C\u0027mon, let me try to show off my completely useless knowledge of all sea life.\" \n\n\"How are you such an expert on these things?\" Sophia leaned closely near me and I easily wrapped my arm around her waist. It just felt natural, like taking a step forward.\n\n\"My mom and dad met at Sea World, so they went there religiously each year with me in tow.\" I can\u0027t help but suddenly feel awkward. Sophia was so close and my hand was getting sweaty. Sweaty enough that I had to focus a good deal of my attention to make sure it didn\u0027t slip.\n\n\"Well, thanks for taking me here.\" She smiled back at me and for a moment, it felt like the world has paused. The fishes stopped swimming and Sophia was just standing there.\n\nIf there was ever a moment, now would be it.\n","page 91":"\"You look great!\" I can\u0027t speak well with the fake vampire teeth in my mouth, but I manage to at least sound somewhat understandable.\n\nBut Sophia was staring at her reflection in the mirror with an odd expression.  It wasn\u0027t an expression I remember seeing before. Her eyes were wide and a strange fascination lit those beautiful emerald eyes.\n\n\"....so this is how I\u0027d look in the end.\" The words were spoken so softly I could barely hear them. An odd feeling of trepidation filled me and I couldn\u0027t let the silence fill up the space between us.\n\n\"Yeah, undead buddy!\" I lean heavily against her shoulder and for a moment, I feel her crumple against my weight. Luckily, I kept most of my weight on my other leg and manage to regain my balance before we both topple over. \"Sheesh Sophia, you used to be able to carry me on your back!\"\n\n\"We were kids back then! Things...change.\" She bit her lip as she said those last two words. As though they were the beginning words to a torrent of others that would ruin everything.\n\nI hated that. I mean, I was getting used to those odd silences, those secrets that were forming between her and me.  But that night, I wanted it to be over. But that night, Sophia still wouldn\u0027t look away from her reflection.\n\nThat reflection of a girl long dead.\n","page 90":"\"Tell me a secret.\" Sophia\u0027s voice is a little sluggish and for a second, I wonder if it was the wisest decision opening up that bottle of christmas wine.\n\n\"I never keep any secrets from you.\" I answer and honestly, there is nothing I could possibly hide from Sophia. She knew everything about me. All it took was one stare from her and I was completely transparent.\n\nBut Sophia was different. It was like there was a veil, a impenetrable veil between her and me. I could tell by her eyes. Those beautiful emerald eyes that told no secrets and held no lies.\n\n\"Everybody has secrets.\" She leaned forward and all I can do is stare back at her. The Christmas light gave her silver hair a light pink tint, or maybe my mind was finally going a little crazy. She was like a drug I couldn\u0027t stop taking.\n\nBut was it the same for her?\n\n\"Tell me yours.\" I want to say those words. But maybe I knew the answer and I didn\u0027t want to hear it.\n\nMaybe I knew if I did, this would be all over.\n\n\"Hey, can you draw me?\"\n","page 93":"\"You look great!\" I can\u0027t speak well with the fake vampire teeth in my mouth, but I manage to at least sound somewhat understandable.\n\nBut Sophia was staring at her reflection in the mirror with an odd expression.  It wasn\u0027t an expression I remember seeing before. Her eyes were wide and a strange fascination lit those beautiful emerald eyes.\n\n\"....so this is how I\u0027d look in the end.\" The words were spoken so softly I could barely hear them. An odd feeling of trepidation filled me and I couldn\u0027t let the silence fill up the space between us.\n\n\"Yeah, undead buddy!\" I lean heavily against her shoulder and for a moment, I feel her crumple against my weight. Luckily, I kept most of my weight on my other leg and manage to regain my balance before we both topple over. \"Sheesh Sophia, you used to be able to carry me on your back!\"\n\n\"We were kids back then! Things...change.\" She bit her lip as she said those last two words. As though they were the beginning words to a torrent of others that would ruin everything.\n\nI hated that. I mean, I was getting used to those odd silences, those secrets that were forming between her and me.  But that night, I wanted it to be over. But that night, Sophia still wouldn\u0027t look away from her reflection.\n\nThat reflection of a girl long dead.\n","page 92":"\"Tell me a secret.\" Sophia\u0027s voice is a little sluggish and for a second, I wonder if it was the wisest decision opening up that bottle of christmas wine.\n\n\"I never keep any secrets from you.\" I answer and honestly, there is nothing I could possibly hide from Sophia. She knew everything about me. All it took was one stare from her and I was completely transparent.\n\nBut Sophia was different. It was like there was a veil, a impenetrable veil between her and me. I could tell by her eyes. Those beautiful emerald eyes that told no secrets and held no lies.\n\n\"Everybody has secrets.\" She leaned forward and all I can do is stare back at her. The Christmas light gave her silver hair a light pink tint, or maybe my mind was finally going a little crazy. She was like a drug I couldn\u0027t stop taking.\n\nBut was it the same for her?\n\n\"Tell me yours.\" I want to say those words. But maybe I knew the answer and I didn\u0027t want to hear it.\n\nMaybe I knew if I did, this would be all over.\n\n\"Hey, can you draw me?\"\n","page 95":"\"Tell me a secret.\" Sophia\u0027s voice is a little sluggish and for a second, I wonder if it was the wisest decision opening up that bottle of christmas wine.\n\n\"I never keep any secrets from you.\" I answer and honestly, there is nothing I could possibly hide from Sophia. She knew everything about me. All it took was one stare from her and I was completely transparent.\n\nBut Sophia was different. It was like there was a veil, a impenetrable veil between her and me. I could tell by her eyes. Those beautiful emerald eyes that told no secrets and held no lies.\n\n\"Everybody has secrets.\" She leaned forward and all I can do is stare back at her. The Christmas light gave her silver hair a light pink tint, or maybe my mind was finally going a little crazy. She was like a drug I couldn\u0027t stop taking.\n\nBut was it the same for her?\n\n\"Tell me yours.\" I want to say those words. But maybe I knew the answer and I didn\u0027t want to hear it.\n\nMaybe I knew if I did, this would be all over.\n\n\"Hey, can you draw me?\"\n","page 94":"\"Hmmm?\" Sophia looked closely at my face and I immediately blushed under her scrutiny. \"Really?\"\n\n\"Really.\" I insist, despite my blush burning more than ever.\n\nShe tossed on a shirt lazily and stretched dramatically. I can\u0027t think of a single pair of eyes that wasn\u0027t glued to her.\n\n\"C\u0027mon, stop it.\"\n\n\"I thought you weren\u0027t jealous!\" Sophia teased back, but then she sat down next to me. \"You know I only have eyes for you.\"\n\nI want to avert my face so she can\u0027t see that huge grin that spreads on my face, but she caught it anyways. \"I hate it when they look at you though.\"\n\n\"Why?\" She walks up close to me, her body still dripping water. That familiar scent of cinnamon mint, I\u0027d breathe it in all day long if I could.\n\n\"They\u0027re always all over you.\"I look away with a pout. Partially to make my point, partially to catch my breath.\n\n\"Hey.\" She stops me with her hand and turns my head towards her. \"Even when they\u0027re around, I don\u0027t see them. I only see you.\"\n\n\"Always?\" I can\u0027t help but ask.\n\nShe smiles, but there is a hint of sadness as she replies \"Well...as long as always can last.\"\n","page 97":"\"Tell me a secret.\" Sophia\u0027s voice is a little sluggish and for a second, I wonder if it was the wisest decision opening up that bottle of christmas wine.\n\n\"I never keep any secrets from you.\" I answer and honestly, there is nothing I could possibly hide from Sophia. She knew everything about me. All it took was one stare from her and I was completely transparent.\n\nBut Sophia was different. It was like there was a veil, a impenetrable veil between her and me. I could tell by her eyes. Those beautiful emerald eyes that told no secrets and held no lies.\n\n\"Everybody has secrets.\" She leaned forward and all I can do is stare back at her. The Christmas light gave her silver hair a light pink tint, or maybe my mind was finally going a little crazy. She was like a drug I couldn\u0027t stop taking.\n\nBut was it the same for her?\n\n\"Tell me yours.\" I want to say those words. But maybe I knew the answer and I didn\u0027t want to hear it.\n\nMaybe I knew if I did, this would be all over.\n\n\"Hey, can you draw me?\"\n","page 96":"\"You look great!\" I can\u0027t speak well with the fake vampire teeth in my mouth, but I manage to at least sound somewhat understandable.\n\nBut Sophia was staring at her reflection in the mirror with an odd expression.  It wasn\u0027t an expression I remember seeing before. Her eyes were wide and a strange fascination lit those beautiful emerald eyes.\n\n\"....so this is how I\u0027d look in the end.\" The words were spoken so softly I could barely hear them. An odd feeling of trepidation filled me and I couldn\u0027t let the silence fill up the space between us.\n\n\"Yeah, undead buddy!\" I lean heavily against her shoulder and for a moment, I feel her crumple against my weight. Luckily, I kept most of my weight on my other leg and manage to regain my balance before we both topple over. \"Sheesh Sophia, you used to be able to carry me on your back!\"\n\n\"We were kids back then! Things...change.\" She bit her lip as she said those last two words. As though they were the beginning words to a torrent of others that would ruin everything.\n\nI hated that. I mean, I was getting used to those odd silences, those secrets that were forming between her and me.  But that night, I wanted it to be over. But that night, Sophia still wouldn\u0027t look away from her reflection.\n\nThat reflection of a girl long dead.\n","page 150":"\"My friend the slacker, huh?\" Sophia sighed exaggeratedly, a slight giggle accompanying her solemn words.\n\n\"A terrible slacker to the end.\" I admit sadly, but the entire time I have to hide a grin.\n\nIt was just like old times.\n\n\"Well, you have to snack regularly. An artist cannot function on an empty stomach.\"\n\n\"You just want an excuse to eat sweets, don\u0027t you?\" I knock my shoulder against hers and she pouted.\n\n\"What, do other girls not eat sweets?\" Sophia sulked.\n\n\"I didn\u0027t mean that.\" I sigh and hold up my hands \"Why don\u0027t we compromise? A fun activity and then study time?\"\n\n\"My friend the slacker, huh?\" Sophia sighed again.\n","page 151":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 154":"\"How is this making up for anything?\" Sophia huffed and puffed as she dilligently ran to keep up with my light jogging.\n\n\"Weren\u0027t you always complaining about how out of shape you\u0027ve gotten?\" I try to slow down to seem like I\u0027m helping, but a little bit of me feels happy. Before it was always me desperately chasing her, doing anything to keep up.\n\n\"Okay...so I was a total mess today and I\u0027m fat?\" Sophia laughs incredulously, but a smile still lingers on her face. Like even she knew that her as a total mess was still stunningly beautiful and that any fat on her body would be perfectly placed so you wouldn\u0027t be able to tell that she eaten a few more slices of pie than what was wise.\n\n\"You know I didn\u0027t mean it that way.\" \n\n\"Yeah, but you always say things that people misunderstand. You\u0027re going to get in a lot of trouble with girls if you don\u0027t shape up.\"\n\nApparently I was always being misunderstood by her. My dad always told me that you have to be ridiculously open to failure when it came to girls. Even though it was terrifying to make the first step, you\u0027ll make it if the girl is worth it and Sophia was worth it.\n\n It wasn\u0027t like I didn\u0027t try to give her signs. I always kept looking at her lips. Imagining how it would feel, how amazing it would feel to kiss them the first time...and the second...and the millionth.\n\n\"Hmm? \" Sophia paused in front of me and leaned forward. Her face slightly covered with a sheen of sweat \"Did you fall in love with me?\" She laughed a little at the end, certain that I hadn\u0027t.\n\nIt was kinda suprising how clueless Sophia could be. Or maybe cruel would be a better word.\n","page 153":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 134":"\"Staying the same is best, isn\u0027t it?\" I hold her hand as we walk down the hall. It was better not to be tempted...I don\u0027t want to make a mistake that would risk my friendship with her.\n\nThis was really for the best.\n\nAs I held her hand, I feel an odd sense of loss.\n\n\"It really is for the best.\" She agrees and for a second, I feel her squeeze back my hand.\n\nWas her hand always this fragile?\n\nIt felt like the briefest touch would cause it to shatter into a million pieces.\n\nLooking over at her, I want to believe that this is for the best.\n\nReally...isn\u0027t it for the best? \n","page 133":"It was fate.\n\nAs I kissed her and she kissed me, it felt like I was sinking into the ground and just feeling everything along the way.\n\nSoft. Silky. Smooth.\n\nA taste of cinnamon mint.\n\nA nibble of vanilla.\n\nIt was intoxicating.\n\nMy brain was turning into mush, even more so because it was so late at night.\n\nThe only question was whether or not I could stop.\n","page 136":"It was a different love story.\n\n\"You\u0027re still here?\"  She cried softly, leaning against the window.\n\nIt was the last day they could meet, the boy she met who was never alive in the first place.\n\nHis fingers rested gently on hers, but she couldn\u0027t feel them anymore.\n\n\"Thank you.\" She whispered as a sad melody began. As she spoke, he was leaning closer to kiss her head, but the screen faded to black and the movie ended.\n\nI could feel tears dripping off of Sophia\u0027s face. She was leaning against my shoulder and was trying hard not to let me notice.\n\n\"Hey...is this a happy ending?\" Sophia asked me softly.\n\n\"As happy as their situation could be, I guess.\" Rubbing her shoulder softly with my hand, I try to keep my voice light \"Sometimes, you just get a bad deck of cards. Sometimes a happy ending is impossible.\"\n\nShe sighed and looked at the ground.\n\n \"Would you be happy in that case?\"\n\nI\u0027m not even sure what answer she wanted. But before I could think of one, she left the room.\n\nDidn\u0027t my answer matter?\n\n Why did this feel so familiar?\n","page 135":"They do exist, you know.\n\nIt wasn\u0027t like I was invisible to them either. Every now and then, I\u0027d catch a girl looking over.\n\nAlthough how you can really tell what girls are thinking is beyond me. Besides them traveling in packs, I only associated with them through Sophia. The only one I truly understood was Sophia.\n\nDid I want to change that?\n\nWas it time to just move on?\n\nI mean, it wasn\u0027t like I hadn\u0027t tried.\n\nShe was keeping secrets, secrets she\u0027d never tell me.\n\n \n","page 138":"It was a different love story.\n\n\"You\u0027re still here?\"  She cried softly, leaning against the window.\n\nIt was the last day they could meet, the boy she met who was never alive in the first place.\n\nHis fingers rested gently on hers, but she couldn\u0027t feel them anymore.\n\n\"Thank you.\" She whispered as a sad melody began. As she spoke, he was leaning closer to kiss her head, but the screen faded to black and the movie ended.\n\nI could feel tears dripping off of Sophia\u0027s face. She was leaning against my shoulder and was trying hard not to let me notice.\n\n\"Hey...is this a happy ending?\" Sophia asked me softly.\n\n\"As happy as their situation could be, I guess.\" Rubbing her shoulder softly with my hand, I try to keep my voice light \"Sometimes, you just get a bad deck of cards. Sometimes a happy ending is impossible.\"\n\nShe sighed and looked at the ground.\n\n \"Would you be happy in that case?\"\n\nI\u0027m not even sure what answer she wanted. But before I could think of one, she left the room.\n\nDidn\u0027t my answer matter?\n\n Why did this feel so familiar?\n","page 139":"\"Hey!\" Alexa smiled back at me and I could tell from the way she flipped her hair to the side, she was trying to get a compliment. I couldn\u0027t tell what was different about her today, but there was always an easy way to appease her.\n\n\"You look really pretty.\" I smile back, but the enthusiasm is not quite there. She frowns slightly, but the buzzing of her phone saves me from having to elaborate.\n\nAlexa was another girl in my class. I actually hadn\u0027t realized they existed because I was always so wrapped up in Sophia.\n\n\"You always get so quiet.\" I hadn\u0027t realized the phone call ended when Alexa pokes me gently on my side. \"C\u0027mon, I need to hear some good news right now. I just got off the phone with Tenia.\"\n\nTenia?\n\n\"You mean, Sophia\u0027s little sister?\" I try to keep my voice calm, but it shakes just enough for Alexa to tilt her head curiously. \"What about?\"\n\n\"We were just talking about Sophia.\" Alexa show me a knowing stare \"Do you want to know?\"\n","page 0":"It\u0027s always the same dream.\n\n\"Do you miss me?\" Her silky soft voice sounds like velvet and I can smell her familiar scent of cinnamon mint. Her beautiful emerald eyes looking right through me, as though the answer on the tip of my lips has already been said.\n\nThat face hasn\u0027t changed a bit, already she had certainly grown more beautiful than before. I manage to fight back the growing urge in me to lean forward to touch her, prove that she was real. Even if the wing was plastic on her back, there was no way Sophia would be here with me.\n","page 141":"I say the words, but I don\u0027t feel it. Instead, I look away and can only remember.\n\n\"Hey, he\u0027s all alone!\" Sophia laughed as I finished making my sole dinosaur.\"\n\n\"I\u0027ll make him a buddy soon.\" Shaping the orange play dough was hard work, but I could still feel Sophia lean next to me. She hummed softly as she placed a pink dinosaur next to mine.\n\n\"He shouldn\u0027t be alone.\" She smiled and I smile back.\n\n\"He\u0027ll never be alone as long as she\u0027s around.\" \n\nThere wasn\u0027t enough play dough to make a third dinosaur. But that didn\u0027t matter, because of Sophia.\n\nHey, you really don\u0027t care?\n\nI shake my head.\n\nFine, then.\n","page 140":"\"She\u0027s gone.\"\n\nI wanted to ask more, but those two words were enough.\n\nSophia\u0027s gone?\n\nI can\u0027t feel anything.\n\nAre you surprised?\n\nI can\u0027t feel anything.\n\nOf course not, you knew all along...didn\u0027t you?\n\nI look at the ground and for some reason, I see her face. Smiling and looking back at me with those beautiful emerald eyes.\n\nChrist, you let her die alone.\n\nStop it.\n\nI bet she wondered where you were.\n\nI can\u0027t breathe. Instead, all I can do is stare at that image of Sophia while tears fill my eyes.\n\nWhere the hell were you?\n","page 200":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 166":"It was a different love story.\n\n\"You\u0027re still here?\"  She cried softly, leaning against the window.\n\nIt was the last day they could meet, the boy she met who was never alive in the first place.\n\nHis fingers rested gently on hers, but she couldn\u0027t feel them anymore.\n\n\"Thank you.\" She whispered as a sad melody began. As she spoke, he was leaning closer to kiss her head, but the screen faded to black and the movie ended.\n\nI could feel tears dripping off of Sophia\u0027s face. She was leaning against my shoulder and was trying hard not to let me notice.\n\n\"Hey...is this a happy ending?\" Sophia asked me softly.\n\n\"As happy as their situation could be, I guess.\" Rubbing her shoulder softly with my hand, I try to keep my voice light \"Sometimes, you just get a bad deck of cards. Sometimes a happy ending is impossible.\"\n\nShe sighed and looked at the ground.\n\n \"Would you be happy in that case?\"\n\nI\u0027m not even sure what answer she wanted. But before I could think of one, she left the room.\n\nDidn\u0027t my answer matter?\n\n Why did this feel so familiar?\n","page 169":"She was stunning.\n\n \"They\u0027re all staring.\" Sophia\u0027s arm was wrapped so tightly around my neck that at times, it was a bit hard to breathe.\n\nBut maybe that was because of how close she was and how easily she could take your breath away.\n\n\"They\u0027re jealous.\" I whispered back, trying to keep a silly grin off of my face. It was probably failing miserably, despite my best efforts.\n\n\"I feel like I\u0027m surrounded.\" She sighed softly. \"Do you think they\u0027ll stop looking if we start dancing?\"\n\n\"Oh, that\u0027ll be even worse.\" I laugh \"One of us have two left feet.\"\n\nShe gently whacked my shoulder.\n\n\"I didn\u0027t say it was you!\" \n\n \n","page 168":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 33":"It had been a while.\n\n\"You\u0027re taller.\" Sophia\u0027s voice was filled with surprise. As though those two years gave her an impossible to overcome time advantage in growing.\n\n\"I drank a lot of milk.\" I shoot back, mentally wincing at the countless nights when I had nightmares of cows and monster dairy products chasing me.\n\n\"You hated milk.\" Her forehead still crinkles slightly in the middle when she gets confused. I guess it is a little baffling considering how important those few inchs of height she had over me was. She always mentioned it, as though I couldn\u0027t be a guy in her eyes because I was a few inches shorter.\n\n\"I grew up.\" A total lie in that case considering how I have to force down milk every day.\n\nThe school bell rang so the conversation was unfortunately cut short. But there were always ways to get to spend time with Sophia, even if I chose an unconventional method.\n","page 32":"\"She\u0027s amazing.\" A content smile spread across Sophia\u0027s beautiful face and I can\u0027t help but stare. At her and the world\u0027s luckiest cat.\n\n\"Are you feeling better?\" I gingerly ask and for a second, a shadow crosses her face. Her eyes lower and she ponders the question.\n\n\"Hmm, now I am.\" Kissing the cat gently on the forehead, Sophia laughed \"What\u0027s a good name for a cat like this?\"\n\n\"Err...Sophia II?\" \n\n\"That\u0027s a terrible name!\" \n\n\"What? I\u0027ve been calling her that ever since she was a kitten.\" Staring at her with mock horror, I reply \"I\u0027m pretty sure that cat already thinks that\u0027s her name.\"\n\n\"You\u0027re joking.\" Sophia looks at me with hopeful eyes, but as I shake my head reluctantly, she sighs \"Well...at least there\u0027ll always be a Sophia around you.\"\n\nShe looked so sad for a moment that I had to ask \"What, you\u0027re already abandoning the cat? Just because of a bad name?\"\n\nShe looks up and smiles at my bad joke \"You know I didn\u0027t mean that.\"\n\nThen, what did you mean? The question is on the tip of my tongue, but I swallow it back.\n\nShe wouldn\u0027t answer it.\n\nNo, she wouldn\u0027t.\n","page 35":"I didn\u0027t want to risk it.\n\nFalling asleep next to her was the epitome of suffering. I mean, the most wonderful possible suffering there is, but still...suffering.\n\nHow could I sleep?\n\nShe lay on top of me with her tiny body, her arms wrapped gently around my waist. That familiar scent of cinnamon mint wafting into my nose and overwhelming my senses.\n\nAs I stared up at her beautiful face, I could see a tiny drool slowly leak out of her mouth. I laughed gently, but could hear her softly grumble as her pillow (me) shifted around and made her spot less comfortable.\n\nWhat if things were different?\n\nLet\u0027s change the story now.\n\nWhat if I could save her?\n","page 34":"I couldn\u0027t help it.\n\nMy arm was already being used by her as a pillow. I kept my eyes closed and hugged her closely. Her body was incredibly soft. She fit perfectly against me and was so close that I could feel every bit of her on top of me. I\u0027ve probably hugged Sophia a million times when I was younger. But tonight was different, everything felt different.\n\n\"Hey...\" Her soft scent of cinnamon mint wafted over me \"You can\u0027t be without me?\" \n\nThe way she asked that question was strange. It was a question she had asked me a million times before. But tonight, it sounded like there was a hitch in her voice, an accidental slip.\n\n\"You know the answer.\" I can\u0027t help but smile goofily at Sophia. Even though I know neither one of us are directly addressing the issue at hand, the kiss or the accidental biting of her lips, if you wanted to get more specific.\n\n\"Would you miss me?\" A slighly lonely expression still lingered on her face \"If I was gone?\"\n","page 37":"\"I can\u0027t believe you ordered the Mega Chocolate Sundae Supreme.\" Sophia\u0027s voice is awed as she surveys what surely is the largest chocolate sundae topped with cherries.\n\n\"Plus chocolate sticks and hot chocolate, just in case of unexpected brain freezes.\" I smile eagerly towards Sophia as I nurse a tiny baby dip of ice cream.\n\n\"You really regret what you said, huh?\" A tiny smile formed on her lips, those perfect lips thatI could stare at all day.\n\n\"My wallet does. But I don\u0027t.\" Smiling back, I lick my ice cream cone \"I get to see you eat the entire Mega Chocolate Sundae Supreme by yourself.\"\n\n\"Hey, I thought we were sharing!\"\n","page 36":"\"You really think she\u0027d follow after you ditched her?\"My little sister wasn\u0027t the type that minced her words, biting as they may be.\n\n\"You have to understand it from a guy\u0027s perspective.\" I shoot back \"What if she pushed me away?\"\n\n\"Sophia?\" Emily laughed, her eyes stil glued to her NDS \"Well, as long as we\u0027re playing the \u0027what if\u0027 scenarios...what if she didn\u0027t?\"\n\n\"This doesn\u0027t help Em...\" Leaning back with a heavy sigh, I ask \"What can I do?\"\n\n\"Run to her house with a boombox and play a song by Peter Gabriel?\" Emily laughed \"Or maybe you could visit her. Sophia texted me that she\u0027s sick and I think you can step it up and maybe change this.\"\n","page 38":"It was fate.\n\nAs I kissed her and she kissed me, it felt like I was sinking into the ground and just feeling everything along the way.\n\nSoft. Silky. Smooth.\n\nA taste of cinnamon mint.\n\nA nibble of vanilla.\n\nIt was intoxicating.\n\nMy brain was turning into mush, even more so because it was so late at night.\n\nThe only question was whether or not I could stop.\n","page 31":"\"Why are you here?\" Sophia\u0027s voice was stuffy and she was completely covered in tissues. I had to wipe away the mound to get to the pretty girl underneath.\n\n\"A little bird told me I had to bring chicken noodle soup and tea.\" I hold out the bag \"It\u0027s your favorite kind.\"\n\n\"What a messed up little bird.\" Sophia grinned back, but her eyes still look miserable. \"I didn\u0027t want you to see me like this.\"\n\nSitting down next to her, I had to smile. She was looking down and blushing as though she was a complete mess. But even as a mess, Sophia could make my heart skip a beat any day.\n\n\"I\u0027ve seen you covered in mud before. Remember when we caught Freddy?\"\n\n\"So you still remember how awful I looked even though it was years ago?\" Sophia\u0027s eyes grew wide with horror. \n\n\"C\u0027mon, let me make up for this constant foot in my mouth.\" I plead with her.\n\nShe looks at me straightforwardly with those brillant emerald eyes. \"How?\"\n\nGood question.\n","page 30":"Sophia had a secret ever since she was a kid. She couldn\u0027t swim. Push her into a pool barely above her head and she\u0027d drown without a life preserver.\n\n\"It\u0027s not like I forgot what you said earlier.\" Sophia\u0027s arms were snugly wrapped around my neck as she tried desperately to keep afloat.\n\n\"I thought girls like being told they were young.\" Keeping my voice as light as possible, I feel a warm blush spread across my cheeks. Sophia was close, really close. Her soft warm body pressed tightly against mine and even though the pool water had a distinct smell of chlorine, her familiar scent of cinnamon mint washed over me.\n\n\"That only applies to women when they\u0027re much older. Not kids.\" Pouting heavily, Sophia couldn\u0027t maintain an angry tone as I served as her swim buddy/life preserver in the school\u0027s swimming pool.\n\nIt would be too much to claim a stroke of luck in having Sophia as my pool buddy. Outright bribery of her fellow classmate and swimming instructor was the only possible way I could be Sophia\u0027s swimming buddy ever since the school year began.  Considering how Sophia hadn\u0027t learned how to swim, or even float...I can\u0027t really claim to be the best kind of swim buddy around.\n\nLike heck I cared about that though. Being Sophia\u0027s life preserver was a right only for me. \n","page 170":"I close my eyes and hear that odd static noise I\u0027ve noticed before and tried to ignore.\n\n\"You don\u0027t want this to be the end?\" A soft and silky voice asks. It\u0027s not Sophia\u0027s voice, but it sounds oddly familiar. Like a younger version that had both her and me mixed in.\n\n\"I don\u0027t, of course I don\u0027t.\" Opening my eyes, I see the carbon copy of Sophia as a young child. The only difference was her eyes were clear. This child wasn\u0027t Sophia.\n\n\"Who are you?\"\n\nShe smiled happily, hugging a familiar teddy bear. \"You can\u0027t recognize your own child? What kind of a daddy do I have?\"\n\nThe surroundings are different and for some reason, I feel older. My bones are creaky and when I reach up to touch my chin, I feel a grizzled beard.\n\n\"What...is going on?\" My head is swirrling and at this point, she could have told me that I was dead and I would have believed her. \n\nInstead, the little child replied \"You can change the past daddy. If you\u0027re willing to lose this future.\"\n\nHer arms were so tightly wrapped around her tiny body, but her voice didn\u0027t waver.\n\nAs though she already knew my answer.\n","page 172":"\"Hey stranger.\" Sophia\u0027s familiar face, that beautiful face that haunted my every dream and memory, finally appeared. \"I guess I have a lot of explaining to do.\"\n\nShe sighed softly and shook her head slightly. \"I wanted to tell you...a million times. Everyday, I wanted to tell you. That day I got diagnosed, all I could think of was how I could tell you.\"\n\nShe paused and for a second, her chin trembles. Her bangs covering her eyes so I can\u0027t possibly see them. But she takes a second to breathe in and looks up with a smile. \"I guess I wanted to be selfish in the end. I\u0027m sorry about that. But, I wanted to be with you. Every day, I wanted to be with you. I knew...that the treatment had such little chance of working and I\u0027d never get to see you and I was so scared and...\"\n\nTears fill her eyes and I can tell she\u0027s widening them as much as possible so not a single tear falls. Before it can possibly fall, she places both her fingers on her cheeks and smiles widely. \"Please, forgive me? I want you to remember me like this. Healthy and always, loving you.\"\n\nThe tape ended and I looked through the box. There were only one piece of notebook paper.\n\nWas it her handwriting? Or was it someone else?\n\nAll it said was a hospital and a room number.\n","page 171":"\"You can\u0027t have everything.\"\n\nThe little girl was melting away, her smile still firmly in place. The ground shakes and all of a sudden, I wake in a beautiful open space. It was as close to heaven as I could picture it, minus the floating angels and clouds.\n\n\"What do you mean?\" I shout to the sky, but there is no response. Instead, I can only see two lakes ahead of me. One had a sign labeled \"Save Sophia\" and the other had a sign labeled \"Save your child.\"\n\nIt was a trade.\n\nI had to trade one for the other.\n\n\"You...\" I\u0027m not even sure who I\u0027m speaking to at this moment \"can\u0027t possibly be serious?\"\n","page 174":"Hitting the ground with a thud, I can hear my phone vibrate. Emily was with Sophia at the hospital and for some miraculous reason, she was recovering. Slowly but surely, Sophia was responding to treatment.\n\n\"But...\" Emily\u0027s voice grew sad \"She lost baby.\"\n\nA loud silence engulfed the two of us and all I can say is \"I\u0027ll be there. Tell Sophia, I\u0027ll be there.\"\n\nIt was months before Sophia would speak. She would cry every day, even when she had barely the strength to breathe. All I could do was be with her, hold her whenever she cried, and wonder.\n\nWas it a dream?\n\n\"Hey....\" Sophia looked at me with her deep emerald eyes \"can you believe we\u0027re married?\"\n\nI look at her and feel like I can\u0027t believe anything. Leaning forward to kiss her on her lips, I can only smile as she kisses me back.\n\n\"Hey you two lovebirds, don\u0027t forget about the wedding cake!\" Emily laughed as she happily brought Sophia and I to the table.\n\n\"Why does my figure have such a weird expression?\" I laugh as Sophia gently holds my hand and a knife.\n\n\"Hehe, you always have that expression.\" She laughs and for a moment, a brief moment, my life was perfect.\n\n.\n\n..\n\n...\n\n....\n\nBut don\u0027t tell me you forgot the price you paid for this happiness?\n","page 173":"Hitting the ground with a thud, I can hear my phone vibrate. Emily was with Sophia at her last moments and it turned out there was a baby. \"She\u0027s premature and hanging on by a thread, but a beautiful baby...\"\n\n\"Girl.\"\n\n\"...Did Sophia tell you she was pregnant?\"\n\n\"It doesn\u0027t matter.\" I stand up and start running towards the car. \"I\u0027ve got to see her.\"\n\nIt was months before they let me take her home. Sara was hanging on by a thread for days, but she was strong like her mother. Her body was so small, everyone thought she wasn\u0027t going to make it.\n\nBut, I always knew better.\n\n\"Hey there.\" Gently rocking her back and forth, I felt Sara softly nuzzle against my neck. \"You don\u0027t like sleeping alone?\"\n\nShe gurgles appreciatively and I hold her closely.\n\n\"It\u0027s okay, I\u0027m here.\"\n\nAs I close my eyes, I smell the familiar scent of cinnamon mint. Just a hint in the wind.\n\nAs though maybe, Sophia was here too.\n","page 176":"\"Hey, how are you doing?\" Sophia\u0027s sister hugs her tightly as we slowly make our way to the graveyard.\n\nThe place where our child was buried.\n\nWe first went after the hospital stay, clothed only in the darkest black and funeral attire. The whitest roses adorned her grave. It was there we all made the solemn vow to return there the day...that terrible day...she died.\n\n\"It\u0027s always tough coming here.\" Sophia admitted softly, her voice crackling slightly \"But...it helps.\"\n\nWe now dressed up in bright clothing. Not because we were happy, but...wouldn\u0027t it be a shame? If our only daughter saw us in dark funeral garb each time?\n\n\"Hey, I heard the good news. When are you due? Did you find out whether it\u0027s going to be a boy or a girl?\" Sophia\u0027s sister had a growing smile and finally a smile appeared on Sophia\u0027s face.\n\n\"We\u0027ve got at least a year to go. But, he\u0027s sure for some reason it\u0027s a girl. A beautiful girl who has both of our eyes.\"\n","page 155":"\"This is amazing!\" Sophia laughed and her bright smile matched mine as I stared back at her stunning emerald eyes.\n\n \"I aim to please.\" I smile back and feel a wave of relief wash over me as she smiles back. It was a brillant idea, even if my wallet was weeping tears of Jeffersons and Franklins along the entire island.\n\n\"C\u0027mon, we have to see everything.\" She tugged on my arm and for the entire day, we became one with the island. I ate enough pineapple to last me several lifetimes.\n\nFinally when the sun was setting and fatigue kicked in, Sophia turned to me with a smile.\n\n\"I\u0027ve got an idea.\" She laughed \"Let\u0027s draw each other.\"\n","page 158":"How many times did I have to drag her to the swimming pool? Probably a million. I loved being her life preserver, but there were always haunted houses and scary movies to replace the old swimming days. \n\nPlus, what if she was all alone in a pool by herself?\n\n\"I can\u0027t believe you finally know how to swim.\" We both resurface and I smile back at her. She grins back and eagerly dives into the ocean.\n\nWait, how much time has passed?\n\nI quickly dive in and see her watching a group of turtles swim beneath her feeth. Her hair floating in the air softly around her peaceful face.\n\nWhy did she only look peaceful at moments like these?\n\nWe both resurface, gasping for air. After heading off to the beach to dry off, I can hear the hooting and hollering of the local boys. Sophia always got a lot of interest wherever she went, it should have been something I have gotten used to by now. But my face turns a telltale red and Sophia asks teasingly \"What, are you jealous?\"\n","page 157":"\"I can do this.\" Sophia was determinedly chewing away on her spare pencil as she erased her sketching. The deadline was moved up and she was staying up all night.\n\n\"You need to rest. C\u0027mon, the bed is soft and comfy.\"\n\n\"You can go without me.\" She doesn\u0027t even shift her gaze off the paper. \"I\u0027m going to finish this.\"\n\nI already knew what she would say before she said it. Most nights, I would go ahead and impatiently wait for her to slip next to me. But tonight, I wanted to be next to her. I had to do something while I waited.\n\n\"Let me show off.\" I make a big show of getting some pens and markers.\"I\u0027ll draw you just as I see you.\"\n\nA tiny smile appeared on her lips as she answered \"I\u0027ll be looking forward to it.\"\n","page 159":"\"It\u0027s freezing!\" Sophia\u0027s complaint sounded like music to my ears. It gave me the perfect excuse to sneak up behind her and wrap my arms around hers.\n\n \"You\u0027re cold!\" She yelped and tossed me quickly to the side.\n\n\"Ouch, isn\u0027t body heat supposed to help?\" I exaggeratedly rub my sides, but she\u0027s shivering so badly that I stop.\n\n\"It helps only when the person doesn\u0027t have ice on them as well.\" She pouts sadly, her breath softly floating in the air in a tiny stream.\n\n\"Here.\" Sighing heavily, I hand over my only coat and feel instantly the air freeze around me.\n\n\"Why\u0027d you do that?\" I look over at Sophia, but she\u0027s not moving. All of a sudden, the scene froze around me.\n\n\"Who\u0027s there?\" I yell, but the voice chuckles. \n\nWhy does it sound so familar?\n\n\"Let\u0027s forward this scene. Do you remember how you drew her?\"\n\nA female\u0027s voice...it was a female\u0027s voice. That\u0027s all I can remember as the world fades to black.\n","page 44":"\"You know that this can\u0027t work each time.\" Sophia pouted and I have to admit, that threat would have been more effective had she not been smiling.\n\n\"There\u0027s a lot of cotton candy flavors.\" I tease her but for a moment, she pulls back on my hand and looks back into my eyes. Those brillant emerald eyes could see through me easily.\n\n\"Next time, I mean it.\"\n\n\"I promise.\" I look back and reach out my hand \"I won\u0027t make the same mistake again.\"\n\nShe smiled and for a few minutes, everything was perfect.\n\nThat was until she stopped and asked \"Wait, you still are going to make mistakes in the future, aren\u0027t you?\"\n\nShe knew me too well.\n\n\"Of course not.\" I look at her my most innocent eyes.\n\nShe stuck her tongue out at me \"Next time, I like ice cream.\"\n","page 43":"\"Hey, why do you think they tell the story about the Man in the Moon?\" Sophia was walking just quickly enough to remain out of reach, looking back only now and then to smile back at me.\n\nIt wasn\u0027t a happy smile though. At least, not entirely.\n\n\"To remind us of what we have.\" I smile back, we always had this exchange late at night.\n\nI can\u0027t remember why we started it though. Maybe it made her feel better?\n\n\"How so?\" Sophia asked, her voice filled with curiosity as though I haven\u0027t answered it a million times before.\n\n\"Because the moon is always alone. It only can reflect light, never create it. The moon wouldn\u0027t exist if it wasn\u0027t for the sun. But the sun could exist without the moon.\"\n\n\"What about the stars?\" Sophia slowed down enough for me to catch up \"The stars are alwasy around the moon.\"\n\n\"Those stars don\u0027t matter. You can be alone in a crowd if the person you want by your side isn\u0027t there.\"\n\nShe paused and finally I realized how I messed up the script.\n\n\"You said person.\"\n\n\"A star, a person...whatever.\"\n","page 46":"\"My friend the slacker, huh?\" Sophia sighed exaggeratedly, a slight giggle accompanying her solemn words.\n\n\"A terrible slacker to the end.\" I admit sadly, but the entire time I have to hide a grin.\n\nIt was just like old times.\n\n\"Well, you have to snack regularly. An artist cannot function on an empty stomach.\"\n\n\"You just want an excuse to eat sweets, don\u0027t you?\" I knock my shoulder against hers and she pouted.\n\n\"What, do other girls not eat sweets?\" Sophia sulked.\n\n\"I didn\u0027t mean that.\" I sigh and hold up my hands \"Why don\u0027t we compromise? A fun activity and then study time?\"\n\n\"My friend the slacker, huh?\" Sophia sighed again.\n","page 45":"\"This is amazing!\" Sophia laughed and her bright smile matched mine as I stared back at her stunning emerald eyes.\n\n \"I aim to please.\" I smile back and feel a wave of relief wash over me as she smiles back. It was a brillant idea, even if my wallet was weeping tears of Jeffersons and Franklins along the entire island.\n\n\"C\u0027mon, we have to see everything.\" She tugged on my arm and for the entire day, we became one with the island. I ate enough pineapple to last me several lifetimes.\n\nFinally when the sun was setting and fatigue kicked in, Sophia turned to me with a smile.\n\n\"I\u0027ve got an idea.\" She laughed \"Let\u0027s draw each other.\"\n","page 48":"\"It\u0027s beautiful.\" Sophia\u0027s hair was down and gently swayed in the wind. A bright yellow shawl was wrapped around her shoulders and I felt completely enchanted.\n\n\"You shouldn\u0027t push yourself.\" I can\u0027t help but worry as she climbs eagerly over the mountain. \"Didn\u0027t the doctor tell you to be careful?\"\n\n\"Hmm...thanks Dad.\" Sophia teased me back and I laughed as I hear her scamper up the hill.\n\nShe was getting her strength back.\n\nThank God.\n\n Wait a second, I pause and look around me.\n\nHow did I get here?\n\nBut Sophia is calling me over and already that silly question fades into the background.\n\nThis is going to be different.\n\nThis time, I\u0027ll make sure of it.\n","page 47":"A beautiful smile on her face, a soft sigh escaping those soft lips. She leaned forward and gave me a gentle kiss. So soft and tender that I was melting into a puddle. It was a miracle that I kept my arms wrapped around her.\n\n\"Miss me.\" She kept whispering. Her eyes looking like they were brimming with tears. \"Please, don\u0027t forget me.\"\n\nHer kisses tasted salty and sweet. But I couldn\u0027t live with myself if I did anything when she was like that. So I just held her close and kissed her until both of us were to exhausted to do anything but fall asleep.\n\nWhy would I need to miss her if she\u0027ll always be with me?\n\nWhy was she crying?\n\nI want so badly to ask her. But for some reason, it feels like she\u0027ll disappear if I ask those words. So all I can do is just pull her closer and hope that maybe, just maybe, Sophia would stay.\n","page 49":"\"Do you like it?\"\n\n I honestly never was a fan of chocolate as a kid.\n\nSophia blushed as she covered up the parts of her body that wasn\u0027t submerged in chocolate.\n\nBut in this case, I think things are about to change.\n\n\"How did you...?\" I can\u0027t even comprehend how she pulled this off. The chocolate or the roses...\n\n\"In dreams, anything is possible.\" She smiled back at me and for a second, I pause.\n\nWait.\n\nIs this a dream?\n\nDoes it matter?\n","page 42":"\"I\u0027m ready.\"\n\n She tried so hard to seem like an adult. Even the lingerie she bought was clearly for someone much older.\n\nMy mouth was dry and I could feel a gallon of sweat begin to pour down my forehead. But she was absolutely perfect.\n\nAbsolutely perfect.\n\nIn my arms, she was so tiny. Was Sophia always this small? Before I can ask, she stops me with a kiss. Any kind of comprehensible thought in my brain stops and all I can do is react.\n\nTo kiss her when she kisses me back.\n\nTo slip off that one-piece off her shoulder.\n\n\"Are you sure?\" I ask her hoarsely.\n\nShe nods softly and I give in.\n","page 41":"She was stunning.\n\n \"They\u0027re all staring.\" Sophia\u0027s arm was wrapped so tightly around my neck that at times, it was a bit hard to breathe.\n\nBut maybe that was because of how close she was and how easily she could take your breath away.\n\n\"They\u0027re jealous.\" I whispered back, trying to keep a silly grin off of my face. It was probably failing miserably, despite my best efforts.\n\n\"I feel like I\u0027m surrounded.\" She sighed softly. \"Do you think they\u0027ll stop looking if we start dancing?\"\n\n\"Oh, that\u0027ll be even worse.\" I laugh \"One of us have two left feet.\"\n\nShe gently whacked my shoulder.\n\n\"I didn\u0027t say it was you!\" \n\n \n","page 161":"\"This is amazing!\" Sophia laughed and her bright smile matched mine as I stared back at her stunning emerald eyes.\n\n \"I aim to please.\" I smile back and feel a wave of relief wash over me as she smiles back. It was a brillant idea, even if my wallet was weeping tears of Jeffersons and Franklins along the entire island.\n\n\"C\u0027mon, we have to see everything.\" She tugged on my arm and for the entire day, we became one with the island. I ate enough pineapple to last me several lifetimes.\n\nFinally when the sun was setting and fatigue kicked in, Sophia turned to me with a smile.\n\n\"I\u0027ve got an idea.\" She laughed \"Let\u0027s draw each other.\"\n","page 160":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 163":"Back in the day, Sophia and I had a secret hideout. A special area away from all the other boys and girls who were always plotting nefarious schemes to outwit the opposite sex. Back then, it wasn\u0027t cool to admit that you liked a girl even though they were obviously growing up in ways that captivated interest.\n\n We would play games in that hideout. Games that Sophia usually won.  Whenever that would happen, I would hold up my hands and laughingly claim that I had let her win. Sometimes, I would be telling the truth.  But Sophia was always the picture of health in my memories. Back before...that happened.\n\n\"Found him!\" Sophia\u0027s triumphant voice rang out through the swamp as I followed close behind, wheezing slightly.\n\n\"Nice!\" I laugh as I wipe water off my face. Sophia\u0027s covered in watter too, but she doesn\u0027t care. We were both a complete mess of swamp water and mud. \"I bet Freddy is glad to be back in your hands. I swear he was hopping away from mine towards yours the entire time.\"\n\n\"You know Freddy can\u0027t tell whose hands he\u0027s hopping away or towards.\" Sophia laughed, but of course I knew differently, I knew Sophia\u0027s hands just like I knew my own. Sophia\u0027s hands were just like the rest of Sophia, soft and beautiful with just the right curves that fit perfectly in mine.\n\n\"Freddy\u0027s a guy, of course he can tell!\" I laugh, still wiping away at the dripping swamp water on my face.\n\n\"Oh...so any guy can?\" A mischievous smile crossed Sophia\u0027s face \"Does that mean you see me as a girl then?\"\n","page 162":"\"This is amazing!\" Sophia laughed and her bright smile matched mine as I stared back at her stunning emerald eyes.\n\n \"I aim to please.\" I smile back and feel a wave of relief wash over me as she smiles back. It was a brillant idea, even if my wallet was weeping tears of Jeffersons and Franklins along the entire island.\n\n\"C\u0027mon, we have to see everything.\" She tugged on my arm and for the entire day, we became one with the island. I ate enough pineapple to last me several lifetimes.\n\nFinally when the sun was setting and fatigue kicked in, Sophia turned to me with a smile.\n\n\"I\u0027ve got an idea.\" She laughed \"Let\u0027s draw each other.\"\n","page 164":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 101":"\"It\u0027s freezing!\" Sophia\u0027s complaint sounded like music to my ears. It gave me the perfect excuse to sneak up behind her and wrap my arms around hers.\n\n \"You\u0027re cold!\" She yelped and tossed me quickly to the side.\n\n\"Ouch, isn\u0027t body heat supposed to help?\" I exaggeratedly rub my sides, but she\u0027s shivering so badly that I stop.\n\n\"It helps only when the person doesn\u0027t have ice on them as well.\" She pouts sadly, her breath softly floating in the air in a tiny stream.\n\n\"Here.\" Sighing heavily, I hand over my only coat and feel instantly the air freeze around me.\n\n\"Why\u0027d you do that?\" I look over at Sophia, but she\u0027s not moving. All of a sudden, the scene froze around me.\n\n\"Who\u0027s there?\" I yell, but the voice chuckles. \n\nWhy does it sound so familar?\n\n\"Let\u0027s forward this scene. Do you remember how you drew her?\"\n\nA female\u0027s voice...it was a female\u0027s voice. That\u0027s all I can remember as the world fades to black.\n","page 189":"\"I can do this.\" Sophia was determinedly chewing away on her spare pencil as she erased her sketching. The deadline was moved up and she was staying up all night.\n\n\"You need to rest. C\u0027mon, the bed is soft and comfy.\"\n\n\"You can go without me.\" She doesn\u0027t even shift her gaze off the paper. \"I\u0027m going to finish this.\"\n\nI already knew what she would say before she said it. Most nights, I would go ahead and impatiently wait for her to slip next to me. But tonight, I wanted to be next to her. I had to do something while I waited.\n\n\"Let me show off.\" I make a big show of getting some pens and markers.\"I\u0027ll draw you just as I see you.\"\n\nA tiny smile appeared on her lips as she answered \"I\u0027ll be looking forward to it.\"\n","page 100":"It makes her seem more alive.\n\n\"Let me draw around you.\" I stare back at her and she smiled back at me. Her eyes were still cloudy and before I can say anything else, she eagerly stands up and nods her head.\n\n\"Wait a second.\" She runs into the closet and grabs a dress. But before I can say anything, she changes out of her Christmas attire and into the dress she picked out of the closet. It was so quickly, you could blink and miss it.\n\n\"How did...?\" Before I can ask another question, my mind goes to static. It must be the wine, surely I had too much to drink. \"Just sit down there.\"\n\nShe sits down eagerly and I carefully draw flowers around her.\n\nAfter taking a picture, she turns to me and asks \"Why flowers?\n\n \"They fit.\" I can\u0027t think clearly. Not when she was so close to me.  Looking down and breathing that familiar cinnamon mint.\n\nBut when I blink, I hear static. The world goes to black and all of a sudden, I\u0027m lying on my back in the house. Again...why does this feel so familiar?\n","page 188":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 103":"\"What do you think?\"  Sophia wore only a silk blue wrap, so thin that barely anything was hidden from view. \n\nShe looked like Aphrodite\n\n\"Amazing.\" \n\nA warm blush spread across her face. \"C\u0027mon draw, that way it\u0027ll last forever.\n\nThe way she said those words...like forever was impossible. Wait a second, did she say those words?\n\nStatic noise rises in the background and suddenly I have to lean my head against my knees.It was getting a bit hard to breathe. Like I wasn\u0027t supposed to be in this room. Like I wasn\u0027t supposed to be with her.\n\n\"Hey...are you okay?\" Her concerned voice sounds so far away. I shake my head and suddenly the static noise stops ringing in my ears.\n\n\"Sophia...\" The words slip out my lips easily.\n\nWhat should I do?\n","page 102":"\"Is this wild enough?\"  Sophia laughed, her hair dramatically gelled to one side and her body seductively tilted in my direction.\n\n\"Fine, but you have to hold that position the entire time.\" I shoot back, smiling at the look of horror on her face.\n\n\"You owe me a backrub. And a foot massage.\"\n\n\"And a kiss?\" I shoot back hopefully.\n\nShe smiled back at me and replied simply \"Go for it.\"\n\nIt was getting a bit hard to breathe. Like I wasn\u0027t supposed to be in this room. Like I wasn\u0027t supposed to be with her.\n\n\"Hey...are you okay?\" Her concerned voice sounds so far away. I shake my head and suddenly the static noise stops ringing in my ears.\n\n\"Sophia...\" The words slip out my lips easily.\n\nWhat should I do?\n","page 104":"\"I\u0027m ready.\"\n\n She tried so hard to seem like an adult. Even the lingerie she bought was clearly for someone much older.\n\nMy mouth was dry and I could feel a gallon of sweat begin to pour down my forehead. But she was absolutely perfect.\n\nAbsolutely perfect.\n\nIn my arms, she was so tiny. Was Sophia always this small? Before I can ask, she stops me with a kiss. Any kind of comprehensible thought in my brain stops and all I can do is react.\n\nTo kiss her when she kisses me back.\n\nTo slip off that one-piece off her shoulder.\n\n\"Are you sure?\" I ask her hoarsely.\n\nShe nods softly and I give in.\n","page 107":"\"Hey stranger.\" Sophia\u0027s familiar face, that beautiful face that haunted my every dream and memory, finally appeared. \"I guess I have a lot of explaining to do.\"\n\nShe sighed softly and shook her head slightly. \"I wanted to tell you...a million times. Everyday, I wanted to tell you. That day I got diagnosed, all I could think of was how I could tell you.\"\n\nShe paused and for a second, her chin trembles. Her bangs covering her eyes so I can\u0027t possibly see them. But she takes a second to breathe in and looks up with a smile. \"I guess I wanted to be selfish in the end. I\u0027m sorry about that. But, I wanted to be with you. Every day, I wanted to be with you. I knew...that the treatment had such little chance of working and I\u0027d never get to see you and I was so scared and...\"\n\nTears fill her eyes and I can tell she\u0027s widening them as much as possible so not a single tear falls. Before it can possibly fall, she places both her fingers on her cheeks and smiles widely. \"Please, forgive me? I want you to remember me like this. Healthy and always, loving you.\"\n\nThe tape ended and I looked through the box. There were only one piece of notebook paper.\n\nWas it her handwriting? Or was it someone else?\n\nAll it said was a hospital and a room number.\n","page 109":"I had to listen to her last request.\n\nMy eyelids were so heavy that it felt as though they were glued shut, I was surrounded by darkness that I could see and feel with every inch of my being.   But oddly enough, I wasnt scared.\n\nReally, you came here? A gentle voice wrapped around me and I felt a familiar happiness that I hadnt felt in the longest time.  The sweetest scent of cinnamon mint entered my mouth and a pair of the softest lips brushed against mine.  So soft at first that I can barely feel it, but she leans in closer and already Im melting into a happiness that had long disappeared one terrible night long ago.\n\nIdont want to wake up if its a dream. Mumbling, my eyes feel a lot less heavy but Im too scared to open them.  Too many times Ive talked with Sophia and open my eyes to see an open space. If this is a dream, I dont ever want to wake up.\n\nHmmm. I can hear a teasing smile in her voice, that soft and gentle voice that ran circles in my head every day since she left how can I prove to you this isnt a dream then?\n\nStay with me. Immediately, the words I could never say before finally fall from my lips. Dont ever leave me again.\n\nSilence.  Then I felt her warmth spread through my arm as she gently nestled her head against my shoulder, leaning her body close to mine as she wrapped her arms around my neck.  I clung to her like a drowning man would cling to the only piece of ship; I clung to her like she was the only existence in this darkness, which to me was the truth.\n\nTrailing my fingers against her soft cheek, that tiny slope on the back of her neck, I felt as though I was falling.  I was falling and I didnt, noI couldnt stop.  If I stopped, if I let her goat that moment it felt as though some part of me must have known.  Known that this was going to be the last dream, the last kiss, the last time Sophia would ever be able to fulfill my only wish.\n\n\nThe tips of her fingers slowly tracing words on the back of my neck, at first I jumped before slowly closing my eyes. Even though this isnt realthe cool darkness is feeling less lonely, less unbearably lonely by the second.\n\nIlove you Her fingers slowly traced the words over and over again, but it didnt take long for the words to fill my back as though the words had taken on an entirely new life of their own. Warmit was so warm A sigh danced lightly upon my lips before I quickly swallowed it back, savoring what little warmth that carelessly lingered by.\n\nBye... Before I can open my eyes, I feel a pair of lips that had long lost any semblance of warmth press so gently against my back that when I opened my eyes and softly pressed the tips of my fingers to the exact spot her lips had touched, it was already gone.  The air had already stolen it away, a kiss that never existed to begin with.\n","page 54":"\"Hey.\" Sophia smiled awkwardly.\n\nHow much time has passed?\n\nHer hair was so much longer. Or maybe that wasn\u0027t her real hair...if the rumors were true.\n\n\"Who is this guy?\" Erik, Sophia\u0027s boyfriend, asked without looking at me.\n\n\"A friend.\" Sophia looked away for a second. \"A friend I haven\u0027t seen in a long time.\"\n\nI can\u0027t remember the awkward conversation that followed. I honestly don\u0027t want to remember, actually.\n\nBut what I do remember is looking back and seeing her lean forward to kiss him.\n\n\"He\u0027s a jerk.\" I mutter softly.\n\nBut I am an idiot.\n","page 108":"The hospital was completely empty by the time I got there and the visiting hours were long over. It was sheer luck that I knew one of the nurses, someone who had known both me and Sophia since childhood.\n\nEven Emily had known about this...why was I the only person left out?\n\nI had a million questions I wanted to ask her. They were are burning on the tip of my lips, but they were soon forgotten the moment I saw Sophia. Or what remained of Sophia as she lay quietly on the hospital bed.\n\n\"You...came.\" Her words were barely audible from the oxygen machine tubing and I can\u0027t tell if the trembling is from emotion or the exertion necessary to force the words out \"I...knew...you...would.\"\n\nMy knees keep buckling, but I somehow manage to stand. I can\u0027t let her see me act any different.\n\nAt the very least, she deserves that.\n\n\"I wanted to see you.\" I force a smile and taste salty tears. \n\nDamn.\n\n\"Why?\" She shifts her eyes sadly \"I...look...awful.\"\n\nLeaning forward to grab her hand, that soft fragile hand that now feels like a thin bag of bones, I tell her \"You\u0027ve always been the most beautiful thing I\u0027ve ever seen.\"\n\n\"Liar.\" A tiny smile cracked her lips. They were so pale, her entire body was so pale that it seemed like all the color was sucked out of her by those infernal tubes.\n\n\"I mean it.\" I gently squeeze her hand and smile back for real this time \"I could never lie to you.\"\n\nShe laughed slightly, but the laugh ends in a coughing fit. I can\u0027t do anything.\n\nNot a single thing to save her.\n\n\"Hey...\" Sophia smiled softly, her dark emerald eyes locked onto mine \"Can you tell me one last story?\"\n","page 56":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 58":"\"Daddy!\" Sara tugged eagerly at my shoulder and I felt a wide grin break across my face. So many years had passed from that beautiful day.\n\nSo what if it was a dream?\n\n\"Did she put you up to this?\"\n\n\"Mm-hm.\" Sara couldn\u0027t tell a lie.\n\n\"Well, I guess I better get up!\" Smiling back at her, I wonder for a second how long this dream will last.\n\n\"Daddy? You\u0027re not trying to doze off...are you?\"\n\nDeep down, I know this can\u0027t be real.\n\n\"Of course not.\" Getting up with a laugh, I pick up Sara and Marley \"I wouldn\u0027t miss this for the world.\"\n\n\"But Daddy...\" Sara pouted \"Don\u0027t you miss her?\"\n\nA chill went down my spine \"What do you mean?\"\n\nShe bit her lip \"I meant...don\u0027t you miss Mommy?\"\n\nI can\u0027t even escape in my dreams, can I?\n","page 190":"How many times did I have to drag her to the swimming pool? Probably a million. I loved being her life preserver, but there were always haunted houses and scary movies to replace the old swimming days. \n\nPlus, what if she was all alone in a pool by herself?\n\n\"I can\u0027t believe you finally know how to swim.\" We both resurface and I smile back at her. She grins back and eagerly dives into the ocean.\n\nWait, how much time has passed?\n\nI quickly dive in and see her watching a group of turtles swim beneath her feeth. Her hair floating in the air softly around her peaceful face.\n\nWhy did she only look peaceful at moments like these?\n\nWe both resurface, gasping for air. After heading off to the beach to dry off, I can hear the hooting and hollering of the local boys. Sophia always got a lot of interest wherever she went, it should have been something I have gotten used to by now. But my face turns a telltale red and Sophia asks teasingly \"What, are you jealous?\"\n","page 192":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 191":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 193":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 196":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 110":"\"Hey!\" Sophia was bouncing off the walls \"You never answered my question.\"\n\nShe pouted slightly and I couldn\u0027t help but smile. Smile that I got to spend the day with Sophia and smile because she had asked the question I always wanted to hear.\n\n\"The girl I like?\" I pause dramatically \"She\u0027s got to be special, not the kind of girl you\u0027d find anywhere.\"\n\nSophia stuck her tongue out \"That didn\u0027t answer the question.\"\n\nLooking down with a grin, I can\u0027t help but wonder how specific I should get at this point. I always knew who the only girl was for me in the end after all.\n\n\"It doesn\u0027t matter actually.\" I look up at Sophia and laugh \"She\u0027s way out of my league.\" \n\nHer jaw dropped and for a second she paused in the middle of the side walk.\n\n\"Sophia?\" I look back to see her turning bright red and gripping her hands.\n\n\"I can be better than her.\" She looked back at me with determined eyes \"I can be a much better girl for you than that girl!\" \n\nI probably should have told you that I was just describing you to yourself. But being a young boy doesn\u0027t mean I always give the most mature responses.\n\n\"Whatever.\" Walking away with a nonchalant air, I can\u0027t help but be relieved she can\u0027t see the huge silly grin on my face.\n\nAs I was telling the story, Sophia\u0027s hand was slowly falling out of mine. No matter how tightly I held her hand, there was no strength left.\n\nHer eyes were closed and they would never open.\n\nShe was gone.\n\n\"Sophia?\" I whisper \"It was you. It was always you.\"\n","page 198":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 197":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 178":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 179":"I didn\u0027t want to risk it.\n\nFalling asleep next to her was the epitome of suffering. I mean, the most wonderful possible suffering there is, but still...suffering.\n\nHow could I sleep?\n\nShe lay on top of me with her tiny body, her arms wrapped gently around my waist. That familiar scent of cinnamon mint wafting into my nose and overwhelming my senses.\n\nAs I stared up at her beautiful face, I could see a tiny drool slowly leak out of her mouth. I laughed gently, but could hear her softly grumble as her pillow (me) shifted around and made her spot less comfortable.\n\nWhat if things were different?\n\nLet\u0027s change the story now.\n\nWhat if I could save her?\n","page 65":"Shrugging my shoulders with a sigh, I look straight at Sophia and ask her \"why would you want to grow up so quickly anyways?\"\n\nShe looks away with a small pout and spotted my ace in the hole.\n\n\"She\u0027s amazing.\" A content smile spread across Sophia\u0027s beautiful face and I can\u0027t help but stare. At her and the world\u0027s luckiest cat.\n\n\"Are you feeling better?\" I gingerly ask and for a second, a shadow crosses her face. Her eyes lower and she ponders the question.\n\n\"Hmm, now I am.\" Kissing the cat gently on the forehead, Sophia laughed \"What\u0027s a good name for a cat like this?\"\n\n\"Err...Sophia II?\" \n\n\"That\u0027s a terrible name!\" \n\n\"What? I\u0027ve been calling her that ever since she was a kitten.\" Staring at her with mock horror, I reply \"I\u0027m pretty sure that cat already thinks that\u0027s her name.\"\n\n\"You\u0027re joking.\" Sophia looks at me with hopeful eyes, but as I shake my head reluctantly, she sighs \"Well...at least there\u0027ll always be a Sophia around you.\"\n\nShe looked so sad for a moment that I had to ask \"What, you\u0027re already abandoning the cat? Just because of a bad name?\"\n\nShe looks up and smiles at my bad joke \"You know I didn\u0027t mean that.\"\n\nThen, what did you mean? The question is on the tip of my tongue, but I swallow it back.\n\nShe wouldn\u0027t answer it.\n\nNo, she wouldn\u0027t.\n","page 60":"\"Hey!\" I ran up to her, panting the entire way. This heavy puppy seriously needed to go on a diet. He felt like two of Sophias, even though she easily towered over him.\n\n\"Hey stranger.\" She smiled back and I can\u0027t help but smile. \"Is that my birthday present?\"\n\n\"I wanted to wrap him up but he refused to cooperate.\" I sadly admit as the puppy coughed up a scrap of wrapping paper. \n\n\"Hmm, what\u0027s your name cutie?\" Sophia asked the puppy softly.\n\n\"I think you should give him one. It is your dog after all.\" \n\n\"How about Marley?\" Sophia asks and it was at that moment, the puppy decided to lick her face.\n\n\"I guess he likes it!\" We laugh together and for a moment, a brief moment, I feel like everything is okay.\n\nBut the moments started becoming rare. So rare, that even I realized it. Even during the moments when you acted like everything would be okay.\n\nDid you believe it?\n\nOr were you pretending like that day?\n","page 62":"\"Stay still!\"\n\n It was impossible to stay still when I could feel her eyes on me.\n\nFirst, she would stare at my face. Then, my arms. Then, my neck.\n\nIt was enough to drive me crazy.\n\n\"Hey, you moved!\" Sophia laughed and I snapped back into place.\n\nSeveral hours passed before she was satisified, but that was Sophia. A perfectionist to the end, she could always find the tiniest flaws in her work that people would praise as masterpieces.\n\n\"C\u0027mon, it\u0027s late.\" After she finished sketching, she was busy coloring in the lines. While I was happy to see the painting that caused the horrible crick in my neck to form, I wanted to see her, touch her, feel her.\n\nAll things that were impossible as she sat in that high chair.\n\n\"Hmm...\" She looked back at me with questioning eyes \"What are you going to do now?\"\n","page 64":"I say the words softly, but not because I\u0027m scared of other people hearing it. I say it softly into her ear, pleading with her to listen. To trust me when I tell her something because I\u0027ll always say the truth to her.\n\nShe smiles, but there is a hint of sadness to her smile as she asks just as softly \"Does it matter?\"\n\n\"Not really.\" Leaning my forehead against her head, I whisper back \"Young or old, I\u0027d like you either way.\"\n\n\"Hmph.\" A small laugh escaped her lips \"Your dad\u0027s sappy lines are rubbing off on you.\"\n\nWe both looked at each other and laughed. Of course, that moment was broken up by the swimming instructor who had noticed Sophia and I standing still in the middle of the pool while the other students were diligently swimming away.  While other people\u0027s conversations had faded completely to me when Sophia was nearby, the paddleboard to the head knocked me unconscious and Sophia had to get help to drag my floating body to the poolside for safety.\n\n\"You definitely owe me one now.\" Sophia laughed and her smile was so wide that I didn\u0027t mind the inevitable debt that my poor wallet would have to pay for her surprisingly insatiable stomach.\n\n\"Same place, same time.\" I toss back with a matching smile.\n\nSophia was already waiting patiently at our usual place. Her hair tied back neatly and I was struck by her new glasses.\n\n\"They make me look like a dork.\" Sophia sighed \"But I can\u0027t stand wearing contacts after swimming.\"\n\n\"You look smart.\" I gently knock my shoulder against hers.\n\n\"Wait, does that mean I don\u0027t look like smart if I don\u0027t have glasses on?\u0027 Sophia knocked back with her shoulder against mine, a bit harder than I had.\n","page 63":"\"Hmph.\"\n\nApparently, there was nothing else to do on this island.\n\n\"Hmph.\" Sophia sighed heavily again and I could see both Sophia and Angie staring at me from the corner of their eyes.\n\nThe entire time, Marley was blissfully yawning in the sunlight.\n\nLucky dog.\n\n\"C\u0027mon, we can do other things.\" I try to hand out an olive branch.\n\n\"Psh, just go meet other girls.\" Angie pouted and i have to admit, she played the role of Sophia\u0027s sister as though it was her sole purpose in life. Even if it was completely overboard, she mirrored her mood to Sophia\u0027s mood. So no matter what, I couldn\u0027t ignore how Sophia was feeling.\n\nSomehow, this felt like a lose-lose situation.\n","page 181":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 180":"\"I\u0027m ready.\"\n\n She tried so hard to seem like an adult. Even the lingerie she bought was clearly for someone much older.\n\nMy mouth was dry and I could feel a gallon of sweat begin to pour down my forehead. But she was absolutely perfect.\n\nAbsolutely perfect.\n\nIn my arms, she was so tiny. Was Sophia always this small? Before I can ask, she stops me with a kiss. Any kind of comprehensible thought in my brain stops and all I can do is react.\n\nTo kiss her when she kisses me back.\n\nTo slip off that one-piece off her shoulder.\n\n\"Are you sure?\" I ask her hoarsely.\n\nShe nods softly and I give in.\n\n \n","page 183":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 182":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 185":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 184":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 187":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n","page 186":"She was only wearing adornments in her hair, the rest of Sophia was clad just as she was born. We had actually taken baths together when we were kids. Back then, I couldn\u0027t realize how stunningly beautiful she always was. \n\n\"Always remember..please.\" I can\u0027t quite hear the words she\u0027s whispering though. I can only catch fragments. Her beautiful emerald eyes won\u0027t open though. They won\u0027t look back into mine anymore and for some reason, that terrifies me.\n\nLeaning forward, my fingers barely graze her arm when I shudder. Her skin is cold, ice cold. Even though she has a rosy blush and her body looks perfect, she feels like a corpse. A beautiful talking corpse of the girl of my dreams.\n\n\"Please...forgive me....\" Her lips keep moving and I feel afraid. Like I\u0027m remembering something I don\u0027t want to remember.\n\nLike the moment I remember, she\u0027ll be gone.\n\nGreen eyed girl, why are you crying?\n\nDid the world treat you badly enough to feel like dying?\n\nStop it. I shake my head and look down at my hands. My hands that were empty before are now filled with...\n"}