{
  "page 19": "All around you the inn bursts into applause. The bard bows low before clambering down from his table and slipping out of sight. No one was quite expecting that ending, strange as it was, and no one is likely to forget it either. You chuckle at the abundance of flies buzzing around the crowded room, landing greedily on sweaty heads and tankards of ale. Perhaps some of them were once great wizards, too. The atmosphere is warm and all eyes are friendly, everyone eager to prove he is not likely to collapse into a raging insect at any moment.\n\n\nAfter a couple hours of talk you go upstairs, still half singing the last drinking song and reveling in your happiness. Nights like this don\u0027t come along often, especially for travelers like yourself. Come morning you\u0027re still whistling, and though your forget the bard\u0027s exact words, you walk with a spring in your step from that night forward. Each buzzing fly reminds you of the cost of foolish anger.\n",
  "page 5": "No one speaks. A few ashen faces turn to one another, fearful looks all around. The same thought is on every mind. What on Earth can this man, this damned fool have be thinking, peddling his treasonous idiocy around innocent people. Doesn\u0027t he know that Cantaphrax has powerful servants? The barman recovers first, clenched his fist and shouts \"Out!\" He\u0027s trembling. The bard obliges, giving the room one last sly smile before walking into the cold.\n\n\nYou don\u0027t know if his tale is true, if a Prince named Reginald once had a chance to stop the Wizard\u0027s rise. But it doesn\u0027t matter now, the world is as it is and no silly, stupid song can change it. After a few minutes nervous chatter begins in earnest, everyone quick to pretend nothing is wrong. It\u0027s unlikely there were demons listening here, at a tiny inn on the outskirts of a tiny village. Surely Cantaphrax would be merciful to innocents, to loyal subjects just as horrified at treason as the Mage himself? After an hour or so of this sort of talk, you retire to a small and flea-infested room upstairs. The bard\u0027s final words come back to you, just before you drift off to a fitful sleep. Will a hero come, someday? A man who could succeed where the noble Prince failed and bring down the tyrant. Idle talk, most likely. Tall tales.\n",
  "page 18": "But Cantaphrax was in no mood\n\n\nTo once again delay his goal\n\n\nAnd so his mind, before so shrewd\n\n\nSubmitted to his raging soul.\n\n\nHe cursed and spat at Lady Jane\n\n\nWith all the kindness of a troll.\n\n\nThe Princess in her heart felt pain\n\n\nTo see her savior so transformed\n\n\nInto this angry thing. In vain\n\n\nShe sought to calm the mighty storm\n\n\nErupting from the once-wise Mage\n\n\nReduced now to pathetic form\n\n\nBent over with impatient rage.\n\n\nThe spittle flew from out his maw\n\n\nHe looked more fit to fill a cage\n\n\nIn some menagerie with straw\n\n\nTo be his bed and hate his feed.\n\n\nAs minutes passed the Lady saw\n\n\nThe Mage begin to shrink, indeed\n\n\nUntil with every frenzied cry\n\n\nHis human nature did recede.\n\n\nTill soon enough he was a fly\n\n\nWho could do naught but buzz about\n\n\nBut wait, what\u0027s that, you ask me why?\n\n\nThere is in my mind little doubt\n\n\nThat we can blame his rage and hate\n\n\nFor how old Cantaphrax turned out.\n",
  "page 29": "There is a smattering of applause as the bard strums his deep, final chord. \"How very true, \" begins the old abbott, \"that we must all look to our sins and redeem ourselves.\" He takes a deep breath and begins a sermon, but thankfully the rest of the patrons drown out his creaking voice. \"I wasn\u0027t expected such an ending, no I wasn\u0027t,\" says the barman. \"Sneaky little devil, slipping a lesson in when we least expected it.\" You shrug. It seems morality plays are not quite the fashion in this inn.\n\n\nYou walk upstairs to your room soon after, tired and drunk. The bed is hardly comfortable but it\u0027s a damn sight better than a ditch on the side of the road. As you drift off you think of how Cantaphrax turned out. You\u0027ve known some villains in your time, unscrupulous merchants and foul criminals mostly. Never a wizard, but what\u0027s the difference really. None of them had a change of heart and started helping the poor. Still, makes a nice ending.\n",
  "page 8": "So while the beast roared loud as Hell\n\n\nHe dove between its filthy feet\n\n\nAnd just beside the Princess fell.\n\n\nHe cut her chains, no easy treat\n\n\nWhile Minotaur is looming near\n\n\nPreparing to cut you to meat.\n\n\nWith Jane set free he felt no fear\n\n\nAnd turned to face the hairy thing\n\n\nThat stared straight with a manic leer.\n\n\nTheir blades connected with a ding\n\n\nResounding to the farthest shore.\n\n\nBut neither foe had strength to bring\n\n\nHis enemy to Hades\u0027 door\n\n\nUntil the Lady Jane stepped in\n\n\nAnd, picking up the chain she\u0027d wore\n\n\nIn desperation helped her kin\n\n\nBy throwing it against the beast\n\n\nA steely bolt to end his grin.\n\n\nNow seeing that his foe had ceased\n\n\nTo fight because the chain had struck\n\n\nPrince Reginald\u0027s attacks increased!\n\n\nThe Minotaur had lost his luck\n\n\nThe Prince loped off his ugly head\n\n\nAnd tossed it down to join the muck.\n\n\nThen Prince and Princess both embraced.\n\n\nThey wept to see themselves alive\n\n\n...\n\n\n \n",
  "page 7": "His sword to slay the Demon-Bull!\n\n\nAnd Lady Jane bound fast with chains\n\n\nAgainst her wretched bonds did pull.\n\n\nThe Minotaur with bulging veins\n\n\nThat ran across fleshy form\n\n\nLet swing his axe of bloody stains\n\n\nAs merciless as Hell\u0027s own storm.\n\n\nThe silver-footed Prince cried out\n\n\nAs blood began to bubble warm\n\n\nFrom out the hole where once did sprout\n\n\nHis ear, and turning to his foe\n\n\nHe charged and swung with one long shout!\n\n\nPrince Reginald aimed his blade low\n\n\nAnd so the tragedy occurred.\n\n\nHe missed the beast but fierce did flow\n\n\nHis sister\u0027s blood, he hadn\u0027t heard\n\n\nHer scream of terror at the sword.\n\n\nNow at her corpse with vision blurred\n\n\nHe stared in shock then turned toward\n\n\nThe beast, but too late to react\n\n\nHis head, once severed joined the hoard\n\n\nThe filthy creature kept and stacked.\n\n\nAs did that of the Lady Jane\n\n\nBut soon enough the beast was tracked\n\n\nAnd killed in anger and in pain\n\n\nBy Cantaphrax, whose plan had failed.\n\n\nSo ends my tale, and are all slain.\n",
  "page 2": "Then he would come with foul intent\n\n\nTo rescue her and make her think\n\n\nHe was an old and kindly gent.\n\n\nFrom there the Mage would worm and wink\n\n\nWith all his slimy magic skill\n\n\nUntil her sovereign mind would sink\n\n\nBeneath his domineering will.\n\n\nSo quick as lightening conjured he\n\n\nA dreadful Dragon trained to kill.\n\n\nFrom there the plan went perfectly\n\n\nThe Lady Jane was caught and then\n\n\nOld Cantaphrax emerged to free\n\n\nHer from the wicked Wyrm again.\n\n\nHe spoke to her with words most kind\n\n\nAnd being little more than ten\n\n\nShe trusted him and so was blind.\n\n\nBut then the Lady Jane did ask\n\n\nThe Mage if he would help her find\n\n\nHer castle home and to this task\n\n\nHe was most happy to assist.\n\n\nA pinch of powder from his flask\n\n\nAnd magic words he did enlist\n\n\nTo bring them in an instant to\n\n\nThe castle walls rising through mist.\n\n\nShe thanked him and her feeling grew\n\n\nSo that she thought him best of men\n\n\n...\n",
  "page 1": "Then Cantaphrax would raise his knife\n\n\nOf purest silver \u0027oer the maid\n\n\nTo cut away her royal life.\n\n\nThen with the blood spilled from the blade\n\n\nHe\u0027d call upon a Fiend most great\n\n\nAnd make a most unholy trade.\n\n\nThe Lady\u0027s soul he\u0027d give with hate\n\n\nAnd in return dominion gain.\n\n\nHe would rule- \u0027twould be his fate!\n\n\nAnd so the Wizard sought poor Jane\n\n\nBy sending out a demon slave\n\n\nA Minotaur, who with a chain\n\n\nDid drag her to a far-off cave.\n\n\nNext morn when Reginald awoke\n\n\nHe knew his sister he must save.\n\n\nThe Prince picked up his sword and cloak\n\n\nAnd rode off from his castle home\n\n\nBut coming to a dead old oak\n\n\nHe knew he could no longer roam\n\n\nMust choose to go to left or right\n\n\nDown dusty roads found in no tome\n\n\nIf for his sister he would fight.\n\n\nPrince Reginald then chose the path\n\n\n...\n",
  "page 4": "All was dark and damp and fell\n\n\nThe Sun was strangled by the trees\n\n\nFor of that fen few tales do tell.\n\n\nAlthough the Prince rode on with ease\n\n\nNot knowing he had lost his way\n\n\nAll at once something did seize\n\n\nHis horse\u0027s leg, it gave a neigh!\n\n\nIt was the Hydra! Poison green\n\n\nAnd hidden in the mud it lay.\n\n\nThe Prince drew out his sword, whose sheen\n\n\nStill faintly glimmered in the gloom\n\n\nAnd sliced one of the heads off clean!\n\n\nSurely the Prince had caused its doom.\n\n\nBut look and see the smoke that flies\n\n\nFrom Hydra\u0027s bloody neck in plumes.\n\n\nAnd see the heads of tiny size\n\n\nThat soon grew huge and fell as fear.\n\n\nIt gazed at him with doubled eyes\n\n\nAnd fought with hate it quick made clear.\n\n\nThe Prince attacked with all his might\n\n\nBut this Thing from the frontier\n\n\nCould not be bested. With one bite\n\n\nIt ripped the noble Prince apart\n\n\nAnd doomed the Princess to her plight.\n\n\nThen Cantaphrax, he pierced her heart\n\n\nAnd gained dominion \u0027oer our land.\n\n\nSo goes the tale that tells the start\n\n\nOf our submission to his hand.\n\n\nThe Mage rules still in tyranny\n\n\nUntil some hero takes his stand\n\n\nAnd makes our kingdom once more free.\n",
  "page 3": "The Prince rode on along the road\n\n\nAs ever taller grew the heights\n\n\nAnd in his earnest never slowed.\n\n\nThrough darkness fell still shone the lights\n\n\nOf moon and stars arrayed above\n\n\nOur guardians atop all nights.\n\n\nSo driven on by heart-felt love\n\n\nPrince Reginald did spy a cave\n\n\nAnd fearless of danger thereof\n\n\nMade for this dark and gloomy grave.\n\n\nDear listener, you\u0027ve guessed it true\n\n\nThe Lady Jane and Mage\u0027s slave\n\n\nLay waiting in this cavern too!\n\n\nThe Prince approached the hellish maw\n\n\nAnd rode in, crying \"Hew!\"\n\n\nThe Minotaur struck forth a claw\n\n\nAnd bellowed out his fearful rage.\n\n\n...\n",
  "page 11": "Prince Reginald and Lady Jane\n\n\nRode swiftly down the mountain way\n\n\nAnd his poor horse the Prince did strain\n\n\nWhile Lady Jane did naught but pray.\n\n\nThey did not fear old Cantaphrax\n\n\nFor they knew not \u0027twas all his scheme\n\n\nBut still could neither one relax\n\n\nBoth haunted by a waking dream\n\n\nOf terrors coming in the night\n\n\nBeneath the frigid stars agleam.\n\n\nThough he had won a mighty fight\n\n\nThe Prince longed just to make it back\n\n\nAnd end the misadventure right.\n\n\nThey wandered down the misty track\n\n\nBut lacking light to guide the course\n\n\nWere quickly lost in inky black.\n\n\nThe Prince, the Princess and the horse\n\n\nStill wander in the wilderness\n\n\nA hundred years of ghostly force\n\n\nHas kept them lost with no redress.\n\n\nSo if you ride by night and see\n\n\nThe ghostly royals, feel no distress\n\n\n\u0027Tis just their phantoms, never free.\n",
  "page 22": "And quickly saw to all their woes\n\n\nThe sick were healed and filled with light\n\n\nFrom shining eyes to glowing toes.\n\n\nYou would have wept to see the sight\n\n\nOf all the folk restored and gay\n\n\nAnd never known the darkest night\n\n\nThat in the Mage\u0027s soul still lay.\n\n\nThe peasants thanked him heartily\n\n\nBut wordless waved he them away.\n\n\nThe Lady Jane looked on with glee\n\n\nTo see how Cantaphrax did aid\n\n\nThese simple folk without a fee.\n\n\nShe led him though the mossy shade\n\n\nOf tower, wall, and parapet\n\n\nUntil the Mage grew quite afraid\n\n\nFrom out this maze he\u0027d never get.\n\n\nThey came at last to a small door\n\n\nOf purest ironwood and set\n\n\nInside with fiery rubies four.\n\n\nThis was the Tower of the Sage\n\n\nHis newfound home and even more\n\n\nThe place to work his skill as Mage\n\n\nAnd gain dominion \u0027oer this girl\n\n\nTo rule the Kingdom as his stage\n\n\nAnd play the dramas that did swirl\n\n\nAmid his foul and filthy head.\n\n\nBut wait, do I yet spy a pearl\n\n\nOf good inside this oyster dread?\n\n\nA chance to overcome his hate?\n\n\n...\n",
  "page 21": "Was he, the greatest sorcerer\n\n\nAlive to serve this rabble? No!\n\n\nThese filthy, lowly peasants were\n\n\nBeneath his notice, far below!\n\n\nThe crowd was furious and shocked\n\n\nAnd Lady Jane could hardly know\n\n\nWhy Cantaphrax at helping balked.\n\n\nThen suddenly a rock was thrown-\n\n\nAt that the gates of rage unlocked.\n\n\nThe peasants hurled stone and stone\n\n\nToward his arrogant, old head!\n\n\nAgainst the tide he fought alone\n\n\nBut from his many wounds he bled\n\n\nAnd though his magic felled a few\n\n\nThe Mage was quickly beaten dead.\n\n\nNow listen, you, and you and you\n\n\nTo what his death makes clear to me.\n\n\nThe moral of the tale, it\u0027s true\n\n\nIs never to regard with glee\n\n\nYourself and think you better than\n\n\nThe rest- I\u0027m sure you will agree.\n",
  "page 13": "A chill hangs over the entire inn as the bard finishes, and you take a sip of ale to warm your insides. Pretty soon everyone is eating and talking as boisterously as before, but now all on the same subject. \"I saw a specter myself,\" a ragged monk behind you pipes up. \"The Abbott of the monastery three hundred years ago, he floated through a wall once when I was chanting the evensong.\" The man to your left cuts him off, eager to relate his own experience with ghosts. It seems everyone has been visited at least once, and some of the louder men claim to have seen four or five. You\u0027d never believed in the things before, but now you wonder. There have been times, traveling alone or half asleep, when you\u0027ve seen something out of the corner of your eye. You\u0027d always dismissed it as nothing, but perhaps there\u0027s more?\n\n\nA couple of hours of such chatter and ale sees you stumble upstairs to a tiny room, ready to sleep for a fortnight. You resolve to be on the watch from now on, for you never know when a ghost might come by. And think if one did appear, maybe even Prince Reginald and the Lady Jane, and you missed it! Thank God the bard helped you see that these things are possible, a testament to his mysterious skill.\n",
  "page 12": "To ride by night would be indeed\n\n\nA folly, so they did decide\n\n\nTo wait for morning to proceed.\n\n\nThrough hours long the royals tried\n\n\nTo reach the gentle shore of sleep\n\n\nAnd float with ease upon its tide.\n\n\nBut inky night could not long keep\n\n\nThe Sun from rising in the sky\n\n\nSo from the cave, down pathways steep\n\n\nThe horse and riders quick did fly\n\n\nToward the castle, refuge from\n\n\nThose terrors lurking ever nigh.\n\n\nThe King was downcast, sitting glum\n\n\nWhen through the door his children came!\n\n\nHis son and daughter! Beat the drum\n\n\nAnd let the trumpets sing their fame\n\n\nFor deeds of valor rarely seen\n\n\nBy noble knight or cultured dame.\n\n\nNow closer, friend, I beg you lean\n\n\nTo hear the moral of my song-\n\n\nThe old who mock the young as green\n\n\nAre doing them a mighty wrong\n\n\nFor my tale has surely shown\n\n\nIn heart the young have valor strong.\n",
  "page 23": "The inn erupts into cheers as the bard bows and disappears from view. All around the farms nod and laugh at their liege lords\u0027 pretensions. Even the monks smirk at their abbot, who has launched into a lecture on the many virtues of obedience to one\u0027s natural superiors. You join in the fun, having known more than enough idiotic and arrogant nobles in your time. The abbot eventually denounces you all as seditious and ungodly, which only brings on more laughter.\n\n\nA few hours of such talk and you make your way upstairs and into a room. As you drift off to sleep you wonder idly about this strange world, where some men are born superior and other to work in the mud. If those peasants could kill the great wizard Cantaphrax, why not the men in this inn? Maybe someday the whole system will come crashing down, replaced by God knows what. The next morning you leave, never to return to the tavern or see anyone in it again. You do, however, meet many more farmers and monks and travelers, all eager to hear of the time their kind triumphed over one of their betters.\n",
  "page 15": "The bard bows low before disappearing from view, a flagon of ale in one hand and his lute in the other. The reaction is certainly mixed, clapping and cheers mixed with scattered grumbling about upstart musicians. Quickly the inn descends into full argument on all sides. The older farmers shake their heads at the protestations of their sons while several novice monks begin to shout at their stooped and wizened fellow. Even the barman has joined it, lecturing his little servants on the virtues of obedience. You watch with amusement before being accosted on either side, both young and old eager to criticize your flippancy. \n\n\nAfter a few hours of increasingly drunk argumentation you roar several choice oaths and find a room upstairs. The bard was right, you decide before drifting off, to sing the praise of Prince Reginald and Lady Jane. What connection they have to the boisterous young pups downstairs you don\u0027t know, but it was a fine tale all the same. \n",
  "page 26": "This seed which long in darkness lay\n\n\nHad finally received its chance\n\n\nTo grow and in the wind to sway.\n\n\nThough unseen by a passing glance\n\n\nThrough days and weeks his conscious grew.\n\n\nThe Mage did slowly change his stance\n\n\nUntil he took a different view.\n\n\nControl and power sought he not-\n\n\nDo not doubt I tell it true.\n\n\nThe Lady\u0027s influence had taught\n\n\nOld Cantaphrax to see the light\n\n\nAnd change his ways ere he did rot.\n\n\nTo help the poor was his delight\n\n\nTo heal the sick his new-found love.\n\n\nIt goes to show the darkest night\n\n\nIs always pierced by stars above.\n\n\nAnd so I tell you, faithful friends\n\n\nRemember him and think thereof\n\n\nBefore your chance for goodness ends.\n",
  "page 9": "A few moments of silence follow the bard\u0027s last note. You can almost feel the sorrow on the back of your neck, forcing you into a shallow grave. The other patrons begin to clap and you do likewise, marveling at this magician who can summon fear and death with mere words. Soon the ordinary talk of life begins again, idle chatter about the road ahead or memories of years long gone. You drink more than is good for you, enough to regret tomorrow morning.\n\n\nAfter a couple hours you make your way upstairs and collapse on the small and flea-infested bed. Sleep comes almost immediately, but it is not a peaceful rest. Phantoms with horns and axes dripping blood hunt after you, eager to add your rotting head to the pile. As the days go by you forget about the dreams and, after a while, even the bard and his story. But every so often they return, the nameless terror only words can bring forth in the night, a testament to that chilling tale.\n",
  "page 25": "Each day the Princess came to sit\n\n\nAnd listen at the Mage\u0027s feet.\n\n\nHe\u0027d conjure up some small trinket\n\n\nA magic brooch or fairy sweet\n\n\nTo give her and so every day\n\n\nHe grew in her eyes tall as wheat.\n\n\nThis wily devil knew to play\n\n\nThe kindly Mage when with the King\n\n\nAnd help him in some tiny way\n\n\nLike finding once a long-lost ring.\n\n\nO bless his heart, the King knew not\n\n\nHis busy bee nursed quite a sting.\n\n\nSo for long years did grow the rot\n\n\nUntil the Mage decided it\n\n\nWas time to strike for what he sought.\n\n\nThe deed required all his wit\n\n\nTo sneak into the kitchens and\n\n\nDeposit just a little bit\n\n\nOf Hydra venom in a pan\n\n\nOf rare and wild choice mushrooms.\n\n\nAs soon as King and Prince began\n\n\nTo eat, the pallor of the tomb\n\n\nCame swift across their faces to\n\n\nAnnounce their final, poisoned doom.\n\n\nAnd so the Lady Jane, it\u0027s true\n\n\nWas crowned the Queen in majesty.\n\n\nBut Cantaphrax had worked his coup\n\n\nThe young Queen\u0027s will was never free\n\n\nFrom Cantaphrax\u0027s scheming plans.\n\n\nWith all his thoughts she did agree.\n\n\nAnd so the Mage ruled o\u0027er the land\n\n\nWith tender compliments so that\n\n\nThe Queen would never take a stand.\n",
  "page 17": "The King was glad indeed to see\n\n\nHis daughter back and thanked the Mage\n\n\nNot knowing his identity.\n\n\nBut Cantaphrax in his old age\n\n\nAppeared a wise and noble gent\n\n\nAnd since the castle lacked a sage\n\n\nThe king asked if he would consent\n\n\nTo stay and serve the royal court.\n\n\nThe offer would his plan augment\n\n\nAnd make his scheme harder to thwart\n\n\nSo Cantaphrax did take the job-\n\n\nHe was a quick and scheming sort-\n\n\nThe Lady Jane did nearly sob\n\n\nWith joy to see her savior stay.\n\n\nBy this time there had formed a mob\n\n\nOf peasant folk with faces grey\n\n\nThat sought the Wizard\u0027s help with all\n\n\nTheir problems that had brought dismay.\n\n\nWhen Cantaphrax observed the sprawl\n\n\nOf beggars hoping for his aid\n\n\n...\n",
  "page 27": "The inn bursts into applause at the bard\u0027s last words. He vanishes into the crowded room as talk breaks out all over about his tragic story. The monks seem to have especially liked it. You overhear the Abbott pontificating on the evils of magic and how it only ever leads down the road to trouble. The barman is certainly enjoying the atmosphere, with his customers eager to stay up, talk, and drink more of his ale. You get into a discussion with a few other travelers, reveling in how everyone seems to have a talk of his own about some villain like Cantaphrax.\n\n\nHours later and stumbling from the ale you collapse on a bed upstairs, hoping for a few hours sleep before another wearying journey tomorrow. You think through all the tales you heard tonight, from the bard\u0027s to those of the travelers. If you were the Lady Jane, you wouldn\u0027t have been duped by an evil wizard. How could she have fallen for that and let herself be influenced, be controlled? Not you. You drift off, reveling in your cherished freedom.\n",
  "page 0": "Few sights are as cheery as the warm light of an inn on a moonless night, especially when the winds are coming strong from the north and biting at your skin with icy teeth. You plod straight through the muck and dirty puddles, eager to rest before another day of wearying travel. The oaken door is heavy, but a mountain could not stop you, this close to warmth. \n\n\nYou are not disappointed. The inn is crowded with people of every shape and size. Farmers from the nearby village mix with black-robed monks from the abbey. Children dart here and there, laughing at the drunk and sodden men that lie senseless in their ale. A handful of scraggly travelers warm themselves by the enormous fire, swapping rumors and tearing into black bread. You take a seat alongside them, nodding a welcome but with eyes only for the flames. Only after you can once again feel your hands and feet does your hunger return. The barman is a squat fellow, red bearded and seemingly fond of shouting. He takes your coins and shoves a bowl of thick stew towards you. \"Welcome,\" he shouts, \"to the Red Lion!\"\n\n\nThe man to your left strikes up a conversation about your destination, and soon the two of you are chatting away while you forget the miles ahead tomorrow. Suddenly the room goes silent, no small feat. Even the barman has ceased bellowing to his sons. All eyes are fixed upon the bard who has just stood, lute in hand, on a central table. He is a curious, almost comical figure, with arms and legs just slightly too long for his body and a shock of white hair that cascades down his shoulders like a waterfall. His voice, however, is low and clear, and it is not hard to see why all await the performance so eagerly. The bard strums a few notes, coughs twice, and begins his tale.\n\n\nA hundred years ago or more\n\n\nWhen good king Freolaf did rule\n\n\nThe realm knew peace and never war.\n\n\nHis son, the Prince, was never cruel\n\n\nThe worthy son, Prince Reginald.\n\n\nHe had a daughter, too, a jewel\n\n\nThe Lady Jane, but twelve years old.\n\n\nOur Prince did love his sister sweet\n\n\nTheir bond was joyous to behold.\n\n\nBut danger came on swiftest feet\n\n\nFrom that old fiend, that devilish man\n\n\nCantaphrax, the Lord of Heat\n\n\nWhose crimes, if I the list began\n\n\nWould stretch from here right to the Moon!\n\n\nThe demons of the fiery clan\n\n\nAll paid him homage, danced his tune.\n\n\nHe summoned flames with just a wink\n\n\nBrighter than the Sun at noon.\n\n\nUpon a plan the Mage did think\n\n\nTo win the power he\u0027d long sought\n\n\nFrom spells in books with fading ink.\n\n\nThe scheme was this: send demons hot\n\n\nTo steal the Lady Jane away\n\n\n...\n"
}