["100","Three Hundred Thousand Tears","Crescentstar","6","6","6.14","https://chooseyourstory.com/story/Three_Hundred_Thousand_Tears.aspx","To some, it\u0027s called the \"Forgotten Holocaust of World War II\". The atrocities committed in the Pacific theater of war during World War II are arguably the most inhumane and cruel acts done in all of human history.\nPlay as either Zhaoluo or Li, a pair of stepsisters, along with a touch of enemy perspective.\nEndings: 3 Normal Epilogues, 2 Special Epilogue (an altered version of a normal epilogue due to at least one choice), 2 Normal Endings, 2 Death Endings.\nNotes:\n1. I do not intend to discriminate against any group; I think that all types of people can be very nice and kind, and I\u0027m writing in both sides\u0027 possible perspectives, so keep that in mind. Also keep in mind that the Japanese and Chinese had always had tensions between them, and their bias against the other can be very strong.\n2. I\u0027ve taken some creative liberties with the story, which include making up appearances for real people/characters and the lack of police officers and guards in the camp the protagonist resides in. It is historical fiction after all. Oh, and I\u0027m pretty sure that some of the swear words I used don\u0027t really exist in Chinese, but my knowledge in that area is not too good.\n3. Information found are on various sources listed at the end of the main path (the most boring path, of course).\n4. Although much of it is optional, and because I can\u0027t write such things very well, there will be mentions and mild descriptions of violence, gore, rape/forced incest, decapitation/removal of body parts, and other dark subjects. Viewer discretion advised.\n5. Update (1): Thanks you, StrykerL, for the critique. I\u0027ve incorporated most of the tips. Future Updates (?): Extended paths, Hidesada Path.\nAcknowledgements:\nThanks to TharaApples for beta-reading. :D Also, I\u0027d like to also mention Orange and MinnieKing for (keeping me entertained and) helping each other procrastinate during our time with all this: *gestures wildly*. Of course, for also shoving each other toward the finish line (he he). Oh, and Steve24833: Thanks for a few informational pointers and stuff. Thanks to the people who\u0027ve given writing advice to me in my time here because they were very helpful.\nIf you notice anything wrong, incorrect, or otherwise... odd, please let me know! ^-^\nEnjoy. :D"]