{
  "page 77": "Dr. Wilson came through the door again, promptly going over to her. This time, he carried a small box with him. He placed it next to her along with a blanket. \"For you to feel more comfortable\"\n\n\n\"What\u0027s the box?\" Li asked.\n\n\nHe opened the small wooden thing to reveal a few scary-looking instruments and a few bottles and pills.\n\n\nShe shrank away at the sight of a needle, but Dr. Wilson chuckled as he said, \"I\u0027m just going to look after your wound. Can you stretch out your leg and pull up the leg?\"\n\n\nLi obeyed, and he went to do something similar to what Zhen had done. The familiar sting was somewhat nostalgic.\n",
  "page 76": "Unfortunately, she woke up to the sounds of people weezing or groaning or coughing. She tried to shut them out. She was just wounded. She wasn\u0027t sick. She wasn\u0027t going crazy. But the sounds of those people disturbed her very much.\n\n\nHer parents once told her a story about somebody who was sick. They didn\u0027t really know what illness it was, but a priest and his apprentice made a medicine by boiling some mythical animal in a pot with herbs. It sat there for so-many days and hardened, becoming the medicine. Everyone in the village became happy and healthy again. Li couldn\u0027t... remember the details too well. It didn\u0027t seem important anymore. But she was thinking that that sickness in the story wasn\u0027t really a physical sickness. How else could a mythical creature be involved? She didn\u0027t know the word for it, but it was something like people who believe their sick are more likely to stay sick or something, and people who are confident in the medicine and the priest will be cured.\n\n\nIt was a stupid thing. Unfair and uncertain. These people were miserable that Li was beginning to feel miserable and weak. It was so dumb. They\u0027re all just feeding off their own misery. She wanted to sob to herself at how sad this place was.\n\n\nAt last, somebody opened the door wide, and Li realized that is was somewhat bright outside. The man was sort of young-looking, but obviously not a young adult. Clutching his face were his spectacles, and his hair had receded from his head a bit already.\n\n\nImmediately, he asked kindly, \"Which one of you arrived here last night?\"\n\n\nTentatively, Li raised her hand. He was short, but he felt like a strong force just standing there. He looked down at her, surprised. Why would he be?\n\n\nHe closed the door behind him, and everybody else just kind of looked at him. Who was he to have the attention of all of these people so quickly?\n\n\n\"I\u0027m Dr. Wilson,\" he greeted. \"What\u0027s your name?\"\n\n\n\"Li.\"\n\n\nHe didn\u0027t ask anymore personal information. \"Can I see the injury?\"\n\n\nShe nodded.\n\n\nThe doctor carefully peeled away the cloths without giving away anything in his expression. He didn\u0027t want the girl to be scared, as she clearly has been through a lot. From what John had told him, he expected somebody older. This girl wasn\u0027t even a teenager.\n\n\nLi felt a bit of prodding with something, but she was too scared too look at what he might do to the wound. Heck, she was too scared to look at the infection at all.\n\n\nDr. Wilson muttered something foreign, and she felt like she was going to hear some bad news. She didn\u0027t. He simply cleaned the wound, wrapped it in fresh cloths and told her, \"You have to stay here for a bit. I\u0027ll come back every day to make sure it\u0027s alright. Food is served twice a day; when you\u0027re in here, someone will bring some food in for you. Understand?\"\n\n\nHe was keeping things as short as possible but was very kind about it. Li smiled and nodded, not feeling too positive. She didn\u0027t want to spread negativity, and her father always said that if you smile and be positive, it\u0027ll make others feel that way too. She didn\u0027t want Dr. Wilson gloomy or anything.\n\n\nHe moved onto the next person, and Li thought again, I want the kind doctor to be happy.\n",
  "page 79": "It was in the afternoon when the Japanese entered the camp. They were officers, and they carried filled sacks. Kuyue had quickly swept Li away—away from those men who ruined both their lives. Li was scared, so scared as she saw those men again. Less wild than the soldiers she had seen, but she was still frightened. She\u0027d seen the mercy of people. It was close to none.\n\n\nAnd so, Kuyue told her a story.\n\n\n---\n\n\nI lived in a family of four, the standard, I suppose. Baba, Mami, and Maimai, my sister. Baba worked as a messenger, so he was always away in the morning and afternoon. He arrives home late.\n\n\nWhen the Japanese invaded, I never saw him again. Mami rushed us out of the house at the first sound of war. She had been ready. She gave us each a small bag to carry—some basic things like food and important possessions. She didn\u0027t take jewelry; she felt that it was too dangerous to carry that around.\n\n\nWe weren\u0027t wealthy, but she left all her jewelry here except for one bracelet Baba had given her. And we headed off. We didn\u0027t run because Mami wasn\u0027t used to it, and Maimai got tired easily, so when we heard Japanese soldiers calling to us, we got split up—Mami and me, and Maimai all by herself....\n\n\nMami wanted me to keep running. I was younger and almost my prime age. She was aging. I refused. The Japanese men caught up to us, and they took her and raped her. It was so brutal. They... they kept hitting her. I\u0027m not sure if I should be telling you this...\n\n\nWell, they hurt her taking turns, apparently planning to save me for later? I managed to free myself from the man who was holding me, hitting his weapon into his ribs. And I ran. All of them were so busy, and Mami screamed for me to keep running.\n\n\nI did. I didn\u0027t stop until I saw the Red Cross flags. We were so, so close too. I don\u0027t know where Maimai is either. She\u0027s... I don\u0027t know.\n\n\n---\n\n\nLi patted Kuyue\u0027s back, feeling her own heart twist like a serpent inside her. She watched her mother... She didn\u0027t dare think of it. She\u0027s heard of the acts committed so many times in this place that she knew what it was now. Li wished she didn\u0027t.\n\n\n\"It\u0027s going to be all right.\"\n\n\n---\n\n\nThe officers left later, and they ended up passing small pouches of white powder to everybody. Kuyue and Li weren\u0027t exceptions. A soldier had went up to them and just given it to them, saying something that must\u0027ve been nasty in Japanese before leaving.\n\n\nKuyue said immediately after he was out of earshot, \"Don\u0027t use it.\"\n\n\nOn the pouch, the words \"For Peace of Mind\" were written on it in Chinese. \"Why not?\" Li dared to open the pouch. A white substance was inside; it looked like rice and flour\u0027s offspring.\n\n\n\"They want to pacify us.\"\n\n\nLi promptly closed the bag. \"How do you know what it is?\"\n\n\nKuyue frowned. \"I\u0027ve tried it before. My uncle was an addict.\"\n\n\n\"Oh.\" Li looked at the small bags in each of their hands, wondering how else the Japanese wanted to ruin their lives.\n",
  "page 78": "Li replied, \"I feel great,\" and Kuyue smiled, clearly happy. The two girls left the house of the sick and injured to greet a fresh blow of air, carrying the faintest hint of spring from the south.\n\n\nEveryday after Kuyue met her, she visited the infirmary to see if Li was getting better. In less than a week, she felt awesome... again. Kuyue was very kind to her, and sometimes she would tell her stories or do something fun together. Keeping in mind her illness, of course. It was something that made Li want to cry just because it was such a kind action. She hadn\u0027t thought she could understand that, but she realized something after the deaths of the people she knew—they cared about her, even Zhen. He wasn\u0027t family. Neither is Kuyue. They weren\u0027t family, and they helped her.\n\n\nHer parents and sister always emphasized that the only people one could rely on was themselves and family, so Li had been brought up that way. She didn\u0027t realize that relying on people like Zhen, Dr. Wilson, and Kuyue when things were going wrong could be a good thing. Clearly, it was.\n\n\n\"What\u0027s going to happen to us after this war?\" Li asked the older girl.\n\n\n\"We\u0027re going to find a life, of course.\" Kuyue looked off into the distance, toward where the gloomy sun was setting.\n\n\nThen Li approached the topic she\u0027d been scared to think about. She needed to know. \"Kuyue, what will we do without our parents?\"\n\n\nKuyue looked down at Li. \"I\u0027ll do whatever I need to.\" The small height difference between them made her realize that Kuyue wasn\u0027t much older than her.\n\n\n\"What about me?\"\n\n\n\"I\u0027ll make sure you\u0027re safe.\"\n\n\nI\u0027ll keep you safe. Similar words spoken. She blinked as her eyes began to water. A heavy feeling formed at the top of her nose as Li smiled cheerily, \"I\u0027ll make sure your safe too.\"\n\n\nKuyue gave her a bittersweet smile.\n",
  "page 71": "Dr. Wilson glanced up at her before returning to working on her leg. \"Why do you ask?\"\n\n\n\"Well, you could be fleeing this war-ridden country if you wanted to right now. Go somewhere safe. Yet you stay—\" Li\u0027s last work was stopped with a gasp as he did something particularly painful. She glanced down at her leg, which, miraculously, was better than yesterday, and saw him wiping some sort of... ooze off. Her eyes swiftly returned to the top of his head.\n\n\n\"I couldn\u0027t leave innocent people here to die. It\u0027s not right if I can do something about it.\"\n\n\n\"And if you can\u0027t do anything about it?\" Li asked, curiously, nervously.\n\n\n\"There is always something that can be done.\"\n",
  "page 70": "Dr. Wilson performs the same ritual of traveling from person to person, asking about their wellbeing and health.\n\n\nLi stared off, thinking... Too much thinking. Carefully, she listed the events in her mind, not wanting to break down in front of these strangers. In front of Dr. Wilson.\n\n\nMama and Baba died.\n\n\nDidi died. Chichi is gone.\n\n\nZhaoluo died.\n\n\nZhen died.\n\n\nI\u0027m alone.\n\n\nI made it to the safe zone.\n\n\nI\u0027m safe. I\u0027m safe. I\u0027m safe.\n\n\n---\n\n\nLi sat there for the rest of the day, feeling lost. She wanted someone to... hug. She needed to take it out on someone, something. This war was horrible. She wished it could end soon. She didn\u0027t want this to keep going on. She wanted to be back home with her family.\n\n\nShe felt like giving up. The groaning and coughing people around her were strangers. The floors and walls of this place were too smooth to be home. Everything was different, and it was wrong.\n\n\nThe days passed her by, and she was strangely at peace. She didn\u0027t know why, but she felt calm now. Her infection slowly died, only to spring up again continuously—an unending cycle. Li was stuck here until it healed to a level Dr. Wilson would approve of.\n\n\nWhen that day finally came, Li felt energetic and rested, having nothing to do but sleep and think. Her hunger had been somewhat nourished, but there was a dull pang in her stomach. She really didn\u0027t keep track of time, but she knew several changes of people had came and went through the infirmary already.\n\n\nAs she left the building, a few people outside glanced her way with mild interest. They turned back to whatever they were doing to eat away at the time and fear when they saw she wasn\u0027t someone they knew. In the almost dewy morning air, Li bounded over to the building Dr. Wilson had described to her. They had to crowd her into the top floor, and she squirmed at the thought of strangers being so close to her when she was sleeping.\n\n\nThe blanket the doctor had given her days ago was wrapped tightly around her, covering her from shoulders to mid-calf easily. It was only a bit chilly to Li, so she didn\u0027t ask for more blankets. Not that she had the guts to. Not that they had any to spare.\n\n\nA few refugees glanced her way, again, as she entered the... house. Their looks didn\u0027t hold for long. The people who didn\u0027t look up... Were they alone like her? With nobody to look after or expect? Li moved around the makeshift beds of blankets and little bags or boxes of personal items. Inside one of them, she caught sight of a gold and green glint and wondered what it was. Jewelry? She wanted to grimace with disgust.\n\n\nShe made her way up creaky stairs repeating the experience as she reached the second and top floor. Their was hardly any space left, and somebody had taken the initiative to have the others clear some space for her. Smack dab in the middle of the room and totally out of her comfort zone.\n\n\nUnsettled and nervous, she felt like she was burning as she lowered herself onto that spot. Li caught sight of a somewhat older girl—younger than Zhaoluo though. She smiled at Li, and Li felt herself attempt to smile, but things started to fade. And get blurry. And disappear.\n\n\nShe fell to the ground, and only that girl came rushing to her.\n",
  "page 73": "She woke up in the infirmary. Li thought she had already left the infirmary. What was she doing here again? It brought a feeling of resentment to her. Will she always be stuck in a place for the sick and injured with nobody with her? Her head hurt, and her body didn\u0027t feel too great either. The earlier energy was gone, replaced with a weary heaviness.\n\n\nThere was somebody next to her though. A girl with shoulder length hair that curved inward toward her face blinked at her, asking, \"Are you okay? Do you feel well?\"\n\n\nAs Li stared at her for a moment, she realized that she was that girl from the second floor. Li nodded at first but shook her head when she comprehended the girl\u0027s question. \"I feel sick.\"\n\n\nThe girl bit her lip, her narrow eyes closing before saying, \"Dr. Wilson isn\u0027t here.\" She opened her eyes again. \"I\u0027m Kuyue.\"\n\n\nLi nodded, almost coldly. \"Were you the one to bring me here?\"\n\n\n\"Yep. I needed another person\u0027s help though.\"\n\n\n\"Who?\"\n\n\nKuyue frowned. \"I don\u0027t know him. He didn\u0027t seem to happy about it though.\"\n\n\n\"Well, thank you. Uh... what exactly happened?\" Li sat herself up further, crossing her healed leg over the other and looking at the girl.\n\n\n\"You fainted,\" she replied simply. \"I think you have a fever. Perhaps you should rest?\"\n\n\nLi grumbled, \"I don\u0027t want to be stuck in here any longer. I\u0027ve been here for heaven knows how long.\"\n\n\nShe clucked disapprovingly. \"Hey, if your fever worsens, worse things will happen, and you will be stuck in here longer.\"\n\n\nSighing, Li thought, She sounds so knowing and logical. Caring, even.\n\n\n\"Why did you help me? Nobody else did. Even the man you asked to help me didn\u0027t.\" Li frowned, fiddling with her robe\u0027s sleeve.\n\n\n\"It\u0027s the right thing to do.\" Kuyue\u0027s gentle smile faded as she continued, \"You just looked like my little sister.\" It sounded so much like what Dr. Wilson had said that all Li could do was blink. Could people really be like that? She smiled at the dumbfounded expression. \"Now, rest. I\u0027ll come back later to check on you. Make sure to eat.\"\n\n\nKuyue left, and her shutting the door and leaving her in the infirmary alone... it was scary. Li curled up and fell asleep again.\n\n\n---\n\n\n\"Li?\" Kuyue prodded her side, and she grumbled as she sat up to look at her newfound friend. \"Dr. Wilson checked on you earlier, so I think you can come out now. He said you were better.\"\n\n\nLi blinked. Her head still felt a little light, but otherwise, she did feel better.\n",
  "page 72": "Dr. Wilson performs the same ritual of traveling from person to person, asking about their wellbeing and health.\n\n\nLi stared off, thinking... Too much thinking. Carefully, she listed the events in her mind, not wanting to break down in front of these strangers. In front of Dr. Wilson.\n\n\nMama and Baba died.\n\n\nDidi died. Chichi is gone.\n\n\nZhaoluo died.\n\n\nZhen died.\n\n\nI\u0027m alone.\n\n\nI made it to the safe zone.\n\n\nI\u0027m safe. I\u0027m safe. I\u0027m safe.\n\n\n---\n\n\nLi sat there for the rest of the day, feeling lost. She wanted someone to... hug. She needed to take it out on someone, something. This war was horrible. She wished it could end soon. She didn\u0027t want this to keep going on. She wanted to be back home with her family.\n\n\nShe felt like giving up. The groaning and coughing people around her were strangers. The floors and walls of this place were too smooth to be home. Everything was different, and it was wrong.\n\n\nThe days passed her by, and she was strangely at peace. She didn\u0027t know why, but she felt calm now. Her infection slowly died, only to spring up again continuously—an unending cycle. Li was stuck here until it healed to a level Dr. Wilson would approve of.\n\n\nWhen that day finally came, Li felt energetic and rested, having nothing to do but sleep and think. Her hunger had been somewhat nourished, but there was a dull pang in her stomach. She really didn\u0027t keep track of time, but she knew several changes of people had came and went through the infirmary already.\n\n\nAs she left the building, a few people outside glanced her way with mild interest. They turned back to whatever they were doing to eat away at the time and fear when they saw she wasn\u0027t someone they knew. In the almost dewy morning air, Li bounded over to the building Dr. Wilson had described to her. They had to crowd her into the top floor, and she squirmed at the thought of strangers being so close to her when she was sleeping.\n\n\nThe blanket the doctor had given her days ago was wrapped tightly around her, covering her from shoulders to mid-calf easily. It was only a bit chilly to Li, so she didn\u0027t ask for more blankets. Not that she had the guts to. Not that they had any to spare.\n\n\nA few refugees glanced her way, again, as she entered the... house. Their looks didn\u0027t hold for long. The people who didn\u0027t look up... Were they alone like her? With nobody to look after or expect? Li moved around the makeshift beds of blankets and little bags or boxes of personal items. Inside one of them, she caught sight of a gold and green glint and wondered what it was. Jewelry? She wanted to grimace with disgust.\n\n\nShe made her way up creaky stairs repeating the experience as she reached the second and top floor. Their was hardly any space left, and somebody had taken the initiative to have the others clear some space for her. Smack dab in the middle of the room and totally out of her comfort zone.\n\n\nUnsettled and nervous, she felt like she was burning as she lowered herself onto that spot. Li caught sight of a somewhat older girl—younger than Zhaoluo though. She smiled at Li, and Li felt herself attempt to smile, but things started to fade. And get blurry. And disappear.\n\n\nShe fell to the ground, and only that girl came rushing to her.\n",
  "page 75": "Li woke up to the barking of men. She froze for a moment in fright, but immediately tried to calm down. Stopping in a situation like this could be fatal.\n\n\nShe slipped off of the relatively soft bed and headed toward the backdoor—her old friend and the reason why she chose this house. The backdoor was hidden by a wall at first glance, but it was really just around the corner. She had changed into a somewhat large robe, which needed a lot of folding and tucking, earlier, so when she went outside, she was quite comfortable as the wind brushed her short hair.\n\n\nStill with no footwear, Li picked her way through the dark, moving quicker when she heard human noise. She just needed to escape anymore death and destruction. She tried to not make any noise as she moved, but Li just couldn\u0027t help but trip and grunt. Her foot at stubbed against some hard object or another, and tears welled up in her eyes. From the noises behind her, someone was chasing her.\n\n\nLi quickly got herself together and half limped, half ran away from whoever was chasing her or looking for her. It didn\u0027t matter at this point. If someone wanted to find her, she didn\u0027t want to be found. Anyone she could trust with that job to begin with is dead.\n\n\nGlad it was dark, she stayed close to the houses to make sure she wasn\u0027t caught in the middle of an open street, vulnerable to attack. There was breathing behind her, and she kept moving, scared. Faster. She had to move faster. Li forced herself to jog, wincing as her injured toe pressed against the ground. It was really hurt. Her infected leg, on the other leg, wasn\u0027t much better. Li wanted to cry again. It was so... so stressful. She didn\u0027t think she could take it.\n\n\nSounds. Someone was... doing something. She heard the noise of something being struck, and a few seconds later, there was a clicking sound on the building beside her. Something blew up. It sent her off her wounded feet and onto the ground, and as the light disappeared, she heard the sound of the men who threw it. Frantically, she heaved herself up again, not minding the new scrapes on her body. A hand reached out to touch her, and she couldn\u0027t help it. She screamed. It was a high pitched, girlish scream that gave away her location right away.\n\n\nLi burst to her feet and dashed away from the reaching hands and jeering cries. Is this just a game for them? Is it? She heard the firing of guns and flinched. Thank the gods it was dark. Thank you, thank you. She was still alive, her feet pounding painfully against the dirt grounds, littered with stone. The building had already caught fire, and when she looked back, she could see faint outlines of the soldiers. Why did it have to be this way? Li fled. She didn\u0027t know where she was running, but somebody grabbed her from the side and covered her mouth tightly.\n\n\nShe tried to bite his finger but couldn\u0027t manage to. Tears rolled down her face as heavy drops as the man dragged her off, flailing, into the darkness.\n\n\nStaying awake the whole time, Li saw lights ahead of them. The man finally whispered a \"shh\" and said with a surprisingly gentle voice, \"I won\u0027t hurt you,\" and released her.\n\n\nLi suddenly felt vulnerable again. She couldn\u0027t do anything. She couldn\u0027t fight him. \"Who are you?\" she croaked with her parched throat.\n\n\nThe man replied, \"I am one of the administrators of the safe zone.\"\n\n\n\"Administrators? Safe zone?\" Li got excited, forgetting the burning house and chasing Japanese soldiers.\n\n\n\"I help run the safe zone,\" he simplified, leading her through a small gate wide enough for a cart. What appeared to be red flags with crosses on them waved at her, and she blinked. A circle of two-story houses stood before her, dim lights coming from inside them and little lamps outside.\n\n\nI\u0027m here? Already? Li gaped.\n\n\n\"I heard the grenade. People were frightened. I went out to see.\"\n\n\n\"In the dark?\" Li followed him toward one of the houses in the middle.\n\n\n\"Yes.\"\n\n\n\"Aren\u0027t you afraid?\"\n\n\n\"No. I am protected because I\u0027m not from here or any of the conquered countries.\"\n\n\n\"You\u0027re a Westerner?\"\n\n\n\"Yes.\"\n\n\nLi let this sink in. Westerners really did run this place. Maybe she\u0027d be safe here. The Japanese couldn\u0027t do anything to her here.\n\n\n\"My feet hurt,\" Li mumbled, embarassed as she realized how dirty she probably was compared to him.\n\n\n\"That\u0027s okay. Are you injured?\"\n\n\n\"Mhmm.\"\n\n\nImmediately, the man whipped around and kneeled. \"Where?\"\n\n\nLi rolled up the pant leg and pointed at the cloths that bound the infection. \"And I stubbed my right toe.\"\n\n\n\"I don\u0027t know yet, but it appears really bad. We need to get you to the infirmary.\" The man got up and swerved to the right. He led her to a short building. \"You can rest here. I\u0027ll make sure you get some help tomorrow.\" He opened the door for her, and Li\u0027s eyes widened.\n\n\nIt had been so empty in the city, but seeing this room so full was just... odd. Li nodded a quick thanks before entering the room, lit by the yellow glows of small lamps or candles. Every bed was filled. Some people were even on the floor. Li quickly settled herself by the door, in that corner. She curled herself into a ball and cried a bit. Other people, as if catching her sadness, sniffled too.\n\n\nShe was so, so alone. If Zhaoluo were here, she\u0027d be next to her. This was a room full of strangers, and she didn\u0027t think she could trust strangers anymore. But where could she go? Outside those gates? If this wasn\u0027t the safe zone, it would be just as bad as the city right now. But the man—she didn\u0027t know his name yet nor what exactly he looked like—said it was, and she had to take his word for it.\n",
  "page 74": "Li woke up to the barking of men. She froze for a moment in fright, but immediately tried to calm down. Stopping in a situation like this could be fatal.\n\n\nShe slipped off of the relatively soft bed and headed toward the backdoor—her old friend and the reason why she chose this house. The backdoor was hidden by a wall at first glance, but it was really just around the corner. She had changed into a somewhat large robe, which needed a lot of folding and tucking, earlier, so when she went outside, she was quite comfortable as the wind brushed her short hair.\n\n\nStill with no footwear, Li picked her way through the dark, moving quicker when she heard human noise. She just needed to escape anymore death and destruction. She tried to not make any noise as she moved, but Li just couldn\u0027t help but trip and grunt. Her foot at stubbed against some hard object or another, and tears welled up in her eyes. From the noises behind her, someone was chasing her.\n\n\nLi quickly got herself together and half limped, half ran away from whoever was chasing her or looking for her. It didn\u0027t matter at this point. If someone wanted to find her, she didn\u0027t want to be found. Anyone she could trust with that job to begin with is dead.\n\n\nGlad it was dark, she stayed close to the houses to make sure she wasn\u0027t caught in the middle of an open street, vulnerable to attack. There was breathing behind her, and she kept moving, scared. Faster. She had to move faster. Li forced herself to jog, wincing as her injured toe pressed against the ground. It was really hurt. Her infected leg, on the other leg, wasn\u0027t much better. Li wanted to cry again. It was so... so stressful. She didn\u0027t think she could take it.\n\n\nSounds. Someone was... doing something. She heard the noise of something being struck, and a few seconds later, there was a clicking sound on the building beside her. Something blew up. It sent her off her wounded feet and onto the ground, and as the light disappeared, she heard the sound of the men who threw it. Frantically, she heaved herself up again, not minding the new scrapes on her body. A hand reached out to touch her, and she couldn\u0027t help it. She screamed. It was a high pitched, girlish scream that gave away her location right away.\n\n\nLi burst to her feet and dashed away from the reaching hands and jeering cries. Is this just a game for them? Is it? She heard the firing of guns and flinched. Thank the gods it was dark. Thank you, thank you. She was still alive, her feet pounding painfully against the dirt grounds, littered with stone. The building had already caught fire, and when she looked back, she could see faint outlines of the soldiers. Why did it have to be this way? Li fled. She didn\u0027t know where she was running, but somebody grabbed her from the side and covered her mouth tightly.\n\n\nShe tried to bite his finger but couldn\u0027t manage to. Tears rolled down her face as heavy drops as the man dragged her off, flailing, into the darkness.\n\n\nStaying awake the whole time, Li saw lights ahead of them. The man finally whispered a \"shh\" and said with a surprisingly gentle voice, \"I won\u0027t hurt you,\" and released her.\n\n\nLi suddenly felt vulnerable again. She couldn\u0027t do anything. She couldn\u0027t fight him. \"Who are you?\" she croaked with her parched throat.\n\n\nThe man replied, \"I am one of the administrators of the safe zone.\"\n\n\n\"Administrators? Safe zone?\" Li got excited, forgetting the burning house and chasing Japanese soldiers.\n\n\n\"I help run the safe zone,\" he simplified, leading her through a small gate wide enough for a cart. What appeared to be red flags with crosses on them waved at her, and she blinked. A circle of two-story houses stood before her, dim lights coming from inside them and little lamps outside.\n\n\nI\u0027m here? Already? Li gaped.\n\n\n\"I heard the grenade. People were frightened. I went out to see.\"\n\n\n\"In the dark?\" Li followed him toward one of the houses in the middle.\n\n\n\"Yes.\"\n\n\n\"Aren\u0027t you afraid?\"\n\n\n\"No. I am protected because I\u0027m not from here or any of the conquered countries.\"\n\n\n\"You\u0027re a Westerner?\"\n\n\n\"Yes.\"\n\n\nLi let this sink in. Westerners really did run this place. Maybe she\u0027d be safe here. The Japanese couldn\u0027t do anything to her here.\n\n\n\"My feet hurt,\" Li mumbled, embarassed as she realized how dirty she probably was compared to him.\n\n\n\"That\u0027s okay. Are you injured?\"\n\n\n\"Mhmm.\"\n\n\nImmediately, the man whipped around and kneeled. \"Where?\"\n\n\nLi rolled up the pant leg and pointed at the cloths that bound the infection. \"And I stubbed my right toe.\"\n\n\n\"I don\u0027t know yet, but it appears really bad. We need to get you to the infirmary.\" The man got up and swerved to the right. He led her to a short building. \"You can rest here. I\u0027ll make sure you get some help tomorrow.\" He opened the door for her, and Li\u0027s eyes widened.\n\n\nIt had been so empty in the city, but seeing this room so full was just... odd. Li nodded a quick thanks before entering the room, lit by the yellow glows of small lamps or candles. Every bed was filled. Some people were even on the floor. Li quickly settled herself by the door, in that corner. She curled herself into a ball and cried a bit. Other people, as if catching her sadness, sniffled too.\n\n\nShe was so, so alone. If Zhaoluo were here, she\u0027d be next to her. This was a room full of strangers, and she didn\u0027t think she could trust strangers anymore. But where could she go? Outside those gates? If this wasn\u0027t the safe zone, it would be just as bad as the city right now. But the man—she didn\u0027t know his name yet nor what exactly he looked like—said it was, and she had to take his word for it.\n",
  "page 111": "A few years later...\n\n\nZhaoluo stepped through the doorway; her eyes immediately fell to the man sitting at the desk. His finer features and thin spectacles faced his desk, where a couple of papers were neatly placed. The desk was tidy in general, and the open window let in a dusty yellow light. Outside, the incessant noises of the workers rang in the air. It entered the building muffled.\n\n\n\"Ren.\" Her voice came out firmly, and Ren at last looked up from the documents.\n\n\nHe gazed at her with large, brown eyes for a moment before saying, \"I wanted to tell you that Boyan is officially courting Huaxing.\"\n\n\nShe scoffed. \"Obviously.\" Walking forward toward him, she continued, \"He\u0027s so protective about her safety, always that perfect gentleman.\"\n\n\nRen laughed, breaking the cool mood. \"He does everything by the book and thinks rationally. He and Yinshi are brilliant.\"\n\n\n\"Only thing not rational is that he\u0027s helping us.\" Zhaoluo sighed.\n\n\nBoyan had been an editor for the Nanking news and also worked for the communications of the city. He hadn\u0027t told them anything about his past, but when the city got back onto its feet—those days of stumbling had been hard—he offered them a job... The communications branch had been low staffed. Then, he proceeded to offer them a place to stay at the patched up news building. He had automatically taken command of the business as he was at the top of the ladder after the invasion.\n\n\n\"He has a heart, you know.\"\n\n\n\"I\u0027ve only ever seen his mind work.\"\n\n\nRen, whose eyes had been drifting back to the desk, fixed them on hers. \"Our hearts are what drives us.\"\n\n\nShe nodded. But fear was what drove them all.\n\n\n---\n\n\nThe monastery was a beautiful place. But the most beautiful thing in here was Boyan and Huaxing. They were standing there, holding hands, as they spoke with Yinshi. MaiMai was beside them, occasionally  interjecting with a comment here and there. She was a bit nervous in the ancient-feeling building. Everything in the city had to be built anew. This place... was protected from attacks. And it felt wrong to her.\n\n\nWhen she slowed, Ren would prod her from behind, whispering, \"Keep going.\"\n\n\nAt last, she reached Boyan and Huaxing, and their smiles bloomed at the sight of her. MaiMai latched onto her leg, and Zhaoluo couldn\u0027t help but grin.\n",
  "page 88": "A few years later...\n\n\nZhaoluo stepped through the doorway; her eyes immediately fell to the man sitting at the desk. His finer features and thin spectacles faced his desk, where a couple of papers were neatly placed. The desk was tidy in general, and the open window let in a dusty yellow light. Outside, the incessant noises of the workers rang in the air. It entered the building muffled.\n\n\nBoyan had been an editor for the Nanking news and also worked for the communications of the city. He hadn\u0027t told them anything about his past, but when the city got back onto its feet—those days of stumbling had been hard—he offered them a job... The communications branch had been low staffed. Then, he proceeded to offer them a place to stay at the patched up news building. He had automatically taken command of the business as he was at the top of the ladder after the invasion.\n\n\n\"Ren.\" Her voice came out softly, and Ren at last looked up from the documents.\n\n\nHe gazed at her with large, brown eyes for a moment before saying, \"I wanted to tell you that Boyan is officially courting Huaxing.\"\n\n\nShe frowned. That\u0027s not something she had wanted to wholeheartedly hear. \"Obviously.\" Walking forward toward him, she continued, \"He\u0027s so protective about her safety, always that perfect gentleman.\"\n\n\n\"He has a heart, you know.\"\n\n\n\"I think you do too.\"\n\n\nRen, whose eyes had been drifting back to the desk, fixed them on hers. \"Our hearts is what drives us.\" He got up from his seat and padded closer to her, a look filling his eyes—the kind of look she\u0027d seen in Boyan\u0027s eyes as he gazed at Huaxing and vice versa. A look she\u0027d seen her father give her mother. A look she didn\u0027t think she\u0027d ever see from Ren.\n\n\n---\n\n\nThe monastery was a beautiful place. But the most beautiful thing in here was Boyan and Huaxing. They were standing there, holding hands, as they spoke with Yinshi. MaiMai was beside them, occasionally  interjecting with a comment here and there.\n\n\nNervously, Zhaoluo approached, the boots under her robe clicking against the marble floors. It didn\u0027t feel right. There was blood on her hands. Why is she in this majestic, holy building? Her gaze fell to her hands, unpleasantly callused after... after what she\u0027d held in her hands before. She could imagine the red on them. An almost chalky red as the fluid dried and flaked. No matter how many times she washed her hands with soap...\n\n\nWhen she slowed, she could feel Ren\u0027s hand around her waist, gently leading her on.\n\n\nAt last, she reached Boyan and Huaxing, and their smiles bloomed at the sight of her. Huaxing\u0027s smile became wicked when she saw where Ren\u0027s hand was, and Zhaoluo fought a blush. MaiMai latched onto her leg, and Zhaoluo couldn\u0027t help but grin. Ren completed this beautiful imperfection by moving his arm from her waist to her shoulders and laughing.\n",
  "page 87": "There was a creaking sound in the dark. Somebody was walking outside. Zhaoluo froze in her bed, but then mentally slapped herself for being silly. It was probably her father. Just to make sure, she quietly slipped out of the bed she shared with Li and tiptoed to makeshift wall that separated them from the main room. She peeked over the wall, and there was her father.\n\n\nShe had been about to call out, but he looked hunched a bit, and he was carrying a pouch. He pinched something flour-like onto the table top and did the oddest thing—he leaned forward and sniffed at it. It was a soft sound. She was confused. Why was he... sniffing at the flour?\n\n\nZhaoluo didn\u0027t think it\u0027d be right to call out to her father now; she was mesmerized in this ritual. When her father stopped, she crept back to bed. As she slipped in, the blankets rustled, and all sounds from the adjoint room stopped.\n\n\nMore footfalls. A shadow loomed over her bed, and she pretended to be asleep, slowing her breath. The shadow stayed for a while before slipping away. She kept her eyes closed until she fell asleep.\n",
  "page 80": "The Japanese pulled out of Nanking. It was spring, and the refugees were no longer trapped. They trudged to their homes in silence only to break down with tears upon the sight of their homes. They looked at the streets, caked with red, with the same horror Li felt when she listed the deaths of the people she cared for and was cared by. Their bodies trembled, grey and grail, from loss, addiction, and disbelief.\n\n\nThe government did not return, but people did. And so they began to rebuild Nanking.\n",
  "page 81": "Slowly, Kuyue picked apart the jade silks she wore, placing the bracelets and necklace onto the small table beside her. Her legs were curled under her on the bed, and she gave the man a shy but sly look. The man gulped, eyes glued to her. There was one thing that she hadn\u0027t told Li, who was like her second sister. She had no dignity to lose anymore.\n\n\n---\n\n\nLi had already returned from the orphanage\u0027s school, and she was reading a beautiful poem written by a master poet named Wang Wei when the door to her and Kuyue\u0027s room opened.\n\n\nIt was Kuyue on the other side, of course. Li leaped to her feet and dashed toward her, hugging her. Kuyue returned the hug, and when Li looked up, she saw a faint bruise on her cheek.\n\n\n\"Ku, did you get hurt?\" Li asked worriedly, reaching to touch the bruise.\n\n\nGently, she shook her head. \"I did, but I\u0027m fine now.\"\n\n\n\"I\u0027m glad that communications accepted you to work for them, but this is ridiculous. How come you\u0027re always hurt in some way or another?\" Li asked grumpily.\n\n\n\"Hey, that\u0027s my own fault.\" Kuyue moved from the doorway, placing her basket on the table Li had been working on. \"I\u0027m clumsy. I\u0027m lucky they haven\u0027t fired me just for being some girl.\" She glanced down at the poem Li was reading and smiled. \"I remember his poetry.\"\n\n\n\"Yep. So pretty. I wish I could see where he lived. The nature there must\u0027ve been beautiful.\" A longing could easily be heard in her voice as she sat down on the single bed in the room. She wanted to live somewhere that was not here. Somewhere where you couldn\u0027t still see streets of broken houses, still needing to be rebuilt but not enough people to do so. No need now that the population was reduced by half.\n\n\n\"You didn\u0027t ask what I brought today,\" Kuyue remarked with a pout, placing a hand over the basket.\n\n\n\"Ooh. Food! Er...\" Li flopped onto the bed. \"Roubao?\"\n\n\n\"You guessed right again?\" She stuck her hand in the basket to remove a fist-sized, white bun, still warm. \"How do you do it?\"\n\n\nLi giggled as she went over to snatch the bun from her hands. \"It smells so good!\"\n\n\nKuyue watched contently as Li bit into the bun, yelping when she reached the hot meat in the middle, and laughed.\n",
  "page 84": "\"What do I know?\" Ren scoffed, looking up at her with a single brow lifted. He looked so... dangerous like that.\n\n\nZhaoluo shifted her arms a bit and looked away, disguising it with a roll of her eyes. \"If my father was a very bad man, what could he have done that your mother hadn\u0027t already?\"\n\n\nRen blinked. And frowned. And ignored her. \"I wasn\u0027t going to accept the offer anyway, but I didn\u0027t want to offend the poor man. Once, I saw him mingling with some, ah, shady characters—\"\n\n\n\"And how would you know they were shady?\" When it came out of her mouth, she wanted to slap herself because it sounded so dumb.\n\n\n\"They had on longer, darker clothing and had this awful look to them. Zhaoluo,\" Ren started, \"you\u0027re father was sucking up a lot of money. And that is why I did not accept the marriage offer. With you.\"\n\n\nZhaoluo gave him an inspecting once-over. He wasn\u0027t bad looking... but she had worse things to worry about. She crossed her arms, uncrossed them, and crossed them again. Then she sighed and let both hands fall to their places. \"What was the point of this? People are dying out in the city, and the refugees literally just shred the resourcse.\"\n\n\n\"I thought you should know that your father, and you and I...\" He shot her a sly look. \"But I suppose you already knew.\"\n\n\nShivers were running up her spine. Not the cold-and-scared shiver, but the barely-controlled-anger kind. \"Ren. I don\u0027t know what you\u0027re problem is. Who did you lose? Who did you lose in this war?\"\n\n\nLooking uncomfortable, Ren cleared his throat. \"I\u0027m just one of thousands. Millions, probably. What does it matter? Everyone lost someone. You clearly lost your family—father, stepmother, and half sister. All that. We\u0027re all the same. Everyone has a sad story to tell. I just don\u0027t feel for them anymore.\"\n\n\nThe first thing that came out of her mouth was, \"That\u0027s a horrible thing to say!\" Zhaoluo immediately gave herself a mental slap at being so rash.\n\n\n\"Can you say you feel for them? Did you feel for Huaxing?\" The look on her face must have told him enough. \"I thought so.\" He stood from the crate and began walking away. \"You understood it all too soon. But at least, now you won\u0027t feel to bad.\"\n\n\nShe still felt bad. Zhaoluo slowly lowered herself onto where Ren had sat. \"Bad\" was just a hollow, empty feeling.\n\n\n---\n\n\n\"We have to bury the boy.\"\n\n\nIt was the \"we\" part of the statement that made Zhaoluo snap, \"I know.\"\n\n\nRen rolled his eyes and planted his fists on his hips. \"You\u0027re the one who suggested it. No need to get so moody.\"\n\n\nThe two found Mr. Bates, who had just finished wrapping up the body, which kept chill in the winter air. Together, they brought the body to the burial site—it used to be a park or field—and began digging into the solid ground with shovels already there. Previous graves were marked with ashes, previously paper in place of incense, and small trinkets. There were no fruits; they couldn\u0027t afford it.\n\n\nZhaoluo\u0027s arms gave way quickly, as she wasn\u0027t used to menial work like digging, and Ren took her space easily, smirking at her incompetence. She wanted to growl at him. Instead, she nudged him out of the way and forced her aching arms to keep shoveling.\n\n\nIt was something about the place that kept them quiet. Individual graves in the middle of a pretty much conquered city was a luxury. Mr. Bates, right before he brought them to this morbid place, explained to them some of the reports he got on what\u0027s happening in the city. According to him, many of the captive citizens and soldiers were forced to dig graves for themselves. It was a saddening thought, but it sounded bland next to the burning. And killing contests.\n\n\nWhen they were finished digging, Mr. Bates and Ren—with a queasy look on his face—lowered the boy into the hole, his body stiff as if he had been preserved in the snow. They slowly filled up the spaces between the earth and the boy until there was a mound, inconspicuous among the others, before them. Mr. Bates, having already thought ahead, took out a piece of paper. Small script was scribbled on it, and it was messy enough that Zhaoluo couldn\u0027t read it. The idea startled her, as Mr. Bates would have practiced finer writing—who made these papers, and how many did the person make?\n\n\nUsing a lighter, he set a corner of the paper aflame and placed the paper in the center of the mound. They offered their prayers and wishes—she wished the boy a full, happy life that he would never get—and left.\n\n\nThe trio returned to the cramped camp, and the professor thanked them for their assistance. Ren nodded, and Zhaoluo simply smiled. Burials were dismal here—nobody had been there for the boy. His father had left several days ago.\n",
  "page 83": "Ren looked at her, somewhat surprised at her question. \"Nothing.\"\n\n\nZhaoluo rolled her eyes. Something was definitely wrong. \"Whatever you say, fantong.\"\n\n\nHe scoffed. \"Your father. What was he like?\"\n\n\nThe kid was changing the subject again, and he was really confusing her. He didn\u0027t want to talk about himself, apparently.\n\n\nZhaoluo sat down beside him, kicking at the dirt. Where were the others? They were probably mingling about. Knowing Boyan, he\u0027d probably be with the doctor, trying to help people. \"My father... he was a typical man. He\u0027d always wanted... a son.\"\n\n\nRen nodded, his face grim but knowing. \"I am the youngest child of three sisters. My father and mother always fought over us, but my father insisted on getting a boy just so he could pass on his surname and lineage. It\u0027s silly, really.\"\n\n\n\"Obviously. He always wanted me to fix the tea and whatnot. Always looking about for good matches for me; he always watched out for the family because he had no son to share that duty with,\" Zhaoluo replied, almost angrily.\n\n\n\"Your father. Did he work at a restaurant?\" Ren asked suddenly.\n\n\nShe shot him a wondering look. \"Yes. Why?\"\n\n\n\"I worked at a restaurant. A man that worked with me always looked at me and sized me up. It was odd, but I didn\u0027t say anything. I\u0027ve experienced such... scrutiny before. Early in Novemeber, he asked me about marriage prospects and what kind of woman I liked.\"\n\n\nZhaoluo was getting an uncomfortable feeling about this.\n\n\n\"He said that he had two daughters, and one of them was old enough to be married, and that he thought I would make a good match. I almost laughed at the time, but he looked like a wise man.\" Ren pushed at the metal of his glasses. \"He went on to tell me of his daughter. She was... he said that she cooked and cleaned very well and was always organized.\" He paused, waiting to see if Zhaoluo would respond.\n\n\nShe didn\u0027t. Her eyes glowed with... an emotion that she didn\u0027t dare identify.\n\n\n\"She said that she had a... defiant spirit that would need, ah, taming. But he emphasized on her...\" Ren looked slightly uncomfortable at what he was about to say. \"He emphasized her beauty and how well she worked.\"\n\n\nAh. \"And?\"\n\n\n\"We were wiping down after the day\u0027s work, and my hand slipped off the table when he actually asked about it. Honestly, it was odd. Typically, he would approach my parents, but I suppose he either already knew them or thought I was already out of the house or something. I really respected the man.\"\n\n\n\"Oh? Did you?\" A bitter feeling grew in her stomach. \"What was this man\u0027s name?\"\n\n\n\"Lisong.\"\n\n\nA tight feeling gripped her chest, and she tensed. Ren took this in.\n\n\n\"So you are Lisong\u0027s daughter. I knew it.\" Ren stood up from his spot and looked down on her. \"Your father has done very bad things, Zhao Luo.\" He puncuated her name in such a way that it felt like a threat.\n\n\nShe took a moment to breathe when the uncomfortable feeling grew. She had always suspected... but...\n",
  "page 86": "Her father had told her to wait for him at the corner of the street. He had brought her along to carry some of the groceries and food. Somebody with a large, black overcoat needed to talk to him for a moment. She, slightly suspicious because of the other man\u0027s shrewd appearance, had followed her father with bags in hand to the small inlet of street where a few dingy houses stood.\n\n\nThread pouches were exchanged, and her father already made to walk away. Zhaoluo turned from her somewhat distant position and returned to the other street corner, noting the gradual buildup of human noise. She wished she lived in a quieter place in the city.\n\n\n\"Zhaoluo?\" Her father\u0027s voice made her snap out of her thoughts.\n\n\n\"Yes, Baba?\"\n\n\n\"Let\u0027s get home,\" he said—no pouch in sight.\n\n\n\"Father, who was that man?\" She looked at his shirt and pants, which lacked pockets, wondering where he could\u0027ve put that green and purple pouch.\n\n\nHer father\u0027s eyes flickered to the ground. His shoes. \"Just an old friend.\"\n",
  "page 85": "She looked through the glass windows at the hunched figure sitting before the table. She had suspected that it for a while, but seeing it just makes her want to cry.\n\n\nZhaoluo had asked several owners whose shops she frequented about different... substances. They were shocked at her questioning but answered her nonetheless.\n\n\nOh, she\u0027s heard of opium dens before. She didn\u0027t realize there were substances as bad as and worse than opium. Things that could harm as much as opium could. Her father had been bringing less money in, saying that he was demoted because of an accident. Her stepmother\u0027s face had just fallen. Lisong\u0027s face didn\u0027t stay in its slightly bright expression.\n\n\nThe fool. What was wrong with Lisong? What was so bad about him and his life that he resorted to idiocy like this and let his family suffer ever so slowly?\n",
  "page 19": "Everyone\u0027s head snapped toward the fence. People were already gathered there, clamoring loudly. Miner pushed his way through the crowd, and a boy who looked only eight was being carried through. People were shocked and wailing at something.\n\n\nThat\u0027s when Zhaoluo saw the blood. A trail of dark red followed the boy and what appeared to be his father, and the small group stood up from where they had lounged on the wooden crates. She followed them when they rushed over to the boy.\n\n\nMiner was already calling for Dr. Wilson, and when Boyan neared him, he asked quickly, \"What happened?\"\n\n\nUpon a closer inspection, she saw that there were several stab wounds in the boy\u0027s chest. They seemed eerily similar to the ones on her father and sister. His lashes fluttered, and he looked close to death. As Dr. Wilson arrived, he confirmed as much.\n\n\nPeople were surrounding the boy, asking about what happened and will the boy be alright. The father was kneeling beside the boy, fear in his brown eyes as Dr. Wilson drilled him with several questions.\n\n\n\"How did the boy get stabbed?\"\n\n\n\"B-Bayonets. They had bayonets. The two of the Japanese stabbed him and left him to die. I was close by, and I couldn\u0027t leave my son like that.\"\n\n\nThe doctor began to peel off the clothing on the boy, ripping his shirt away to reveal a bright red blood spewing from three wounds. MaiMai and other observers turned away.\n\n\n\"Everybody, leave. I can\u0027t have him getting more dirty and infected than what he is now.\" The doctor pulled a clean cloth from a small bag that he had been carrying. As Zhaoluo and the others walked away from the boy and the frantic father, she heard the doctor murmur, \"It\u0027ll be a miracle if I saved him.\"\n\n\nShe shivered. It was so much like the wounds in her father\u0027s and sister\u0027s chests.\n\n\nSuddenly, somebody was patting her back. She paused to see Huaxing beside her with a brave smile on her face. \"He\u0027s going to be okay.\" The odd light in her eyes didn\u0027t look hopeful.\n\n\n---\n\n\nThe three girls had settled down on the wooden crates after kicking the boys away, who now stood several meters away, muttering among themselves. The injured child had been rushed inside after the bleeding had been reduced. Huaxing started talking, and Zhaoluo forced her mind to stop thinking about the bleeding boy and the fright in her father\u0027s eyes.\n\n\n\"I arrived about a week ago, just a few days before you did, Zhaoluo.\" Zhaoluo looked up at her. She hadn\u0027t seen Huaxing before today. The other girl\u0027s eyes started to water, and MaiMai sucked in a breath as if she could anticipate what her friend was about to say. The two looked so youthful and innocent compared to the rest of them.\n\n\n\"I remember. Mama was making dinner. The Japanese hadn\u0027t broken completely through the Chinese lines. My father, he was a soldier. He fled. He didn\u0027t want to fight. He ran from his post on the gates and came home. The people he fights with were getting drunk dreading the Japs. They wanted to flee. They wanted to leave. He burned his soldier gear and dressed like a civilian because they said they wouldn\u0027t harm non-soldiers. \"\n\n\nHow wrong that was.\n\n\n\"And then... and then he told us to get to the safe zone. He stored his weapons inside the house somewhere, but he didn\u0027t flee with us. He said he just couldn\u0027t, even though he ran away.\" She started to sniffle. \"I don\u0027t understand! I don\u0027t understand why he did it.\"\n\n\n\"What did he do?\" MaiMai gasped.\n\n\n\"He stayed behind, and the Japanese arrived, but Mama and I were already in the safe zone. And before you arrived... we went out to find him, and she saw the soldiers running. They were running toward the river. They looked so tired and scared and their eyes. The wildness in their eyes. They smelled so bad like smoke and fire and death.\" Huaxing started to sob, and Boyan looked over worriedly, unsure if they should intervene. MaiMai shot them a death glare, and they backed off.\n\n\n\"You don\u0027t have to say it if you don\u0027t want to, Huaxing,\" Zhaoluo said gently. She wasn\u0027t sure what she was going to say, but she didn\u0027t she we was going to like it.\n\n\n\"They had nowhere to run, so they jumped into the river. The water was freezing and strong, and it carried them downstream. They were screaming for someone to help them, but they knew they\u0027d die. I think... they jumped because they didn\u0027t want to die at the hands of the Japanese. Some were wounded, and they were all screaming. Mama and I hid behind some buildings, and then... the Japanese shot into the water. They were laughing and pointing. It was like they were having... a contest. They called out something each time they killed someone.\"\n\n\nMaiMai covered her mouth at that, and Zhaoluo gently hugged her.\n\n\n\"And... I don\u0027t know why, but I saw father there. He was dressed as a civilian, but he jumped in with the others. He was insane. I don\u0027t know why. I don\u0027t know why!\" Huaxing hugged her back, and MaiMai joined in.\n\n\n\"Mama started to cry and tried to cover my eyes, but I saw them shoot my father. There was so much blood.\" Huaxing shut her eyes tightly. \"The looked pink and red, and the bodies... they were just swept downstream. They would bump against each other or against something, but they were limp. And they were laughing at them. Laughing at them.\"\n\n\nWhere is her mother now? This only happened... a few days ago, Zhaoluo thought, and a pressure began building in her chest.\n\n\n\"I don\u0027t know why. I...\" Huaxing had trouble breathing and she continued on, her face wet with tears. \"Mama grabbed a pot from the house\u0027s kitchen—the window was open. I remember asking her what she was doing, but she started to sneak away. I told her to come back, but she told me that she was sorry. Then she... she got close enough to the nearest soldier and hit him with the pot. I heard the crack through the blasting gunshots, but I ran. And then they were shouting, and I looked back, and Mama was on the ground, and they were taking her clothes off.\"\n\n\nZhaoluo started to tear up too. This sounded all too familiar. Had the Japanese made everything into a game with her family too? \"I\u0027m so sorry,\" she managed to choke out. They were horrible. What those soldiers had done was unforgivable.\n\n\n\"I think your mother is very brave to take down a Japanese soldier. She was strong and brave, and you are too, Huaxing. I won\u0027t ever let them touch you,\" Zhaoluo murmured as they rocked back and forth quietly, unsure of how she\u0027d keep that promise.\n",
  "page 18": "The racket downstairs woke her up, and she climbed out of the pile of blankets which she had grown very fond of in the past few days. The people downstairs were definitely not using inside voices. Zhaoluo groaned. Yesterday, the others had gone off to their designated buildings in the camp, which were all, unfortunately, not the same house as her. Sometimes she really wished she could wake up to a friendly face and not complete strangers.\n\n\nThe gang and her... aren\u0027t strangers anymore, right? She had spent the past few days talking to them. While most didn\u0027t share the complete details of their lives before now, they still offered intelligent conversation outside of complaints about camp food, conditions, and the amount of people—horrified, empty-eyed, grimy people—flooding this camp as well as the many others.\n\n\nIt just didn\u0027t seem... as bad anymore. And she was disgusted with herself. She is disgusted that she can\u0027t give more thought to her family and more thought to be people and feel scared because she wasn\u0027t. She wasn\u0027t scared anymore. Her newfound friends... she can\u0027t let them get close. Otherwise, she will be scared when something happens. Something will always happen.\n\n\nZhaoluo looked out the window at a building past the fence, which is undergoing reinforcement—not like that\u0027s going to do any good. Outside, the buildings are shattered. If she looked down the street, she\u0027d see burnt buildings. Reports from Mr. Bates, who she realized was Miner, told of the burnings. The Japanese locked the citizens into the buildings they spent their entire lives in and burned them in there, laughing as they tried to climb out windows or jump off the roof to another building, burning or being shot as they tried. They were told that the victims were like walking torches.\n\n\nFinally, she padded down the steps to the first floor, only to be almost pushed back as people were all trying to converge at the door. The entire floor still had people there, and somebody was blocking the path.\n\n\n\"What\u0027s going on?\" Zhaoluo poked the nearest person by her—a woman with no significant features except a high, thin nose—who glared at her and ignored her. She stepped to the highest spot possible on the staircase, trying to see who (or what) was at the door.\n\n\n\"Everyone, calm down!\" She recognized the voice as Mr. Bate\u0027s.\n\n\nBut nobody did. Why would they? The Japanese had enough of China\u0027s east coast and inland already... who said they couldn\u0027t conquer them all? Who said that these Westerners wouldn\u0027t just abandon them?\n\n\nAt last, the professor moved out of the way as people spilled out into the camp area, which was basically an area surrounded by buildings and even tents which several obvious paths leading outside into the city and further into the safe zone. Zhaoluo was almost surprised to remember that there were more camps than just this one in the safe zone, and that she was very lucky to have gotten into this one.\n\n\nThe refugees started to flood out of the building like a horde of desperate people. What\u0027s going on again? When Zhaoluo reached the door, everybody seemed to be surrounding something. When she saw Ren, she ran over and asked him what he thought was going on. She could see tears behind those spectacles.\n\n\n\"I think... the boy that arrived the other day—the one with the three bayonet wounds—is dead.\"\n\nFor some reason, the news doesn\u0027t surprise Zhaoluo. \"Are they gathering around... his body?\"\n\n\nHe nodded.\n\n\nShe pushed through the group, who muttered at her jostling. When she finally broke through the mob-like ranks, her eyes settled onto the boy. He was just laid down like that with a scrap of cloth covering his eyes. They were going to bury him soon. The father was nowhere to be seen. Mr. Bates appeared across from her, and he gazed at her. She blinked. Huh?\n\n\n\"The father was moved to another camp. He... didn\u0027t think he could stay here,\" Mr. Bates said to nobody in particular.\n\n\nThe other people nodded, almost as if understanding. What bothered Zhaoluo was that father didn\u0027t even get to see his son buried.\n\n\nZhaoluo\u0027s eyes fell onto the boy\u0027s clothed chest. Beneath the ripped cloth—the same cloth that he arrived in—there were several stitched areas, but they were covered with dried blood and something nasty that reminded her of mold.\n\n\n\"He needs to be covered immediately,\" Zhaoluo said with surprising confidence. Then, when nobody moved, she added, \"We could get infected with that stuff on his wound.\"\n\n\nThat got the crowd moving away, though some shot her an ugly glance. Why did they not like her?\n\n\nMr. Bates nodded at her with approval. \"You are correct. We have to bury... the poor child. There isn\u0027t enough of us in this camp right now...\" Emptiness, guilt, whatever in her eyes got him asking, \"Would you like to help?\"\n\n\nShe looked back at Ren, who stood there staring at her and Mr. Bates and the body. \"What about you, Ren?\" Something about this case made Ren very uncomfortable, and she wanted to know why. Maybe it was just corpses.\n\n\n\"Sure,\" he muttered, shoving his hands into his pockets and looking away from the body. \"When?\"\n\n\n\"Tomorrow. When the sun rises forth in the sky.\"\n\n\n---\n\n\nThere\u0027s something wrong. Ren refused to look at Zhaoluo after they returned to the crates—which we had unofficially name the \"base\". Was he that scared of... of dead bodies? Why would he agree to bury the boy if there was something wrong?\n\n\n\"Ren—\"\n\n\n\"I know what you\u0027re going to say.\" His reply was brief, and he paused his pacing. His eyes were on his dusty shoes.\n\n\n\"Do you know me that well?\"\n\n\n\"No, but I saw the look on your face after I replied. I slipped; that\u0027s all.\" Ren was gazing at her now, his eyes keen and knowing.\n",
  "page 2": "\"What are we going to do?\" A frantic emotion was surging through her. She can\u0027t have the baby now! They weren\u0027t in the camp yet. They weren\u0027t ready!\n\n\nZhaoluo\u0027s stepmother, who was lying on the floor with a small cloak as her blanket, breathed heavily in the dark. She looked downward toward the wet spot on the cloak and floor. This was very bad.\n\n\n\"Wake up your father.\" A shudder passed through her stepmother as she closed her eyes. Her pale skin was shiny, and it\u0027s a wonder how the other two haven\u0027t woken up from the breathing.\n\n\nZhaoluo rushed over to where her father slept and shook him awake. \"Baba!\"\n\n\nHe grumbled something and squinted at her. \"What is it?\" At that moment, he seemed to register the noise coming from his wife and lurched up. Zhaoluo hadn\u0027t even sat up before her father was by his wife\u0027s side.\n\n\n\"Tanla!\" her father was almost yelling, but all Zhaoluo could think of was the loud gunshots she heard this morning and her stepmother\u0027s name.\n\n\n\"Lisong...\" From the way they were acting, it was as if her stepmother would die at any moment.\n\n\nZhaoluo stood up, and with a shaky voice, said, \"We have to get help. I don\u0027t know how to carry a baby!\"\n\n\nFather nodded as if her words hadn\u0027t just snapped him out of his frenzy. \"Can you find your way to the Committee?\"\n",
  "page 1": "\"What are we going to do?\" A frantic emotion was surging through her. She can\u0027t have the baby now! They weren\u0027t in the camp yet. They weren\u0027t ready!\n\n\nZhaoluo\u0027s stepmother, who was lying on the floor with a small cloak as her blanket, breathed heavily in the dark. She looked downward toward the wet spot on the cloak and floor. This was very bad.\n\n\n\"Wake up your father.\" A shudder passed through her stepmother as she closed her eyes. Her pale skin was shiny, and it\u0027s a wonder how the other two haven\u0027t woken up from the breathing.\n\n\nZhaoluo rushed over to where her father slept and shook him awake. \"Baba!\"\n\n\nHe grumbled something and squinted at her. \"What is it?\" At that moment, he seemed to register the noise coming from his wife and lurched up. Zhaoluo hadn\u0027t even sat up before her father was by his wife\u0027s side.\n\n\n\"Tanla!\" her father was almost yelling, but all Zhaoluo could think of was the loud gunshots she heard this morning and her stepmother\u0027s name.\n\n\n\"Lisong...\" From the way they were acting, it was as if her stepmother would die at any moment.\n\n\nZhaoluo stood up, and with a shaky voice, said, \"We have to get help. I don\u0027t know how to carry a baby!\"\n\n\nFather nodded as if her words hadn\u0027t just snapped him out of his frenzy. \"Can you find your way to the Committee?\"\n",
  "page 3": "\"What are we going to do?\" A frantic emotion was surging through her. She can\u0027t have the baby now! They weren\u0027t in the camp yet. They weren\u0027t ready!\n\n\nZhaoluo\u0027s stepmother, who was lying on the floor with a small cloak as her blanket, breathed heavily in the dark. She looked downward toward the wet spot on the cloak and floor. This was very bad.\n\n\n\"Wake up your father.\" A shudder passed through her stepmother as she closed her eyes. Her pale skin was shiny, and it\u0027s a wonder how the other two haven\u0027t woken up from the breathing.\n\n\nZhaoluo rushed over to where her father slept and shook him awake. \"Baba!\"\n\n\nHe grumbled something and squinted at her. \"What is it?\" At that moment, he seemed to register the noise coming from his wife and lurched up. Zhaoluo hadn\u0027t even sat up before her father was by his wife\u0027s side.\n\n\n\"Tanla!\" her father was almost yelling, but all Zhaoluo could think of was the loud gunshots she heard this morning and her stepmother\u0027s name.\n\n\n\"Lisong...\" From the way they were acting, it was as if her stepmother would die at any moment.\n\n\nZhaoluo stood up, and with a shaky voice, said, \"We have to get help. I don\u0027t know how to carry a baby!\"\n\n\nFather nodded as if her words hadn\u0027t just snapped him out of his frenzy. \"Can you find your way to the Committee?\"\n",
  "page 11": "She had to. She had to at least see what they did to her family. She owed them that.\n\n\nZhaoluo slowly got up from the mess of blankets on the floor and made her way to the staircase. She crept down the silent stairs and toward the door. Nobody was awake. Good. She opened the door, and a gust of cold air blew inside. Blankets rustled, but nobody called her out. She slipped out into the night. And gathering the last threads of energy she had, she ran.\n\n\nThe crying and screaming hadn\u0027t stopped, and in the distance, the city was ablaze. Zhaoluo kept running. She didn\u0027t know how many horizons she had ran today, but her muscles creaked from her weight. They cried for her to stop. Her brain started to pound against her skull. Even her heart thumped in a jittery dance. Was she ready for what she was going to see? There\u0027s no turning back now. Her feet already carried her this far.\n\n\nZhaoluo slipped into an alleyway as a group of enemy soldiers ran by. Her muscles ached as they locked up, tense. When the voices of the soldiers were gone, she continued her journey until she saw the building. She checked the empty street, cleared out by the Japanese, and walked to the window.\n\n\nThe smell of blood and guts hit her, and when she took in the scene, she felt something rise in her chest. She was going to puke again, but there wasn\u0027t anything left in her stomach to puke.\n\n\nThe first sight was her stepmother. Her abdomen had been cut open, and her guts removed. A baby, covered in dark liquid, lay beside her with its head pierced through. The baby couldn\u0027t possibly have been born in the time that Zhaoluo had been seeking help, which meant...\n\n\nZhaoluo dry heaved again. In the darkness past Tanlan was her father and sister. Both were dead from stab wounds, and they were both undressed. Lisong was on top of Li, whose smaller legs were apart...\n\n\nThis time, something watery and foul rose into her mouth, and she spat that onto the ground. What the Japanese had done... What they had done... Her right hand covered here nose and mouth, and she turned away.\n\n\nTears streaked down her face as she ran back to the refugee camp.\n",
  "page 99": "Hidesada called out, pointing at the fleeing girls, and the rest of his squad turned. They saw them too and chased. Hidesada followed, feeling a little bad. That feeling was soon gone as he felt the exhilaration of the chase taking over his thoughts, and he laughed as he shot at them. The tall one fell down, screaming. The smaller child shouted; her face was flushed from running.\n\n\nOne.\n\n\nHis squad mates aimed at the little girl, but it was Hidesada\u0027s bullet that killed her. Two.\n\n\nKinmoto walked over to him and smiled. \"Was wondering when you\u0027d kill somebody.\"\n\n\nHe smirked at his friend as he felt something in his mind snap. It disappeared before he could grasp it. \"I have one kill more than you, mate.\"\n\n\n\"Let the competition continue.\" Wicked grins spread on both of their faces, the squad started sweeping through the city.\n",
  "page 10": "The building where she had left her parents and sister just a while ago was broken into. The window at the front was shattered, and she could see men clad in rough clothing through the window. On their faces, wicked smiles were plastered. Their skin was covered in a layer of dirt, and she heard screaming.\n\n\nNo.\n\n\nAll she could do was watch them. Watch the five enemy soldiers barking at her family, who she could not see. One was gesturing. Li was screaming, and Lisong was sobbing. Zhaoluo had never heard her father cry before, but she never wanted to again. She didn\u0027t think she was ever going to.\n\n\n\"Baba! Stop it, please!\" Li was crying and screaming, and the soldiers were laughing and pointing.\n\n\nZhaoluo stood there, peeking out from behind a building. Her breaths felt shallow.\n\n\n\"You\u0027re hurting me!\"\n\n\nAn image was forming in her mind, and she did not like it. Zhaoluo threw up on the ground, and Dr. Wilson pulled her hair away from her face.\n\n\nSome of the men began to walk past the window, past what she could see.\n\n\nAnd Tanlan started crying. Zhaoluo heard tearing and begging. \"Please, please, no.\"\n\n\nBut nobody was stopping anything. Then her stepmother was screeching from pain. Zhaoluo slid down the side of the old building, tears forming in her eyes as she silently cried.\n\n\n\"Help me! Liso—\" her mother\u0027s voice choked as she continued screaming into the night.\n\n\nZhaoluo could hear more screaming from the city. More crying. Gunshots. What was happening? What were those monsters doing to her family?\n\n\n\"Not him! AHHH!\"\n\n\nThe pain etched into that sound made Zhaoluo choke on her breaths. Dr. Wilson looked on in horror. \"It\u0027s going to be alright,\" he murmured, rubbing her back in rhythmic circles.\n\n\nIt wasn\u0027t alright. She was safe... and they, her family... They weren\u0027t. They were being...\n\n\nMore screaming.\n\n\n\"We need to get back now, Zhaoluo,\" Dr. Wilson prompted. \"They might catch us.\"\n\n\nLet them catch us, she thought, but she let Dr. Wilson ease her toward the truck and away from her family.\n\n\nAs they drove back in the night, they listened to an eerie song of hell on earth. When she looked back, she could see fire lighting up the city. She could hear the cries of the tormented. This was truly hell on earth.\n\n\nWhen they arrived back at the safe zone, Zhaoluo looked at Dr. Wilson\u0027s sympathetic face blankly. He led her back to the building she had knocked the door of. That seemed like forever ago. She followed Dr. Wilson up the flight of stairs in the back and recorded the look on Miner\u0027s face as he saw that she was alone. They led her to a makeshift bed in the corner of the house, and she curled up in the blankets. Zhaoluo heard them talking, but she didn\u0027t hear them. She drifted off to sleep.\n\n\n---\n\n\nIt wasn\u0027t long before she awoke. The house was silent, and the flames on the candles were blown out. Zhaoluo tried snuggling into the nothing-smelling blanket and falling back asleep, but she couldn\u0027t. What those things had done to her family... It was...\n\n\nHer fault.\n\n\nShe left them. If she had stayed, she wouldn\u0027t be alone now. She would\u0027ve died with her family. She\u0027ll never see their faces again. Never see Li playing with that threadbare doll. Never see Tanlan\u0027s beautiful smile. Never hear her father\u0027s caring voice. Never see the face of her baby sibling.\n\n\nWhat could she possibly do? Nothing. She could waste away here and hope that Japan surrendered. She only laughed at that. China was too weak. The reason those soldiers were withdrawn from Nanking was because their leaders feared that they wouldn\u0027t have enough soldiers later. China is going to lose this war, Zhaoluo thought with a bitter smile against the soft blanket. But... she had done nothing. Was she brave enough to see... exactly what the soldiers had done?\n",
  "page 98": "The Japanese had already done so much damage to them. What were they going to do? Sit around like ducks waiting to be shot? Even if they don\u0027t really make a real impact, they\u0027re doing something besides cowering and letting the Japanese kill and kidnap them all. They\u0027re not... just sitting there like those other refugees, eyes either blank with emptiness or horror or static from free. Those people were not standing up to the enemy the cruel, evil enemy. They just trembled at their seats, praying for the war to stop or to at least die a quick death. Their dirty shoes tapped on the ground slowly, as if they were counting the seconds and minutes and days passing.\n\n\nThe Japanese had been taking more girls and women.They simply became more subtle and discreet. Mr Bates even drove through the patched up gates to beg the Japanese commander to return the stolen girls, bu they refused. He came back limping and with a few bruises; he had been shoved down the stairs. That\u0027s when Zhaoluo realized, knew for sure, just how powerless the Committee was. How even in the safe zone, they weren\u0027t safe.\n\n\nSure, the Japanese promised not to enter the area outside of delegations, but how could fifteen people enforce it? They had no power against the Japanese except being neutral—the Japanese simply could not hurt them. But they could hurt the refugees, especially if nobody was there to stand in front of the way.\n\n\nIt was a painful realization. And Boyan... well... He was good at covering up his emotions. Zhaoluo convinced herself of that.\n\n\n---\n\n\nZhaoluo led the way through the city. They had gotten used to the debris and glass after a few trips through the empty, red streets to steal more guns (with cost them several minor injuries). Every building had a unique destruction ridden upon it. Shattered windows, blood soaked floors, toppled roofs. The three, sometimes Ren would join them, would pick their way through the remnants of homes, some burnt to the ground with a smell of something foul emanating through the cracks between the stones and ashes. They had burned them alive.\n\n\nAs Zhaoluo passed the house, she swore she sensed the screams echoing through the air, begging, \"Help me! Save me!\" The whine of nails scratching and fists pounding against the walls...\n\n\nShe could hear the malevolent barking of the enemy as they shot and stabbed. The laughter and jeer as they counted each person, each human, that fell to their weapons and into the Yangtze. A mass grave dug by the hands of Nanking and filled with those same hands. The theft and arson and rape. The forced incest of LiLi and her father—the image seared into her head. The pale, pale flesh tainted by blood, mutilated.\n\n\nThis was why Zhaoluo lit the bomb.\n",
  "page 13": "A dreary light filtered through the windows, and Zhaoluo blinked up at it.\n\n\nShe was so tired.\n\n\nHer body was sore, and her head and heart ached. She stared at the ceiling.\n\n\nWhat the Japanese did in Shanghai, right before they came here, was nothing compared to this. Let there be arson, let there be theft and death... but rape, destruction, and humiliation? The humiliation. They can break them physically, but if the Japanese broke them psychologically, they were goners. There would be no fighting back. This house, this camp, the International Safe Zone—it meant that there was hope.\n\n\nShe didn\u0027t know how long she lay there, but lunch was being called, so she followed the other people outside to where food was being passed out. She was stuck inside her head, which somehow blanked overnight. Miner helped keep track of the food, which consisted of water, potatoes, and salt.\n\n\nWhen she took a bowl of it, Miner said, \"I\u0027m here to talk to if you ever need it.\"\n\n\nZhaoluo blinked at him and walked away. She found some secluded corner to force down the potato soup and gaze at the dirt. Dinner worked pretty much the same way, and by the time it was dark and she was in the small pile of blankets, she hadn\u0027t spoken a word.\n\n\nShe still had not spoken several days later, even when more people entered this camp in a frenzy. She shut herself out from their tears and cries, and she felt almost peaceful. They escaped as families, these people. How lucky they are. They still have somebody. She had nobody.\n\n\nOne afternoon, a shadow fell over her as she set down the small bowl of bland food. Zhaoluo sighed quietly as she looked up and squinted. Another refugee. About seventeen.\n\n\n\"Do you want to join us?\" he asked.\n\n\nShe looked past the kid to a small group of teenagers gazing at her. A few were smiling or waving. How could they smile? Zhaoluo returned her eyes to the boy, who had a nice head of hair. \"Who are you.\" A demand, not a question.\n\n\n\"Boyan,\" he replied, sticking his hand out.\n\n\nHer eyes were empty when she took the hand, intending to shake it or something. Boyan, however, pulled her up. \"Come with me.\"\n\n\nShe did. She dragged herself across the sad camp toward him and his group, and when they finally stopped, she said, \"Hi.\" They didn\u0027t seem to be in better shape than herself, and she wondered why they were even hanging around here.\n\n\nBoyan presented her to them. \"Guys, this is Zhaoluo. Zhaoluo, these are MaiMai, Huaxing, Ren, and Yinshi.\" He pointed to each person in turn, and her eye\u0027s rested on MaiMai, who looked only twelve. She was small enough that she could\u0027ve been Li.\n\n\nThey all respectfully said, \"Hello.\"\n\n\nHuaxing was delicate-looking and very pretty. She was probably at least Zhaoluo\u0027s age. Ren had spectacles but looked athletic enough that Zhaoluo guessed he wasn\u0027t some library-dwelling scholar apprentice or something. Yinshi was the scrawny one with robes on—probably used to be part of a convent.\n\n\nThey looked interesting enough.\n\n\nBoyan began to speak, and Zhaoluo couldn\u0027t help but listen. \"We\u0027re all orphans.\"\n\n\nShe sucked in a breath. Of the things she\u0027d think they\u0027d say, that wasn\u0027t one of them. Of course that\u0027d be part of war. Children get separated. But all she could squeak out was, \"What?\"\n\n\nMaiMai got up from the wooden crate she was sitting on and said, \"My parents didn\u0027t have enough money or supplies to bring me, so they ran away with my older brother. I lived nearby, and Mr. Bates found me outside and brought me here.\" Her eyes looked watery.\n\n\nZhaoluo blinked at her. That wasn\u0027t right. How could her family not make room for the child? She looked so much like Li. Zhaoluo sighed to get rid of the heavy feeling settling in her chest. Not feeling was better than crying right now.\n\n\nYinshi nodded at her before mumbling, \"Father Youcai brought me here and took the Sisters to another camp. I think he\u0027s somewhere in this area, but I haven\u0027t seen him.\"\n\n\n\"When did you arrive here?\" Zhaoluo asked.\n\n\n\"A month ago.\"\n\n\n\"You\u0027ve been here for a month?\" She gaped at him. \"What about the rest of you?\"\n\n\nThey answered quietly, and the times ranged from a week to a month ago.\n\n\n\"How do you guys handle it? Losing your family?\" She swallowed as a lump formed in her throat. Her voice cracked at she said, \"They were all I h-had left.\"\n\n\nThe five young survivors looked at her sadly. \"We have each other, at least.\"\n\n\nSomething loud sounded from nearby—a cry of pain and fear.\n",
  "page 12": "She probably couldn\u0027t handle it. She heard the pain in their voices and the laughs of the Japanese soldiers. Zhaoluo didn\u0027t want to know. She didn\u0027t want to see what happened. She didn\u0027t want it to be real.\n\n\nBut it was real. She knew what happened.\n\n\nHow could she forgive herself? How could she forgive herself for living when her family couldn\u0027t?\n",
  "page 15": "Everyone\u0027s head snapped toward the fence. People were already gathered there, clamoring loudly. Miner pushed his way through the crowd, and a boy who looked only eight was being carried through. People were shocked and wailing at something.\n\n\nThat\u0027s when Zhaoluo saw the blood. A trail of dark red followed the boy and what appeared to be his father, and the small group stood up from where they had lounged on the wooden crates. She followed them when they rushed over to the boy.\n\n\nMiner was already calling for Dr. Wilson, and when Boyan neared him, he asked quickly, \"What happened?\"\n\n\nUpon a closer inspection, she saw that there were several stab wounds in the boy\u0027s chest. They seemed eerily similar to the ones on her father and sister. His lashes fluttered, and he looked close to death. As Dr. Wilson arrived, he confirmed as much.\n\n\nPeople were surrounding the boy, asking about what happened and will the boy be alright. The father was kneeling beside the boy, fear in his brown eyes as Dr. Wilson drilled him with several questions.\n\n\n\"How did the boy get stabbed?\"\n\n\n\"B-Bayonets. They had bayonets. The two of the Japanese stabbed him and left him to die. I was close by, and I couldn\u0027t leave my son like that.\"\n\n\nThe doctor began to peel off the clothing on the boy, ripping his shirt away to reveal a bright red blood spewing from three wounds. MaiMai and other observers turned away.\n\n\n\"Everybody, leave. I can\u0027t have him getting more dirty and infected than what he is now.\" The doctor pulled a clean cloth from a small bag that he had been carrying. As Zhaoluo and the others walked away from the boy and the frantic father, she heard the doctor murmur, \"It\u0027ll be a miracle if I saved him.\"\n\n\nShe shivered. It was so much like the wounds in her father\u0027s and sister\u0027s chests.\n\n\nSuddenly, somebody was patting her back. She paused to see Huaxing beside her with a brave smile on her face. \"He\u0027s going to be okay.\" The odd light in her eyes didn\u0027t look hopeful.\n\n\n---\n\n\nThe three girls had settled down on the wooden crates after kicking the boys away, who now stood several meters away, muttering among themselves. The injured child had been rushed inside after the bleeding had been reduced. Huaxing started talking, and Zhaoluo forced her mind to stop thinking about the bleeding boy and the fright in her father\u0027s eyes.\n\n\n\"I arrived about a week ago, just a few days before you did, Zhaoluo.\" Zhaoluo looked up at her. She hadn\u0027t seen Huaxing before today. The other girl\u0027s eyes started to water, and MaiMai sucked in a breath as if she could anticipate what her friend was about to say. The two looked so youthful and innocent compared to the rest of them.\n\n\n\"I remember. Mama was making dinner. The Japanese hadn\u0027t broken completely through the Chinese lines. My father, he was a soldier. He fled. He didn\u0027t want to fight. He ran from his post on the gates and came home. The people he fights with were getting drunk dreading the Japs. They wanted to flee. They wanted to leave. He burned his soldier gear and dressed like a civilian because they said they wouldn\u0027t harm non-soldiers. \"\n\n\nHow wrong that was.\n\n\n\"And then... and then he told us to get to the safe zone. He stored his weapons inside the house somewhere, but he didn\u0027t flee with us. He said he just couldn\u0027t, even though he ran away.\" She started to sniffle. \"I don\u0027t understand! I don\u0027t understand why he did it.\"\n\n\n\"What did he do?\" MaiMai gasped.\n\n\n\"He stayed behind, and the Japanese arrived, but Mama and I were already in the safe zone. And before you arrived... we went out to find him, and she saw the soldiers running. They were running toward the river. They looked so tired and scared and their eyes. The wildness in their eyes. They smelled so bad like smoke and fire and death.\" Huaxing started to sob, and Boyan looked over worriedly, unsure if they should intervene. MaiMai shot them a death glare, and they backed off.\n\n\n\"You don\u0027t have to say it if you don\u0027t want to, Huaxing,\" Zhaoluo said gently. She wasn\u0027t sure what she was going to say, but she didn\u0027t she we was going to like it.\n\n\n\"They had nowhere to run, so they jumped into the river. The water was freezing and strong, and it carried them downstream. They were screaming for someone to help them, but they knew they\u0027d die. I think... they jumped because they didn\u0027t want to die at the hands of the Japanese. Some were wounded, and they were all screaming. Mama and I hid behind some buildings, and then... the Japanese shot into the water. They were laughing and pointing. It was like they were having... a contest. They called out something each time they killed someone.\"\n\n\nMaiMai covered her mouth at that, and Zhaoluo gently hugged her.\n\n\n\"And... I don\u0027t know why, but I saw father there. He was dressed as a civilian, but he jumped in with the others. He was insane. I don\u0027t know why. I don\u0027t know why!\" Huaxing hugged her back, and MaiMai joined in.\n\n\n\"Mama started to cry and tried to cover my eyes, but I saw them shoot my father. There was so much blood.\" Huaxing shut her eyes tightly. \"The looked pink and red, and the bodies... they were just swept downstream. They would bump against each other or against something, but they were limp. And they were laughing at them. Laughing at them.\"\n\n\nWhere is her mother now? This only happened... a few days ago, Zhaoluo thought, and a pressure began building in her chest.\n\n\n\"I don\u0027t know why. I...\" Huaxing had trouble breathing and she continued on, her face wet with tears. \"Mama grabbed a pot from the house\u0027s kitchen—the window was open. I remember asking her what she was doing, but she started to sneak away. I told her to come back, but she told me that she was sorry. Then she... she got close enough to the nearest soldier and hit him with the pot. I heard the crack through the blasting gunshots, but I ran. And then they were shouting, and I looked back, and Mama was on the ground, and they were taking her clothes off.\"\n\n\nZhaoluo started to tear up too. This sounded all too familiar. Had the Japanese made everything into a game with her family too? \"I\u0027m so sorry,\" she managed to choke out. They were horrible. What those soldiers had done was unforgivable.\n\n\n\"I think your mother is very brave to take down a Japanese soldier. She was strong and brave, and you are too, Huaxing. I won\u0027t ever let them touch you,\" Zhaoluo murmured as they rocked back and forth quietly, unsure of how she\u0027d keep that promise.\n",
  "page 9": "She mirrored his nod. \"I probably can.\"\n\n\n\"Go.\"\n\n\nThat was all the affirmative that she needed before she charged out of the little apartment, running down the street.\n\n\nThe cold from the earth bit her toes as Zhaoluo ran. Lisong had shown her the layout of the city once, and she had tried to memorize the jigsaw of lines. Western central district. Western central district. She repeated that to herself as she charged down the partly paved, partly earth street.\n\n\nHer stepmother was in labor. Holy spirits. This cannot be happening. But it was happening, and she was sprinting through the night trying to get help. The frigid air circulated into her lungs. Her lungs were heaving, probably just like Tanla\u0027s.\n\n\nThe gunshots were still continuing outside, and in the night, it sounded like distant thunder. A fat, but not round, moon shed the only light.\n\n\nGunshots, breathing, footfalls. The sounds rung in Zhaoluo\u0027s ears.\n\n\nAnd then she saw light.\n\n\nThese houses had faint glows coming from within. There! She ran forward, her exhaustion catching up to her as she paused at the outside of the fence. It was a poor fence, but the Red Cross flags lined up periodically against it signaled that this was, indeed, the International Safe Zone.\n\n\nZhaoluo crossed over the wood and rope barrier and made her way for the closest buildings. The door was locked, so she knocked on the painted door furiously. \"Help!\" Her cry echoed through the night.\n\n\nThe murmuring inside paused as someone stepped toward the door on the other side. The door opened to reveal a middle-aged man wearing a pair of round spectacles. His mandarin was decent when he started, \"Child—\"\n\n\n\"You have to help me, sir. My stepmother is in labor, and she\u0027s still out in the city!\" she cried, sinking to his knees before the noble-looking man.\n\n\nA look of shock crossed his face as he helped her up again. \"Then we must get her help immediately. What\u0027s your name, child?\"\n\n\n\"I\u0027m Zhaoluo.\"\n\n\nThe man helped her up, inspecting her condition. Then, he turned his head back and called into the house. \"Dr. Wilson!\"\n\n\nShe peaked into the building to see blankets on the floor where civilians lay. They were all staring at her and whispering.\n\n\nThe man that appeared, rushing down from the staircase that no doubt led to more refugee civilians, was younger than the one who stood before her; he too wore spectacles. \"What can I do for you, Miner?\" he inquired as he approached them.\n\n\n\"Zhaoluo\u0027s stepmother is in labor,\" Miner replied. \"Take the truck.\"\n\n\nWithout a question, Dr. Wilson rushed toward her and said, \"Come.\" She followed the doctor outside to a truck placed behind the house. She hadn\u0027t seen it when she came in, so she supposed that was a good hiding place for a vehicle.\n\n\nZhaoluo got into the automobile with Dr. Wilson\u0027s help, and he turned in on. The noise deafened her at first, and she worried about being detected driving through the night.\n\n\n\"Don\u0027t worry, it gets quieter in a bit,\" Dr. Wilson said.\n\n\n\"Okay.\" Zhaoluo gazed out of the vehicle in wonder. They moved quickly through a small opening in the fence—the opening had been placed further than the house, which must be why she also didn\u0027t see it.\n\n\nAnybody coming here in a rush probably couldn\u0027t glean much information until they studied the place a bit more.\n\n\n\"Have you ever been on a automobile before, Zhaoluo?\"\n\n\nShe turned back toward the man. He looked friendly enough. \"No.\"\n\n\nHe nodded. \"You\u0027re going to have to tell me where to go.\"\n\n\n\"It\u0027s going to be in the southern central area. We could hear gunshots from outside the wall. I think that would be down this street and a right turn.\" she listed off all the information she could remember.\n\n\n\"Alright. I think I know where they could be. Is it a residential street?\"\n\n\n\"Yes.\"\n\n\nAfter a few moments of quiet, a loud BANG sounded. It was followed by more gunshots, and she almost leaped out of her seat.\n\n\nDr. Wilson harshly said something under his breath and drove the car left into a small alleyway.\n\n\n\"Dr. Wil—\"\n\n\nHe shushed her and hissed, \"The city has been invaded.\"\n\n\nA cold fear rushed through her. \"That means we have to get there fast!\"\n\n\nDr. Wilson was already getting off the truck. \"We can\u0027t risk them hearing the car.\"\n\n\nShe groaned in frustration as he helped her off.\n\n\n\"We have to run.\" He placed both hands on her shoulders, a stable force. \"Do you think you can run your way there?\"\n\n\nYes. Yes because she had no choice. She nodded and started to run. Maybe it was because she was weak, but Dr. Wilson kept up just fine. He was a professor who studied papers. Maybe they were both just unable to run fast.\n\n\nZhaoluo ran down the street, and it felt like fire was trailing in her footsteps. Perhaps she heard muffled shouts and firing, but the wind brushed against her ears. She was burning with energy. Fear. She had to get to them. Even if she didn\u0027t like her father anymore, even if her stepmother wasn\u0027t her real mother.\n\n\nA gunshot nearby froze her in her steps, and Dr. Wilson pulled her back.\n\n\nShe was already here... but... Zhaoluo took in the scene before her.\n",
  "page 14": "A dreary light filtered through the windows, and Zhaoluo blinked up at it.\n\n\nShe was so tired.\n\n\nHer body was sore, and her head and heart ached. She stared at the ceiling.\n\n\nWhat the Japanese did in Shanghai, right before they came here, was nothing compared to this. Let there be arson, let there be theft and death... but rape, destruction, and humiliation? The humiliation. They can break them physically, but if the Japanese broke them psychologically, they were goners. There would be no fighting back. This house, this camp, the International Safe Zone—it meant that there was hope.\n\n\nShe didn\u0027t know how long she lay there, but lunch was being called, so she followed the other people outside to where food was being passed out. She was stuck inside her head, which somehow blanked overnight. Miner helped keep track of the food, which consisted of water, potatoes, and salt.\n\n\nWhen she took a bowl of it, Miner said, \"I\u0027m here to talk to if you ever need it.\"\n\n\nZhaoluo blinked at him and walked away. She found some secluded corner to force down the potato soup and gaze at the dirt. Dinner worked pretty much the same way, and by the time it was dark and she was in the small pile of blankets, she hadn\u0027t spoken a word.\n\n\nShe still had not spoken several days later, even when more people entered this camp in a frenzy. She shut herself out from their tears and cries, and she felt almost peaceful. They escaped as families, these people. How lucky they are. They still have somebody. She had nobody.\n\n\nOne afternoon, a shadow fell over her as she set down the small bowl of bland food. Zhaoluo sighed quietly as she looked up and squinted. Another refugee. About seventeen.\n\n\n\"Do you want to join us?\" he asked.\n\n\nShe looked past the kid to a small group of teenagers gazing at her. A few were smiling or waving. How could they smile? Zhaoluo returned her eyes to the boy, who had a nice head of hair. \"Who are you.\" A demand, not a question.\n\n\n\"Boyan,\" he replied, sticking his hand out.\n\n\nHer eyes were empty when she took the hand, intending to shake it or something. Boyan, however, pulled her up. \"Come with me.\"\n\n\nShe did. She dragged herself across the sad camp toward him and his group, and when they finally stopped, she said, \"Hi.\" They didn\u0027t seem to be in better shape than herself, and she wondered why they were even hanging around here.\n\n\nBoyan presented her to them. \"Guys, this is Zhaoluo. Zhaoluo, these are MaiMai, Huaxing, Ren, and Yinshi.\" He pointed to each person in turn, and her eye\u0027s rested on MaiMai, who looked only twelve. She was small enough that she could\u0027ve been Li.\n\n\nThey all respectfully said, \"Hello.\"\n\n\nHuaxing was delicate-looking and very pretty. She was probably at least Zhaoluo\u0027s age. Ren had spectacles but looked athletic enough that Zhaoluo guessed he wasn\u0027t some library-dwelling scholar apprentice or something. Yinshi was the scrawny one with robes on—probably used to be part of a convent.\n\n\nThey looked interesting enough.\n\n\nBoyan began to speak, and Zhaoluo couldn\u0027t help but listen. \"We\u0027re all orphans.\"\n\n\nShe sucked in a breath. Of the things she\u0027d think they\u0027d say, that wasn\u0027t one of them. Of course that\u0027d be part of war. Children get separated. But all she could squeak out was, \"What?\"\n\n\nMaiMai got up from the wooden crate she was sitting on and said, \"My parents didn\u0027t have enough money or supplies to bring me, so they ran away with my older brother. I lived nearby, and Mr. Bates found me outside and brought me here.\" Her eyes looked watery.\n\n\nZhaoluo blinked at her. That wasn\u0027t right. How could her family not make room for the child? She looked so much like Li. Zhaoluo sighed to get rid of the heavy feeling settling in her chest. Not feeling was better than crying right now.\n\n\nYinshi nodded at her before mumbling, \"Father Youcai brought me here and took the Sisters to another camp. I think he\u0027s somewhere in this area, but I haven\u0027t seen him.\"\n\n\n\"When did you arrive here?\" Zhaoluo asked.\n\n\n\"A month ago.\"\n\n\n\"You\u0027ve been here for a month?\" She gaped at him. \"What about the rest of you?\"\n\n\nThey answered quietly, and the times ranged from a week to a month ago.\n\n\n\"How do you guys handle it? Losing your family?\" She swallowed as a lump formed in her throat. Her voice cracked at she said, \"They were all I h-had left.\"\n\n\nThe five young survivors looked at her sadly. \"We have each other, at least.\"\n\n\nSomething loud sounded from nearby—a cry of pain and fear.\n",
  "page 17": "\"Slipped?\" she had to ask.\n\n\nRen sighed and pushed those spectacles up his nose. \"Never mind. It\u0027s just... whatever.\"\n\n\n\"We\u0027ve all been effected by this stupid war. Hell, Huaxing\u0027s parents both died in front of her face!\"\n\n\nZhaoluo spread her hands out, trying to get something out of him. He seemed really interesting as a person and very intelligent as well.\n\n\n\"This war has been a curse for every person in China. I am no different.\" Ren finally sat on a wooden crate with a deep sigh.\n\n\nZhaoluo stood before him, hands on her hips, with an odd need to comfort the guy even though... what he said was completely true.\n\n\nBut he spoke before she did. \"You don\u0027t seem like the type of person to swear.\"\n\n\nShe could see the curiosity in the lines of his face, at lost for words. \"Swear?\"\n\n\nHe scoffed. \"Your father. What was he like?\"\n\n\nThe kid was changing the subject again, and he was really confusing her. He didn\u0027t want to talk about himself, apparently.\n\n\nZhaoluo sat down beside him, kicking at the dirt. Where were the others? They were probably mingling about. Knowing Boyan, he\u0027d probably be with the doctor, trying to help people. \"My father... he was a typical man. He\u0027d always wanted... a son.\"\n\n\nRen nodded, his face grim but knowing. \"I am the youngest child of three sisters. My father and mother always fought over us, but my father insisted on getting a boy just so he could pass on his surname and lineage. It\u0027s silly, really.\"\n\n\n\"Obviously. He always wanted me to fix the tea and whatnot. Always looking about for good matches for me; he always watched out for the family because he had no son to share that duty with,\" Zhaoluo replied, almost angrily.\n\n\n\"Your father. Did he work at a restaurant?\" Ren asked suddenly.\n\n\nShe shot him a wondering look. \"Yes. Why?\"\n\n\n\"I worked at a restaurant. A man that worked with me always looked at me and sized me up. It was odd, but I didn\u0027t say anything. I\u0027ve experienced such... scrutiny before. Early in Novemeber, he asked me about marriage prospects and what kind of woman I liked.\"\n\n\nZhaoluo was getting an uncomfortable feeling about this.\n\n\n\"He said that he had two daughters, and one of them was old enough to be married, and that he thought I would make a good match. I almost laughed at the time, but he looked like a wise man.\" Ren pushed at the metal of his glasses. \"He went on to tell me of his daughter. She was... he said that she cooked and cleaned very well and was always organized.\" He paused, waiting to see if Zhaoluo would respond.\n\n\nShe didn\u0027t. Her eyes glowed with... an emotion that she didn\u0027t dare identify.\n\n\n\"She said that she had a... defiant spirit that would need, ah, taming. But he emphasized on her...\" Ren looked slightly uncomfortable at what he was about to say. \"He emphasized her beauty and how well she worked.\"\n\n\nAh. \"And?\"\n\n\n\"We were wiping down after the day\u0027s work, and my hand slipped off the table when he actually asked about it. Honestly, it was odd. Typically, he would approach my parents, but I suppose he either already knew them or thought I was already out of the house or something. I really respected the man.\"\n\n\n\"Oh? Did you?\" A bitter feeling grew in her stomach. \"What was this man\u0027s name?\"\n\n\n\"Lisong.\"\n\n\nA tight feeling gripped her chest, and she tensed. Ren took this in.\n\n\n\"So you are Lisong\u0027s daughter. I knew it.\" Ren stood up from his spot and looked down on her. \"Your father has done very bad things, Zhao Luo.\" He puncuated her name in such a way that it felt like a threat.\n\n\nShe took a moment to breathe when the uncomfortable feeling grew. She had always suspected... but...\n",
  "page 16": "The racket downstairs woke her up, and she climbed out of the pile of blankets which she had grown very fond of in the past few days. The people downstairs were definitely not using inside voices. Zhaoluo groaned. Yesterday, the others had gone off to their designated buildings in the camp, which were all, unfortunately, not the same house as her. Sometimes she really wished she could wake up to a friendly face and not complete strangers.\n\n\nThe gang and her... aren\u0027t strangers anymore, right? She had spent the past few days talking to them. While most didn\u0027t share the complete details of their lives before now, they still offered intelligent conversation outside of complaints about camp food, conditions, and the amount of people—horrified, empty-eyed, grimy people—flooding this camp as well as the many others.\n\n\nIt just didn\u0027t seem... as bad anymore. And she was disgusted with herself. She is disgusted that she can\u0027t give more thought to her family and more thought to be people and feel scared because she wasn\u0027t. She wasn\u0027t scared anymore. Her newfound friends... she can\u0027t let them get close. Otherwise, she will be scared when something happens. Something will always happen.\n\n\nZhaoluo looked out the window at a building past the fence, which is undergoing reinforcement—not like that\u0027s going to do any good. Outside, the buildings are shattered. If she looked down the street, she\u0027d see burnt buildings. Reports from Mr. Bates, who she realized was Miner, told of the burnings. The Japanese locked the citizens into the buildings they spent their entire lives in and burned them in there, laughing as they tried to climb out windows or jump off the roof to another building, burning or being shot as they tried. They were told that the victims were like walking torches.\n\n\nFinally, she padded down the steps to the first floor, only to be almost pushed back as people were all trying to converge at the door. The entire floor still had people there, and somebody was blocking the path.\n\n\n\"What\u0027s going on?\" Zhaoluo poked the nearest person by her—a woman with no significant features except a high, thin nose—who glared at her and ignored her. She stepped to the highest spot possible on the staircase, trying to see who (or what) was at the door.\n\n\n\"Everyone, calm down!\" She recognized the voice as Mr. Bate\u0027s.\n\n\nBut nobody did. Why would they? The Japanese had enough of China\u0027s east coast and inland already... who said they couldn\u0027t conquer them all? Who said that these Westerners wouldn\u0027t just abandon them?\n\n\nAt last, the professor moved out of the way as people spilled out into the camp area, which was basically an area surrounded by buildings and even tents which several obvious paths leading outside into the city and further into the safe zone. Zhaoluo was almost surprised to remember that there were more camps than just this one in the safe zone, and that she was very lucky to have gotten into this one.\n\n\nThe refugees started to flood out of the building like a horde of desperate people. What\u0027s going on again? When Zhaoluo reached the door, everybody seemed to be surrounding something. When she saw Ren, she ran over and asked him what he thought was going on. She could see tears behind those spectacles.\n\n\n\"I think... the boy that arrived the other day—the one with the three bayonet wounds—is dead.\"\n\nFor some reason, the news doesn\u0027t surprise Zhaoluo. \"Are they gathering around... his body?\"\n\n\nHe nodded.\n\n\nShe pushed through the group, who muttered at her jostling. When she finally broke through the mob-like ranks, her eyes settled onto the boy. He was just laid down like that with a scrap of cloth covering his eyes. They were going to bury him soon. The father was nowhere to be seen. Mr. Bates appeared across from her, and he gazed at her. She blinked. Huh?\n\n\n\"The father was moved to another camp. He... didn\u0027t think he could stay here,\" Mr. Bates said to nobody in particular.\n\n\nThe other people nodded, almost as if understanding. What bothered Zhaoluo was that father didn\u0027t even get to see his son buried.\n\n\nZhaoluo\u0027s eyes fell onto the boy\u0027s clothed chest. Beneath the ripped cloth—the same cloth that he arrived in—there were several stitched areas, but they were covered with dried blood and something nasty that reminded her of mold.\n\n\n\"He needs to be covered immediately,\" Zhaoluo said with surprising confidence. Then, when nobody moved, she added, \"We could get infected with that stuff on his wound.\"\n\n\nThat got the crowd moving away, though some shot her an ugly glance. Why did they not like her?\n\n\nMr. Bates nodded at her with approval. \"You are correct. We have to bury... the poor child. There isn\u0027t enough of us in this camp right now...\" Emptiness, guilt, whatever in her eyes got him asking, \"Would you like to help?\"\n\n\nShe looked back at Ren, who stood there staring at her and Mr. Bates and the body. \"What about you, Ren?\" Something about this case made Ren very uncomfortable, and she wanted to know why. Maybe it was just corpses.\n\n\n\"Sure,\" he muttered, shoving his hands into his pockets and looking away from the body. \"When?\"\n\n\n\"Tomorrow. When the sun rises forth in the sky.\"\n\n\n---\n\n\nThere\u0027s something wrong. Ren refused to look at Zhaoluo after they returned to the crates—which we had unofficially name the \"base\". Was he that scared of... of dead bodies? Why would he agree to bury the boy if there was something wrong?\n\n\n\"Ren—\"\n\n\n\"I know what you\u0027re going to say.\" His reply was brief, and he paused his pacing. His eyes were on his dusty shoes.\n\n\n\"Do you know me that well?\"\n\n\n\"No, but I saw the look on your face after I replied. I slipped; that\u0027s all.\" Ren was gazing at her now, his eyes keen and knowing.\n",
  "page 91": "It was in the afternoon when the Japanese entered the camp. They were officers, and they carried filled sacks. Another man—Western, named John Rabe—that Zhaoluo had never seen before met them at the facility that was the place for such things. They talked for some time; Zhaoluo and the others—no Huaxing—sat there, watching the door, waiting for it to open. Waiting.\n\n\n---\n\n\nLater that day, Zhaoluo threw down the small pack of powder distributed by the Japanese and hissed for the others to do the same. \"It\u0027s a drug,\" she whispered with disdain. \"I\u0027m sure this wasn\u0027t the first time. I don\u0027t remember any times before though... Did they ever...?\" She looked around at the others, eyes landing on Ren.\n\n\n\"They did, but we were typically not around or something,\" was Ren\u0027s immediate response.\n\n\nShe nodded and tipped her head to the pile of drugs before her. \"Don\u0027t ever use it.\" And then she told them about her father. \"So don\u0027t.\"\n\n\nBoyan agreed. \"They want to pacify us. Make us not care. Whether this is a good thing or a bad thing, I don\u0027t know.\"\n\n\n\"The Japanese rule this city now. The Committee is useless, as is the safe zone,\" Zhaoluo said. It was the truth, and MaiMai may not be able to sleep at night, but she\u0027d rather have the girl able to flee if the Japanese ever try. \"We\u0027ll keep doing what we\u0027re doing. Avoid the Japanese.\" The ones who killed Huaxing. And Zhaoluo fell into a weary quiet again.\n\n\n---\n\n\nThey took over the city. Completely. They pretty much stole the Committee\u0027s power and established another puppet government. And the people generally did not care anymore. They were too addicted to heroin at this point. Zhaoluo felt bad for them. They were all victims of this stupid war. The Japanese could take them away if they wanted, so long as they promised to pump death into their veins instead of simply stabbing them.\n\n\nAnd it wasn\u0027t fair. Mr. Bates and Dr. Wilson and Mr. Rabe... they had little power. All of them. They can\u0027t stop the Japanese from continuing the rape and murder. But, Zhaoluo thought, almost gratefully, they did help. But they couldn\u0027t stop Boyan. He\u0027s impossible...\n\n\nIt was also at this time a cold fire kindled in her body. Zhaoluo was angry. She hated them. She loathed the Japanese for what they did to her family, what they did to her friends, what they did to the innocent. And she hated Boyan too.\n",
  "page 90": "Zhaoluo glanced at the dirt below her feet nervously, and Boyan nodded stiffly.\n\n\n\"Alright. Just me an Huaxing then.\"\n\n\nShe didn\u0027t think she could do it. It was far too scary out there. But something was nagging at her. How could she protect Huaxing like this? How? She promised but... her own fears were too strong.\n\n\n---\n\n\nZhaoluo woke to Mr. Bates\u0027 prodding, and she groaned, \"What?\"\n\n\n\"Shh. I need to speak with you.\" His voice was quiet as a mouse, and she realized her own unseemly noise had been awfully loud.\n\n\nShe quietly, and groggily, untangled herself from her blankets and followed Mr. Bates outside. Surprised to find the rest of the gang, she fell into the line they made. Maimai wasn\u0027t here. At least they could protect the youngest one. Mr. Bates paced in front of them.\n\n\nZhaoluo looked down the line, and when she couldn\u0027t find Huaxing, something in her heart stopped.\n\n\n\"I cannot believe you guys would do this!\" Mr. Bates looked angry, like a teacher reprimanding a student for some crazy act or another. He glared at Boyan. \"You fool.\"\n\n\nBoyan appeared very calm, but he said nothing.\n\n\n\"Whatever. I just... Somebody made it to the safe zone, left the safe zone on their own volition, and died because of it.\"\n\n\nShe couldn\u0027t hear the rest of what Mr. Bates said. This was too much. She... Huaxing... Zhaoluo started crying. Ren immediately went to her, saying something nice or threatening or something. She couldn\u0027t hear. Dammit. Why is she losing everything? She felt a little selfish. The others knew Huaxing longer, but...\n\n\nShe broke her promise. And Huaxing is dead.\n\n\n---\n\n\nAfter Mr. Bates put more eyes on them (she could feel some of the other refugees just looking at her) to make sure they weren\u0027t going anywhere, the others tried to comfort her and Maimai, who were most affected, apparently.\n\n\nRen would say something like, \"It wasn\u0027t your fault. She wanted to do that. Blame Boyan or something if you feel that bad.\"\n\n\nShe knew that it wasn\u0027t her fault, at least not exactly, but she felt guilty anyways. And she couldn\u0027t stop that feeling from invading her head as she hugged MaiMai close to her. Zhaoluo didn\u0027t think she could ask Boyan exactly what happened, too fearful of what his response could be, but based on what she overheard him telling Ren, she shuddered at the image of Huaxing\u0027s head rolling against the ground, blood following it like a red ribbon.\n",
  "page 93": "A few years later...\n\n\nZhaoluo was pouring tea by the time Ren returned. Maimai was setting up the table—the way Li would, with the bowls going from smallest to biggest. After a day helping out at the orphanage, Zhaoluo had returned to find the rice already cooked by Maimai. She\u0027d been grateful for that. She was sick of cooking bucket loads after bucket loads of rice for the children and stragglers.\n\n\nRen cleared his throat as he stepped inside, clothing dripping from the rain outside. Zhaoluo smirked; she left the orphanage early enough to not trudge through in the rainstorm. Rolling her eyes, she called over her shoulder, \"I heard you already, Ren.\"\n\n\nHe took off the wet outer layer of his clothing and dropped them into Maimai\u0027s waiting hands with a thank you. Ren walked over to Zhaoluo, who whispered, \"How\u0027s Boyan?\"\n\n\n\"He\u0027s okay. Doing his communications stuff.\"\n\n\nBoyan had been an editor for the Nanking news and also worked for the communications of the city. He hadn\u0027t told them anything about his past, but when the city got back onto its feet—those days of stumbling had been hard—he offered Ren a job... The communications branch had been low staffed. Then, he proceeded to offer them a place to stay at the patched up news building. He had automatically taken command of the business as he was at the top of the ladder after the invasion.\n\n\nZhaoluo nodded. \"Alright.\" She didn\u0027t think she could ever forget what his \"plan\" had done. Or the promise she broke. Zhaoluo hated uncertainty.\n\n\nRen looked at the tea cup, which was overflowing. He tapped her shoulder, and she glanced down, immediately setting the teapot. Quickly, she grabbed a rag to wipe at the tea, which had begun dripping off the edge of the counter.\n\n\n\"Clumsy,\" Ren remarked, almost taunting her.\n\n\n\"Shut up,\" she retorted. \"It\u0027s not like you have to perfect tea pouring.\"\n\n\nSomething in his face darkened, but he laughed it away. \"If you married me, I\u0027d never make you pour tea. It\u0027s ridiculous.\"\n\n\nZhaoluo rolled her eyes at that, and Maimai cooed, eyes lighting up with delight. She went over to the pot and carried it over to the table. Lifting the lid, she said, \"Enjoy.\"\n",
  "page 92": "The Japanese pulled out of Nanking. It was spring, and the refugees were no longer trapped. They trudged to their homes in silence only to break down with tears upon the sight of their homes. They looked at the streets, caked with red, with the same horror Zhaoluo felt when she first entered the city and realized her family\u0027s end. Or set off those bombs. Their bodies trembled, grey and grail, from loss, addiction, and disbelief.\n\n\nThe government did not return, but people did. And so they began to rebuild Nanking.\n",
  "page 95": "Zhaoluo rushed past Huaxing and Boyan to leap onto the man. The impact jarred her, but the gun fell out of his hands. The man punched her, laughing with delight to find a young woman out here. He didn\u0027t know of the other two.\n\n\nShe heard a faint scraping sound, and Huaxing hissed at Boyan.\n\n\nBANG!\n\n\nThe man that had gotten on top of her suddenly slumped onto her. Zhaoluo tried to push the dead weight off, stunned out of her wits. She didn\u0027t dare look at the man\u0027s shadowed face.\n\n\n\"Zhaoluo, hurry!\" Boyan whispered, voice hoarse, as he lifted the man off her. Zhaoluo quickly rolled out as the soldiers began rushing out of Huaxing\u0027s house.\n\n\nThe soldiers from the building were shouting, \"Kinmoto!\" and a sick feeling wormed its way into Zhaoluo´s stomach as the three teenagers rushed away.\n\n\n\"KINMOTO!\" It seemed as if they found the man. From the voices behind them, they wanted to find them now too.\n\n\n\"Move!\" Boyan hissed to Zhaoluo, who had been lagging a bit from fright.\n\n\nHuaxing\u0027s breathing was raspy, but Boyan kept pushing her forward back to the refugee camp. They don\u0027t want to get stuck in the city. They had to get back.\n\n\nZhaoluo followed them mindlessly, always close behind. She focused on the ground and not the feeling of that weight. The weight of a dead man.\n\n\nZhaoluo couldn\u0027t hear the stomping of Japanese soldiers behind them but didn\u0027t stop moving. And how Boyan knew where to go in this devastated sector was beyond her. The route they took back to the refugee camp seemed much quicker than the way out. Maybe it was just the running.\n\n\nZhaoluo\u0027s head was still spinning as they crossed back into the safety zone. She almost fell trying to get over the fence. Huaxing had to be pushed over, and Zhaoluo caught her; Boyan nimbly lifted himself over.\n\n\nOnce they were all standing on the safer side of the fence, Boyan whispered quickly, \"You\u0027re not hurt, are you, Zhaoluo?\"\n\n\n\"No.\"\n\n\n\"Good.\" Even in the dark and under the shadow of the small lights, Zhaoluo could make out Boyan\u0027s pained expression.\n\n\nHe had killed someone. It didn\u0027t matter if it was a Japanese soldier.\n",
  "page 97": "Zhaoluo and the others were nervously counting down their days, on edge in fear of another kidnapping. Needing those explosives to calm their minds. Boyan had insisted on planting an explosive in a Japanese camp, but those were too far away and subject to change frequently. Making them trigger traps were out of the question because they didn\u0027t want to accidently kill anyone innocent. So, they thought they could just use them as grenades or something.\n\n\n\"It depends on how they turn out,\" Boyan had said.\n\n\nMrs. Lu finally approaced Zhaoluo four days later, handing her the bag that must\u0027ve contained said explosives. She told them that it was hard retrieving other supplies, and when they asked how she even got \"other supplies\", Mrs. Lu simply stated that she isn\u0027t the only person in the safe zone who knew how to make bombs or shoot people. Boyan winced at the last part.\n\n\nThat night, with the sky creeping into darkness, Boyan and Zhaoluo again met by the little corner by the fence. Only to see someone already there—Ren.\n\n\n\"Ren?\" Zhaolou hissed, crouching slightly. For what reason? She didn\u0027t know. Perhaps to defend herself from a stranger?\n\n\n\"Yeah, that\u0027s me,\" came Ren\u0027s voice.\n\n\nBoyan came closer to him and dropped to Ren\u0027s eye level, Ren being just a blotch of shadow under the stars. \"Why the hell are you here?\"\n\n\nRen\u0027s seemed to look at her for a moment, and she bristled. \"With Huaxing out, I thought you might need another person.\"\n\n\n\"You of all people,\" muttered Boyan, but he did not object. It was always nice to have another friend tagging along.\n\n\n\"Do you have the explosives?\" Ren asked, glancing at the bag in Zhaoluo\u0027s hands.\n\n\n\"Yes.\"\n\n\n\"Alright, what are you waiting for?\"\n\n\n---\n\n\nThe plan was simple but dangerous. All they had to do was plant a bomb inside the buildings where the Japanese were sleeping and relaxing and doing whatever they\u0027re doing. If there are captives in the building... That question hadn\u0027t been answered yet. They didn\u0027t know what to do. Captives suffered at Japanese hands, so would ending them be a kinder move? Or not killing them, but keeping them alive to suffer?\n\n\nLogically, Boyan said that they should just blow all of them up. What was the problem with that? They themselves probably wanted to die. He killed someone. How could he be so... so.... Zhaoluo just stopped the thought. And Ren just didn\u0027t say anything except, \"Whatever.\"\n\n\nIt was difficult finding more Japanese soldiers. For some reason, they had a knack for finding you and running off when you try finding them. Eventually, however, the sounds of banter and laughter attracted the group to a small shop similar to the one Zhaoluo had slept in the days preceding the... invasion. A small yellow light illuminated a square of street on the outside.\n\n\nThey crouched silently behind a pile of rubble that used to be a building of some sort, their feet pressing into ashes of burned wood. The Japanese\u0027s shouts were horrendous and rough as they laughed like monkeys at something. Probably someone.\n\n\nBoyan simply took a small explosive—it looked like a can with strings around it—and walked toward the building, wary of the glass on the ground that could prove fatal to them all. He proceeded to light the explosive with matches he must\u0027ve found somewhere (who knows where) and dashing away from the building. Just in time, Boyan reached their pile of rubble, leaping behind it. Red and orange flames erupted on the building, sections of the wall blew off, and the screaming started.\n\n\nThe Japanese soldiers could be seen as dark outlines in the building; their clothes must\u0027ve caught fire, according to the loudness of their screeches. Even from their position, they could feel heat pulsing from the bits and pieces of the store that caught fire.\n\n\nAnd then they started to run. Boyan had a bag, and he was like a streak in the dark. A spy, a secret soldier. Calling down vengeance on them all.\n\n\n---\n\n\nBoyan had used up all four explosives by the time they returned to the safe zone. Zhaoluo was stiff, and she didn\u0027t say anything as Ren took her arm and led her back. She blankly returned to her bed with two thoughts: Why wasn\u0027t the door locked? and Boyan is dangerous.\n",
  "page 96": "The lady with the high nose and sharp features seemed to glare down on them despite being in a lower position. Yinshi and Ren, with MaiMai trailing fearfully along, had found them, and after a few moments of reuniting, Boyan told them their plans. That led them here.\n\n\nIn her own little corner of the camp (near the infirmary), the lady was sewing. Of all things she was sewing. Zhaoluo supposed that it had its uses, as there was a bin of washed, but tattered, clothing beside her.\n\n\n\"Mrs. Lu,\" Boyan greeted, dipping his head toward the hunched over woman. \"I have a request.\"\n\n\nMrs. Lu looked at each of them in turn. Yinshi was looking at the needle in her hands with wide eyes—like he\u0027s never seen a sewing needle before. Ren was fidgeting and uncomfortable; he opposed the plan wholly. MaiMai was smiling at the woman, seeing something that the others did not. Then onto Zhaoluo, who was studying the stitches of the clothes with appreciation. Her eyes fixed on Boyan. \"What.\"\n\n\n\"You told me before you knew how to make explosives from guns.\"\n\n\n\"So?\"\n\n\n\"We would like you do that for us.\"\n\n\n\"Why?\" Mrs. Lu was actually considering it. That\u0027s something Zhaoluo did not expect.\n\n\n\"We want to get back at the Japanese soldiers for what they did.\"\n\n\n\"Don\u0027t we all.\" She returned to sewing.\n\n\nBoyan crossed his arms. \"Mrs. Lu...\"\n\n\nShe glared at Boyan. \"Leave the gun under my blankets.\"\n\n\n---\n\n\nZhaoluo tiptoed toward Mrs. Lu\u0027s spot in the house, feeling very exposed with the heavy gun in her hands. She lifted the edge of the blanket, wincing as the gun scraped against the floor. Her eyes flicked around the room. Nobody was awake.\n\n\nHaving finished her job, Zhaoluo returned to the staircase and looked back. Mrs. Lu had rolled over the gun, almost protectively. She smiled to herself and sneaked back upstairs.\n",
  "page 29": "The Japanese soldier approached. It was obvious that he was approaching the destroyed counter where they hid. He didn\u0027t speak anymore, but his footsteps weren\u0027t silent on the glass from the shot out windows.\n\n\nBoyan pressed a finger to his lips, and when a figure appeared on his side, he lunged at it. He pushed the gun aside as several shots were released. Huaxing cried out in pain, while the soldier smashed against the ground, caught unawares. Boyan slipped on the gun, pushing it back toward Zhaoluo. He and the soldier scrambled on the ground, trying to wrestle each other down.\n\n\n\"HIDESADA!\" cried the soldier, and Boyan wrapped his hands around the man\u0027s neck.\n\n\nZhaoluo picked up the gun, surprised by its weight. Unsure of what to do with it.\n\n\n\"Shoot him!\" Boyan commanded, struggling to keep his position on top the soldier. \"More are coming!\"\n",
  "page 22": "She looked through the glass windows at the hunched figure sitting before the table. She had suspected that it for a while, but seeing it just makes her want to cry.\n\n\nZhaoluo had asked several owners whose shops she frequented about different... substances. They were shocked at her questioning but answered her nonetheless.\n\n\nOh, she\u0027s heard of opium dens before. She didn\u0027t realize there were substances as bad as and worse than opium. Things that could harm as much as opium could. Her father had been bringing less money in, saying that he was demoted because of an accident. Her stepmother\u0027s face had just fallen. Lisong\u0027s face didn\u0027t stay in its slightly bright expression.\n\n\nThe fool. What was wrong with Lisong? What was so bad about him and his life that he resorted to idiocy like this and let his family suffer ever so slowly?\n",
  "page 21": "\"What do I know?\" Ren scoffed, looking up at her with a single brow lifted. He looked so... dangerous like that.\n\n\nZhaoluo shifted her arms a bit and looked away, disguising it with a roll of her eyes. \"If my father was a very bad man, what could he have done that your mother hadn\u0027t already?\"\n\n\nRen blinked. And frowned. And ignored her. \"I wasn\u0027t going to accept the offer anyway, but I didn\u0027t want to offend the poor man. Once, I saw him mingling with some, ah, shady characters—\"\n\n\n\"And how would you know they were shady?\" When it came out of her mouth, she wanted to slap herself because it sounded so dumb.\n\n\n\"They had on longer, darker clothing and had this awful look to them. Zhaoluo,\" Ren started, \"you\u0027re father was sucking up a lot of money. And that is why I did not accept the marriage offer. With you.\"\n\n\nZhaoluo gave him an inspecting once-over. He wasn\u0027t bad looking... but she had worse things to worry about. She crossed her arms, uncrossed them, and crossed them again. Then she sighed and let both hands fall to their places. \"What was the point of this? People are dying out in the city, and the refugees literally just shred the resourcse.\"\n\n\n\"I thought you should know that your father, and you and I...\" He shot her a sly look. \"But I suppose you already knew.\"\n\n\nShivers were running up her spine. Not the cold-and-scared shiver, but the barely-controlled-anger kind. \"Ren. I don\u0027t know what you\u0027re problem is. Who did you lose? Who did you lose in this war?\"\n\n\nLooking uncomfortable, Ren cleared his throat. \"I\u0027m just one of thousands. Millions, probably. What does it matter? Everyone lost someone. You clearly lost your family—father, stepmother, and half sister. All that. We\u0027re all the same. Everyone has a sad story to tell. I just don\u0027t feel for them anymore.\"\n\n\nThe first thing that came out of her mouth was, \"That\u0027s a horrible thing to say!\" Zhaoluo immediately gave herself a mental slap at being so rash.\n\n\n\"Can you say you feel for them? Did you feel for Huaxing?\" The look on her face must have told him enough. \"I thought so.\" He stood from the crate and began walking away. \"You understood it all too soon. But at least, now you won\u0027t feel to bad.\"\n\n\nShe still felt bad. Zhaoluo slowly lowered herself onto where Ren had sat. \"Bad\" was just a hollow, empty feeling.\n\n\n---\n\n\n\"We have to bury the boy.\"\n\n\nIt was the \"we\" part of the statement that made Zhaoluo snap, \"I know.\"\n\n\nRen rolled his eyes and planted his fists on his hips. \"You\u0027re the one who suggested it. No need to get so moody.\"\n\n\nThe two found Mr. Bates, who had just finished wrapping up the body, which kept chill in the winter air. Together, they brought the body to the burial site—it used to be a park or field—and began digging into the solid ground with shovels already there. Previous graves were marked with ashes, previously paper in place of incense, and small trinkets. There were no fruits; they couldn\u0027t afford it.\n\n\nZhaoluo\u0027s arms gave way quickly, as she wasn\u0027t used to menial work like digging, and Ren took her space easily, smirking at her incompetence. She wanted to growl at him. Instead, she nudged him out of the way and forced her aching arms to keep shoveling.\n\n\nIt was something about the place that kept them quiet. Individual graves in the middle of a pretty much conquered city was a luxury. Mr. Bates, right before he brought them to this morbid place, explained to them some of the reports he got on what\u0027s happening in the city. According to him, many of the captive citizens and soldiers were forced to dig graves for themselves. It was a saddening thought, but it sounded bland next to the burning. And killing contests.\n\n\nWhen they were finished digging, Mr. Bates and Ren—with a queasy look on his face—lowered the boy into the hole, his body stiff as if he had been preserved in the snow. They slowly filled up the spaces between the earth and the boy until there was a mound, inconspicuous among the others, before them. Mr. Bates, having already thought ahead, took out a piece of paper. Small script was scribbled on it, and it was messy enough that Zhaoluo couldn\u0027t read it. The idea startled her, as Mr. Bates would have practiced finer writing—who made these papers, and how many did the person make?\n\n\nUsing a lighter, he set a corner of the paper aflame and placed the paper in the center of the mound. They offered their prayers and wishes—she wished the boy a full, happy life that he would never get—and left.\n\n\nThe trio returned to the cramped camp, and the professor thanked them for their assistance. Ren nodded, and Zhaoluo simply smiled. Burials were dismal here—nobody had been there for the boy. His father had left several days ago.\n",
  "page 24": "There was a creaking sound in the dark. Somebody was walking outside. Zhaoluo froze in her bed, but then mentally slapped herself for being silly. It was probably her father. Just to make sure, she quietly slipped out of the bed she shared with Li and tiptoed to makeshift wall that separated them from the main room. She peeked over the wall, and there was her father.\n\n\nShe had been about to call out, but he looked hunched a bit, and he was carrying a pouch. He pinched something flour-like onto the table top and did the oddest thing—he leaned forward and sniffed at it. It was a soft sound. She was confused. Why was he... sniffing at the flour?\n\n\nZhaoluo didn\u0027t think it\u0027d be right to call out to her father now; she was mesmerized in this ritual. When her father stopped, she crept back to bed. As she slipped in, the blankets rustled, and all sounds from the adjoint room stopped.\n\n\nMore footfalls. A shadow loomed over her bed, and she pretended to be asleep, slowing her breath. The shadow stayed for a while before slipping away. She kept her eyes closed until she fell asleep.\n",
  "page 23": "Her father had told her to wait for him at the corner of the street. He had brought her along to carry some of the groceries and food. Somebody with a large, black overcoat needed to talk to him for a moment. She, slightly suspicious because of the other man\u0027s shrewd appearance, had followed her father with bags in hand to the small inlet of street where a few dingy houses stood.\n\n\nThread pouches were exchanged, and her father already made to walk away. Zhaoluo turned from her somewhat distant position and returned to the other street corner, noting the gradual buildup of human noise. She wished she lived in a quieter place in the city.\n\n\n\"Zhaoluo?\" Her father\u0027s voice made her snap out of her thoughts.\n\n\n\"Yes, Baba?\"\n\n\n\"Let\u0027s get home,\" he said—no pouch in sight.\n\n\n\"Father, who was that man?\" She looked at his shirt and pants, which lacked pockets, wondering where he could\u0027ve put that green and purple pouch.\n\n\nHer father\u0027s eyes flickered to the ground. His shoes. \"Just an old friend.\"\n",
  "page 26": "\"I\u0027ll go with you guys; after all, I did promise Huaxing that I\u0027ll keep her safe,\" Zhaoluo mumbled. What the hell was she getting herself into?\n\n\nBoyan raised one of this thick eyebrows; he had clearly not expected that. \"Are you sure?\"\n\n\nZhaoluo rolled her eyes at him. \"A moment ago, you were yelling at Ren for being a coward or whatever. Now you don\u0027t want me to go?\"\n\n\nYinshi interrupted, a hint of worry in his voice, \"You\u0027re a girl.\"\n\n\nAnd I could be raped. And brutalized. And whatnot. Zhaoluo bit her lip. \"I have nothing to lose.\"\n\n\n\"But your dignity and life,\" Yinshi added, leaning forward to look past MaiMai and Huaxing and at her.\n\n\n\"Look. What Boyan said is right. The Japs will probably get us some way or another. I don\u0027t want to die conceding the fact that I never got them back for it,\" she retorted and stood up. \"Boyan is right. Both of you are cowards.\"\n\n\n\"Why can\u0027t I go?\" MaiMai pipes up, trying to break the tension.\n\n\nEveryone turned to look at her, and it was Ren who answered, \"You\u0027re the youngest.\"\n\n\n\"I\u0027m twelve!\" she complained, looking as if that was the most reasonable explanation for her demand. Zhaoluo couldn\u0027t bring herself to look at the girl. She just seemed so much like Li—innocent, dark eyes and straight, to-the-brow bangs with short hair. Even her whining and the expression on her face.\n\n\n\"I know Yinshi and Ren would gladly keep you here,\" Boyan threatened. He looked deadly serious with his hand poised on a hip like that.\n\n\nMaiMai gave him an equally venomous glare, her brows making a V. \"What if I tell a grownup?\"\n\n\nYinshi interjected before Boyan could say something he\u0027d regret. \"If you do, Huaxing wouldn\u0027t forgive you. She\u0027s doing this for her family, city, and country.\" The soft look on the boy\u0027s face was convincing enough, and paired with Huaxing\u0027s pretty grin of assurance, MaiMai\u0027s face relaxed.\n\n\n\"Oh, all right,\" she muttered. \"But you better be coming back, or I\u0027ll never forgive you.\"\n\n\nBoyan, Huaxing, and Zhaoluo quieted, and the rest followed. The weight of the child\u0027s words sank into their minds as they lowered their heads. We may not be coming back.\n",
  "page 25": "Boyan stood before them, smiles and confidence and all. Zhaoluo didn\u0027t understand how he could remain so... so strong at times like these. Not empty. Not like Ren, not like her.\n\n\n\"I have a plan,\" Boyan repeated, having already told this to them before they converged at the base.\n\n\n\"And?\" Ren asked rudely.\n\n\nGlancing at the other boy, Boyan explained, though not loudly, \"The soldiers fought for the city, for us. What\u0027s to say we can\u0027t fight for ourselves?\"\n\n\n\"That\u0027s suicide.\"\n\n\n\"But what if we set up traps in the city that explode when triggered?\"\n\n\n\"Ammunition?\"\n\n\n\"There\u0027s gunpowder and some other stuff at my house,\" Huaxing murmured, cowering beneath the rapid fire of words.\n\n\nBoyan inclined his head toward her. \"Her father was a soldier.\"\n\n\nPain flashed across the girl\u0027s eyes before she added, \"I can take you guys there.\"\n\n\n\"Why weren\u0027t Zhaoluo, Yinshi, and I told this?\" Ren questioned, a look of hurt in his features.\n\n\n\"I\u0027m telling you now!\" Boyan snapped. \"You\u0027re pissy today.\"\n\n\n\"Can we just be nice?\" Huaxing whispered, letting MaiMai inch closer to her.\n\n\nZhaoluo nodded. \"I don\u0027t particularly like fools shouting loudly above me.\" The sun was golden today, and with Boyan towering over her, his silhouette was a looming shadow over them.\n\n\nHe ran a hand through his unclean hair, sighing his rage away. \"Alright. So what say you guys?\"\n\n\nYinshi spoke, and Zhaoluo was surprised. She had forgotten that he was there. \"I agree with Ren. It would be suicide to go back into the city. Have you seen those reports? Do you want to die painfully?\" He glanced at Huaxing. \"Would you want bad things to happen to the girls?\"\n\n\n\"That\u0027s why I\u0027m only suggesting that a few of us go,\" Boyan replied. \"Huaxing and me.\"\n\n\n\"That\u0027s ridiculous!\" Ren exclaimed, and Yinshi nodded. Their spectacles glinted in the golden light.\n\n\nZhaoluo squinted as sunlight hit her eyes when Boyan moved toward where Yinshi sat. The idea was pretty ridiculous and unlikely. They were just teenagers. Kids. Bored, empty, lost, hurt kids that probably saw too much.\n\n\n\"If the Japs plan to kill us all, we might as well die fighting,\" Boyan hissed, glaring at Ren.\n\n\n\"You sound like a stupid Jap yourself,\" retorted Ren. \"Escaping is a better idea. The military pretty much abandoned us anyway. Even the soldiers left behind here! Did you see them? They had tried to take the people\u0027s clothing off their backs to try to pretend like they\u0027re us! Because they didn\u0027t want to fight. They\u0027re cowards, and I don\u0027t see why we can\u0027t run like they did.\"\n\n\nBoyan snorted. \"And how do we escape? Nanking is a fortified city! There\u0027s walls! And the Japs probably blocked all the exits anyway. We\u0027d need official papers to get through those.\"\n\n\nRen sighed angrily. \"Do whatever you want. It\u0027s not like I actually have control over you.\"\n\n\n\"But you won\u0027t tell anyone.\"\n\n\nThe two shared a long, knowing look before Boyan broke away to return to the front. Zhaoluo\u0027s eyes followed him, frightened for his foolishness.\n\n\n\"MaiMai will not come with us. Ren clearly will not come with us. Who else will?\" Boyan\u0027s eyes shined with a dangerous light, looking at Yinshi doubtfully but with eyes on me.\n",
  "page 28": "With Huaxing in lead, they made their way across the road, a marker between the dismal refugee camp and the wrecked city. A blast of wind howled their way past them, and the hazy darkness sputtered against an intersecting street. Their eyes drank in their city. Behind the cover of dispersing shadows was a wreckage of buildings. Houses. Apartments. Schools. Places that nobody should be allowed to destroy. Beams, planks, and bricks littered the streets. Structures were toppled from the bombs that blew off their roofs and ripped off their walls.\n\n\nIt was morbid. The rubble of some of the houses lay across the street, and they had to pick their way through the debris, eyes pricked by dust and limbs bruised by one extraneous or another. In the distance, behind a cloud of grey, a mute fire was burning.\n\n\nZhaoluo’s foot landed on something… sticky. It sucked on her shoes, making quiet noises, and she looked down. And stifled a shriek. Something dark glistened. She paused her walking, and Boyan turned back to look at her. Following her gaze, he spotted the dark spot on the ground. She looked around for the source of the blood and found it under a small roof of wood. A single spear of metal was driven through the body.\n\n\nBoyan stopped Huaxing, who looked back at her. Boyan gently pulled her away from the scene, softly whispering, “Quickly…”\n\n\nShe suddenly felt exposed, even in the darkness. The air was saturated with tension, and there was a whispering in the trembling wind. A loud bang sounded, and the three refugees scrambled to hide, tripping up on the scattered rubble, daring not to make a noise. The gunfire was followed by more shots, each bringing their own wave of fear. There was shouting and screaming, though muffled, but it seemed farther in the city.\n\n\nRealizing this, they squirmed out of their individual hiding places beneath some pile of debris or another, scraping against bits of metal and splintered wood. Zhaoluo met Boyan’s eyes, seeing a reflection of alertness and fear. He gestured for us to continue, and Huaxing led them down a discreet but winding path. Zhaoluo breathed a sigh of relief as they were led farther from the sounds of fire, guns, and shouts.\n\n\nIt wasn’t long before the group arrived at a small house—a single house, not some apartment buildings or shared homes. The small house still stood standing, but as they padded closer to the box-like structure, Zhaoluo could pick up huffing noises and quiet talking. It was coming from inside the house. She turned to Huaxing, who mouthed something that was likely unpleasant.\n\n\nBoyan pointed to ruined shop across the street, and the girls followed him. They squatted behind a broken counter, likely removed forcefully from the store, and Boyan leaned in toward them. “We can’t get in there. There are enemy soldiers in there.”\n\n\n“There has to be a way.” Zhaoluo sounded desperate, even to herself. She did not just step into a drying puddle of blood and trek through Nanking for nothing.\n\n\nHuaxing shook her head, though Zhaoluo could barely see her expression under the shadow of the counter. “There is no other way into the building except the backdoor and the windows, and we’d still be caught.”\n\n\nSomething crackled around them, and they froze, shutting up.\n\n\n\"Dete kite dokoni ite mo detekuru,\" came a harsh, and surprisingly young, voice. “Watashi wa anata ga kikoeru.”\n\n\nA rush of fear and a pounding heart were Zhaoluo\u0027s only movements. She dare not breathe.\n\n\nA shadow was getting closer, and they were crouching behind the counter, knowing that they\u0027d be found. Huaxing and Boyan exchanged scared looks, and Zhaoluo hoped that the soldier didn\u0027t find them and kill them. Or worse.\n",
  "page 27": "When the group dispersed, Zhaoluo made her way to Boyan and Huaxing, the masterminds of this plot. They looked powerful standing together—sharp, beautiful, and assured. Huaxing especially seemed to have discarded the sorrowful face Zhaoluo had witnessed before. In the waning sunlight, their height created demon-like shadows on the dirt, stone, and wood.\n\n\nShe went to stand beside them, and it was as if the circle was complete. Just standing there beside these two vivid survivors was enough to make her smile faintly.\n\n\n\"We will be leaving to gather the gunpowder tonight, when everyone is asleep and the sky is dark,\" Boyan began with a whisper. \"We only bring ourselves and a knife. Here.\" Boyan reached into the pockets of his pants and pulled out two kitchen knives. \"I helped out in the kitchen,\" he explained and handed one to us. \"I had only planned on two of us, but I\u0027ll have to get another one.\"\n\n\n\"What\u0027s the knife for...? I thought we were just going to get to my house and back,\" Huaxing asked, slipping the somewhat sharp knife into her coat pocket. Then her mouth fell open and her eyes widened as the realization dawned upon her.\n\n\nBoyan answered anyway. \"In case we\u0027re caught and not immediately shot, we\u0027re going...\" He sighed and raked his hair, eyes lowering.\n\n\n\"Oh,\" was her only response.\n\n\nSomething in Zhaoluo\u0027s guts began to squirm, and an uncomfortable sensation rose to her chest as the full impact of the idea hit her. She didn\u0027t truly know to what extent she could or would push herself to with the threat of pain, and she didn\u0027t want to find out.\n\n\n\"Tonight. I will get another knife, and we will leave. Huaxing will immediately take us to her house, which isn\u0027t too far away. We should be back by breakfast. Nobody will know we were gone.\"  They had everything planned out. Almost everything. Otherwise they wouldn\u0027t need the weapons. \"Hey.\" Boyan placed a hand on each of our arms and made eye contact with us both in turn. \"We will be back. I will not let MaiMai, Yinshi, and Ren lose another person they know. Do you understand?\"\n\n\nHuaxing nodded slowly, and Zhaoluo fixed a determined gaze on him. \"We got this.\"\n\n\n---\n\n\nZhaoluo slipped out of her building. The stairs were a pain to get up and down with cracking a sound. Another obstacle was one of the women—the high-nosed lady—who rolled into her path, layering her thin arm over Zhaoluo\u0027s slippered foot. The woman\u0027s hand proceeded to land on someone\u0027s bare foot, and the man shifted. This building was crowded, and Zhaoluo was glad she was in the quieter, less crowded upper floor.\n\n\nShe quietly shut the door behind her and turned left—toward the fences, but in a discreet corner made by the fence (at some point, upgraded since last time) and the house. The lonely, cold scene was only interrupted by small lights placed throughout the camp, encircling it and giving the barest glow.\n\n\nShe was the first one there, so she quietly sat down on the dirt and propped her head against the house\u0027s wooden flank. Her eyes trailed to the dark sky, the tiny stars little holes of light. Like a passageway to... something. Before, she used to take nature for granted, as it was always there no matter what humans endeavored. Now, it was still the only thing here standing after this horrible series of punishments on the Chinese, her people.\n\n\nZhaoluo couldn\u0027t understand why the Japanese wanted China so badly. Why they wanted so much of China so badly. Resources? Weren\u0027t the other nations and places they conquered enough? Why take over all of China? Supplies and troops would be badly spread to manage such a task. They could better spend their time and resources on other things that would better benefit their nation.\n\n\nA pattering of light footsteps sounded, and Zhaoluo tensed. As the footsteps drew nearer, she pushed herself against the wall and tried to stay in the dark—just in case. Luckily, it was Boyan\u0027s face that popped into view, and he settled into a spot beside her, crossing his legs and peeking over the wall.\n\n\n\"You\u0027re first here?\" The question was just a rush of wind, and Zhaoluo nodded as Boyan turned to her. It was difficult to see his features, but she could see his blurry outline. \"Alright. Huaxing should be hear soon.\" There wasn\u0027t a single touch of fear in his voice.\n\n\nZhaoluo leaned back against the wall, a placid expression on her face.\n\n\n\"You scared?\" Boyan asked.\n\n\n\"Very.\"\n\n\nHe sighed. \"We\u0027d be fools if we weren\u0027t. The Japanese have better weapons than us. It\u0027s kind of unfair. They have this puny island, and we have a big chunk of Asia.\"\n\n\nShe chuckled. \"It\u0027s mostly mountains.\"\n\n\n\"Yeah, well...\" Boyan muttered bitterly. \"We should be better. I don\u0027t know why we\u0027re still like this.\"\n\n\nSaving her from a response, Huaxing padded into the inlet. Boyan and Zhaoluo, having not heard her previously, jumped at her sudden appearance.\n\n\n\"You scared me!\" Zhaoluo hissed, though not unpleasantly.\n\n\nHuaxing grinned as she before them. \"Hey, hey. I was practicing being quiet.\"\n\n\nZhaoluo rolled her eyes though none of them could clearly see. \"Whatever. Let\u0027s go. I want to be back as soon as possible.\"\n\n\nThe trio climbed over the fence-wall-thing.\n",
  "page 20": "A dreary light filtered through the windows, and Zhaoluo blinked up at it.\n\n\nShe was so tired.\n\n\nHer body was sore, and her head and heart ached. She stared at the ceiling.\n\n\nWhat the Japanese did in Shanghai, right before they came here, was nothing compared to this. Let there be arson, let there be theft and death... but rape, destruction, and humiliation? The humiliation. They can break them physically, but if the Japanese broke them psychologically, they were goners. There would be no fighting back. This house, this camp, the International Safe Zone—it meant that there was hope.\n\n\nShe didn\u0027t know how long she lay there, but lunch was being called, so she followed the other people outside to where food was being passed out. She was stuck inside her head, which somehow blanked overnight. Miner helped keep track of the food, which consisted of water, potatoes, and salt.\n\n\nWhen she took a bowl of it, Miner said, \"I\u0027m here to talk to if you ever need it.\"\n\n\nZhaoluo blinked at him and walked away. She found some secluded corner to force down the potato soup and gaze at the dirt. Dinner worked pretty much the same way, and by the time it was dark and she was in the small pile of blankets, she hadn\u0027t spoken a word.\n\n\nShe still had not spoken several days later, even when more people entered this camp in a frenzy. She shut herself out from their tears and cries, and she felt almost peaceful. They escaped as families, these people. How lucky they are. They still have somebody. She had nobody.\n\n\nOne afternoon, a shadow fell over her as she set down the small bowl of bland food. Zhaoluo sighed quietly as she looked up and squinted. Another refugee. About seventeen.\n\n\n\"Do you want to join us?\" he asked.\n\n\nShe looked past the kid to a small group of teenagers gazing at her. A few were smiling or waving. How could they smile? Zhaoluo returned her eyes to the boy, who had a nice head of hair. \"Who are you.\" A demand, not a question.\n\n\n\"Boyan,\" he replied, sticking his hand out.\n\n\nHer eyes were empty when she took the hand, intending to shake it or something. Boyan, however, pulled her up. \"Come with me.\"\n\n\nShe did. She dragged herself across the sad camp toward him and his group, and when they finally stopped, she said, \"Hi.\" They didn\u0027t seem to be in better shape than herself, and she wondered why they were even hanging around here.\n\n\nBoyan presented her to them. \"Guys, this is Zhaoluo. Zhaoluo, these are MaiMai, Huaxing, Ren, and Yinshi.\" He pointed to each person in turn, and her eye\u0027s rested on MaiMai, who looked only twelve. She was small enough that she could\u0027ve been Li.\n\n\nThey all respectfully said, \"Hello.\"\n\n\nHuaxing was delicate-looking and very pretty. She was probably at least Zhaoluo\u0027s age. Ren had spectacles but looked athletic enough that Zhaoluo guessed he wasn\u0027t some library-dwelling scholar apprentice or something. Yinshi was the scrawny one with robes on—probably used to be part of a convent.\n\n\nThey looked interesting enough.\n\n\nBoyan began to speak, and Zhaoluo couldn\u0027t help but listen. \"We\u0027re all orphans.\"\n\n\nShe sucked in a breath. Of the things she\u0027d think they\u0027d say, that wasn\u0027t one of them. Of course that\u0027d be part of war. Children get separated. But all she could squeak out was, \"What?\"\n\n\nMaiMai got up from the wooden crate she was sitting on and said, \"My parents didn\u0027t have enough money or supplies to bring me, so they ran away with my older brother. I lived nearby, and Mr. Bates found me outside and brought me here.\" Her eyes looked watery.\n\n\nZhaoluo blinked at her. That wasn\u0027t right. How could her family not make room for the child? She looked so much like Li. Zhaoluo sighed to get rid of the heavy feeling settling in her chest. Not feeling was better than crying right now.\n\n\nYinshi nodded at her before mumbling, \"Father Youcai brought me here and took the Sisters to another camp. I think he\u0027s somewhere in this area, but I haven\u0027t seen him.\"\n\n\n\"When did you arrive here?\" Zhaoluo asked.\n\n\n\"A month ago.\"\n\n\n\"You\u0027ve been here for a month?\" She gaped at him. \"What about the rest of you?\"\n\n\nThey answered quietly, and the times ranged from a week to a month ago.\n\n\n\"How do you guys handle it? Losing your family?\" She swallowed as a lump formed in her throat. Her voice cracked at she said, \"They were all I h-had left.\"\n\n\nThe five young survivors looked at her sadly. \"We have each other, at least.\"\n\n\nSomething loud sounded from nearby—a cry of pain and fear.\n",
  "page 0": "\"What are we going to do?\" A frantic emotion was surging through her. She can\u0027t have the baby now! They weren\u0027t in the camp yet. They weren\u0027t ready!\n\n\nZhaoluo\u0027s stepmother, who was lying on the floor with a small cloak as her blanket, breathed heavily in the dark. She looked downward toward the wet spot on the cloak and floor. This was very bad.\n\n\n\"Wake up your father.\" A shudder passed through her stepmother as she closed her eyes. Her pale skin was shiny, and it\u0027s a wonder how the other two haven\u0027t woken up from the breathing.\n\n\nZhaoluo rushed over to where her father slept and shook him awake. \"Baba!\"\n\n\nHe grumbled something and squinted at her. \"What is it?\" At that moment, he seemed to register the noise coming from his wife and lurched up. Zhaoluo hadn\u0027t even sat up before her father was by his wife\u0027s side.\n\n\n\"Tanla!\" her father was almost yelling, but all Zhaoluo could think of was the loud gunshots she heard this morning and her stepmother\u0027s name.\n\n\n\"Lisong...\" From the way they were acting, it was as if her stepmother would die at any moment.\n\n\nZhaoluo stood up, and with a shaky voice, said, \"We have to get help. I don\u0027t know how to carry a baby!\"\n\n\nFather nodded as if her words hadn\u0027t just snapped him out of his frenzy. \"Can you find your way to the Committee?\"\n",
  "page 33": "The moment she blinked her eyes open, she stood up from the badly-washed blankets and looked down at herself. The light of day revealed blood on her hands and shirt. Dirt, an ugly color of dried dung, clung to her shirt. She pondered for a moment on what she was going to do about it, but Mr. Bates decided that for her.\n\n\nHe appeared at the stairs, looking around at the empty room (many people were downstairs or outside), and glanced at her attire before focusing on her face. \"Zhaoluo...\"\n\n\nShe tensed, freezing up like a little kid caught red-handed in a devious act. She was basically red-handed at this point.\n\n\n\"Is there something you\u0027d like to explain?\" He glanced pointedly at her hands and shirt. \"I don\u0027t have time to be reprimanding children. There are not two dozen of us trying to take care of half the Nanking population! I can\u0027t keep track of all of you.\"\n\n\nZhaoluo, needing to tell someone, spilled the whole act—not mentioning their initial intentions and the gun in their possessions, of course. She often used hand gestures, ignoring the coating on them, to better show how things happened, but she just couldn\u0027t reproduce the experience. It didn\u0027t seem right.\n\n\nMr. Bates followed along, sighing, but not interjecting. Finally, when she was finished, he said with a disappointed tone, \"Do not ever leave again. There are horrible things they can do to you.\"\n\n\n\"I know.\"\n\n\n\"And Boyan and Huaxing—they were so stupid! How could they just plan this? How could you agree to this? Who else knew about this?\" He was furious; she could tell by the flushed throat and cheeks and felt a little bad for the man.\n\n\n\"Is... Huaxing okay?\" Zhaoluo asked, worried. She hadn\u0027t heard from the other two yet.\n\n\n\"She has a very dangerous wound, considering our conditions. I\u0027m mostly worried about infection. If she gets ill, I don\u0027t think she\u0027d make it.\"\n\n\n\"And Boyan?\"\n\n\n\"He\u0027s distressed.\"\n\n\nHe hadn\u0027t seemed distressed at all last night, but she supposed that after he thought about the situation, it seemed... very bad. \"Can I see them?\"\n\n\nMr. Bates gazed at her, something like mistrust in the tilt of his head, and assented. \"I can\u0027t stop you.\"\n\n\n---\n\n\nThe infirmary was a small, squat building with a few windows letting the grey light in. And it was packed. Every bed, there was someone coughing or moaning or dying on it. There even lay sheets on the floor with people placed on top. Zhaoluo, thankful that Huaxing was placed closer to the door, walked over to her. Boyan was sitting on the bed, staring intently at what seemed to be air.\n\n\n\"Boyan.\"\n\n\nHis name must\u0027ve knocked some sense into Boyan. His head jerked, and she saw a faraway look fading from his eyes. \"About time.\"\n\n\nIgnoring his remark, she sat down on the opposite side, propping herself up with one arm. \"How is she?\"\n\n\n\"She\u0027ll be fine.\" Boyan swallowed, and she had a suspicion that he was only trying to comfort himself.\n\n\nHuaxing\u0027s upper arm was wrapped with fresh cloth, and her hair was pulled up and away from her face. Sweat beaded at her throat. She was pale and shivering.\n\n\n\"I hope so.\"\n\n\n\"Make way!\" Someone at the door shouted, and any visitors scurried out of Dr. Wilson\u0027s way. He was supporting a woman with her shirt torn open, soaked bandages snug around her waist.\n\n\nTo her surprise, the doctor approached them. \"I\u0027m going to need this spot for Goxen.\"\n\n\nBoyan stiffened, and almost glaring at Dr. Wilson, he nodded.\n\n\nZhaoluo could see why the doctor would ask for Huaxing\u0027s spot... but wouldn\u0027t switching patients just like that be... dangerous? But Boyan was already moving Huaxing off the bed. Zhaoluo quickly moved around the bed to assist, and Dr. Wilson set the woman down.\n\n\nSome random person—that high-nosed lady—handed them a sheet to lay Huaxing on, and they did so with extreme care for her arm. Boyan muttered to her, \"The woman\u0027s going to die anyway. What\u0027s the point in trying? It was just like that little boy.\"\n\n\n\"They have to show them they\u0027re trying. That not all people are cruel and mean.\" Zhaoluo wasn\u0027t appalled by his behavior—she agreed. Realistically, the woman\u0027s chances of living were close to nothing. But Westerners were Westerners. At least they helped.\n\n\nAs Huaxing finally settled into her new spot with closed eyes, yelling sounds erupted outside. Zhaoluo froze when she heard the familiar sounds of Japanese soldiers.\n\n\n \"What? How is this possible?\" Zhaoluo hissed as Boyan stood up and looked out the opened door. She turned her head too, along with many of the patients and visitors. Dr. Wilson muttered something under his breath.\n\n\n\"The Japanese... have entered the safe zone...\" Boyan\u0027s voice trailed off as he looked, almost in awe, of the enemy.\n\n\nThe Japanese carried guns, but they weren\u0027t pointing it at anyone . They shouted something in Japanese, and then in Chinese.\n\n\n\"Where is John Rabe?\" The voice of the officer blasted through the camp, and for a moment, nobody did anything.\n\n\nThen the refugees exploded into action. They ran from the Japanese officers and soldiers, screaming and pushing at each other, knocking over crates and rattling the tiny lights. To Zhaoluo\u0027s horror, the Japanese gave chase.\n\n\nThe patients were yelling and crying. Some of the visitors fled while others helped their sick and wounded family and friends stumble out of the makeshift beds. Boyan, too, picked Huaxing up and into his arms. The door was so congested as the bodies tried to squirm and squeeze through the door. Zhaoluo looked around for Dr. Wilson, but he\u0027s disappeared in the mess.\n\n\nBoyan shoved his way through the other people, Huaxing grunting and crying out whenever someone rammed an extra elbow into her arm. Goxen, the wounded woman that Dr. Wilson had brought in earlier, was limping toward the door with nobody helping her. The doctor seemed to have wrapped new bandages around her already, but she pressed a hand against her abdomen anyway. Her chest heaved with effort and sweat coated her forehead. Blood was already dirtying the white bandages, and she was nowhere near the door.\n\n\nThere were a few loose gunshots, and Zhaoluo cowered at the sound. There were so many people here, and everything smelled of sickness and terror and blood; she hated it. She looked around fervently. She had to get out of here. Out of this place. Too much crying, too much yelling.\n",
  "page 32": "\"KINMOTO!\" The soldier ran to his friend\u0027s prostrate position on the ground, dropping his weapon in the process. Kneeling beside his already dead comrade, Hidesada checked the vitals, finding a bullet wound to the heart. \"WHO DID THIS?\" he roared.\n\n\nSome of his squad moved to take the body away, while the others tried to comfort and calm him.\n\n\nKinmoto\u0027s death didn\u0027t make sense at all. The Chinese military forces in Nanking should have been wiped out, yet someone has a weapon and managed to shoot a Japanese soldier, better armed and equipped.\n\n\n\"Someone took his gun.\"\n\n\n\"I think we got on injured there\u0027s a trail here.\"\n\n\n\"Who could\u0027ve done this?\"\n\n\nHidesada heard their squad leader order to some guy or another, \"Follow the trail. Kill any Chinese in sight.\"\n\n\n\"Hidesada...\" The squad leader had walked to the body and was speaking in a pained voice. \"Look. Casualties happen in war. Kinmoto\u0027s dead—\"\n\n\nHidesada\u0027s mind blanked at that. All of the people he knew here were dead. They weren\u0027t coming back. He felt sick to his stomach. That was war. It took people from you.\n",
  "page 35": "Many refugees had fled and not come back, but Zhaoluo, Boyan, and Huaxing returned. After seeing Goxen off, they went to search for MaiMai, Yinshi and Ren. They hadn\u0027t seem them all day except in the early morning after Boyan returned. The air was tainted with the urgent fear of the kidnapping, and despite Mr. Bates trying his best in helping calm people down and demanding the return of the girls, nothing worked.\n\n\nAfter about twenty minutes of searching, Boyan gave up and sat on one of the crates. If they couldn\u0027t find the other two, then MaiMai, Yinshi and Ren just have to find them. Huaxing was delivered by Boyan to the infirmary, where she lay on a sheet on the ground. It was just Boyan and Zhaoluo sitting there.\n\n\n\"Where\u0027s the gun?\" Boyan asked suddenly.\n\n\n\"I hid it.\"\n\n\nHe nodded, expression darkening. \"You know what they\u0027re going to do with those poor girls.\"\n\n\n\"Yes.\"\n\n\n\"They need to be taught a lesson!\" Boyan hissed, slamming a first against the wood. \"They can\u0027t just happily walk around this city slaughtering people. That\u0027s wrong.\"\n\n\n\"Are you planning to shoot someone? Kill someone?\" Zhaoluo asked, very direct with it.\n\n\n\"No.\" Boyan fixed those dark eyes on her. \"I plan to bomb them.\"\n\n\n\"You what?\" Zhaoluo hissed. \"Where are you going to get a bomb?\"\n\n\n\"I know someone able to make explosives from guns and stuff.\" Boyan smiled faintly as if that was a good thing. In a way, it was.\n\n\n\"And is he willing to do it for us?\"\n\n\n\"It\u0027s a she.\"\n\n\n---\n\n\nThe lady with the high nose and sharp features seemed to glare down on them despite being in a lower position. Yinshi and Ren, with MaiMai trailing fearfully along, had found them, and after a few moments of reuniting, Boyan told them their plans. That led them here.\n\n\nIn her own little corner of the camp (near the infirmary), the lady was sewing. Of all things she was sewing. Zhaoluo supposed that it had its uses, as there was a bin of washed, but tattered, clothing beside her.\n\n\n\"Mrs. Lu,\" Boyan greeted, dipping his head toward the hunched over woman. \"I have a request.\"\n\n\nMrs. Lu looked at each of them in turn. Yinshi was looking at the needle in her hands with wide eyes—like he\u0027s never seen a sewing needle before. Ren was fidgeting and uncomfortable; he opposed the plan wholly. MaiMai was smiling at the woman, seeing something that the others did not. Then onto Zhaoluo, who was studying the stitches of the clothes with appreciation. Her eyes fixed on Boyan. \"What.\"\n\n\n\"You told me before you knew how to make explosives from guns.\"\n\n\n\"So?\"\n\n\n\"We would like you do that for us.\"\n\n\n\"Why?\" Mrs. Lu was actually considering it. That\u0027s something Zhaoluo did not expect.\n\n\n\"We want to get back at the Japanese soldiers for what they did.\"\n\n\n\"Don\u0027t we all.\" She returned to sewing.\n\n\nBoyan crossed his arms. \"Mrs. Lu...\"\n\n\nShe glared at Boyan. \"Leave the gun under my blankets.\"\n\n\n---\n\n\nZhaoluo tiptoed toward Mrs. Lu\u0027s spot in the house, feeling very exposed with the heavy gun in her hands. She lifted the edge of the blanket, wincing as the gun scraped against the floor. Her eyes flicked around the room. Nobody was awake.\n\n\nHaving finished her job, Zhaoluo returned to the staircase and looked back. Mrs. Lu had rolled over the gun, almost protectively. She smiled to herself and sneaked back upstairs.\n",
  "page 34": "Zhaoluo made her way over to the woman and helped support her as they walked. Goxen mumbled a \"thank you\", but the clamor drowned out her voice.\n\n\nA high-pitched scream sounded by the door—oh, they were so close to the door—and enough people had already fled that Zhaoluo could see a Japanese soldier grabbing a girl, one of the visitors. She was crying, but nobody was there to help her. Whoever she visited left her.\n\n\nZhaoluo turned her head away from the soldier as she and Goxen passed the door at last. She was so, so scared of being harmed. The soldier, however, was too busy wrenching the girl away. She was crying, \"Save me!\" But nobody did.\n\n\nZhaoluo was speed walking, unable to run because of the woman beside her. Everybody was streaming further into the safe zone through the narrow and wide roads between buildings.\n\n\nAs Zhaoluo, too, made her way toward the roads, she looked back. The Japanese were kidnapping the girls. Dr. Wilson and Mr. Bates finally showed their faces, shouting at the Japanese but powerless to stop them. The gate and parts of the fence were broken, and the Japanese left the same way they came in, except now they have a dozen or so captives.\n",
  "page 37": "The Japanese had already done so much damage to them. What were they going to do? Sit around like ducks waiting to be shot? Even if they don\u0027t really make a real impact, they\u0027re doing something besides cowering and letting the Japanese kill and kidnap them all. They\u0027re not... just sitting there like those other refugees, eyes either blank with emptiness or horror or static from free. Those people were not standing up to the enemy the cruel, evil enemy. They just trembled at their seats, praying for the war to stop or to at least die a quick death. Their dirty shoes tapped on the ground slowly, as if they were counting the seconds and minutes and days passing.\n\n\nThe Japanese had been taking more girls and women.They simply became more subtle and discreet. Mr Bates even drove through the patched up gates to beg the Japanese commander to return the stolen girls, bu they refused. He came back limping and with a few bruises; he had been shoved down the stairs. That\u0027s when Zhaoluo realized, knew for sure, just how powerless the Committee was. How even in the safe zone, they weren\u0027t safe.\n\n\nSure, the Japanese promised not to enter the area outside of delegations, but how could fifteen people enforce it? They had no power against the Japanese except being neutral—the Japanese simply could not hurt them. But they could hurt the refugees, especially if nobody was there to stand in front of the way.\n\n\nIt was a painful realization.\n\n\n---\n\n\nZhaoluo led the way through the city. They had gotten used to the debris and glass after a few trips through the empty, red streets to steal more guns (with cost them several minor injuries). Every building had a unique destruction ridden upon it. Shattered windows, blood soaked floors, toppled roofs. The three, sometimes Ren would join them, would pick their way through the remnants of homes, some burnt to the ground with a smell of something foul emanating through the cracks between the stones and ashes. They had burned them alive.\n\n\nAs Zhaoluo passed the house, she swore she sensed the screams echoing through the air, begging, \"Help me! Save me!\" The whine of nails scratching and fists pounding against the walls...\n\n\nShe could hear the malevolent barking of the enemy as they shot and stabbed. The laughter and jeer as they counted each person, each human, that fell to their weapons and into the Yangtze. A mass grave dug by the hands of Nanking and filled with those same hands. The theft and arson and rape. The forced incest of LiLi and her father—the image seared into her head. The pale, pale flesh tainted by blood, mutilated.\n\n\nThis was why Zhaoluo lit the bomb.\n",
  "page 36": "Zhaoluo and the others were nervously counting down their days, on edge in fear of another kidnapping. Needing those explosives to calm their minds. Boyan had insisted on planting an explosive in a Japanese camp, but those were too far away and subject to change frequently. Making them trigger traps were out of the question because they didn\u0027t want to accidently kill anyone innocent. So, they thought they could just use them as grenades or something.\n\n\n\"It depends on how they turn out,\" Boyan had said.\n\n\nMrs. Lu finally approaced Zhaoluo four days later, handing her the bag that must\u0027ve contained said explosives. She told them that it was hard retrieving other supplies, and when they asked how she even got \"other supplies\", Mrs. Lu simply stated that she isn\u0027t the only person in the safe zone who knew how to make bombs or shoot people. Zhaoluo wasn\u0027t sure if she knew that she herself killed a Japanese soldier, Kinmoto, wasn\u0027t it, a several days prior.\n\n\nThat night, with the sky creeping into darkness, Boyan and Zhaoluo again met by the little corner by the fence. Only to see someone already there—Ren.\n\n\n\"Ren?\" Zhaolou hissed, crouching slightly. For what reason? She didn\u0027t know. Perhaps to defend herself from a stranger?\n\n\n\"Yeah, that\u0027s me,\" came Ren\u0027s voice.\n\n\nBoyan came closer to him and dropped to Ren\u0027s eye level, Ren being just a blotch of shadow under the stars. \"Why the hell are you here?\"\n\n\nRen\u0027s seemed to look at her for a moment, and she bristled. \"With Huaxing out, I thought you might need another person.\"\n\n\n\"You of all people,\" muttered Boyan, but he did not object. It was always nice to have another friend tagging along.\n\n\n\"Do you have the explosives?\" Ren asked, glancing at the bag in Zhaoluo\u0027s hands.\n\n\n\"Yes.\"\n\n\n\"Alright, what are you waiting for?\"\n\n\n---\n\n\nThe plan was simple but dangerous. All they had to do was plant a bomb inside the buildings where the Japanese were sleeping and relaxing and doing whatever they\u0027re doing. If there are captives in the building... That question hadn\u0027t been answered yet. They didn\u0027t know what to do. Captives suffered at Japanese hands, so would ending them be a kinder move? Or not killing them, but keeping them alive to suffer?\n\n\nLogically, Boyan said that they should just blow all of them up. What was the problem with that? They themselves probably wanted to die. Emotionally, Zhaoluo didn\u0027t think she could... do that again. And Ren, well, he didn\u0027t say anything. He just said, \"Whatever.\"\n\n\nIt was difficult finding more Japanese soldiers. For some reason, they had a knack for finding you and running off when you try finding them. Eventually, however, the sounds of banter and laughter attracted the group to a small shop similar to the one Zhaoluo had slept in the days preceding the... invasion. A small yellow light illuminated a square of street on the outside.\n\n\nThey crouched silently behind a pile of rubble that used to be a building of some sort, their feet pressing into ashes of burned wood. The Japanese\u0027s shouts were horrendous and rough as they laughed like monkeys at something. Probably someone.\n\n\nZhaoluo closed her eyes and tried to shut the sound out, wondering why the hell she agreed to go out into the city again after telling Mr. Bates they wouldn\u0027t do something stupid again. Boyan simply took a small explosive—it looked like a can with strings around it—and walked toward the building, wary of the glass on the ground that could prove fatal to them all. He proceeded to light the explosive with matches he must\u0027ve found somewhere (who knows where) and dashing away from the building. Just in time, Boyan reached their pile of rubble, leaping behind it. Red and orange flames erupted on the building, sections of the wall blew off, and the screaming started.\n\n\nThe Japanese soldiers could be seen as dark outlines in the building; their clothes must\u0027ve caught fire, according to the loudness of their screeches. Even from their position, they could feel heat pulsing from the bits and pieces of the store that caught fire.\n\n\nAnd then they started to run. Boyan had a bag, and he was like a streak in the dark. A spy, a secret soldier. Calling down vengeance on them all.\n\n\n---\n\n\nBoyan had used up all four explosives by the time they returned to the safe zone. Zhaoluo was stiff, and she didn\u0027t say anything as Ren took her arm and led her back. She blankly returned to her bed with an odd thought: Why wasn\u0027t the door locked?\n\n\nShe didn\u0027t feel any better than before. It was still the same. When she first arrived and now. Like her body was hollow and emotions simply dwindled away to nothing. How could she feel after that? There was no success in that. How Boyan maintained a calm visage was beyond her comprehension. The entire time, his lips had been pressed into a straight line as the explosion flashed before their eyes. She even received a few outside bruises and scratches from the fragments of wood or metal flinging themselves at them.\n\n\nWar wasn\u0027t fair. She hated it. She wished it were over. There is no winning here. There is no revenge. It was all just death and pain. Why can\u0027t anyone recognize that? Why can\u0027t the stupid governments of the world realize that? It\u0027s not worth it. War is not worth the loss of your innocence and dignity.\n",
  "page 39": "The Japanese had already done so much damage to them. What were they going to do? Sit around like ducks waiting to be shot? Even if they don\u0027t really make a real impact, they\u0027re doing something besides cowering and letting the Japanese kill and kidnap them all. They\u0027re not... just sitting there like those other refugees, eyes either blank with emptiness or horror or static from free. Those people were not standing up to the enemy the cruel, evil enemy. They just trembled at their seats, praying for the war to stop or to at least die a quick death. Their dirty shoes tapped on the ground slowly, as if they were counting the seconds and minutes and days passing.\n\n\nThe Japanese had been taking more girls and women.They simply became more subtle and discreet. Mr Bates even drove through the patched up gates to beg the Japanese commander to return the stolen girls, bu they refused. He came back limping and with a few bruises; he had been shoved down the stairs. That\u0027s when Zhaoluo realized, knew for sure, just how powerless the Committee was. How even in the safe zone, they weren\u0027t safe.\n\n\nSure, the Japanese promised not to enter the area outside of delegations, but how could fifteen people enforce it? They had no power against the Japanese except being neutral—the Japanese simply could not hurt them. But they could hurt the refugees, especially if nobody was there to stand in front of the way.\n\n\nIt was a painful realization.\n\n\n---\n\n\nZhaoluo led the way through the city. They had gotten used to the debris and glass after a few trips through the empty, red streets to steal more guns (with cost them several minor injuries). Every building had a unique destruction ridden upon it. Shattered windows, blood soaked floors, toppled roofs. The three, sometimes Ren would join them, would pick their way through the remnants of homes, some burnt to the ground with a smell of something foul emanating through the cracks between the stones and ashes. They had burned them alive.\n\n\nAs Zhaoluo passed the house, she swore she sensed the screams echoing through the air, begging, \"Help me! Save me!\" The whine of nails scratching and fists pounding against the walls...\n\n\nShe could hear the malevolent barking of the enemy as they shot and stabbed. The laughter and jeer as they counted each person, each human, that fell to their weapons and into the Yangtze. A mass grave dug by the hands of Nanking and filled with those same hands. The theft and arson and rape. The forced incest of LiLi and her father—the image seared into her head. The pale, pale flesh tainted by blood, mutilated.\n\n\nThis was why Zhaoluo lit the bomb.\n",
  "page 38": "The Japanese pulled out of Nanking. It was spring, and the refugees were no longer trapped. They trudged to their homes in silence only to break down with tears upon the sight of their homes. They looked at the streets, caked with red, with the same horror Zhaoluo felt when she first entered the city and realized her family\u0027s end. Or set off those bombs. Their bodies trembled, grey and grail, from loss, addiction, and disbelief.\n\n\nThe government did not return, but people did. And so they began to rebuild Nanking.\n",
  "page 31": "Boyan looked at her with a baffled expression, but he nodded and left with Huaxing, who was breathing hard against him.\n\n\nZhaoluo stood for a moment, contemplating. She wasn\u0027t sure if she could trust the guy. He told her to shoot someone, and he was very calm about Huaxing\u0027s injury. Those had been logical actions at the time, but... Boyan... He did kick the gun from the soldier—Kinmoto—in such a way that it shot Huaxing. Zhaoluo knew that he wouldn\u0027t do something like that on purpose, but he was so fearless and confident. He took down a soldier without hesitation and was going to try and strangle him if she didn\u0027t do anything.\n\n\nShe knew it was logical, but it was also dangerous.\n\n\nHer hands smoothed down her shirt, which had new tears and dirt on it. Looking up, Zhaoluo blinked at the stars, which were somewhat dimmer since.\n",
  "page 30": "Zhaoluo aimed her gun at the soldier, and the fear in her veins and heart made her pull the trigger.\n\n\nEverything happened too quickly; her arms swung back from recoil, and there was a loud, earsplitting sound. And the soldier was dead. Gingerly, Boyan extracted himself from the soldier. His hands unwrapped themselves. Huaxing was groaning, and when Zhaoluo looked back at her, there was blood.\n\n\nSoldiers were rushing out of Huaxing\u0027s house, and Boyan muttered, \"We have to go. Don\u0027t drop the gun.\"\n\n\nZhaoluo looked down at the gun. It glinted in her hands, and she shuddered but held onto it. Boyan shushed Huaxing and dragged her away back toward the way they came. The soldiers from the building were shouting, \"Kinmoto!\" and a sick feeling wormed its way into Zhaoluo´s stomach as the three teenagers rushed away.\n\n\n\"KINMOTO!\" It seemed as if they found the man. From the voices behind them, they wanted to find them now too.\n\n\n\"Move!\" Boyan hissed to Huaxing, wrenching her good arm forward.\n\n\nHuaxing\u0027s breathing was raspy, but Boyan kept pushing her forward back to the refugee camp. They don\u0027t wan tto get stuck in the city. They had to get back.\n\n\nZhaoluo followed them mindlessly, always close behind. She focused on the ground and not the sounds. That sound. The one made by the gun she was holding in both dirtied hands. Her eyes caught on the blood. Huaxing\u0027s blood was making a think trail on the stones, mixing with the dried blood already there. But the clear spots...\n\n\nZhaoluo gasped and said over a rush of wind, \"Huaxing\u0027s wound is making a trail!\"\n\n\nBoyan slowed to a brisk walk, but his hands moved to his shirt, tearing a strip of it and shoving an end toward Huaxing. He bound the wound on her arm, ripped off the bloodied sleeve of her shirt and threw it on the ground.\n\n\n\"Now move! We have to get away.\"\n\n\nZhaoluo couldn\u0027t hear the stomping of Japanese soldiers behind them but didn\u0027t stop moving. And how Boyan knew where to go in this devastated sector was beyond her. The route they took back to the refugee camp seemed much quicker than the way out. Maybe it was just the running.\n\n\nZhaoluo\u0027s head was still spinning as they crossed back into the safety zone. She almost fell trying to get over the fence with the gun in hand. Huaxing had to be pushed over; Zhaoluo caught her, but she yelped in pain as her injured arm landed heavily against her. Boyan nimbly lifted himself over.\n\n\nOnce they were all standing on the safer side of the fence, Boyan whispered quickly, \"We need to get Huaxing help.\"\n\n\n\"No kidding.\" Zhaoluo was gently holding onto Huaxing\u0027s arm. She hadn\u0027t got a close look yet, but there was a lot of red.\n\n\n\"I\u0027ll take Huaxing to Dr. Wilson. You can just, ah...\" Even in the dark and under the shadow of the small lights, Zhaoluo could make out Boyan\u0027s pained expression.\n\n\nHe feels responsible.\n\n\nShe nodded at Boyan, who took Huaxing. The poor girl was wobbling and losing consciousness. \"What about the gun?\"\n\n\nHis eyes fell to the metal thing in her hands, and he said, \"I\u0027ll take it.\"\n",
  "page 44": "\"There isn\u0027t enough time.\" Zhaoluo groaned loudly. \"Dammit—\"\n\n\n\"Zha—\"\n\n\n\"We\u0027ll just have to try.\" She seated herself beside stepmother, laying the cloak beneath her. Lisong stayed by his wife\u0027s side as Zhaoluo went to wake Li.\n\n\n\"She can\u0027t be asleep. We don\u0027t know what might happen.\"\n\n\nThey all sat beside Tanla in the dark. There was nothing Zhaoluo could do when her stepmother shuddered and convulsed, even when her father screamed at her for it.\n\n\nLi stared wide-eyed at her mother and whispered, \"Is she going to have a baby?\"\n\n\nLisong shushed her, and Zhaoluo gave the woman the cloth from the makeshift bags to bite on. She kept groaning, and the sound of her pain unbearable.\n\n\nAnd something sounded outside. Guns, footsteps. A foreign language spoken so quickly and gruffly that it couldn\u0027t be mistaken for anything else.\n\n\nLisong and Zhaoluo exchanged a frightened look. There was no way Tanla could escape. He started to cry.\n\n\n\"We have to get out of here!\" Zhaoluo tugged at her father, whispering fiercely. \"Or else we will all die.\"\n\n\nHe didn\u0027t listen. Instead, he swore at her for not being able to help them, his wife, and she growled, \"Suit yourself.\"\n\n\nShe didn\u0027t care. Her father... she didn\u0027t care anymore. He was worthless and weak and pretended to be strong when he wasn\u0027t. Let war show the true nature of them all.\n\n\nZhaoluo grabbed Li and pulled her away. \"Do not speak, LiLi. I can\u0027t lose you too.\"\n\n\n\"Why did you leave them?\" Li cried, struggling as Zhaoluo picked her up easily.\n\n\nShe rushed through and out of the back window and looked around. No soldiers here yet. \"Your mother can\u0027t move in that state, and your father refuses to move. If we stay and be like them, we will die.\"\n\n\n\"So you\u0027re leaving them to die?\" Li banged her fists against Zhaoluo, but she didn\u0027t let go. \"Do you want to stay behind?\"\n\n\n\"Yes!\"\n\n\nBut Zhaoluo was already running with the weight of her stepsister slowing her down. \"I won\u0027t allow that.\" Her eyes flicked around the street, landing on a small box-like building. It looked sturdy enough, but she wasn\u0027t sure if she could carry Li any longer.\n",
  "page 46": "Following through with the plan, she hissed to Li, “Follow me.”\n\n\nZhaoluo took a moment to unlock the backdoor, and when she did, the sound of an explosion startled her ears. Li whimpered, but Zhaoluo swung the door shut just as she saw the faint light of the other side peeking through the front door. There were probably too many soldiers around, but they couldn’t just stay in the building.\n\n\nTrusting Li to listen to her, she moved forward, skirting the edges of the buildings. She could see Japanese soldiers, relatively clean and very loud, running on the streets as she ran through the alleys. They were grabbing people—civilians—and taking them... What are they doing? Didn\u0027t they promise not to hurt the people? Oh wait. They\u0027re Japanese. They have no mercy. She could only watch as the civilians shrieked and tried to run, and that\u0027s when they lifted their guns into hands and shot them. Li gasped behind her as blood pooled into the cracks in the streets. She slowed.\n\n\nThen they shoved the people into a small building. They poured something along the base of the little house, and something in her guts told them that she wouldn\u0027t like what\u0027s going to happen.\n\n\nThe structure went ablaze, and the screaming began. It happened all along the street; fire, fire, fire. Zhaoluo forced up her pace, hoping but knowing that Li couldn\u0027t last much longer. As the people clawed at the windows, breaking them with anything they could find, the ear splintering scream, the  begging, was horrible. They tried to shove themselves out of the building. Their clothing just a dark imprint in a flame that ate their bodies. The Japanese shot them. One by one. Anyone who left, they let loose bullet after bullet.\n\n\nShe knew that Li could see this, and they both wondered about their parents.\n\n\nThen a soldier turned, and his eyes landed on them.\n\n\n---\n\n\nHidesada was not enjoying this. He did not enjoy listening to the crying and pleading; he\u0027s learned what those certain foreign words mean. He\u0027s heard them many times before. \"Save me.\" It didn\u0027t seem right to him. These people aren\u0027t monsters. With an uncomfortable realization in his stomach, he admited to himself, \"We\u0027re the monsters.\"\n\n\nThey had found a woman giving birth in another house, her husband right beside her. However, the cloths spread out on the floor suggest more than two people had been there. Did they have more children? And just remembering what had been done to the two parents was horrible. Degrading. As a Japanese, someone who had been told that the civilians must not be harmed on the dignity and honor of the individual, this was a dream. It couldn\u0027t be happening. Because the Japanese never lie like this. But the Chinese... oh, couldn\u0027t they just come to an agreement? Surrender? That would make things less painful for them all.\n\n\nHe had to look away from the scene. When he faced the buildings on the opposite side of the street, his eyes caught on two girls, probably sisters, running between two buildings. The older one\u0027s eyes landed on his, fear and horror of discovery written on her face. Hidesada never participated in these things, but she wouldn\u0027t know. He... he didn\u0027t want to hurt anyone, but the new orders were to do as much damage as they could on the city and the Chinese...\n\n\nHe made his decision.\n",
  "page 45": "Zhaoluo jogged down to the structure, unsurprised to find it unlocked, and closed herself inside. It was a one-story facility with a lot of weird devices and wires and things that she\u0027s never seen in her life. There was a back door but no windows, so she wouldn\u0027t know if the Japanese had approached unless it was quiet.\n\n\n\"LiLi, I need you to be silent.\" She grabbed her arm before she could run off and get hurt. \"Look.\" Trying to keep a passive expression, she locked her eyes on her sister\u0027s. “Listen to me. We won’t be seeing Baba and Mama anymore. The Japanese have invaded this city, and they will die. If we don’t be careful, we might too. And even if we are, we still might die.”\n\n\nIt was a harsh reality to tell Li, who still clutched that doll like it was her lifeline. Li, to her surprise, asked with only a few tears running down her cheeks, “Why is this happening?”\n\n\n“Because of the Japanese.” Zhaoluo weaved a simple plan in her head; if the Japanese start trying to open the door, quickly get out through the back door. If they don’t try opening the door... that’s where she’d have to start improvising because she didn’t want to be stuck in here.\n\n\n“But why?” Li was shivering even though the facility had an odd warmth to it.\n\n\n“I don’t know, and for once, I don’t care to find out.” Zhaoluo pulled Li with her toward the backdoor. Just in case. Just in case.\n\n\nAnd then they waited in silence. Through the somewhat thick walls, they first heard the bombs. That piercing wail as it flew through the air or the small explosions of the grenades. Then the shouting. The door rattled, and Zhaoluo leaped to her feet.\n",
  "page 48": "Zhaoluo refused to let herself think about what just happened, what that soldier had just done. He let them escape. How...? The Japanese were notorious for never giving up the fight, never backing down... so why? He watched those flames intently, seeming attuned to the crying, so how could he let them just go?\n\n\nThe only answer she had was that he never started a fight to back down from. Which, in some way, seemed scary to her. But it was good to know that there were some good guys out here.\n\n\nLi was panting beside her, struggling to keep her pace, struggling keep quiet, struggling because she was a little kid caught in hell with no way out. \"Zhao, I\u0027m tired.\"\n\n\nThey were both panting; they had never been used to running or even walking for extended periods of time like Lisong. It was sad, really. Right now, it was fatal. Zhaoluo grunted as she picked up her sister, surprised at her heaviness. How did Li get so chubby? It\u0027s not like they had that much food either.\n\n\nZhaoluo would let Li rest, if only because Li would keep complaining otherwise. But what were their chances of living like this anyway? Running? They had to get to the safe zone. Or else bad things will happen. Maybe even worse than what probably happened to her parents... And her parents... Will she and Li ever get to confirm what really happened to them? Probably not. There\u0027s no turning back now.\n\n\nAs she neared another intersection in the road, she tripped, encumbered by both of their weights and the burden of the knowledge of what likely happened to Lisong and Tanla. Li cried as she spilled onto the dirt and stones; the doll dropping from her fingers and falling limply to the ground.\n\n\nSoldiers. More sounds. Screaming, laughing. Snapping and barking. Always barking. \"LiLi, get up.\" Zhaoluo could hear the desparate chord in her throat vibrate shakily, and Li whimpered as she heaved her up. Cried as she picked her up again and ran. Li\u0027s hands pounded against her as she cried for the lost doll\n",
  "page 47": "He ignored them and turned his back on them. He didn\u0027t want to kill another civilian in his life. He\u0027s shot many people, yes. But those people were trained soldiers shooting right back. Those were life and death situations for both sides. This was just bloodletting. Torture. Something he didn\u0027t believe an honorable Japanese would do. The Chinese government had already abandoned Nanking. Half the untrained soldiers fled, and the other half were captured or dead. They have the city. They have the people. What more did they need? The Japanese promised not to hurt the civilians—he heard the overridden command himself—and look where that brought him.\n\n\nHis breathing became heavy as the last of the screams died out.\n",
  "page 49": "\"Mama, please. Just a bit longer.\" Even Li was pressing her mother forward; she could hear the gunshots beginning in the distance. The Japanese had even given them an extra hour before trying to force their way through Chinese resistance.\n\n\n\"LiLi, your mother needs rest.\" Lisong gave them all a strained smile as the older sister narrowed her eyes at him. He gave her a warning look, and she looked away at the small white pack she carried, which was made from the thin tablecloth.\n\n\n\"We have to hurry to the safe zone,\" Zhaoluo muttered and walked on. \"Do not forget that the Japanese will show no mercy.\"\n\n\nThe rest of the family moved on with her. Lisong was holding onto his wife as if she could disappear any moment, and Li was stumbling along, trying to keep up with Zhaoluo\u0027s fast pace.\n\n\n\"Sister,\" Li gasped, panting as she pulled herself toward Zhaoluo.\n\n\n\"What.\" Her response was quick and clean, and she hadn\u0027t even glanced at the younger girl.\n\n\nLi was still holding onto that doll, and with a glance at it, she said, \"Why are you so mean to Baba?\"\n\n\nZhaoluo slowed her pace a bit, but did not answer. Right. Her stepmother was days away from giving birth. She had to remember that. The walking continued on for a bit, and they passed some abandoned stores, some inhabited stores. Some people were just like them—hurrying to get to the safe zone. Others, however, had that defiant gleam in their eyes. Those nationalists who think that everything will be okay if they just listened to their ignorant leaders. The ones who denied them freedom from Nanking\u0027s imminent distruction. The apartment buildings looked dingy but somehow cozy at the same time. Like their home that they will leave behind to escape the destruction that the Japanese will perform.\n\n\n\"I can\u0027t walk anymore,\" her stepmother slumped against Lisong\u0027s side, heaving out a breath, and Zhaoluo turned back to look at her. Sweat gleaned against her brow even though it was chilly outside, and her blackish brown hair appeared brittle against her delicate bones. She was beautiful for her age, and she had those laugh lines around her eyes. She wondered if her father ever contributed to those laughs.\n\n\n\"We\u0027ll stop for now,\" Zhaoluo said, and her father raised an eyebrow at her commanding tone. She simply raised a brow back at him. He wasn\u0027t doing anything for them. He was holding onto his mother like some desparate man.\n\n\nThey were all desperate, and she tore her eyes away from that image. She couldn\u0027t blame him. \"We\u0027ll find an abandoned home, I guess,\" was all she said.\n\n\nLisong scouted the half empty street, and finally, he stopped at a small store which had been abandoned. The door was locked, but the lock wasn\u0027t strong, so he managed to break it. It was a pleasant little shop. It smelled of spices and herbs and other things that her family could afford little of. All the spices and herbs had been cleared out, though.\n\n\nThere was a small table and several counters and bins, and the floor looked clean enough.\n\nLi looked at the place in wonder. \"This is so different from our house!\" She skipped to the door at the back of the shop, and when she opened it, she beheld a small bedroom that had a bed made for one person.\n\n\n\"Your mother will get the bed, and the rest of us will sleep on the floor,\" Lisong said as he took on the little shop. \"We will have a meal right now, but we are leaving tomorrow as soon as we can.\"\n\n\n\"Baba, what will the safe zone look like? Will it be like this shop?\" Li asked hi.\n\n\nHe glanced at the doll in her hands and the wonderous look on her face and replied, \"It will be better.\"\n\n\nZhaoluo gently led her stepmother to the room and helped her onto the bed. \"Do you need anything, Mama?\"\n\n\nHer kind smile held nothing but adoration for her stepdaughter. \"Thank you. I\u0027m okay.\"\n\n\n\"Do you want some food? We have some nuts packed up.\" Zhaoluo was already moving to her bag and taking out a pouch. Her stepmother accepted the pouch with a murmur of gratitude before eating the hard nuts.\n\n\nLisong looked on, and Zhaoluo had to snap at him. \"Well, help me with food! You\u0027re the actual cook.\"\n\n\nHer father gaped at her again, and even Li gave a small gasp. Instead of getting angry at her for speaking out of turn, he simply grabbed his own bag and rummaged through the smaller pouches within.\n\n\n---\n\n\n\"Baba, I\u0027m scared.\" Li crawled closer to her father, dragging the doll with her, and hugged his arm. The slightly opened windows didn\u0027t completely block the shattering sounds of distant gunfire, and Li flinched at the louder once.\n\n\n\"Shh.\" Patting her head, Lisong drew his daughter closer. \"Do not worry about that. Think about Grandma. What will she say about cowering before your enemies?\"\n\n\nLi nodded, and her face brightened a bit. \"Grandma doesn\u0027t like it when people surrender just because they\u0027re too scared. If there\u0027s something worth fighting for, then you should fight for it.\"\n\n\n\"Why would you fight for something if you know you\u0027re going to die?\" Zhaoluo interjected as she crossed her arms. \"The Japanese are stronger and better equipped. They took Shanghai. They can take Nanking.\"\n\n\n\"Li Zhaoluo! Do not speak that way. We must have hope.\" Her father glared at her angrily, gesturing with his eyes at Li.\n\n\nZhaoluo lowered her eyes at the small bowl of rice in front of her. Hope left the city with those soldiers.\n\n\n---December 11-13\n\n\nThe next couple days, they traveled toward the western central district of the city. When the trained soldiers had left the city on orders of Chiang, the control of Nanking was basically shifted from the Chinese government to the International Committee. Apparently, they could take better care of them.\n\n\nLi\u0027s mother was still struggling throughout the day, and sometimes, they had to walk for an hour straight. They lost themselves in the streets, unsure of where exactly the safe zone existed, started, and ended. More people seemed to be coming to their senses as they heard the shouting and fighting from beyond the walled borders of the capital of China. People were trying to get to the safe zone. If they don\u0027t, they could die. Few of them really trusted the Japanese when they said that they would only harm those on the areas occupied by the Chinese soldiers.\n\n\nThe days passed slowly with the cold biting through their shoes to their feet. Their breath chilled in the air, and their fingers reddened. Lisong held his wife\u0027s fingers in his hands as they walked with their bags, rubbing her hands to keep her warm. Zhaoluo did the same for Li, who made her job difficult by being so short. They did that as they walked, and Li\u0027s mother kept complaining, but they knew. Somewhere in their minds, they knew that if they didn\u0027t get to the safe zone soon, something very bad will happen.\n\n\nMany of the people seemed to sense it, and their fervor far outmatched Lisong\u0027s. He looked back at the paths they traveled, remembering his little apartment—the one he had worked for for so long. He couldn\u0027t deny that they were poor. He couldn\u0027t deny that they had to go hungry sometimes, but he tried his best. But war does not show mercy.\n\n\n\"Sister, how long do you think it\u0027ll take for us to get there?\" whined Li.\n\n\n\"At this pace, I\u0027d guess maybe until tomorrow. I don\u0027t know. I\u0027ve never really been around the western central district. I think Baba has, though. Go ask him.\" Zhaoluo looked at her father dully. If only they had had more time!\n\n\n\"Baba, when do you think we\u0027ll get there? What\u0027s it going to be like?\" Li asked him, walking backwards on the paved sidewalk.\n\n\n\"Tomorrow. Most likely at around noon,\" Lisong responded prompty.\n\n\nLi lifted the doll in front of her face and said, \"I think we will get there soon. Mama will be healthy and safe, and Baba will be happy, and Zhaoluo will finally feel safe.\"\n\n\n\"LiLi, what about yourself?\" her mother asked, voice strained with effort.\n\n\n\"I\u0027m going to play with the other kids there, so I won\u0027t have to bother Baba or Zhaoluo!\" she piped cheerfully, almost tripping backwards over a small stone.\n\n\nZhaoluo sighed. Optimism, she supposed, was an okay thing.\n",
  "page 40": "It was in the afternoon when the Japanese entered the camp yet again. They were officers, and they carried filled sacks. It seemed that this time, it was planned. Another man—Western, named John Rabe—that Zhaoluo had never seen before met them at the facility that was the place for such things. They talked for some time; Zhaoluo and the others sat there, watching the door, waiting for it to open. Waiting.\n\n\n---\n\n\nLater that day, Zhaoluo threw down the small pack of powder distributed by the Japanese and hissed for the others to do the same. \"It\u0027s a drug,\" she whispered with disdain. \"I\u0027m sure this wasn\u0027t the first time. I don\u0027t remember any times before though... Did they ever...?\" She looked around at the others, eyes landing on Ren.\n\n\n\"They did, but we were typically not around or something,\" was Ren\u0027s immediate response.\n\n\nShe nodded and tipped her head to the pile of drugs before her. \"Don\u0027t ever use it.\" And then she told them about her father. \"So don\u0027t.\"\n\n\nBoyan agreed. \"They want to pacify us. Make us not care. Whether this is a good thing or a bad thing, I don\u0027t know.\"\n\n\n\"The Japanese rule this city now. The Committee is useless, as is the safe zone,\" Zhaoluo said. It was the truth, and MaiMai may not be able to sleep at night, but she\u0027d rather have the girl able to flee if the Japanese ever try. \"We\u0027ll keep doing what we\u0027re doing. Avoid the Japanese.\"\n\n\n---\n\n\nThey took over the city. Completely. They pretty much stole the Committee\u0027s power and established another puppet government. And the people generally did not care anymore. They were too addicted to heroin at this point. Zhaoluo felt bad for them. They were all victims of this stupid war. The Japanese could take them away if they wanted, so long as they promised to pump death into their veins instead of simply stabbing them.\n\n\nAnd it wasn\u0027t fair. Mr. Bates and Dr. Wilson and Mr. Rabe... they had little power. All of them. They can\u0027t stop the Japanese from continuing the rape and murder. But, Zhaoluo thought, almost gratefully, they did help.\n\n\nIt was also at this time a cold fire kindled in her body. Zhaoluo was angry. She hated them. She loathed the Japanese for what they did to her family, what they did to her friends, what they did to the innocent. Kinmoto deserved that. He deserved to die. And his friend, Hidesada deserved to hurt too.\n",
  "page 42": "https://thenankingmassacre.org/\n\n\nhttp://web.library.yale.edu/divinity/nanking\n\n\nhttp://www.pacificwar.org.au/JapWarCrimes/TenWarCrimes/Rape_Nanking.html\n\n\nhttp://www.newworldencyclopedia.org/entry/Nanjing_Massacre\n\n\nhttp://www.history.com/topics/nanjing-massacre\n\n\nhttps://www.britannica.com/event/Nanjing-Massacre\n\n\nhttp://www.historyplace.com/worldhistory/genocide/nanking.htm\n\n\nNote: I did use Wikipedia for names and information of Mr. Bates, Dr. Wilson, and Mr. Rabe.\n",
  "page 41": "A few years later...\n\n\nZhaoluo stepped through the doorway; her eyes immediately fell to the man sitting at the desk. His finer features and thin spectacles faced his desk, where a couple of papers were neatly placed. The desk was tidy in general, and the open window let in a dusty yellow light. Outside, the incessant noises of the workers rang in the air. It entered the building muffled.\n\n\n\"Ren.\" Her voice came out firmly, and Ren at last looked up from the documents.\n\n\nHe gazed at her with large, brown eyes for a moment before saying, \"I wanted to tell you that Boyan is officially courting Huaxing.\"\n\n\nShe scoffed. \"Obviously.\" Walking forward toward him, she continued, \"He\u0027s so protective about her safety, always that perfect gentleman.\"\n\n\nRen laughed, breaking the cool mood. \"He does everything by the book and thinks rationally. He and Yinshi are brilliant.\"\n\n\n\"Only thing not rational is that he\u0027s helping us.\" Zhaoluo sighed.\n\n\nBoyan had been an editor for the Nanking news and also worked for the communications of the city. He hadn\u0027t told them anything about his past, but when the city got back onto its feet—those days of stumbling had been hard—he offered them a job... The communications branch had been low staffed. Then, he proceeded to offer them a place to stay at the patched up news building. He had automatically taken command of the business as he was at the top of the ladder after the invasion.\n\n\n\"He has a heart, you know.\"\n\n\n\"I\u0027ve only ever seen his mind work.\"\n\n\nRen, whose eyes had been drifting back to the desk, fixed them on hers. \"Our hearts are what drives us.\"\n\n\nA loud bang echoed in her ears, and she winced as memories flooded back into her. Fear also drove them.\n\n\n---\n\n\nThe monastery was a beautiful place. But the most beautiful thing in here was Boyan and Huaxing. They were standing there, holding hands, as they spoke with Yinshi. MaiMai was beside them, occasionally  interjecting with a comment here and there.\n\n\nNervously, Zhaoluo approached, the boots under her robe clicking against the marble floors. It didn\u0027t feel right. There was blood on her hands. Why is she in this majestic, holy building? Her gaze fell to her hands, unpleasantly callused after... after what she\u0027d held in her hands before. She could imagine the red on them. An almost chalky red as the fluid dried and flaked. No matter how many times she washed her hands with soap...\n\n\nWhen she slowed, Ren would prod her from behind, whispering, \"Keep going.\"\n\n\nAt last, she reached Boyan and Huaxing, and their smiles bloomed at the sight of her. MaiMai latched onto her leg, and Zhaoluo couldn\u0027t help but grin.\n",
  "page 101": "The woman would\u0027ve died anyway... He tried to rationalize as he heard more Japanese troops storming down the street on the other end. Shit. He tried to duck behind a crate, but they already saw him. They raised their guns, but Zhen had already dropped Li and lifted his two guns, shooting two soldiers (though not dealing anything fatal). They four left looked up, raising their own guns to point at him. He hated it when guns were pointed at him.\n\n\n\"Li! RUN!\"\n\n\nLi was standing up, but her pant leg was rolled up. The bandage wasn\u0027t fresh anymore, but she had begun peeling it off. Underneath, there was an unsightly infection.\n\n\n\"RUN, YOU IDIOT!\" Zhen yelled, and he could hear himself being surrounded by the Japanese. Li ran. She ran into the side of the broken building to his left, through that building, and was gone.\n\n\nHe let loose several shots, determined to take down as many of his persecutors. They had already fired back, and in that storm of bullets, he held onto his last secret.\n",
  "page 103": "Kuyue left her alone at that, a worried smile plastered onto her face. Li still felt miserable, but she couldn\u0027t risk the fever coming up again.\n\n\nEveryday after Kuyue met her, she visited the infirmary to see if Li was getting better. Soon, she felt awesome... again. Kuyue was very kind to her, and sometimes she would tell her stories or do something fun together. It was something that made Li want to cry just because it was such a kind action. She hadn\u0027t thought she could understand that, but she realized something after the deaths of the people she knew—they cared about her, even Zhen. He wasn\u0027t family. Neither is Kuyue. They weren\u0027t family, and they helped her.\n\n\nHer parents and sister always emphasized that the only people one could rely on was themselves and family, so Li had been brought up that way. She didn\u0027t realize that relying on people like Zhen, Dr. Wilson, and Kuyue when things were going wrong could be a good thing. Clearly, it was.\n\n\n\"What\u0027s going to happen to us after this war?\" Li asked the older girl when she finally felt one hundred percent healed.\n\n\n\"We\u0027re going to find a life, of course.\" Kuyue looked off into the distance, toward where the gloomy sun was setting.\n\n\nThen Li approached the topic she\u0027d been scared to think about. She needed to know. \"Kuyue, what will we do without our parents?\"\n\n\nKuyue looked down at Li. \"I\u0027ll do whatever I need to.\" The small height difference between them made her realize that Kuyue wasn\u0027t much older than her.\n\n\n\"What about me?\"\n\n\n\"I\u0027ll make sure you\u0027re safe.\"\n\n\nI\u0027ll keep you safe. Similar words spoken. She blinked as her eyes began to water. A heavy feeling formed at the top of her nose as Li smiled cheerily, \"I\u0027ll make sure your safe too.\"\n\n\nKuyue gave her a bittersweet smile.\n",
  "page 102": "Li didn\u0027t know where she was going. It just had to be away from the fighting. Away from her rescuer, who could be teaming back up with his buddies by now. She had nothing on her. Her thin slippers had already lost themselves somewhere, and the boring pink robe was somewhat stiff from sweat or dirt or tears. But she was alone. She didn\u0027t know where she was. What she was doing anymore. Nobody was there to guide her. Where was her sister? Parents? Zhen?\n\n\nShe felt like the little girl she was running through that street, eyes wide at the loud sounds of war behind her. Knowing in a way she would have not known before that... Zhen is dead. Everyone\u0027s dead. Almost crying by now (her thirst not allowing), she kept sprinting away.\n\n\nHer soft feet hurt against the dirt, which was laced with pieces of metal and wood and stone. What was she doing? She heard more sounds to her right, and she ran from that too. Through the cracked streets... until... Li blinked carefully and looked at her surroundings. These houses weren\u0027t bombed or destroyed or broken yet. The planks were perfectly in place, and the windows weren\u0027t shattered. When she turned back, she couldn\u0027t witness the destruction, but she could hear it in the wind and see it in the smoke.\n\n\nShe turned back toward the street of houses before her. They were going to come here soon, which meant...\n",
  "page 105": "She\u0027d been here for so long. How did they not tire? Not that it mattered at this point. She clung to the scrap of fabric left of her robe, arms around her knees in the corner with some of the other girls. She hated watching more girls being brought in, hated the fear, the screams. Not that they stopped.\n\n\nThe day the sun\u0027s rays shined bright through her window with a less wintry glow, that all ended. She didn\u0027t know what happened, but the Japanese rifled through each of them like they were the articles of clothing that they so lacked. A few were brought outside and loud bangs were heard. Zhaoluo was left inside with a dozen or so other girls. The men shoved robes toward them, and the newer ones pulled them on self-consciously.\n\n\nThey were led to a truck—a vehicle so similar to the one she had arrived in—and gestured for them to go in. Some of them started crying. The door shut behind them, and Zhaoluo herself began to whimper. Where were they going? They didn\u0027t dare speak. The only time they had been allowed was when one of them men told them to talk—dirtily.\n\n\nAt last, the vehicle stopped, and their \u0027escorts\u0027 opened the door. They greeted the faces of several Westerners, one who looked especially angered at the sight of them. Zhaoluo flinched. Were they giving them away to... these people?\n\n\nOne of the Westerners walked forward, and Zhaoluo and the others shrank away. His face snapped toward their \u0027escorts\u0027 and he said something. The officer of the group replied in a different language, clearly not Japanese—it was a broken accent.\n\n\nThen, the Westerners led them off. Their voices were gentle and soothing. \"It\u0027s going to be alright. The war\u0027s done here.\" It was the second part that made Zhaoluo remember something. Something that she had forgotten when the curtain was drawn over it... Where\u0027s LiLi?\n\n\nHer keen state of mind returned to her slowly, and she realized that Li was likely dead.\n",
  "page 104": "It was in the afternoon when the Japanese entered the camp. They were officers, and they carried filled sacks. Kuyue had quickly swept Li away—away from those men who ruined both their lives. Li was scared, so scared as she saw those men again. Less wild than the soldiers she had seen, but she was still frightened. She\u0027d seen the mercy of people. It was close to none.\n\n\nAnd so, Kuyue told her a story.\n\n\n---\n\n\nI lived in a family of four, the standard, I suppose. Baba, Mami, and Maimai, my sister. Baba worked as a messenger, so he was always away in the morning and afternoon. He arrives home late.\n\n\nWhen the Japanese invaded, I never saw him again. Mami rushed us out of the house at the first sound of war. She had been ready. She gave us each a small bag to carry—some basic things like food and important possessions. She didn\u0027t take jewelry; she felt that it was too dangerous to carry that around.\n\n\nWe weren\u0027t wealthy, but she left all her jewelry here except for one bracelet Baba had given her. And we headed off. We didn\u0027t run because Mami wasn\u0027t used to it, and Maimai got tired easily, so when we heard Japanese soldiers calling to us, we got split up—Mami and me, and Maimai all by herself....\n\n\nMami wanted me to keep running. I was younger and almost my prime age. She was aging. I refused. The Japanese men caught up to us, and they took her and raped her. It was so brutal. They... they kept hitting her. I\u0027m not sure if I should be telling you this...\n\n\nWell, they hurt her taking turns, apparently planning to save me for later? I managed to free myself from the man who was holding me, hitting his weapon into his ribs. And I ran. All of them were so busy, and Mami screamed for me to keep running.\n\n\nI did. I didn\u0027t stop until I saw the Red Cross flags. We were so, so close too. I don\u0027t know where Maimai is either. She\u0027s... I don\u0027t know.\n\n\n---\n\n\nLi patted Kuyue\u0027s back, feeling her own heart twist like a serpent inside her. She watched her mother... She didn\u0027t dare think of it. She\u0027s heard of the acts committed so many times in this place that she knew what it was now. Li wished she didn\u0027t.\n\n\n\"It\u0027s going to be all right.\"\n\n\n---\n\n\nThe officers left later, and they ended up passing small pouches of white powder to everybody. Kuyue and Li weren\u0027t exceptions. A soldier had went up to them and just given it to them, saying something that must\u0027ve been nasty in Japanese before leaving.\n\n\nKuyue said immediately after he was out of earshot, \"Don\u0027t use it.\"\n\n\nOn the pouch, the words \"For Peace of Mind\" were written on it in Chinese. \"Why not?\" Li dared to open the pouch. A white substance was inside; it looked like rice and flour\u0027s offspring.\n\n\n\"They want to pacify us.\"\n\n\nLi promptly closed the bag. \"How do you know what it is?\"\n\n\nKuyue frowned. \"I\u0027ve tried it before. My uncle was an addict.\"\n\n\n\"Oh.\" Li looked at the small bags in each of their hands, wondering how else the Japanese wanted to ruin their lives.\n",
  "page 106": "Zhaoluo slipped the hood of her cape over her head and walked down the street. The ground beneath her slippered feet was wet. The stones were a dark, gloomy color, and the dirt was soaked to a deep umber. It wasn\u0027t too far now, and she slipped into a dense collection of somewhat connected buildings, all stout.\n\n\nShe found the one—there was an \"X\" on it—and pushed open the door. Inside, it was warm and loud with the ruckus of wanton comers and goers. She dropped the cape on a chair that served as a coat rack and did the only thing she could do as she weaved her way through to the back.\n",
  "page 55": "“We can’t leave.” Lisong threw his cotton jacket onto one of the chairs surrounding the dining room. “The government has abandoned us.”\n\n\nLi Maoxing could see the rage building up in the lines of her father’s face as he sat down heavily onto the chair. Zhaoluo, her half sister, sighed angrily as she took the pot off the small boiler.\n\n\nLi pulled at the arms of her five year old doll. “Baba, what does that mean?” she asked. “Why is Sister mad?”\n\n\nLisong looked at Zhaoluo, who was pouring him thin tea, and then at Li. When he lost his previous job, he had worn the same expression. His eyes dropped to the limp doll in her hands, and he said, “Don’t worry about it, LiLi.”\n\n\nLi walked to her father and hugged his arm. He always smelled like food.\n\n\n“LiLi, help me with Mama after this, okay?” Zhaoluo started setting up the table with mismatched bowls and slightly-bent chopsticks.\n\n\nLi piped up, “Okay!” She hugged her father again and gave him a serious look. “You three aren’t telling me something.”\n\n\nZhaoluo cut him a glance as he chuckled. “You’ll understand when you get older.”\n\n\nShe pouted in response and skipped over to her older sister, who only glanced down at her before saying, “You’ve had that doll since you were four.”\n\n\n“I know! But Grandma gave it to me,” Li replied, clutching the thin doll closer to her.\n\n\n“Whatever.” Zhaoluo finished with the table and washed her hands in the tub. “Come on.”\n\n\nThe father looked on sadly as his two daughters walked to their mother’s room in the cramped apartment. Li was nine years old, and Zhaoluo was fifteen. Soon, they might have another sibling. How could he let his children suffer through war? How could he submit to Chiang’s order for civilians to not evacuate Nanking?\n\n\nAs the door to the room closed, he heard the happy laughs of Li and Zhaoluo’s well intended questions. His wife’s responses were quieter. She was so close. Only a couple more weeks, and they’d have another child.\n\n\nHe sipped at the herbal tea and tried to distract himself. Zhaoluo was always good with tea. Perhaps that will attract a nice husband. She is beautiful, no doubt. Li was just a playful child who was really talented at dancing. She loved that doll because his mother gave it to her, and everybody loved his mother. His mother is so kind and hardy. He missed her.\n\n\nA shiver went through him as Li squealed at something her half sister did. He’s heard of what the Japanese planned to do—they thought they could take over China in just three months. Should they disobey leader Chiang and flee? Or shall they stay to defend the city containing the grave of the Father of China? Will more graves be dug?\n",
  "page 109": "It was in the afternoon when the Japanese entered the camp. They were officers, and they carried filled sacks. Another man—Western, named John Rabe—that Zhaoluo had never seen before met them at the facility that was the place for such things. They talked for some time; Zhaoluo and they sat there, watching the door, waiting for it to open. Waiting.\n\n\n---\n\n\nLater that day, Zhaoluo threw down the small pack of powder distributed by the Japanese and hissed for the others to do the same. \"It\u0027s a drug,\" she whispered with disdain. \"I\u0027m sure this wasn\u0027t the first time. I don\u0027t remember any times before though... Did they ever...?\" She looked around at the others, eyes landing on Ren.\n\n\n\"They did, but we were typically not around or something,\" was Ren\u0027s immediate response.\n\n\nShe nodded and tipped her head to the pile of drugs before her. \"Don\u0027t ever use it.\" And then she told them about her father. \"So don\u0027t.\"\n\n\nBoyan agreed. \"They want to pacify us. Make us not care. Whether this is a good thing or a bad thing, I don\u0027t know.\"\n\n\n\"The Japanese rule this city now. The Committee is useless, as is the safe zone,\" Zhaoluo said. It was the truth, and MaiMai may not be able to sleep at night, but she\u0027d rather have the girl able to flee if the Japanese ever try. \"We\u0027ll keep doing what we\u0027re doing—nothing. Avoid the Japanese.\"\n\n\n---\n\n\nThey took over the city. Completely. They pretty much stole the Committee\u0027s power and established another puppet government. And the people generally did not care anymore. They were too addicted to heroin at this point. Zhaoluo felt bad for them. They were all victims of this stupid war. The Japanese could take them away if they wanted, so long as they promised to pump death into their veins instead of simply stabbing them.\n\n\nAnd it wasn\u0027t fair. Mr. Bates and Dr. Wilson and Mr. Rabe... they had little power. All of them. They can\u0027t stop the Japanese from continuing the rape and murder. But, Zhaoluo thought, almost gratefully, they did help.\n\n\nIt was also at this time a cold fire kindled in her body. Zhaoluo was angry. She hated them. She loathed the Japanese for what they did to her family, what they did to her friends, what they did to the innocent.\n",
  "page 54": "\"The Japanese will be heading to this city! We must hold a safe zone,\" James argued, pointing at the map before him. \"Think of the destruction at Shanghai.\"\n\n\nThe other man, clad in a light grey suit, stood beside the car, which had been packed with his belongings. \"You are just a businessman. What do you know of war? I would rather not get involved with the war between China and Japan.\"\n\n\nSeveral people in the circle around them mutter an agreement, shifting on their feet.\n\n\n\"And you, Charles Trimmer, are a doctor. You heal people. How can you not feel guilty for leaving the people? Have you heard of the horrors the Japanese unleashed after Shanghai? They are committing war crimes.\"\n\n\n\"To hell with that! What\u0027s the point if we could just DIE?\" Charles yelled, spreading his arms outward.\n\n\nSeveral people nod, but James only replied, \"You are a coward.\"\n\n\n\"And you, Mr. Lean, are a fool.\"\n\n\nA man with a thinning brown-grey hair and spectacles cleared his throat loudly, and the gatherers turned to him. \"I could ask some higher ups to intervene.\"\n\n\nThe others started whispering, and he heard, \"Nazi,\" at some point.\n\n\n\"I am German, and the Japanese cannot harm me because of the agreement between our countries. We can save lives here. Think of the people who can\u0027t or won\u0027t flee.\" In the large overcoat of his, the man walked toward James.\n\n\n\"Whether we are American, German, French, or Dutch, we are protected. The Japanese will not risk Western troops in the Pacific yet. If I run away now, I know I cannot live with the guilt of leaving the civilians behind. Did you not hear of the prisoners of war? Did you not here of their games? Can you live knowing you ran away from that? Do you know how many of us are here? Less than three dozen!\" John Rabe looked at each of the men in turn, piercing them with that sharp gaze.\n\n\nThe others fiddled with their hands or shifted on their feet. A younger man named Robert Wilson stepped forward toward the concentrated center. \"I will help.\"\n",
  "page 108": "\"Don\u0027t go.\" Heads turned to her, and Zhaoluo said, staring at Huaxing, \"Don\u0027t go. It\u0027s not worth the risk, and the risk is high.\"\n\n\n\"Zhao, it\u0027s only to my house. It\u0027s not that far...\" She looked at Boyan for support, and he nodded.\n\n\n\"It\u0027s her choice.\"\n\n\nShe stood up from the seat, still not shifting her gaze from the girl. \"I promised that I\u0027d keep you safe, but I can\u0027t protect you if you decide to leave! Look at your parents—\"\n\n\n\"Zhao—\" came MaiMai\u0027s warning tone.\n\n\n\"—they died to take down as many of them as they could. They died running and fighting. Do not follow them like that.\" She didn\u0027t know why she brought up Huaxing\u0027s parents. It was low for her to use that against her, but it was the only card left she could play.\n\n\nAnd it seemed to work. Sighing, Huaxing said, \"I don\u0027t want to risk my life. Perhaps I am too much like Baba and Mama.\"\n\n\nBoyan gaped at Zhaoluo, and she glared at him in return. Again, she won.\n\n\nThey truly were afraid to die. They didn\u0027t want to risk their lives, but they felt like they had to do something. But blowing up enemy camps at the risk of your own lives is not worth it. It\u0027s not worth dying. It\u0027s not worth making us dread and cry and lose another person we care about.\n",
  "page 57": "When she awoke, it was because a man had opened the door to... the vehicle that she was trapped in. There were several other girls inside, crying or being painfully silent. Zhaoluo didn\u0027t know what was happening, but the man barked for them to get out. Where was Li? Where...?\n\n\nShe stepped onto the ground, uneasy. Along with the other girls, she was led toward a large warehouse. She didn\u0027t know where she was, but Zhaoluo had a guess it was outside of Nanking\u0027s walls. Muffled sounds came from inside, and soldiers began surrounding them. One of them pointed at her and said, \"Mariko.\"\n\n\nBefore she knew it, he had grabbed her arm and began dragging her into the warehouse. The other girls were treated in similar manner. One tried to talk to another, but her captor slapped her. \"Damare!\"\n\n\nZhaoluo quickly fell into a silence. She was outmatched and outnumbered here. These were soldiers. She couldn\u0027t even escape this man\u0027s tight grip on her wrist. Where is Li?\n\n\nThe door opened before her, and she was shoved inside. She heard the noise before she saw the men. The amount of flesh she saw made her shudder as the doors closed behind her and shutting her into the orgy. Already, she felt hands clawing at her robes. It was dim in here, and she felt herself crying. Someone slapped her bared side, and Zhaoluo gave up.\n",
  "page 56": "Dammit. Zhaoluo growled, frustrated. \"LiLi, I\u0027ll get the doll. Shut up.\" She set her stepsister down, glaring at her to keep her put, and returned for the doll. It was so close, and as she reached for it, there was a loud sound. The doll\u0027s face disappeared among the stuffing and metal. Zhaoluo\u0027s blood jumped, rushing through her chest, her ears.\n\n\n\"Haha! Meinu, shinu!\" Their awful sounds. Japanese soldiers appeared from between some of the buildings on both sides of the street, rushing at Zhaoluo. She felt her joints locking up as she chucked the broken doll toward Li; it glided in the air like a feather but still reached her. \"LiLi! RUN!\" It was all she could do before the Japanese soldiers reached her and dragged her up, sniggering.\n\n\nShe didn\u0027t know if she fainted or if somebody knocked her unconscious, but the darkness might as well have signaled her death.\n",
  "page 59": "She wasn\u0027t on her front anymore, that much she could tell. And that her legs, her feet... they hurt. A throbbing, angry red pain. And she didn\u0027t know where she was. Li took in a deep breath as she opened her eyes. \"Zhao...?\"\n\n\nThe person that sat before her, dozing, was not Zhaoluo. Li immediately shied away, and the person\u0027s head lifted to look at her. He looked like someone she knew. He seemed like a somewhat jolly person, but he wasn\u0027t smiling. His young face was grim. Older than Zhaoluo, but not by too much. About the same height too. Still much taller than herself.\n\n\n\"Who are you?\" she managed to squeak. \"Where\u0027s Zhaoluo?\"\n\n\nHe looked pained at the mention of her sister, but he replied with a gentle voice, \"I could not find your sister.\"\n\n\n\"Why not?\"\n\n\nShe had barely asked the question before more foreign noises sounded outside whatever house they were in. Immediately, the man blocked her from whatever could be outside the house and raised two guns, pointing them at the windows. Wha? Where\u0027d he get those?\n\n\nHe crouched there for a moment before someone appeared at the window. And he shot. A small metal piece flew out from the gun and landed on her. She flinched as the windows shattered outward and a bright red liquid spurted into the air. There was a loud groan as the soldier fell backwards, and another person replaced him. However, the soldier shot with his weapon inward, missing the man and landing just to her left. She froze without a gasp, her chest tightening as fear made heat rush through her veins.\n\n\nAnd then all that she knew was death and glass as the man released another wave of metal from both guns.\n\n\nHer eyes shut by themselves, and she instinctively curled herself into a ball, hands on head. Li cried silently, and her tears trickled down onto the floor, merging with dust and dirt.\n\n\nThe sounds stopped. She dropped her arms and lifted her head.\n\n\nAs the man turned around, he slid the gun into the big pockets of his pants. Disappeared, just like that. He fixed a curious gaze on her, and she didn\u0027t like his scrutiny. She hated when adults did that. Despised their judgments.\n\n\nCouldn\u0027t forget the yelps of pain from the soldiers—even if they were enemies. Or that red blood.\n\n\nLi shivered as chilly air began to enter through the openings in the wall that used to be windows.\n\n\n\"Are you okay?\" the man asked. He didn\u0027t approach, thankfully. She didn\u0027t think she\u0027d be ready for that yet. He... killed people.\n\n\nLi nodded slowly, wrapping her arms around her legs and ducking. She winced as she remembered the pain in her legs and feet. Her eyes watered, but the tears were gone.\n\n\nHis eyes flicked to her legs with worry evident in them, but they remained like that before Li finally spoke.\n\n\n\"Who are you?\"\n\n\n\"Zhen.\" He took a seat, and Li suddenly felt uncomfortable with the man\u0027s back to the windows. Unsafe.\n\n\n\"Where\u0027s my sister?\"\n\n\nLi toyed with the frayed edges of her pants... where did her skirt go?\n\n\nAgain, he look at where she lifted the edge of her pants. Worried, worried, worried. Just like how Zhaoluo would be when she finds her. \"Dead.\"\n\n\nShe ceased movement. Her next breath caused a spasm of trembles to move through her. Breathing became hard. \"What?\" What?\n\n\n\"She\u0027s gone. The explosion killed her. Do you remember anything?\"\n\n\nLi started to cry, tears exploded as she sniffled the snot that began to form. \"All I remember is her hugging me and taking care of me and making sure I was all right—\" she knew she was being loud, but she couldn\u0027t stop \"—and telling me that Mama and Baba and Didi were gone and—\" her speech became incomprehensible.\n\n\nZhen scooted himself over to her, slowly and cautiously putting an arm around her. Li suddenly felt so much younger now, and she started bawling into him. He gingerly hugged her, unsure of what to do with a crying little girl.\n",
  "page 58": "\"I\u0027m sorry, LiLi. I can\u0027t get it.\" Zhaoluo muttered with any spare breath she could get. Luckily, the Japanese soldiers missed her as she rounded another corner and zigzagged her way to safety. She needed a breath. The sweat on her skin was an uncomfortable sensation as her clothes pressed against her, warmed with Li\u0027s heat.\n\n\nThe stout buildings around her seemed insufficient in hiding them, but at least they wouldn\u0027t be a target for bombs. Hopefully. Zhaoluo crept into a space between two small houses, dragging Li along with her.\n\n\nDirty streaks—where did the dirt come from?—ran down her stepsister\u0027s face, and Li\u0027s eyes were bright and red. Zhaoluo sighed heavily, an unfamiliar ache in her chest as she looked down on the lost child. Her own sister.\n\n\n\"LiLi,\" she began, still wary of her surroundings, \"if I went back to get that doll, we might have died or worse.\"\n\n\nShe was sniffling, but she babbled, \"Did worse things happen to Mama and Baba?\"\n\n\nCrap. She had to ask. Zhaoluo hugged the trembling child. \"They aren\u0027t with us anymore, but I can promise you that your baby brother would have loved to play with you and grow up with you.\"\n\n\nLi snuggled into Zhaoluo despite the sweat and mumbled, \"Do you love me?\"\n\n\nWith a bittersweet smile and a lump in her throat, Zhaoluo replied, \"That\u0027s a dumb question.\"\n\n\nMaking a sound between a groan and a laugh, Li shrugged her off. \"Alright. What do we do now?\"\n\n\nZhaoluo honestly didn\u0027t expect that kind of response. She just witnessed a mass burning, lost her doll, almost got shot, and was told that her parents and baby brother died and that was her reaction? Li had always been the joyous and happy child every parent wanted, but the sad, empty quiet in her right now bothered her.\n\n\n\"We have to go. Now.\" And just on time, yelling erupted at the end of the street and with a BANG, wood and stone showered onto them as they were blown off their feet.\n\n\n---\n\n\nShe was exhausted. Aching. Burning up. There was a pressure against her back, her legs. She felt heavy. Weary. The wood dust in the air, the stench of smoke. The heat was unbearable. But she couldn\u0027t move. She couldn\u0027t. She tried to take a deep breath but ended up coughing, her chest barely able to expand under the... the metal frame and wood planks pressing down on her.\n\n\nShe was going to die. Like her mother. Like her father. Like her brother. Tears slid down her face as she realized what was going to happen to her. She was too young. Too young for this. Fire exploded somewhere, and a scorching warmth assaulted her legs, and she alas screamed. Screamed for someone to help her. Where was her sister? Where was she? She didn\u0027t want to die like those people in that house. She wasn\u0027t ready for it. Where is Zhaoluo? Why can\u0027t anybody hear me?\n\n\nAt that thought, something thumped above her, and she could see fading light through her closed eyelids. She latched onto something soft, and somebody was whispering. Well, it seemed like whispering. A soft, gentle, male voice. Not like the Japanese. Nothing like them...\n",
  "page 51": "“We can’t leave.” Lisong threw his cotton jacket onto one of the chairs surrounding the dining room. “The government has abandoned us.”\n\n\nLi Maoxing could see the rage building up in the lines of her father’s face as he sat down heavily onto the chair. Zhaoluo, her half sister, sighed angrily as she took the pot off the small boiler.\n\n\nLi pulled at the arms of her five year old doll. “Baba, what does that mean?” she asked. “Why is Sister mad?”\n\n\nLisong looked at Zhaoluo, who was pouring him thin tea, and then at Li. When he lost his previous job, he had worn the same expression. His eyes dropped to the limp doll in her hands, and he said, “Don’t worry about it, LiLi.”\n\n\nLi walked to her father and hugged his arm. He always smelled like food.\n\n\n“LiLi, help me with Mama after this, okay?” Zhaoluo started setting up the table with mismatched bowls and slightly-bent chopsticks.\n\n\nLi piped up, “Okay!” She hugged her father again and gave him a serious look. “You three aren’t telling me something.”\n\n\nZhaoluo cut him a glance as he chuckled. “You’ll understand when you get older.”\n\n\nShe pouted in response and skipped over to her older sister, who only glanced down at her before saying, “You’ve had that doll since you were four.”\n\n\n“I know! But Grandma gave it to me,” Li replied, clutching the thin doll closer to her.\n\n\n“Whatever.” Zhaoluo finished with the table and washed her hands in the tub. “Come on.”\n\n\nThe father looked on sadly as his two daughters walked to their mother’s room in the cramped apartment. Li was nine years old, and Zhaoluo was fifteen. Soon, they might have another sibling. How could he let his children suffer through war? How could he submit to Chiang’s order for civilians to not evacuate Nanking?\n\n\nAs the door to the room closed, he heard the happy laughs of Li and Zhaoluo’s well intended questions. His wife’s responses were quieter. She was so close. Only a couple more weeks, and they’d have another child.\n\n\nHe sipped at the herbal tea and tried to distract himself. Zhaoluo was always good with tea. Perhaps that will attract a nice husband. She is beautiful, no doubt. Li was just a playful child who was really talented at dancing. She loved that doll because his mother gave it to her, and everybody loved his mother. His mother is so kind and hardy. He missed her.\n\n\nA shiver went through him as Li squealed at something her half sister did. He’s heard of what the Japanese planned to do—they thought they could take over China in just three months. Should they disobey leader Chiang and flee? Or shall they stay to defend the city containing the grave of the Father of China? Will more graves be dug?\n",
  "page 50": "Lisong rushed into the apartment, and in a frenzied voice, said to the stunned daughters, \"They just dropped leaflets into the city. They want the city to surrender within twenty-four hours.\"\n\n\nZhaoluo set the pot down and turned off the boiler. \"Baba, what are we going to do?\"\n\n\nLi stopped picking apart the ong-choy. \"What\u0027s wrong?\"\n\n\n\"The Japanese have defeated the troops outside the wall. I\u0027m guessing they\u0027ve surrounded the city,\" Lisong answered quickly, rushing over to the door to his room.\n\n\nZhaoluo let out a shuddering breath. \"This is why I told you to get to the safety zone! Now the Japanese are here, and you\u0027ve done nothing.\"\n\n\nThe man paused at the door. \"Your mother is exhausted. I was worried of moving her.\"\n\n\n\"You should be worried of all of us dying!\" Zhaoluo moved away from the counter.\n\n\n\"The promised to not kill those who do not resist. They respect East Asian cultures.\"\n\n\n\"And when have they ever kept their promises? They are the Japanese! They hate us, and they hate our culture.\"\n\n\nA soft but firm voice from behind the door stopped both of them from speaking. \"What\u0027s going on? Are we talking about the Japanese again?\"\n\n\n\"Don\u0027t worry,\" Lisong called. \"Do you think you can travel? We\u0027re going to the Nanking Safety Zone right now.\"\n\n\nFootsteps sounded, and his wife opened the creaky door. The bulging stomach was apparent through her clothing. She appeared tired, but her eyes made her face shine. \"Of course.\"\n\n\n\"Great.\"\n\n\n\"How are we going to get their? You realize that anybody with an automobile probably already left, right?\" Zhaoluo snapped, and Li looked frightfully between them.\n\n\n\"Watch your tone,\" Lisong reprimanded. \"We are packing now.\"\n\n\n---\n\n\nBaba is ridiculous, Zhaoluo thought as she folded various cloths into bags for each of them. They could\u0027ve left weeks ago when her stepmother wasn\u0027t as swollen as she was now. Money wasn\u0027t important. Couldn\u0027t he see? China is being destroyed by the Japanese soldiers. And their government had abandoned them. Those high officials don\u0027t know. They\u0027re cooped up in their grand buildings deciding on things they have no right to control. Like life.\n\n\nHow dare they prohibit the official leaving of civilians as they left only the untrained auxiliary soldiers here. A cold fire shook its way through her, and she trembled. Her stepmother is going to give birth in a few days.\n\n\nShe gazed at the creaky door, which had cracks in certain places. Zhaoluo really hoped that they made it to the safe zone in time.\n",
  "page 53": "\"We\u0027re going to Nanking, Hidesada.\" His friend whispered to him as they settled down for the night in one of the buildings that hadn\u0027t been completely obliterated with bombing.\n\n\nHe killed people. Shot them on the river bank with foreigners gaping at them with horrified eyes.\n\n\n\"The retreating Chinese army is burning and destroying as much as they can, so we can\u0027t use it.\" Kinmoto prodded him with a clean finger; the blood had been washed off with the waters of the Yangtze River. \"They have no sense of honor for fleeing. We are the greater beings.\"\n\n\n\"You aren\u0027t wrong,\" Hidesada replied, though a bit of doubt tinged his words. Was it really honorable to kill prisoners like that? Shoot them into the river?\n\n\n\"I also heard that they\u0027re giving orders to kill every Chinese person in sight. Ruin the city. Once the capital is down, their morale will drop like a hunting bird.\" His comrade sounded almost excited.\n\n\nHidesada forced a laugh and rolled onto his back, resting a hand on his cold gun. \"Conquering all of China, huh?\"\n",
  "page 52": "\"The Japanese will be heading to this city! We must hold a safe zone,\" James argued, pointing at the map before him. \"Think of the destruction at Shanghai.\"\n\n\nThe other man, clad in a light grey suit, stood beside the car, which had been packed with his belongings. \"You are just a businessman. What do you know of war? I would rather not get involved with the war between China and Japan.\"\n\n\nSeveral people in the circle around them mutter an agreement, shifting on their feet.\n\n\n\"And you, Charles Trimmer, are a doctor. You heal people. How can you not feel guilty for leaving the people? Have you heard of the horrors the Japanese unleashed after Shanghai? They are committing war crimes.\"\n\n\n\"To hell with that! What\u0027s the point if we could just DIE?\" Charles yelled, spreading his arms outward.\n\n\nSeveral people nod, but James only replied, \"You are a coward.\"\n\n\n\"And you, Mr. Lean, are a fool.\"\n\n\nA man with a thinning brown-grey hair and spectacles cleared his throat loudly, and the gatherers turned to him. \"I could ask some higher ups to intervene.\"\n\n\nThe others started whispering, and he heard, \"Nazi,\" at some point.\n\n\n\"I am German, and the Japanese cannot harm me because of the agreement between our countries. We can save lives here. Think of the people who can\u0027t or won\u0027t flee.\" In the large overcoat of his, the man walked toward James.\n\n\n\"Whether we are American, German, French, or Dutch, we are protected. The Japanese will not risk Western troops in the Pacific yet. If I run away now, I know I cannot live with the guilt of leaving the civilians behind. Did you not hear of the prisoners of war? Did you not here of their games? Can you live knowing you ran away from that? Do you know how many of us are here? Less than three dozen!\" John Rabe looked at each of the men in turn, piercing them with that sharp gaze.\n\n\nThe others fiddled with their hands or shifted on their feet. A younger man named Robert Wilson stepped forward toward the concentrated center. \"I will help.\"\n",
  "page 110": "The Japanese pulled out of Nanking. It was spring, and the refugees were no longer trapped. They trudged to their homes in silence only to break down with tears upon the sight of their homes. They looked at the streets, caked with red, with the same horror Zhaoluo felt when she first entered the city and realized her family\u0027s end. Or set off those bombs. Their bodies trembled, grey and grail, from loss, addiction, and disbelief.\n\n\nThe government did not return, but people did. And so they began to rebuild Nanking.\n",
  "page 65": "Frightened of surprises, Li entered the closest house through the unlocked door. What was the point of locking it? The Japanese would just break the door if it were locked.\n\n\nInside, she found little to nothing. Yes, a few clean, but thin, robes were folded into a small chest at the corner, but that was all she could find that seemed useful. Li changed into the bigger clothes after rubbing down, tying and folding at the right places to make it fit her. Zhaoluo would be proud of her.\n\n\nSuddenly, she heard the snuffling of people nearby. It was somewhat bright outside—as bright as winter can be—and she could see figures outside as she peeked out. The figures looked into the building, and she ducked. They probably saw me, Li thought, fear pumping into her veins as she backed behind the bed. She was paralyzed. They saw me, they saw me.\n\n\nThe door banged open, and she heard the men laugh. They saw her. Her eyes were wide, but she shut them. She was going to die. She was going to die.\n\n\nThey pulled her up and yelled at her, so loud, so roughly.\n\n\nAnd Li didn\u0027t die yet. What happened was worse. So much worse. Everything hurt, and she was bleeding from head to toe by the time they were done with her. The blood was warm, and her infection was stinging, and everything hurt.\n\n\nEnd me. Li couldn\u0027t take it. She cried. She wanted Mama and Baba and Zhaoluo. She even wanted Zhen. They made her feel safe. They made her feel like the person she\u0027s supposed to be right now—a young girl. She wanted to live, oh, she wanted to live.\n\n\nSomeone was gripping their hands around her head, and she heard something crack but couldn\u0027t register it as everything blinked out.\n",
  "page 68": "Li walked over to the woman and whispered, \"Hello?\"\n\n\nThe woman froze and blinked up to look at Li. There was a look of fear, then relief, then a return to panic. \"Help me!\"\n\n\n\"I-I...\" Li looked at the beams. She had been trapped under the metal frame and logs of a broken house, too weak to escape. Her clothes were ripped as if she struggled a lot, and she bled a bit. \"How can I help?\"\n\n\n\"I don\u0027t know, but do something!\" She was frantic, fearful, and shivering. From the cold or what, she didn\u0027t know.\n\n\nAnd always at the wrong times, she heard many people running. Laughing. Yelling. Li couldn\u0027t stay here. She couldn\u0027t. She\u0027d die. \"I\u0027m sorry!\" Li whispered.\n\n\n\"Wait! Please!\"\n\n\nBut Li only turned and ran, refusing to look back. She didn\u0027t see any Japanese soldiers, but she felt something whiz by her ear, nicking it.\n\n\n\"HELP ME!\"\n\n\nLi looked back once to find the Japanese men crowding around where the woman had been trapped. And two particularly savage-looking ones chasing her. As she ran, she leaned forward to pick up a stone brick the size of her fist, feeling lucky as something zoomed past her where her head had been. She glanced back and chucked the stone backwards. Li could tell that she hit when one of them groaned and, from the sounds he made, seemed to fall.\n\n\nShe was sore already. Sore and exhausted, but fear drove her on. She dashed, sometimes sprinted, her way until she was back in an abandoned but not devastated part of the city. She had tripped a few times, but nobody was there to pull her up—whether to kill her or help her. Her bandages were torn, and she felt blood and something nasty trickling down her leg.\n\n\nFinding a relatively safe-looking house to sleep in, Li thought, I want this to be over.\n\n\nThere was no water. There was no food. And she was hungry and thirsty. She wanted it to rain, but there was no rain. Any rain would probably be poisoned by smoke and dirt anyway. She wanted food, but there was no food. She wanted warmth, but still, the wintry winds blew.\n\n\nLi sighed, not knowing what to do. Her mother and father or even Zhaoluo had always told her what to do. She didn\u0027t know. For the umpteenth time since she left her house, she cried. And then she unwrapped the bandages carefully, unprepared for what was underneath. She stared at the infection, furious and ugly, wondering how those spots were a dark creamy color and why this spot was dark and why some parts were bloated and others rash red.\n\n\nShe wished she had water. She wanted to wash this all off. It was like a thing... growing on her. What did Zhen do? Bandages? Li rolled the pant leg up and stood. She searched the house for anything that could substitute for a bandage, and she found some clothes. She wanted to wear them herself—to replace her own dirty clothes—but Zhen had used most of his disinfectant to make sure this wound didn\u0027t get an infection. Suspicions, however, rose. Had he poisoned her? No way. He saved her. Protected her. It didn\u0027t make sense.\n\n\nJust keep yourself alive, Li, was what Zhaoluo would\u0027ve said. It doesn\u0027t matter who goes down. Make sure you keep going.\n\n\nIt seemed right, but... Li refused to let any thoughts get into her head. She couldn\u0027t take it if they did. Instead, she used one of the drab robes to pat down the wound, wincing at contact, and the other to wrap over it. It wouldn\u0027t do, but she had no choice.\n\n\nNo choice.\n",
  "page 67": "The safe zone will be... safe. Because it is. There will be people there that will protect her. Li quickly moved forward and down the street. They said that it was in the center of the city. Li\u0027s never seen a map before (she never really left the general area of her house), so she didn\u0027t know where to go. Except... except it was in the center—the middle. If the Japanese were coming from outside the wall, the center of the city is the last place they\u0027d reach. Which meant Li just had to make sure she was staying in this kind of area... where the houses tempted her with safety and warmth.\n\n\nShe trudged, alone, down the street, only ducking behind a house as the Japanese entered from where she had come. She slipped her way through the houses, not knowing where she was or where she was going. Just away. Always away.\n\n\nHaving walked a bit already, Li stopped when she heard more human sounds. Always those sounds. Someone was groaning, crying. Begging for help. Cautiously, Li stepped closer and closer to where the sounds came from—underneath some wreckage?\n\n\nBeneath some beams was a sniffling woman. She hadn\u0027t seen her yet, so Li stayed away. She felt bad. She did, but how could she help her? How?\n",
  "page 69": "She had to leave... if she stayed, they might find her. And she didn\u0027t want to risk that after everything Zhaoluo and Zhen did. Li had to keep moving. She spun away, grateful the woman hadn\u0027t seen her, and left.\n\n\nShe was sore already. Sore and exhausted, but fear drove her on. She dashed, sometimes sprinted, her way until she was back in an abandoned but not devastated part of the city. She had tripped a few times, but nobody was there to pull her up—whether to kill her or help her. Her bandages were torn, and she felt blood and something nasty trickling down her leg.\n\n\nFinding a relatively safe-looking house to sleep in, Li thought, I want this to be over.\n\n\nThere was no water. There was no food. And she was hungry and thirsty. She wanted it to rain, but there was no rain. Any rain would probably be poisoned by smoke and dirt anyway. She wanted food, but there was no food. She wanted warmth, but still, the wintry winds blew.\n\n\nLi sighed, not knowing what to do. Her mother and father or even Zhaoluo had always told her what to do. She didn\u0027t know. For the umpteenth time since she left her house, she cried. And then she unwrapped the bandages carefully, unprepared for what was underneath. She stared at the infection, furious and ugly, wondering how those spots were a dark creamy color and why this spot was dark and why some parts were bloated and others rash red.\n\n\nShe wished she had water. She wanted to wash this all off. It was like a thing... growing on her. What did Zhen do? Bandages? Li rolled the pant leg up and stood. She searched the house for anything that could substitute for a bandage, and she found some clothes. She wanted to wear them herself—to replace her own dirty clothes—but Zhen had used most of his disinfectant to make sure this wound didn\u0027t get an infection. Suspicions, however, rose. Had he poisoned her? No way. He saved her. Protected her. It didn\u0027t make sense.\n\n\nJust keep yourself alive, Li, was what Zhaoluo would\u0027ve said. It doesn\u0027t matter who goes down. Make sure you keep going.\n\n\nIt seemed right, but... Li refused to let any thoughts get into her head. She couldn\u0027t take it if they did. Instead, she used one of the drab robes to pat down the wound, wincing at contact, and the other to wrap over it. It wouldn\u0027t do, but she had no choice.\n\n\nNo choice.\n",
  "page 60": "Eventually, Li\u0027s crying died down, and her emotions dulled into a sluggish storm inside her. The fire in her legs spiked again, and she whimpered. \"My legs hurt.\"\n\n\nZhen released Li and turned his attention onto her injury, lifting the pant leg up to reveal burn marks all along are legs and the bottom of her bare feet. \"You were burned by the bomb. It\u0027s a miracle that you\u0027re still alive.\"\n\n\n\"They hurt.\"\n\n\n\"I know.\"\n\n\nLi couldn\u0027t take her eyes off the reddish brown burns against her pale skin. \"I\u0027m never going to marry, am I?\"\n\n\nThe question was so ridiculous to Zhen that he was snapped out of his worried daze. \"What?\"\n\n\n\"Baba always said that we had to be scarless and snow white and proper and everything.\" Li frowned at what this could mean for her. \n\n\nZhen frowned at what this could mean for her tolerance of destruction. And stuff like that. \"Can I ask your name?\"\n\n\n\"Li Maoxing.\"\n\n\n\"Alright, Li. This is how it\u0027s going to be. Because you\u0027re, ah, sister is gone, I\u0027ll help you. You\u0027re just a little kid.\" His prod was intentional, but it gave him the reaction he wanted.\n\n\n\"I\u0027m not little!\" Li scowled at him.\n\n\n\"We\u0027ll see about that.\" Zhen moved on to the more important matter. \"You have to get to the safe zone.\"\n\n\n\"What about you?\" Li looked up at him with those large, childlike eyes. \"Are you going to go there too?\"\n\n\n\"Ah, sure,\" he lied, and he hated himself for it. The kid just lost everything, and he had an uncomfortable feeling that she was going to latch onto him next. But he couldn\u0027t have just left her to die in the fire.\n\n\nLi gave him a smile, full of hope but also hinting at despair. Emotions were two-sided like that. \"Thank you, Mr. Zhen.\"\n\n\nHe gave her a curious look but didn\u0027t push it. \"Alright...\"\n\n\n\"Oh, just one more thing, sir.\"\n\n\n\"Hmm?\"\n\n\n\"Where\u0027d you get the guns?\"\n\n\nSurprised that she remembered those—well, not surprised, really—he stammered, \"Er, stole them. From some Japs.\"\n",
  "page 62": "Li was wrapped in a somewhat coarse blanket, and she slipped out of it, placing two feet onto the cold wooden floors. There was a tin on the table, but the room was otherwise bare. No sign of Zhen.\n\n\nShe made her way over to the tin and had to stretch to get it. It wasn\u0027t fair that Zhaoluo could be so tall... It wasn\u0027t fair at all. She tried to open the tin with her fingers, but that didn\u0027t work, so she placed it back. The house is dusty, she noted to herself and felt the urdent need to clean it. She didn\u0027t feel safe at all... but she didn\u0027t feel endangered.\n\n\nSuddenly, the door opened, and Li froze like a bird in trauma, staring at Zhen\u0027s smile with shock. He wasn\u0027t carrying anything. It was like... he was just on a walk. His jacket almost seemed to flutter, and Li gaped.\n\n\n\"Li, what\u0027s wrong?\" The smile disappeared. She must\u0027ve looked frightened.\n\n\n\"I thought you were a Japanese soldier!\" she cried, taking a seat on the floor to relax.\n\n\nZhen rounded the table and kneeled beside her. \"I\u0027m not.\"\n\n\nRight... \"Hmp.\" Li glared at him, clearly mad and scared. \"Where are we?\"\n\n\n\"It wasn\u0027t safe last night to stay in that house, so I moved you here.\" He shrugged. \"The Japanese rushed up at us.\"\n\n\nAnd you killed them, didn\u0027t you? ... But can I believe that of you? You did kill them before, but that was just in front of me. \"I want to get to the safe zone as soon as possible.\" Li started to cry, and Zhen, again, felt uncomfortable.\n\n\nWhy do kids randomly cry? He patted her on the back, and she started to blabber. \"Mama and Baba are gone, and they probably got Didi too, and he never lived any, and Mama was so nice, and Baba refused to leave her, and Zhaoluo dragged me off when the Japanese invaded, and I don\u0027t really know what happened to them. And now Zhaoluo\u0027s dead, and I don\u0027t know what to do. She said I had to get somewhere safe, but she\u0027s dead. They\u0027re all dead. All of them. My family. I lost Chichi yesterday. I have nothing.\"\n\n\n\"I\u0027ll get you to the safe zone. Maybe you\u0027ll find someone to help you.\" He certainly couldn\u0027t himself. He couldn\u0027t even stay in the safe zone.\n\n\nWhatever she said became a lot of breaths and sniffling, so Zhen just picked her up, wrapped the blanket loosely around her, and carried them out the house, which is sure to be plundered soon.\n\n\nAs he walked, the girl fell asleep again, and Zhen wondered how many times he\u0027d have to carry her around. She wasn\u0027t exactly a burden, but she was still something. Like time-consuming. He didn\u0027t hate children... but... she was so young. Lost in the city.\n\n\nThe city where half the buildings on the streets were destroyed, a pile of rubble. The city where the dusty streets were ever changing by the wind that blew. The city where civilians hid in buildings, hopping, or simply running to be safe and get to the safe zone. Those were the survivors. The ones that left the roads red with Chinese blood... those were dead.\n\n\nA cry from nearby snapped him out of his thoughts. A woman was crying for help, and the Japanese soldiers were shouting for her to stop. Zhen ducked behind the wreckage of a building and several broken up crates, clearly pillaged of whatever could\u0027ve been in there.\n\n\nTwo women were coming up the street now; both where normal robes and we probably unmarried, seeing how their hair hung in part as braids and in part loosely down their backs. Right now, that hair jumped into the air with every step. One woman stumbled on a prone body, and she screamed and yelled, \"Help me! Help me!\"\n\n\nBut the other woman did not turn back. She kept running. Of course, the Japanese soldiers quickly managed to pull the fallen woman up, laughing as they did so. They were shouting at her and prodding her, and Zhen looked down as they ripped open the front of her robe. Li\u0027s eyes stared up at him.\n\n\n\"Mr. Zhen, what\u0027s happening?\" Her voice was scared, but quiet, as if knowing the consequences of speaking loudly.\n\n\n\"They\u0027re doing bad things to her, Li.\" Zhen\u0027s voice sounded powerless even to himself.\n\n\nLi\u0027s eyes were wide, but she knew it wasn\u0027t the time to ask. \"Oh.\"\n\n\nThe woman was begging now, and Li, knowing almost every word she said, felt silent tears run down her face. Zhen began to pick his way away from the woman, who probably never did anything bad enough to deserve something like that. He felt like he should go back to help her. He helped Li. Twice.\n",
  "page 61": "Wood showered upon them as something thumped on the roof.\n\n\n\"Shit.\" Zhen scooped Li into his arms, surprised at her weight. She was chubby but lighter than he expected.\n\n\n\"What\u0027s—\" As Zhen leaped out of the door, which had been swaying on its hinges, the building exploded. Li finally got to see the destruction the bombs inflicted. Red fire and grey smoke burst the building apart with its great plumes, adding to the ashes in the air.\n\n\nZhen grunted and stumbled a bit; she looked down and yelped. It was... a dead body. Burnt beyond recognition. \"Arson.\"\n\n\nShe shivered. She was very, very scared of fire. \"Are they close by?\"\n\n\n\"The Japs? Probably. We need to be under cover though. Stable cover. To hide from planes and soldiers. Like a bridge.\" Zhen darted under another building, which had one of its walls blown off and two dead bodies inside, bleeding and already beginning to rot.\n\n\n\"Bridge?\" Staring at the bodies with wide eyes, Li thought about bridges. She didn\u0027t think that would work. It seemed too open.\n\n\n\"Yeah. They need those bridges too. I doubt they\u0027d bomb them.\"\n\n\n\"Oh.\" He set her down, and she turned away from the two bodies, their faces heavy-looking with an expression of open panic.\n\n\n\"We need to get your own burns patched up otherwise it might get infected.\" He unbuttoned his jacket to reveal a small amount of supplies attached inside. Li stared in wonder at the various little containers and pressed rectangles of bandages.\n\n\nWho is he?\n\n\n\"Alright.\" He removed a vial of clear liquid from its attaching loop and proceeded to clean her wounds. It was mesmerizing to watch as he removed the burned skin, dirt, and dried blood caking the wounds from the back of her legs. It was odd to let somebody other than Zhaoluo or even her mother touch her, but that didn\u0027t matter at the moment.\n\n\nWhat mattered was that he was pulling out a square of white bandages and applying them to her wound. What mattered was that in Zhen\u0027s jacket was a small circle with words printed around it. What mattered was that those words weren\u0027t Chinese.\n\n\nLi didn\u0027t know what to do. This guy was... Japanese. She hadn\u0027t looked at him closely enough—it was improper—to tell the difference, and his Chinese was impeccable. If Zhaoluo were here...\n\n\nZhaoluo could be alive for all she knew. Zhen could\u0027ve lied.\n\n\nHer foot stung again as he applied fresh disinfectant, but Li couldn\u0027t rid herself of the image of the circle and those foreign letters. As he slid the pant leg down over the sinfully clean bandages, Zhen spoke.\n\n\n\"You need to get to the safe zone. But...\" Zhen\u0027s eyes drifted outside, and Li followed them. Smoke was starting to cloud up the sky, but even without it, it was getting dark.\n\n\n---\n\n\nLi blinked, drowsily sitting up and rubbing her eyes. Where were they? It didn\u0027t seem bright outside, but it was winter... and there was smoke. She remembered... remembered... but she wasn\u0027t inside the building she fell asleep in. That house didn\u0027t have a wall; this building was perfectly normal on the inside—table, bed, cooking counter, etc. Li scanned the ground. Where was Zhen?\n\n\nHer fears and doubts came rushing back at that. Did he sell her out to the Japanese? Was he really part of the Japanese? What was she doing in this building? What was going to happen to her?\n",
  "page 64": "Li didn\u0027t know where she was going. It just had to be away from the fighting. Away from her rescuer, who could be teaming back up with his buddies by now. She had nothing on her. Her thin slippers had already lost themselves somewhere, and the boring pink robe was somewhat stiff from sweat or dirt or tears. But she was alone. She didn\u0027t know where she was. What she was doing anymore. Nobody was there to guide her. Where was her sister? Parents? Zhen?\n\n\nShe felt like the little girl she was running through that street, eyes wide at the loud sounds of war behind her. Knowing in a way she would have not known before that... Zhen is dead. Everyone\u0027s dead. Almost crying by now (her thirst not allowing), she kept sprinting away.\n\n\nHer soft feet hurt against the dirt, which was laced with pieces of metal and wood and stone. What was she doing? She heard more sounds to her right, and she ran from that too. Through the cracked streets... until... Li blinked carefully and looked at her surroundings. These houses weren\u0027t bombed or destroyed or broken yet. The planks were perfectly in place, and the windows weren\u0027t shattered. When she turned back, she couldn\u0027t witness the destruction, but she could hear it in the wind and see it in the smoke.\n\n\nShe turned back toward the street of houses before her. They were going to come here soon, which meant...\n",
  "page 63": "Zhen made a noise that meant he knew nothing good would come out of it as he set Li down on two feet. \"Stay here.\" He didn\u0027t look to see her reaction. He dashed back toward the woman on the other street, avoiding a body half-hidden by charred wood and ash. He pressed himself against the wall of the charred building, grateful some parts of the walls were still attached—and last night\u0027s rain—and looked over the corner. The woman was hopelessly vulnerable, her white flesh dirtied by the Japanese soldiers\u0027 hands. Zhen bit his lip. He didn\u0027t want to acciently shoot the woman. With a single gun, he aimed at the dusty ground before them, a spot untouched by the humiliations of war. He let the bullet loose.\n\n\nThat was all he could do for the woman because right now, he needed to run before those angry soldiers found them. When he saw Li between the two thing and broken walls of the surrounding houses, the fading morning light shining like a spoltlight on her, he also saw the soldiers coming in from the other, darker end.\n\n\nThey barked and raised their guns at Li. Zhen sprinted forward and lifted his two guns, shooting two soldiers (though not dealing anything fatal). They four left looked up, raising their own guns to point at him. He hated it when guns were pointed at him.\n\n\n\"Li! RUN!\"\n\n\nHer head jerked up; how had she not noticed him nor the soldiers? How could she not be alert at the moment? The city could be swarming with Japanese troops. He saw why.\n\n\nLi was standing up, but her pant leg was rolled up. The bandage wasn\u0027t fresh anymore, but she had begun peeling it off. Underneath, there was an unsightly infection.\n\n\n\"RUN, YOU IDIOT!\" Zhen yelled, and he could hear himself being surrounded by the Japanese. Li ran. She ran into the side of the broken building to his left, through that building, and was gone.\n\n\nHe let loose several shots, determined to take down as many of his persecutors. They had already fired back, and in that storm of bullets, he held onto his last secret.\n"
}