[
  "36",
  "Undead Persona",
  "Tanstaafl",
  "7",
  "6",
  "6.53",
  "https://chooseyourstory.com/story/Undead_Persona.aspx",
  "Play as a human turned-Vampire forced to kill to survive. As a man dying for eternity, you set your mind and body to find and kill the man who made you this way.\nFind the light in the blinding rush that is vengeance or embrace the darkness that is your being.\nBeware the Zealous and fear the Professor.\n---\nNOTE: You are encouraged to use the \u0027go back\u0027 button if the need ever arises in this game, as death scenes are aplenty. They aren\u0027t random though, and if you read and think through every choice survival should be easy enough. Still, it\u0027d be a shame if you stopped playing after a premature ending, so make use of that button! Thanks, and good luck.\nAnother NOTE: There will be times in the story where \u0027choices\u0027 will be labeled as \u0027optional\u0027. They aren\u0027t necessary to the story, but they add more beef and \u0027behind the scenes\u0027 action to it.\nThird NOTE: As of now, there are 4 \u0027official\u0027 endings, one of them true, two of them good/evil, and the last practically a loss. There was supposed to be an expansion added to the game where you\u0027d have the choice to leave Kelso, and that path is actually thought out and partly-written already-- however, looking at it realistically I do not have the time nor the motivation to finish it so I\u0027m republishing it on the grounds that it\u0027s entirely self-contained.\n---\nHUGE thanks to:\nJJJ-thebanisher- for giving extremely helpful advice on how to write fight scenes.\nAman- For urging me to get this finished. \nDrakilian- His evilness is contagious.\nEndmaster- Just an inspiring dude.\nSethaniel- Just an inspiring dude (and a judge).\nFleshnblood_78- Also a judge, and a pretty cool dude as well.\nMadglee- for hosting the contest which pretty much forced me to finish.\nVarious teachers who have supported writing and creativity in general.\nAnd the Sonny games by Krin. (As this storygame is loosely inspired from it.)\n2nd Place Contest Entry for the 3/1/2015 Post-Apocalyptic Storygame-Tournament!"
]