{
  "page 123": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 122": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 124": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 127": "\"Well I have a sister named Lily who is five years younger than I am and my two parents. That\u0027s it.\" You look at her.\n\n\"Are you sure you don\u0027t remember anything? Anything?\"\n\nShe shakes her head. \"I had a family, I guess. But no specifics. I don\u0027t remember where I lived, if I had a job, friends . . . not even how I ended up drowning.\" She sighs and lays her head on your shoulder. You give her a comforting hug.\n\n\"Just look to the future. Not the past.\"\n",
  "page 126": "\"You know, I know nothing about you or your past,\" Marina comments.\n\n\"I know nothing about you,\" you counter.\n\n\"That\u0027s different. I can\u0027t remember much about my past. You should remember a lot more.\"\n\nYou roll your eyes and decide to tell her about . . .\n",
  "page 128": "\"I used to live in New York. I had an apartment, which I guess was okay. It wasn\u0027t anything special. Well, actually, it was less than ordinary. I could barely afford it with the job I had--I worked at a McDonalds--and I think I probably would\u0027ve been evicted soon. I didn\u0027t have a roommate to help with the rent; I rarely saw my parents or my sister. Really, everything was horrible.\" You sigh and your head droops a little. \"It was lonely there. I guess that\u0027s why I moved here. No more crabby people--or people at all, for that matter--and no more annoying noises at night. Peace and serenity. But really, \" you turn and look at her, \"I\u0027m glad I\u0027m not alone anymore.\" She smiles warmly.\n\n\"Are you sure you don\u0027t remember anything? Anything?\"\n\nShe shakes her head. \"I had a family, I guess. But no specifics. I don\u0027t remember where I lived, if I had a job, friends . . . not even how I ended up drowning.\" She sighs and lays her head on your shoulder. You give her a comforting hug.\n\n\"Just look to the future. Not the past.\"\n",
  "page 77": "You pick the strawberry up off the ground and throw it back at her. She squeals and jumps out of the way. She beams and picks several strawberries and fires them at you as she hustles toward the blueberries. You dodge and pick up all her fired fruit and throw it right back at her. You two laugh and play Fruit War for almost an hour. When you two finish, you\u0027re both sweaty and gasping.\n\n\"Great game,\" she huffs.\n\n\"Yeah,\" you puff. You laugh slightly. \"I won.\"\n\n\"No way!\" She gives you a playful slap on the arm. \"I won!\" You shake your head with glee. You two look at each other. You decide to . . .\n",
  "page 76": "\"Oh please, of course I remembered!\" You turned around and threw the coconut like a basketball over the barrier or plants. \"I just wanted to play coconut basket ball.\" She snorts.\n\n\"You are a horrible liar.\" You shrug. She twirls a strand of her hair with her finger. \"But maybe I can let it go.\" She looks down and murmurs, \"Do you want to . . . go steady?\"\n",
  "page 79": "You go up behind her and spin her around, then press against her lips before you can change your mind. You again hear her yelp and yet again she pushes you away. This time she looks disgusted.\n\n\"Maybe we should just be friends,\" she sighs.\n",
  "page 78": "\"Nice shot,\" you snicker. She sighs and picks yet another strawberry. You put your hands up in defense and she rolls her eyes.\n\n\"I want to eat this one, stupid.\" She pops it into her mouth and chews thoughtfully. \"You\u0027re not good with girls, are you?\"\n\n\"I haven\u0027t been around one for years,\" you point out.\n\n\"Then I guess I can overlook these mistakes.\" She throws the leaves of the strawberry at you.\n\n\"You\u0027re eating all my crops.\"\n\n\"Yeah. That way you can\u0027t make any more of your fruit salads.\" She smiles and goes to find the blueberries.\n",
  "page 71": "\"Marina, can I show you something?\" you ask her when you get into the living room.\n\n\"Okay, sure,\" she says. You\u0027re a little surprised by her quick reaction, but you\u0027re glad that she gave in.\n\nYou take her around the hut to the south side of the island. \"Where are we going?\" she demands.\n\n\"Somewhere special,\" you always answer. You take her to a cluster of bushes and palm trees that are thick like a barrier.\n\n\"Now what?\" she huffs. You smile and pull back one of the bushes to reveal an opening. You gesture for her to go in. She gives you a skeptical smile and crawls in. You follow close behind. \"Whoa.\"\n\nYour secret garden, the one where you get your fruit, is kept behind the barrier. Pineapple, strawberries, grapes, coconuts, cantaloupe, and several other kinds of fruit are grown. You even have a couple vegetables. You offer her a fresh . . .\n",
  "page 70": "You are still in bed. After the failed attempt at giving Marina a kiss, you can\u0027t bring yourself to get out of bed. You have to find a way to make it up to her.\n",
  "page 73": "\"Seriously?\" she hisses. \"Didn\u0027t I tell you I was allergic to coconuts? Because I am.\" She gives you a sour glare and you are slapping yourself internally. She turns back to the multitude of fruit and picks a strawberry. She wiggles it in your face. \"This is what I love. Strawberries are my favorite!\"\n",
  "page 72": "\"Hey, can I show you something?\" you ask as you walk into the kitchen. She\u0027s cutting up a pineapple.\n\n\"Depends,\" she answers. \"Where is this something?\"\n\n\"It\u0027s very special and at a very special place.\" She rolls her eyes. \"Please?\" She gives in.\n\nYou wait for hours and she keeps trying to get you to tell her, but you don\u0027t break. Finally, at about six-thirty, you tell her it\u0027s time to go. She\u0027s really excited, waiting all day and everything. So when you finally get her down to the beach, she\u0027s disappointed.\n\n\"Why are we here?\" You smile.\n\n\"Just wait.\"\n\nThen, finally, the sky starts to turn pink. You point at the sky and she sighs, \"Ahhhhh,\" and sits down on the sand. \"Beautiful!\"\n",
  "page 75": "\"Sorry, sorry, sorry! Is that all you say?\" She groans and throws the berry at you. You dodge it and she picks another one and throws that one, too. It slaps you in the shoulder and juice gets on your shirt.\n\n\"Hey!\" you squeak. She raises her eyebrow.\n",
  "page 74": "\"I love strawberries!\" she gasps, taking it from you.\n\n\"It\u0027s sweet. Like you.\"\n\nShe smiles sarcastically. \"I tell you you\u0027re sweet like strawberries!\"\n\n\"Yeah, I guess.\" She flashes you a couple glances and she bites her lip. You . . .\n",
  "page 130": "You decide not to change any relationship with Marina.\n",
  "page 132": "\"Can we go to the beach today? I miss the water,\" Marina suggests.\n\n\"I don\u0027t know. I\u0027m pretty tired today.\" You yawn to prove it.\n\n\"Please?\" Marina begs.\n\n\"How about you go down there and I\u0027ll meet you. I\u0027ll even bring a special surprise.\"\n\nShe sighs, \"Fine.\" Then she walks out the hut and you\u0027re left alone to think up a surprise for her.\n",
  "page 131": "You admit your love to Marina. She smiles and nods in agreement.\n",
  "page 112": "After the kiss she laughs in joy. \"Finally, you understand.\" She puts her arms around you and kisses your neck. You lay back and lift her up. \"Hey!\"\n\n\"You are perfect,\" you whisper.\n\n\"Yeah, yeah. Whatever.\" She sticks a pineapple into your mouth. But she keeps her grin on the whole time.\n",
  "page 111": "\"Oh.\" She laughs nervously. \"Weird.\"\n\n\"Is something wrong?\"\n\n\"No. Nothing. It\u0027s just weird that you compare me to a cold-blooded fish.\"\n\n\"I\u0027m sorry,\" you murmur. \"Sorry that you smell like tuna.\" She slaps you playfully.\n\nA flash of lightning roars outside and she flinches, clenching onto you.\n\n\"It\u0027s okay,\" you whisper close to her. She looks up at you expectantly.\n",
  "page 114": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 113": "\"Is that your signature now?\" she jokes, taking a bite out of the red fruit.\n\n\"Kinda,\" you reply, eating some pineapple. \"Just be glad I don\u0027t give you a coconut.\"\n\nShe rolls her eyes and puts her head on your shoulder. \"You make me feel safe.\"\n\nYou smile. She makes you feel safe too.\n",
  "page 116": "After the kiss she laughs in joy. \"Finally, you understand.\" She puts her arms around you and kisses your neck. You lay back and lift her up. \"Hey!\"\n\n\"You are perfect,\" you whisper.\n\n\"Yeah, yeah. Whatever.\" She sticks a pineapple into your mouth. But she keeps her grin on the whole time.\n",
  "page 115": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 118": "You grab her ankles and start toward the door. After you get her outside, her head drops a couple inches from the front step of the house to the ground. Her head bops up and she jerks awake.\n\n\"What the heck?\" She sees you dragging her. \"What are you doing?\"\n\n\"I didn\u0027t know how to get you awake and I wanted to get you outside. So I\u0027m accomplishing both.\"\n\n\"You\u0027re annoying me!\"\n\n\"Okay, three things at once.\" You smirk. She sarcastically smirks back.\n\n\"Where are we going? And stop dragging me!\"\n\n\"The beach and no.\" She kicks her legs, but you keep a strong grip. As soon as you reach the beach\u0027s sand, you let go of her. She gets up and runs her fingers through her hair to get the sand out of it.\n\n\"Now why did you take me here?\" she asks, annoyed.\n\n\"Look up.\" She does and gasps. The stars are bright and you can see millions of them here.\n\n\"Wow,\" she awes. \"Beautiful.\" She looks back at you. \"Okay. Thanks.\" You smile.\n",
  "page 117": "\"Is that your signature now?\" she jokes, taking a bite out of the red fruit.\n\n\"Kinda,\" you reply, eating some pineapple. \"Just be glad I don\u0027t give you a coconut.\"\n\nShe rolls her eyes and puts her head on your shoulder. \"You make me feel safe.\"\n\nYou smile. She makes you feel safe too.\n",
  "page 88": "Marina and you are the best of friends.\n",
  "page 87": "Her face falls. \"But . . .\"\n\nYou shake your head. \"Just not yet. Not now.\" You look into her entrancing eyes. \"But maybe eventually.\"\n",
  "page 119": "You run your fingers lightly on her underfoot. She giggles and her eyes flitter open and she breaks out into hysterical laughter. \"Stop! Stop!\" she shrieks, jerking her feet away. \"What was that for?\"\n\n\"You needed to wake up. Do you want to go see the stars?\" She groans in annoyance.\n\n\"Fine. But you have to carry me.\"\n",
  "page 89": "You are still in bed. After the failed attempt at giving Marina a kiss, you can\u0027t bring yourself to get out of bed. You have to find a way to make it up to her.\n",
  "page 80": "\"Hey, Marina!\" you call. She turns around and you hurry toward her. \"Can I get a kiss?\"\n\nShe laughs. \"What? Seriously?\"\n\n\"Too soon?\" you cringe. She smiles and shakes her head.\n\n\"Nah. Just glad I get a warning.\" She reaches up and brings your head down and your lips meet.\n\nBliss, you think.\n\nAfter the kiss she looks up at you and smiles. \"You wanna do this? This relationship?\"\n",
  "page 82": "Her face falls. \"But . . .\"\n\nYou shake your head. \"Just not yet. Not now.\" You look into her entrancing eyes. \"But maybe eventually.\"\n",
  "page 81": "She smiles wide. \"Thank God.\"\n",
  "page 84": "You lean into her and she leans into you and your lips meet and you kiss heartily. When you pull away she says, \"Are you sure you want to do this relationship?\"\n",
  "page 83": "Marina and you are the best of friends.\n",
  "page 86": "She smiles wide. \"Thank God.\"\n",
  "page 85": "\"Maybe we should just be friends?\" you offer. She shrugs.\n\n\"I can do that,\" she agrees.\n",
  "page 121": "\"Well then I guess I\u0027m not gonna see the stars,\" she huffs. You shrug.\n\n\"Okay, then.\" You walk to the door and glance back at her. Her arms are crossed and she\u0027s pouting. You walk out of the hut and close the door behind you. You find it a little weird to treat her like a little kid, leaving her there to have her follow, but you assume it will work.\n\nYou arrive at the beach and you don\u0027t think she followed you, but you still sit down on the beach and stare up at the sky. The stars are twinkling and you can make out several constellations.\n\nMarina would love this, you think. You look back but see no sign of her. After ten minutes you go back to the hut and find her still on the floor.\n\n\"It\u0027s \u0027bout time you came back,\" she sighs.\n\n\"You didn\u0027t want to see the stars. They really were beautiful.\"\n\n\"I can see them from the window.\"\n\n\"Okay. Not as good, though.\"\n",
  "page 120": "You bend down and take her into your arms. She clings around your neck, afraid you\u0027ll drop her. You snicker at her fright, but you don\u0027t pretend to almost drop her like you want to. When you arrive at the beach you put her down on the sand and take a seat next to her.\n\nYou point out all the constellations you know to her and she awes the sight of all the twinkling stars. You put your hand on top of hers and she blushes, but doesn\u0027t pull away.\n\n\"This is nice,\" she says. You nod. \"I wish this would never end, you know?\"\n\n\"Yeah. I know.\"\n\n\"I wish it was like this all the time.\"\n\n\"I know.\"\n\nShe looks at you. \"This is perfect, me with you.\"\n\nYou look at her. \"I know.\"\n",
  "page 6": "\"Why did Mozart sell his chickens?\" she gives you a confused glance. \"Because they kept going \u0027Bach, Bach, Bach\u0027.\" Her lip twitched into a quick half smile. You grin and say, \"Do you want to hear another joke?\" She raises her eyebrow.\n",
  "page 19": "\"You like the painting, I\u0027m guessing?\" you ask as you come up behind her. She nods without looking away. \"I painted it myself, you know.\" She glances at you skeptically. \"No, really. It took me days to get everything just right. The sunset, the water, the mermaids . . .\" You smile at her. \"What do you think . . . err, what should I call you, anyway?\"\n\nThe girl smiles. \"It\u0027s a great picture,\" she whispers, barely audible. \"And you can call me Marina.\"\n\n\"Marina?\" You almost laugh. \"I\u0027ve never heard of any name like that.\"\n\n\"My parents were from Spain, so they wanted to give me a Spanish name. They named me after part of the word \u0027seasalt\u0027 in Spanish. Sal marina is seasalt in Spanish. Sal wasn\u0027t a very suitable name, so they went with Marina.\"\n\n\"Well, it\u0027s very beautiful, once you get used to it.\" You pat her on the head like she\u0027s a child and she laughs, swatting your hand away. \"I\u0027ll leave you to your painting gazing.\" But she no longer looks at the painting. She looks at you.\n",
  "page 5": "\"Why did the chicken cross the road?\" She looks at you and raises her eyebrow. \"To show the possum it could be done.\" Her lips curled up a bit into a smile. You grin and say, \"You wanna hear another joke?\" She nods.\n",
  "page 18": "\"What\u0027s your name?\" you ask as you come up behind her. She flinches and snaps her head toward you. Her eyes twinkle in fright and she shakes her head. \"Why not?\"\n\n\"I-I\u0027m not ready,\" she stutters quietly, not looking away from you.\n\n\"You talked,\" you whisper, leaning lightly against the wall. \"If you can talk at all, I think you\u0027re ready to tell me your name.\"\n\nShe looks down at the floor. \"Marina.\"\n\n\"Marina?\" You almost laugh. \"I\u0027ve never heard of any name like that.\"\n\n\"My parents were from Spain, so they wanted to give me a Spanish name. They named me after part of the word \u0027seasalt\u0027 in Spanish. Sal marina is seasalt in Spanish. Sal wasn\u0027t a very suitable name, so they went with Marina.\"\n\n\"Well, it\u0027s very beautiful, once you get used to it.\" You pat her on the head like she\u0027s a child and she laughs, swatting your hand away. \"I\u0027ll leave you to your painting gazing.\" She stares at the painting for three more days.\n",
  "page 144": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 8": "\"A woman\u0027s husband had been slipping in and out of a coma for several months, yet she stayed by his bedside every single day. When he came to, he motioned for her to come nearer.\n\n\"As she sat by him, he said, \u0027You know what? You have been with me all through the bad times. When I got fired, you were there to support me. When my business failed, you were there. When I got shot, you were by my side. When we lost the house, you gave me support. When my health started failing, you were still by my side... You know what?\u0027\n\n\"\u0027What dear?\u0027 she asked gently.\n\n\"\u0027I think you bring me bad luck.\u0027\"\n\nShe laughs before she can stop herself and she covers her mouth. You grin wildly and chuckle a little yourself. You carefully take her hand and she doesn\u0027t recoil, but looks into your eyes. You look back and see the blue and slight green roll around in her iris, surrounding her pupils. \"You have wonderful eyes,\" you whisper. She rolls her eyes, but gives you another peek and smile before she loses emotion and turns away to the window. Her hand goes limp and it feels like you\u0027re holding a rock. You sigh and drop her hand.\n\n \n",
  "page 147": "You dress in your swimming clothes, just in case, and you grab a fishing pole you brought with you when you first came to the island. You hurry down to the beach and quickly cast your line into the water. You know that you don\u0027t have much time to gather fish, but you have a feeling that today is a lucky day. And, just as you thought, you catch three fish within the hour, which is a lot more than you\u0027re used to. You leisurely walk to the hut, whistling along the way. Arriving at the hut, you find Marina cutting up the several kinds of fruit she picked. She greets you with a smile, but her face drops when she sees the fish.\n\n\"What\u0027s wrong?\" you ask, leaning the fishing pole against the wall.\n\n\"You got . . . fish?\"\n\n\"Yeah. Is there a problem?\"\n\n\"I\u0027m a vegetarian.\"\n\n\"Isn\u0027t fish not really considered meat?\" She gives you a dark look.\n\n\"You\u0027re still killing something for its flesh, aren\u0027t you?\" You shrug.\n\n\"Okay. I\u0027m sorry. I\u0027ll eat the fish. You can just have the fruit.\" She gives you another dark look and slams your fruit bowl on the counter.\n\n\"I\u0027m not eating with you.\"\n",
  "page 7": "\"Why did the chicken cross the road?\" She looks at you and raises her eyebrow. \"To show the possum it could be done.\" Her lips curled up a bit into a smile and she snickers lightly. She glances at you again and turns back to the window.\n",
  "page 146": "\"How about we get food separately today?\" you say.\n\n\"Why?\" she responds.\n\n\"Because you need to learn to not be so dependent on me. You know; if something . . . happens.\" She nods, a little sad at the thought.\n\n\"I\u0027ll get some fruit from the garden,\" she informs you and takes a large bowl, exiting the hut. You decide to . . .\n",
  "page 2": "“Hey, it’s all right,” you say. You sit down on the ground in front of the couch and she eyes you suspiciously. You tilt your head and look at her curiously. She didn’t know what happened, you know for sure. “You were underwater out by the shore. I pulled you up. Do you know what happened?” She shakes her head cautiously. “Okay. It’s all right, though. You’re safe now. Don’t worry.” Her eyes flicker, but she trusts you enough to let you make her food and give her a place to sleep for a few nights without fuss. But she still doesn’t speak.\n",
  "page 149": "Marina and you are the best of friends.\n",
  "page 1": "“It’s okay, it’s okay,” you soothe, putting a hand on her shoulder. She flinches and drew back, looking more frightened. “Really, you don’t have to be afraid. You’re safe now.” She obviously has no idea what you are talking about. “You were underwater, and I pulled you up. Really, I’m a good person.” You scoot a little closer and she stands up abruptly and slips. You reach out to grab her as she falls and you catch her hand just before she hits the ground. You pull her up and she falls into your arms. She looks into your eyes and blushes, pushing you away. She crosses the room and sits down into a single wooden chair and looks away. She refuses to even look at you for days. She doesn’t talk either.\n",
  "page 148": "You quickly change into your swimming clothes and hurry down the beach. You know where to go to find seaweed and even some edible algae. After an hour or so you have a bundle of salty-tasting plants in your arms and are hobbling back to the hut. You find Marina already cutting up apples, strawberries, pineapples, and other fruits. She looks up and greets you with a smile.\n\n“Your garden really is beautiful,” she compliments, separating the fruit into two bowls. “What did you get?”\n\n“I got some sea plants. Maybe you could make a cool salad with plants and fruit?” She nods.\n\n“Sure. I bet it’s going to be great.” She takes a piece of seaweed and sticks it in her mouth, humming in glee. “Delicious!”\n\n \n",
  "page 4": "A few days after the rescue, you are getting fed up with the girl. She looks around your age, twenty or so, and is stunning. But she won\u0027t smile.\n\nShe won\u0027t talk, will barely look at you, and she won\u0027t show any emotion to you. Every morning is the same routine--wake her up, eat a small breakfast, and try to get her to do something. Unfortunately, she never does anything but gaze out the window and watches the waves of the ocean.\n\nFinally the day comes when you are determined to make her smile. You sit down next to her at the window and she glances at you.\n\n\"Hi,\" you greet softly. She keeps her gaze locked on the ocean. \"Um . . .\"\n",
  "page 3": "A few days after the rescue, you are getting fed up with the girl. She looks around your age, twenty or so, and is stunning. But she won\u0027t smile.\n\nShe won\u0027t talk, will barely look at you, and she won\u0027t show any emotion to you. Every morning is the same routine--wake her up, eat a small breakfast, and try to get her to do something. Unfortunately, she never does anything but gaze out the window and watches the waves of the ocean.\n\nFinally the day comes when you are determined to make her smile. You sit down next to her at the window and she glances at you.\n\n\"Hi,\" you greet softly. She keeps her gaze locked on the ocean. \"Um . . .\"\n",
  "page 11": "After a month, better things started to happen between you two . . .\n",
  "page 99": "You giggle and nod. She takes your hand and leads you out to the ocean. The water is surprisingly warm and comfortable. You lift her up out of the water and she squeals in delight and laughs. Her smile is beautiful and you decide something right there right then . . .\n",
  "page 10": "\"A woman\u0027s husband had been slipping in and out of a coma for several months, yet she stayed by his bedside every single day. When he came to, he motioned for her to come nearer.\n\n\"As she sat by him, he said, \u0027You know what? You have been with me all through the bad times. When I got fired, you were there to support me. When my business failed, you were there. When I got shot, you were by my side. When we lost the house, you gave me support. When my health started failing, you were still by my side... You know what?\u0027\n\n\"\u0027What dear?\u0027 she asked gently.\n\n\"\u0027I think you bring me bad luck.\u0027\"\n\nShe laughs before she can stop herself and she covers her mouth. You grin wildly and chuckle a little yourself. You carefully take her hand and she doesn\u0027t recoil, but looks into your eyes. You look back and see the blue and slight green roll around in her iris, surrounding her pupils. \"You have wonderful eyes,\" you whisper. She rolls her eyes, but gives you another peek and smile before she loses emotion and turns away to the window. Her hand goes limp and it feels like you\u0027re holding a rock. You sigh and drop her hand.\n\n \n",
  "page 98": "\"Hey, you,\" you hiss into her ear. She giggles.\n\n\"What are you doing?\" You shrug. \"Really? Nothing?\"\n\n\"Nope. Nothin\u0027.\"\n\nShe pokes your arm. \"Then why are you laying down next to me?\"\n\n\"Just \u0027cause.\"\n\n\"Do you wanna go steady?\" she blurts out. You\u0027re stunned.\n\n\"What?\"\n\nShe coughs uncomfortably. \"I just thought so . . . with you laying beside me like this . . .\" She looks at you expectantly. \"So?\"\n",
  "page 13": "After a month, better things started to happen between you two . . .\n",
  "page 12": "After a month, better things started to happen between you two . . .\n",
  "page 15": "\"Do you want to go down to the ocean? You\u0027ve sure seen it enough from the window,\" you offered, appearing from your bedroom with your swim trunks on and an old T-shirt you wore in the water. She looks up at you from the window and looks at her own attire. She hasn\u0027t changed her clothes at all since you rescued her. Even she can tell that her clothes are starting to stink, and swimming in the ocean won\u0027t help the smell. You hold up a long dress that once floated on shore. It seems to be much like one a woman would wear to the pool side or beach. Swimming in it shouldn\u0027t be a problem.\n\nWithin minutes she\u0027s changed into the dress and the two of you are walking down the sandy path to the main beach. The sun is beating down on the two of you and she is practically skipping towards the ocean. You smile to yourself as she almost laughs in joy at the fresh air after being stuck in your hut for over a month.\n\nAs soon as she reaches the beach, she sprints toward the cool waters of the ocean. She shrieks a little as the cold seawater splashes her, but giggles at the tickle of seaweed under her toes. You sit down on the sand and watch her as she wades around in the water. She occasionally will go underwater and a couple seconds later appear several yards away from where she was originally.\n\nYou are a tad worried about her, considering she was unconscious in the water when you found her. Whenever she goes under you search around for where she is to make sure she comes up. You relax more when she does.\n\nAt one point she looks over to you and waves you over.\n",
  "page 9": "\"Why did Mozart sell his chickens?\" she looks at you, confused. \"Because they kept going \u0027Bach, Bach, Bach\u0027.\" She snorts a laugh and shakes her head slightly, looking into your eyes. She smiles warmly puts a light hand on your shoulder. She looks deep into your eyes and you look into hers, entranced by the blue and green swirling around her pupils. After a moment she looks away and pulls her hand away, then went back to staring out the window.\n",
  "page 14": "The mysterious girl one day takes notice of your painting. Years ago a paint set washed up on shore along with a drenched canvas. You spent days trying to dry it well enough to use and slowly, but surely, it did and you spent even more days painting a beautiful masterpiece of the ocean shore that can be seen during the sunset with a couple of mermaids and wildlife swimming in the ocean.\n\nThe girl starts staring at the painting rather than through the window, day after day. You find yourself starting to watch her everyday as well, studying her features, adoring her body, and wondering so hard what her voice sounds like. You imagine every tone you can that could fit the beautiful body of the girl, but you can\u0027t decide which would fit her best.\n\nI don\u0027t even know her name, you realize. I have to get her to talk. But how . . .?\n",
  "page 17": "Corruption happens at the worst times . . .\n",
  "page 16": "The purple sky is dotted with yellow daisies as you sit down on the wooden log bench. A tea cup filled with green tea appears on the seat next to you and you pick it up and drink the tea, the liquid warming you as it passes through your lips. It tastes like strawberries and peppermint and it smells like lilacs.\n\n\"Hey . . . hey . . . um, sir?\"\n\nYou blink and are greeted by the darkness shrouded face of Marina. \"Marina?\" you groan as you sit up. You are in your bed. You were dreaming before. \"What is it?\"\n\n\"Um . . . sir . . .\"\n\n\"It\u0027s Brandon, remember?\"\n\n\"Uh, right. Brandon, I . . .\" her voice trails off and you notice that her eyes are puffy and her face is tear-stained.\n\n\"Were you crying?\" She nods sadly. \"Did you have a nightmare?\" She nods again quickly, shaking slightly. She\u0027s obviously shaken up.\n",
  "page 91": "She smiles wide. \"Thank God.\"\n",
  "page 90": "You are still in bed. After the failed attempt at giving Marina a kiss, you can\u0027t bring yourself to get out of bed. You have to find a way to make it up to her.\n",
  "page 93": "You lean in and she meets you and you embrace in a kiss, easily melting into each other.\n\nThis is amazing, you think. This is . . . bliss.\n\nWhen she pulls away she\u0027s smiling naturally. Not forced. Not overly bright. Natural.\n\n\"I love you,\" you whisper.\n\n\"And I, you,\" she agrees.\n",
  "page 92": "Her face falls. \"But . . .\"\n\nYou shake your head. \"Just not yet. Not now.\" You look into her entrancing eyes. \"But maybe eventually.\"\n",
  "page 95": "Marina and you are the best of friends.\n",
  "page 94": "She looks at the berry in surprise, but she accepts it and gives you a good smile. \"We\u0027re really good . . . friends.\" You nod in agreement. She looks down and nibbles at the strawberry. \"Great.\"\n",
  "page 97": "\"This really is a gorgeous sight,\" you say to her. She looks at you and smiles.\n\n\"Yeah, it is.\" She laughs. \"Ocean sunsets are the best.\" She tilts her head in thought. \"You wanna play?\"\n\n\"Play?\"\n\n\"You know,\" she steals a glance at you, \"in the ocean. Splash around a bit.\"\n",
  "page 96": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 150": "Marina and you are the best of friends.\n",
  "page 152": "\"Hey, check it out!\" Marina picks up a bottle with a note crammed into it, a cork screwed into the top. \"It\u0027s a note. Let\u0027s see what it is!\" You take the bottle and force the cork out. You carefully slide the note out and open it.\n\n\"It\u0027s addressed to you,\" you realize. You hand her the note and she reads it.\n\n\"Maybe it\u0027s someone else?\"\n\n\"Do you know anyone else named \u0027Marina\u0027?\" She shrugs and continues to read the note. You don\u0027t understand how she can understand such curved, fancy writing, but she seems to know what it says.\n\n\"Oh my Neptune,\" she hisses.\n\n\"Neptune?\" You shake your head. \"What did it say?\" She looks up at you with big, confused eyes.\n\n\"It explains who I am.\" She looks to the ocean and drops the note onto the sand. She carefully walks into the waves.\n\n\"Marina?\" You start after her but she puts up a hand.\n\n\"No. Stay.\" You are a little upset by her commands, but you sigh and stay on the beach. She turns back and continues into the water until she\u0027s waist-deep. She then starts mumbling something that you can\u0027t understand. You want to yell out to her, but you feel like you shouldn\u0027t interrupt her. When she finishes, she sighs and tries to turn around, then falls into the water, like she tripped. You jump up and run toward her.\n\nWhen you reach her, she\u0027s come back up and her hair is washed back, showing her full face. She looks up at you, towering over her and she sadly half-laughs. \"It\u0027s true,\" she whispers. \"The note was right.\"\n\n\"What was right?\" You reach down to pull her up, but she backs away, not standing.\n\n\"Brandon . . . I doubt you\u0027d believe me, but . . . I\u0027m a mermaid.\" Your jaw drops and you stare at her in disbelief.\n\n\"No way.\" She chuckles a little and lifts her legs . . . but they\u0027re not legs. They\u0027re a tail. Your jaw drops even further.\n\n\"Oh my God . . .\" She seems even sadder when you realize her secret. She sinks even farther into the water.\n\n\"My father told me something. Something about me . . . and you.\"\n",
  "page 151": "After spending so much time with Marina, you know you have to decide what your feelings really are with her. You decide that, with Marina, you want to be . . .\n",
  "page 154": "\"My father doesn\u0027t believe that you are worthy to live with us. But he thinks you deserve to remember out time together. Thank you for being so kind to me. And don\u0027t forget out time . . . together.\" She gives you a bittersweet smile and sinks below the surface, leaving you to live your days out the rest of the way you want. Without her.\n",
  "page 153": "\"Do you want to come and live with me . . . in Atlantis?\" You stare at her in awe. You smile and nod. \"Great. Now we can be together . . . for eternity.\" She takes your hand and pulls you underwater where the two of you lived your days out as lovers. The two, perfect, lovers.\n",
  "page 134": "\"Marina . . .?\" you whisper during your dinner.\n\n\"Yes?\" she replies dreamily.\n\n\"I . . . I love you.\"\n\nShe looks over to you and smiles warmly. \"I love you too.\"\n",
  "page 29": "After a month, better things started to happen between you two . . .\n",
  "page 133": "After your memories with Marina, you decide that you are . . .\n",
  "page 136": "One final thing happens between the two of you.\n",
  "page 135": "\"H-Hey, Marina?\" you ask one night as the two of you are having crisp salad from your garden you keep on the island.\n\n\"Yes?\" she replies, dreamily.\n\n\"I don\u0027t think this is working out.\"\n\nShe looks at you, confused. \"What isn\u0027t working out?\"\n\n\"This . . . us . . . the whole \u0027in love\u0027 thing.\" You look away from her. \"I\u0027m sorry, Marina. But I think we should just be friends.\"\n\n\"Oh.\" She looks away from you and stares at her salad, eating little by little.\n",
  "page 138": "One final thing happens between the two of you.\n",
  "page 137": "One final thing happens between the two of you.\n",
  "page 139": "One final thing happens between the two of you.\n",
  "page 22": "You spring up and run into the water. Her face lights up and she greets you with a hug. She quickly pulls away, blushing. She takes your hand and leads you further out. The ground drops beneath you and you have to kick your feet to keep afloat. She smiles and turns violently, making you spin with her. You yelp at the sudden jerk, but laugh when she keeps spinning you in circles.\n\n\"You\u0027re very fun,\" you giggle when she stops spinning you. She smiles wide and goes under, pulling your legs down a second later. You call out when you go tumbling into the cold water and when you come up you\u0027re laughing and sputtering at the same time. \"Fun, fun, fun.\" She snickers and swims away, making great progress. You try to go after her, but she\u0027s too fast. \"I will catch up with you!\" you vow. She just laughs louder.\n",
  "page 21": "After a month, better things started to happen between you two . . .\n",
  "page 24": "After a month, better things started to happen between you two . . .\n",
  "page 23": "You shake your head at her and her face drops a little, but she smiles again sadly and wades some more in the water. At one point she screams and falls into the water. You jump up and search for her to come back up, but after ten seconds she doesn\u0027t, which takes longer than she did before. You run into the water and to where she was moments ago. You look around, not finding any sign of her.\n\nSPLASH!\n\nYou get pulled underwater and you come back up, sputtering and wiping saltwater out of your eyes. When you are finally able to see, you find her right in front of you, covering her mouth to keep from breaking out in laughter.\n\n\"What the heck . . .?\" you trail off. You open your mouth wide and stare at her in disbelief. \"You little trickster! You didn\u0027t really fall!\" She shakes her head and chuckles escape her lips. \"You scared me half to death!\" She laughs out loud and dives back into the water, appearing yards away in seconds.\n",
  "page 26": "\"What was your dream?\" you ask sleepily.\n\n\"I\u0027m not too sure. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"Do you want to sleep in here tonight?\" She nods slowly. \"Okay. You can sleep in the big chair over there or the hammock in the corner.\" She looks at the big purple chair and the old hammock that hung loosely on the wall\u0027s hooks. She heads to the chair and curls up in the fluff. You feel around on your bed and find a spare blanket and toss it over to her. \"Have a good night sleep,\" you say.\n\n\"I\u0027ll try,\" she replies.\n\n\"You can wake me up if the dream comes back.\"\n\nIt didn\u0027t.\n",
  "page 25": "After a month, better things started to happen between you two . . .\n",
  "page 28": "\"Do you want to sleep here with me?\" You pull back the cover on the other side of the bed. It\u0027s a small bed, but it\u0027s large enough that she can still fit. She smiles slightly and nods, settling into the spot next to you. She lays her arm on your side, cuddling you a little. You close your eyes and melt into her warmth.\n\n\"What was your dream?\" you ask sleepily.\n\n\"I\u0027m not too sure. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers. You turn over so you\u0027re facing each other.\n\n\"It\u0027s okay,\" you whisper, putting your arm around her. \"You\u0027re here with me. I\u0027ll keep you safe.\" She closes her eyes and smiles, cuddling closer to you.\n\n\"You certainly will.\"\n",
  "page 27": "\"What was your dream?\" you ask sleepily.\n\n\"I\u0027m not too sure. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\nYou can\u0027t deal with this. \"Just go sleep on the couch. You\u0027ll be okay.\" You pull the covers back over you and close your eyes.\n\n\"Really?\" she squeaks.\n\n\"Yeah, you will,\" you grunt. You can feel yourself drifting off. Just before you fall back into dreamland you hear the soft shuffle of feet and the soft click of the door.\n\nNo, I won\u0027t . . .\n",
  "page 20": "After a month, better things started to happen between you two . . .\n",
  "page 0": "When you first laid eyes on her she was unconscious. And underwater. But, she was still an amazing sight.\n\nYou had been snorkeling off the coast of your seclude island you live on, in taking the beauty of the multi colored fish and billowing sea plants. You see fish wandering over to a part of the ocean you hadn’t snorkeled near before. Curious, you followed them and were shocked to find a girl lying unconscious on the ocean floor. You immediately plunge down and grab the girl, pulling her to the shore.\n\nYou didn’t know much about CPR, with living alone on an island and all, but luckily you didn’t need to. As soon as she reached the surface she started breathing. You carry her from the soft sand to your hut made out of sticks and palm leaves and you laid her on your couch. Years before you lived on the island you had packed up everything you owned in your house that didn’t need electricity and basically moved to the seclude island. You were fed up with all the noise of the city and you decided you wanted to become a hermit—with the basic comforts of modern day like a bed, couch, and other furniture.\n\nAs she lay on your couch, you were able to get a good look at her. Her brown hair was like a waterfall on her shoulders and she wore a silk blue satin dress that flowed on her legs like a mermaid tail. She obviously wasn’t dressed for swimming. You thought that maybe she just fell overboard from a boat and the crash knocked her out. Though why she was so close to shore, you didn’t know.\n\nHours later, she comes to. She opens her marble blue eyes and looks around, looking quite scared. She spots you and her eyes widen and she tenses up. You have to calm her down.\n\n \n",
  "page 141": "You fill a bowl with pineapple cubes and head down to the beach. When you arrive Marina is waiting for you on the warm sand. She spots you and runs up to greet you, taking the bowl from your hands. \"Your favorite,\" she whispers sarcastically. You shrug. She looks up and you and smiles. \"Hey, I have something to show you.\" She sets the bowl on the ground and takes your hand, leading you into the ocean.\n\n\"I don\u0027t have my swim clothes on,\" you protest. She snickers, but keeps dragging you out to the water.\n\n\"Just go under and keep your eyes open,\" she instructs. She slips under the water and you take a deep breath, following her lead. You open your eyes and clutch a rock to stay under. You keep your eyes open, trying to handle the sting of salt. You don\u0027t see Marina, and you are about to go back up when you feel a tiny squeeze on your shoulder. You look behind and find Marina. She takes hold of your chin and brings your lips to hers in a romantic kiss.\n\nWhen the two of you come up she whispers, \"That\u0027s called the Ocean\u0027s Kiss.\"\n",
  "page 140": "You fill a bowl with strawberries and head down to the beach. When you arrive Marina is waiting for you on the warm sand. She spots you and runs up to greet you, taking the bowl from your hands. \"My favorite,\" she whispers. She looks up and you and smiles. \"Hey, I have something to show you.\" She sets the bowl on the ground and takes your hand, leading you into the ocean.\n\n\"I don\u0027t have my swim clothes on,\" you protest. She snickers, but keeps dragging you out to the water.\n\n\"Just go under and keep your eyes open,\" she instructs. She slips under the water and you take a deep breath, following her lead. You open your eyes and clutch a rock to stay under. You keep your eyes open, trying to handle the sting of salt. You don\u0027t see Marina, and you are about to go back up when you feel a tiny squeeze on your shoulder. You look behind and find Marina. She takes hold of your chin and brings your lips to hers in a romantic kiss.\n\nWhen the two of you come up she whispers, \"That\u0027s called the Ocean\u0027s Kiss.\"\n",
  "page 143": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 32": "\"Do you want a fruit salad?\" you call from the kitchen.\n\n\"Sure. But I\u0027m allergic to coconut,\" she replies from the living room. You toss the fruit cubes into two bowls but you leave the coconut shavings out of one of them. You grab a couple forks and hurry into the living room.\n\n\"One fruit salad, hold the coconut,\" you smile and give her the meal and a fork she replies with a grin and stabs a pineapple cube. She hums in joy as she chews it.\n\n\"This is delicious!\" she exclaims.\n\n\"Thanks.\" You take a bite of strawberry.\n\n\"Where do you even get the fruit?\"\n\n\"I have a secret garden.\" You laugh. \"I should show you some time.\"\n\n\"Maybe,\" she agrees. You two eat in silence for a few minutes. When she finishes half her salad she sighs and puts it down on the table. You look up at her.\n\n\"You\u0027re full already?\"\n\n\"No. Yes. Maybe.\" She sighs again and leans back into the couch. \"It\u0027s just . . . I just realized that I don\u0027t have a family.\"\n",
  "page 35": "\"That\u0027s all you say. \u0027I\u0027m sorry, I\u0027m sorry,\u0027 well  I\u0027m not sorry!\" Tears fall down her face and she shakily takes a breath. \"I\u0027m all alone.\"\n\nYou glance around the room, not wanting to look at her. When you finally do you find he burying her face into a pillow.\n",
  "page 34": "You chop the fruit up and toss it into a bowl you had found. Marina will love the fresh taste of the fruit salad. Actually, you\u0027re not very sure. You know that you love it, though, so hopefully she will as well. You walk from the kitchen into the living room and find her sitting on the sofa, staring at nothing.\n\n\"Marina?\" you say. \"I brought you a fruit salad.\" You put the bowl in her lap and hand her a fork. She takes the fork, not breaking her gaze. \"What are you looking at?\"\n\n\"Not looking,\" she whispers. \"Just thinking.\" She glares at you. \"I hate you.\"\n\nYou\u0027re taken aback by her statement. \"You hate me?\"\n\n\"Yes. You took me away from my family. And you don\u0027t even like me!\" She screeches.\n\n\"I saved your life! And I do like you.\"\n\n\"No you don\u0027t! You don\u0027t even bother to ask me if I like fruit!\" She throws the bowl at you. \"I\u0027m allergic to coconut, you idiot! You don\u0027t even ask!\"\n",
  "page 37": "\"Yes I am!\"\n\n\"No,\" you put a hand on her back and sit down next to her, \"you\u0027re not.\"\n\nShe sniffs and shakes her head. \"I am.\"\n\nYou carefully give her a hug. \"You\u0027re not,\" you whisper. \"I promise.\" She smiles, but there\u0027s no joy in it.\n",
  "page 36": "\"Yeah, I know. That\u0027s the problem.\" She lays back and sighs. \"You just don\u0027t understand.\"\n\n\"I understand perfectly. You\u0027re lonely and you miss your family.\"\n\nShe sniffs and closes her eyes. \"I don\u0027t really remember my family. I just know I have one.\"\n\nYou nod and put your head on her shoulder. She chuckles. \"Shouldn\u0027t I put my head on your shoulder?\" she asks. You shrug.\n\n\"You know, you smell like seasalt,\" you whisper.\n\n\"Good. It\u0027s my name.\"\n\n\"No, your name is part of seasalt.\" She smiles gives you a light hug.\n\n\"Smart alec.\"\n",
  "page 39": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares?\"\n\n\"For several nights now I\u0027ve had the same horrible nightmare. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 38": "\"What?\" she whispers, looking up from the pillow.\n\n\"Well, you have no family, and you\u0027re stuck here with me.\" You sit down next to her. \"Really, I think you\u0027re just hopeless. You\u0027re doomed to living alone.\" You raise your eyebrow. \"With me.\"\n\nShe rolls her eyes. \"Yeah. It really is horrible.\" She cracks a smile. \"I guess I don\u0027t completely hate you.\"\n\n\"Same for me.\"\n",
  "page 31": "After a month, better things started to happen between you two . . .\n",
  "page 30": "After a month, better things started to happen between you two . . .\n",
  "page 155": "\"My father hates how you\u0027ve acted. He thinks that you are some of the lowest of humanity and that you don\u0027t even deserve to know what has happened. So your memories are to be erased as soon as I arrive at Atlantis.\" She leans up and gives you a light kiss. \"I\u0027m sorry.\" She sinks below the surface and you sadly hobble back to your hut.\n\nShe\u0027s gone. Marina is gone. I\u0027m alone now. And I won\u0027t remember . . . You pause and suddenly wonder:\n\nWho\u0027s Marina?\n",
  "page 159": "Marina and you are the best of friends.\n",
  "page 44": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares? Like the one you had before?\"\n\n\"Yes. Th-They\u0027re horrible!\"\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 43": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares? Like the one you had before?\"\n\n\"Yes. Th-They\u0027re horrible!\"\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 46": "\"I can\u0027t quite remember them,\" she admits. \"But I know I still have parents. I might\u0027ve had a sister.\"\n\n\"Were you married?\"\n\n\"That\u0027s too fuzzy.\" She looks up at the ceiling. \"But I don\u0027t think so.\" You can\u0027t help but crack a smile at her answer. You stuff some cantalope into your mouth. \"Do you ever get lonely?\"\n",
  "page 45": "\"I guess,\" she says. \"But just you and me . . . it\u0027s not really much of a family.\" She looks at you with her beautiful blue eyes. \"Don\u0027t you ever get lonely up here?\"\n",
  "page 48": "\". . . but now I have you with me.\" She smiles.\n\n\"You\u0027re really sweet.\"\n\nYou chuckle. \"If you want sweet,\" you give her the bowl of fruit on the table, \"you should try the strawberries.\" She takes it and your hands touch. She blushes and takes a bite of strawberry.\n\n\"You were right,\" she agrees with her mouth full. \"These are sweet.\"\n\nNot as sweet as you, you think happily.\n",
  "page 47": "\"It is pretty quiet,\" you admit. \"But I guess I never really thought of myself as lonely. Just separated. I moved here. I chose to be alone.\" You shift in your chair. \"Sometimes I wonder what would\u0027ve happened if I would\u0027ve stayed, though.\"\n\n\"I\u0027d be dead,\" she mutters. You roll a grape around in your mouth.\n\n\"Maybe,\" you answer. \"But since I am here,\" you get up and sit next to her. You start to lean in close and she gives you a partly startled look. You are an inch from her mouth and you stick a strawberry in her mouth. \"Have a strawberry.\"\n\nShe laughs and chews up the fruit. When she swallows she sticks her tongue out at you.\n",
  "page 49": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares?\"\n\n\"For several nights now I\u0027ve had the same horrible nightmare. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 40": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares?\"\n\n\"For several nights now I\u0027ve had the same horrible nightmare. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 42": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares? Like the one you had before?\"\n\n\"Yes. Th-They\u0027re horrible!\"\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 41": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares?\"\n\n\"For several nights now I\u0027ve had the same horrible nightmare. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 161": "\"Hey, check it out!\" Marina picks up a bottle with a note crammed into it, a cork screwed into the top. \"It\u0027s a note. Let\u0027s see what it is!\" You take the bottle and force the cork out. You carefully slide the note out and open it.\n\n\"It\u0027s addressed to you,\" you realize. You hand her the note and she reads it.\n\n\"Maybe it\u0027s someone else?\"\n\n\"Do you know anyone else named \u0027Marina\u0027?\" She shrugs and continues to read the note. You don\u0027t understand how she can understand such curved, fancy writing, but she seems to know what it says.\n\n\"Oh my Neptune,\" she hisses.\n\n\"Neptune?\" You shake your head. \"What did it say?\" She looks up at you with big, confused eyes.\n\n\"It explains who I am.\" She looks to the ocean and drops the note onto the sand. She carefully walks into the waves.\n\n\"Marina?\" You start after her but she puts up a hand.\n\n\"No. Stay.\" You are a little upset by her commands, but you sigh and stay on the beach. She turns back and continues into the water until she\u0027s waist-deep. She then starts mumbling something that you can\u0027t understand. You want to yell out to her, but you feel like you shouldn\u0027t interrupt her. When she finishes, she sighs and tries to turn around, then falls into the water, like she tripped. You jump up and run toward her.\n\nWhen you reach her, she\u0027s come back up and her hair is washed back, showing her full face. She looks up at you, towering over her and she sadly half-laughs. \"It\u0027s true,\" she whispers. \"The note was right.\"\n\n\"What was right?\" You reach down to pull her up, but she backs away, not standing.\n\n\"Brandon . . . I doubt you\u0027d believe me, but . . . I\u0027m a mermaid.\" Your jaw drops and you stare at her in disbelief.\n\n\"No way.\" She chuckles a little and lifts her legs . . . but they\u0027re not legs. They\u0027re a tail. Your jaw drops even further.\n\n\"Oh my God . . .\" She seems even sadder when you realize her secret. She sinks even farther into the water.\n\n\"My father told me something. Something about me . . . and you.\"\n",
  "page 160": "Marina and you are the best of friends.\n",
  "page 163": "\"My father doesn\u0027t believe that you are worthy to live with us. But he thinks you deserve to remember out time together. Thank you for being so kind to me. And don\u0027t forget out time . . . together.\" She gives you a bittersweet smile and sinks below the surface, leaving you to live your days out the rest of the way you want. Without her.\n",
  "page 162": "\"My father wishes to have you come with us to live in Atlantis. He believes that I should have a good friend since I don\u0027t remember much anyhow.\" She extends her hand. \"Come. Please.\" You carefully take her hand and she pulls you under the water where you grow gills and a tail quickly. The two of you live out your lives as the best of friends.\n",
  "page 164": "\"My father hates how you\u0027ve acted. He thinks that you are some of the lowest of humanity and that you don\u0027t even deserve to know what has happened. So your memories are to be erased as soon as I arrive at Atlantis.\" She leans up and gives you a light kiss. \"I\u0027m sorry.\" She sinks below the surface and you sadly hobble back to your hut.\n\nShe\u0027s gone. Marina is gone. I\u0027m alone now. And I won\u0027t remember . . . You pause and suddenly wonder:\n\nWho\u0027s Marina?\n",
  "page 101": "\"You wanna . . .?\" you aren\u0027t quite able to finish the question She beams wide.\n\n\"Go steady?\" You nod. \"Yes!\" She jumps you and you both fall into the water. She kisses you and you kiss her back.\n\nBest day ever! you shriek to yourself.\n",
  "page 100": "You shake your head and lay down on the beach. She pleads you with her big eyes. You shake your head again. She sighs and lies down next to you.\n\n\"You\u0027re great, you know?\" she whispers.\n\n\"You don\u0027t think that.\"\n\n\"You\u0027re right. I want to go play!\" You turn your head to her.\n\n\"Then go play. I\u0027ll be right here, watching you.\" She rolls her eyes and shakes her head.\n\n\"I\u0027d rather be here with you. My best friend.\"\n",
  "page 103": "Marina and you are the best of friends.\n",
  "page 102": "\"We are awesome friends,\" you sigh, putting her down. She nods.\n\n\"You are an awesome friend!\" she agrees.\n",
  "page 105": "Marina and you are the best of friends.\n",
  "page 104": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 107": "Her face falls. \"But . . .\"\n\nYou shake your head. \"Just not yet. Not now.\" You look into her entrancing eyes. \"But maybe eventually.\"\n",
  "page 106": "She smiles wide. \"Thank God.\"\n",
  "page 55": "You put your arms around her and she bursts out into tears. \"It\u0027s too real!\" she sobs. You can\u0027t stand the sound of her crying, but you know that she has to cry herself out. She cries for half an hour, and then slowly quiets down until she only softly whimpers. \"I think I was drowning in the dream.\"\n",
  "page 109": "\"Let\u0027s go see the stars,\" you suggest. Marina is lying down on the floor with her eyes closed. She doesn\u0027t respond and you\u0027re not sure if she\u0027s sleeping or not. \"Marina?\" She still doesn\u0027t answer. You get down next to her. She\u0027s breathing, so she\u0027s not dead. You decide to wake her by . . .\n",
  "page 54": "\". . . but now I have you with me.\" She smiles.\n\n\"You\u0027re really sweet.\"\n\nYou chuckle. \"If you want sweet,\" you give her the bowl of fruit on the table, \"you should try the strawberries.\" She takes it and your hands touch. She blushes and takes a bite of strawberry.\n\n\"You were right,\" she agrees with her mouth full. \"These are sweet.\"\n\nNot as sweet as you, you think happily.\n",
  "page 108": "\"This storm has been going on for a long time!\" Marina sighs and leans into you. The two of you are lying down on the couch, her on top of you. A bowl of fruit is next to you that you two were sharing. You curl your arms around her and she giggles, cuddling into you. \"You\u0027re amazing.\" You smile.\n\n\"You\u0027ve been saying that every day.\"\n\n\"I know,\" she chuckles. \"I just can\u0027t get over how amazing you are.\" You half smile and stick your nose in her hair. It constantly smells of the ocean, even if she hasn\u0027t been to the water in days. \"What are you doing?\"\n\n\"You just always smell like . . .\"\n",
  "page 57": "You lean in and your lips touch. You feel her flinch, but then she relaxes and presses into you. You run your fingers through her silky brown hair and she takes hold of your head under the chin and presses harder.\n\nWhen the kiss is over, both of you are gasping for air. You grin at her and she grins back.\n\n\"Best comfort ever,\" she laughs. You nod in agreement. \"So . . . do you want to do this? Be in a . . . relationship?\"\n",
  "page 56": "You lean in and your lips touch. You hear her give a quiet yelp and she pushes you away.\n\n\"What the @#!*% are you doing?\" she shrieks. \"I need comfort! This is just . . . just gross! I don\u0027t love you!\" She licks her lips nervously. \"Just leave me alone. I\u0027ll be fine.\"\n\n\"Marina--\" you start.\n\n\"No. Just go. I\u0027ll be fine.\" You sigh and make your way back to your room.\n",
  "page 59": "She smiles wide. \"Thank God.\"\n",
  "page 51": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares?\"\n\n\"For several nights now I\u0027ve had the same horrible nightmare. It was full of darkness. And it felt like I couldn\u0027t breathe. I was trapped . . . in a rope or something. I-It was . . . it was horrible.\" Her voice cracks and wavers.\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 50": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares? Like the one you had before?\"\n\n\"Yes. Th-They\u0027re horrible!\"\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 53": "\"It is pretty quiet,\" you admit. \"But I guess I never really thought of myself as lonely. Just separated. I moved here. I chose to be alone.\" You shift in your chair. \"Sometimes I wonder what would\u0027ve happened if I would\u0027ve stayed, though.\"\n\n\"I\u0027d be dead,\" she mutters. You roll a grape around in your mouth.\n\n\"Maybe,\" you answer. \"But since I am here,\" you get up and sit next to her. You start to lean in close and she gives you a partly startled look. You are an inch from her mouth and you stick a strawberry in her mouth. \"Have a strawberry.\"\n\nShe laughs and chews up the fruit. When she swallows she sticks her tongue out at you.\n",
  "page 52": "A scream erupts from the living room several nights after your talk over fruit salad. You stumble out of bed and find Marina awake on the sofa, very frightened.\n\n\"What is it?\" you mumble sleepily, taking a seat next to her on the sofa.\n\n\"T-The nightmares. They\u0027re m-more real,\" she whispers.\n\n\"What nightmares? Like the one you had before?\"\n\n\"Yes. Th-They\u0027re horrible!\"\n\n\"It\u0027s all right. It was just a dream.\"\n\n\"But it didn\u0027t feel like just a dream!\" She\u0027s scared out of her mind. You decide to comfort her by . . .\n",
  "page 110": "\"Maybe it\u0027s just the rain.\"\n\nYou shake your head. \"Nah, it\u0027s you. I only smell it when I sniff your head.\"\n\n\"Thanks, my hair likes the compliment.\" You smirk and sigh. The rain is relaxing, with the pitter patter on the walls. You close your eyes, letting the noise and her warmth soothe you into easy relaxation.\n\n\"Hey, you.\" You feel a finger tracing your features on your face. You open one eye and find Marina looking over you on the ground. \"You fell asleep.\"\n\n\"Like you wouldn\u0027t?\"\n\n\"I was lonely.\" She pouts with her lips puckered and her eyes big and innocent. \"And bored.\"\n\n\"What do you want to do?\"\n\n\"What do you think?\"\n",
  "page 68": "You lean in and your lips touch. You hear her give a quiet yelp and she pushes you away.\n\n\"What the @#!*% are you doing?\" she shrieks. \"I need comfort! This is just . . . just gross! I don\u0027t love you!\" She licks her lips nervously. \"Just leave me alone. I\u0027ll be fine.\"\n\n\"Marina--\" you start.\n\n\"No. Just go. I\u0027ll be fine.\" You sigh and make your way back to your room.\n",
  "page 67": "You put your arms around her and she bursts out into tears. \"It\u0027s too real!\" she sobs. You can\u0027t stand the sound of her crying, but you know that she has to cry herself out. She cries for half an hour, and then slowly quiets down until she only softly whimpers. \"I think I was drowning in the dream.\"\n",
  "page 69": "You lean in and your lips touch. You feel her flinch, but then she relaxes and presses into you. You run your fingers through her silky brown hair and she takes hold of your head under the chin and presses harder.\n\nWhen the kiss is over, both of you are gasping for air. You grin at her and she grins back.\n\n\"Best comfort ever,\" she laughs. You nod in agreement. \"So . . . do you want to do this? Be in a . . . relationship?\"\n",
  "page 60": "Falling in love with Marina was the best thing that ever happened.\n",
  "page 62": "Marina and you are the best of friends.\n",
  "page 61": "Her face falls. \"But . . .\"\n\nYou shake your head. \"Just not yet. Not now.\" You look into her entrancing eyes. \"But maybe eventually.\"\n",
  "page 64": "\"You\u0027re too good of a swimmer to drown,\" you assure her.\n\n\"But I almost drowned, remember?\" She recalled the day of the rescue.\n\n\"I guess. But you might\u0027ve been hit with something. If you\u0027re well aware of what is happening, there\u0027s no way you\u0027ll sink.\"\n\nShe smiles and leans into you. \"You always know what to say.\"\n\nSometimes, you think.\n",
  "page 63": "\"How do you know?\"\n\n\"Because I\u0027ll always be by your side. You\u0027ll never drown when I\u0027m here.\"\n\n\"And what if you\u0027re not there?\"\n\nYou half smile. \"Then you can always save yourself. I\u0027ve seen you swim. And you\u0027re the best I\u0027ve ever seen.\"\n\nShe leans into you and sighs contently. \"I could stay like this forever.\"\n\n\"Me too.\"\n"
}