{
  "page 123": [
    "End Game and Leave Comments"
  ],
  "page 122": [
    "Continue"
  ],
  "page 124": [
    "I can\u0027t count on the goodwill I have built up. I\u0027m going to just wait this out.",
    "Damn waiting in fear. I\u0027ll tear this kingdom down, and the people will help me do it."
  ],
  "page 126": [
    "End Game and Leave Comments"
  ],
  "page 128": [
    "End Game and Leave Comments"
  ],
  "page 76": [
    "End Game and Leave Comments"
  ],
  "page 79": [
    "End Game and Leave Comments"
  ],
  "page 78": [
    "Continue"
  ],
  "page 70": [
    "End Game and Leave Comments"
  ],
  "page 73": [
    "I\u0027ll have him go to the other shop.",
    "... Maybe I could run it for him?"
  ],
  "page 74": [
    "End Game and Leave Comments"
  ],
  "page 130": [
    "Damn it all, I\u0027m too soft for my own good. I offer to escort her.",
    "I\u0027ll just have to wish her luck and give her directions to the nearest town."
  ],
  "page 132": [
    "Continue"
  ],
  "page 131": [
    "Continue"
  ],
  "page 112": [
    "But this did happen. I want Kit to know."
  ],
  "page 114": [
    "End Game and Leave Comments"
  ],
  "page 113": [
    "End Game and Leave Comments"
  ],
  "page 118": [
    "You don\u0027t deserve this end game link.",
    "Go back and make the right choice for me."
  ],
  "page 117": [
    "But this did happen. I want Kit to know."
  ],
  "page 88": [
    "I shake my head. \"Afraid I won\u0027t oblige your request. Now leave.\"",
    "Considering it, I sigh and nod. \"Fine. I\u0027ll go with you to Castle Oren.\""
  ],
  "page 87": [
    "Damn it all... I\u0027ll go investigate, and see who the hell it is.",
    "Bah, I don\u0027t have time for this. I\u0027m going to sleep."
  ],
  "page 119": [
    "You don\u0027t deserve this end game link.",
    "Go back and make the right choice for me."
  ],
  "page 89": [
    "... And release it with a sigh, staying in the room.",
    "... And swing the door open in a huff, leaving the room."
  ],
  "page 82": [
    "No. Rupert might die if he attacks. I\u0027ll do this myself.",
    "Yes. I need all the help I can get."
  ],
  "page 84": [
    "End Game and Leave Comments"
  ],
  "page 83": [
    "End Game and Leave Comments"
  ],
  "page 121": [
    "I didn\u0027t mean to do that... I can\u0027t believe... I surrender willingly. I deserve whatever fate awaits.",
    "I can\u0027t go down like this. I\u0027ll tell them to leave again, and if that doesn\u0027t work, I\u0027ll attack."
  ],
  "page 120": [
    "Give Kit his friends back.",
    "Fuck you. I don\u0027t have to do this. I can close this game right now if I want. I don\u0027t even have to click this choice. You can\u0027t make me do anything."
  ],
  "page 6": [
    "Yes, I can. I\u0027m not a hero anymore. They can do as they like, so long as they don\u0027t bother me.",
    "No, I can\u0027t. I have to do something."
  ],
  "page 145": [
    "Maybe I can keep helping people. Damn the King and his war, I\u0027ll help people in other ways.",
    "My plans remain the same. I\u0027ll head straight for Castle Oren. I\u0027m sure the King needs me, and won\u0027t mind."
  ],
  "page 5": [
    "I\u0027m not having this. Bertrand should get them out of here.",
    "Fine. If Bertrand is so hesitant, I\u0027ll do it myself."
  ],
  "page 18": [
    "End Game and Leave Comments"
  ],
  "page 8": [
    "I\u0027ll take shelter in the cave.",
    "I\u0027ll continue my trek."
  ],
  "page 147": [
    "End Game and Leave Comments"
  ],
  "page 7": [
    "I\u0027ll rent a room at the inn.",
    "I\u0027ll continue on the road."
  ],
  "page 146": [
    "End Game and Leave Comments"
  ],
  "page 2": [
    "I need to leave. There\u0027s nothing for me here.",
    "I will not leave my home. If the king sends men here, I\u0027ll send them back."
  ],
  "page 1": [
    "Damn the king. He holds no power over me.",
    "I\u0027ve nothing better to do. I\u0027ll go to Castle Oren."
  ],
  "page 4": [
    "Take the path into the woods.",
    "Take the trade route."
  ],
  "page 3": [
    "... Then jump out and chase after the bandits, intent on killing them.",
    "... Then let it go. Best to get out of here while they\u0027re gone."
  ],
  "page 11": [
    "End Game and Leave Comments"
  ],
  "page 10": [
    "I\u0027m curious. I\u0027ll head upstairs.",
    "No, I won\u0027t invade their privacy. I\u0027ll stay for breakfast then leave."
  ],
  "page 13": [
    "Damn him, the sick bastard. I swing.",
    "I stay my hand. If he doesn\u0027t give an answer I like, I\u0027ll kill him."
  ],
  "page 15": [
    "End Game and Leave Comments"
  ],
  "page 9": [
    "Quickly slide my blade back onto my back and raise my hands. I just want to go.",
    "This beast might be wild. I swing wildly, hoping to wound it."
  ],
  "page 14": [
    "End Game and Leave Comments"
  ],
  "page 16": [
    "He asked me to kill him. I will, and put him and his wife to rest.",
    "I won\u0027t kill him. I know the pain he is going through, has been going through."
  ],
  "page 91": [
    "Continue"
  ],
  "page 90": [
    "I need to escape, permanently. I reach for the dagger on my bedside.",
    "No. I won\u0027t take the easy way out. I\u0027ll hold out, as long as it takes."
  ],
  "page 93": [
    "Continue"
  ],
  "page 92": [
    "End Game and Leave Comments"
  ],
  "page 95": [
    "End Game and Leave Comments"
  ],
  "page 94": [
    "I need to do something different with my life.",
    "I won\u0027t change because the dead wish it."
  ],
  "page 97": [
    "End Game and Leave Comments"
  ],
  "page 150": [
    "\"Fine, let\u0027s take your path. Be ready to fight, just in case.\"",
    "\"No, we\u0027ll take the path that was suggested. Let\u0027s get going.\""
  ],
  "page 152": [
    "We\u0027ll go around like Miller suggested.",
    "We\u0027ll take them down like Iris suggested."
  ],
  "page 151": [
    "Run for the woods, it\u0027s the only way to ensure our safety.",
    "Go for the archer, take him out before he alerts the others."
  ],
  "page 154": [
    "Continue"
  ],
  "page 153": [
    "End Game and Leave Comments"
  ],
  "page 29": [
    "End Game and Leave Comments"
  ],
  "page 133": [
    "Continue"
  ],
  "page 136": [
    "Continue"
  ],
  "page 135": [
    "Continue"
  ],
  "page 138": [
    "No. I\u0027ve got to defend my companions. I\u0027ll fight as long as I have to.",
    "They\u0027re on their own. I\u0027m getting out of here, while I still can."
  ],
  "page 137": [
    "Continue"
  ],
  "page 139": [
    "Continue"
  ],
  "page 24": [
    "End Game and Leave Comments"
  ],
  "page 23": [
    "Stand my ground and stick my sword out, hoping the beast runs into it.",
    "Leap out of the way, swinging my sword at it whilst I do."
  ],
  "page 26": [
    "End Game and Leave Comments"
  ],
  "page 28": [
    "The passion has died. I need to let go of my pitiful life.",
    "The passion still burns within me. I won\u0027t let go. I\u0027ll fight until every bone is broken and my last drop of blood has spilled."
  ],
  "page 20": [
    "End Game and Leave Comments"
  ],
  "page 0": [],
  "page 141": [
    "End Game and Leave Comments"
  ],
  "page 140": [
    "I need warmth. I\u0027ll kill whoever is in there, and feel no guilt over it. Whoever\u0027s in there is a monster.",
    "If it\u0027s a choice between being gruesomely maimed and killed or slowly freezing to death... I think I\u0027ll take the latter."
  ],
  "page 142": [
    "End Game and Leave Comments"
  ],
  "page 166": [
    "\"Fine, let\u0027s take your path. Be ready to fight, just in case.\"",
    "\"No, we\u0027ll take the path that was suggested. Let\u0027s get going.\""
  ],
  "page 32": [
    "End Game and Leave Comments"
  ],
  "page 34": [
    "End Game and Leave Comments"
  ],
  "page 37": [
    "I can\u0027t do that. I need to do something. Get them to rise up.",
    "Yeah I can. I\u0027ll continue onwards."
  ],
  "page 36": [
    "Speak to the wandering merchant.",
    "Just get my drink."
  ],
  "page 39": [
    "The sick bastards. I\u0027ll strike them down.",
    "I\u0027ll just leave. Doesn\u0027t involve me."
  ],
  "page 38": [
    "Continue"
  ],
  "page 30": [
    "I\u0027ve nothing better to do. I\u0027ll take it.",
    "I won\u0027t stoop so low. They\u0027re pathetic bandits."
  ],
  "page 158": [
    "End Game and Leave Comments"
  ],
  "page 157": [
    "\"You\u0027re right. Let\u0027s give those Kishak bastards hell.\"",
    "\"It\u0027s pointless. Let\u0027s just... Wait it out.\""
  ],
  "page 159": [
    "End Game and Leave Comments"
  ],
  "page 46": [
    "End Game and Leave Comments"
  ],
  "page 45": [
    "I\u0027ll leave. Now. There\u0027s no reason to defend those who won\u0027t defend themselves.",
    "I\u0027ll defend them from the raiders come tomorrow. They need it."
  ],
  "page 47": [
    "End Game and Leave Comments"
  ],
  "page 49": [
    "I\u0027ll stay here. Perhaps I can help the people that way.",
    "I\u0027ll leave. I defended the village, and now nothing is left for me here."
  ],
  "page 40": [
    "Gi\u0027anti has become something of a friend over this last month. I will gladly stay on the caravan with him.",
    "Much as I enjoy his company, I need to leave. I\u0027ll tell him as much."
  ],
  "page 42": [
    "End Game and Leave Comments"
  ],
  "page 41": [
    "End Game and Leave Comments"
  ],
  "page 163": [
    "\"You\u0027re right. Let\u0027s give those Kishak bastards hell.\"",
    "\"It\u0027s pointless. Let\u0027s just... Wait it out.\""
  ],
  "page 162": [
    "Continue"
  ],
  "page 164": [
    "End Game and Leave Comments"
  ],
  "page 101": [
    "I keep laughing! This is working! I can feel myself slipping away, away from them and all my problems!",
    "What am I doing? I get a grip on myself and stop, before I slip into a pit I cannot pull myself out of."
  ],
  "page 100": [
    "End Game and Leave Comments"
  ],
  "page 103": [
    "End Game and Leave Comments"
  ],
  "page 104": [
    "I want to pretend this didn\u0027t happen. Kit\u0027s gone insane, there\u0027s no way out but death.",
    "I want to pretend this didn\u0027t happen. Kit realizes that the voices are trying to help him and changes.",
    "But this did happen. I want Kit to know."
  ],
  "page 107": [
    "Go back and make the right choice for me."
  ],
  "page 106": [
    "Go back and make the right choice for me."
  ],
  "page 55": [
    "Continue"
  ],
  "page 108": [
    "Give Kit his friends back.",
    "Fuck you. I don\u0027t have to do this. I can close this game right now if I want. I don\u0027t even have to click this choice. You can\u0027t make me do anything."
  ],
  "page 57": [
    "I\u0027m heading right for the Count\u0027s manor. I\u0027m going to do something for those refugees.",
    "The Count doesn\u0027t matter. I came here to get away from fighting, not to get involved in more of it. I\u0027ll look around."
  ],
  "page 56": [
    "I\u0027ve come this far, might as well follow through. I\u0027ll join their uprising.",
    "No, I don\u0027t think I will. The idea was to give them the push they needed, not participate."
  ],
  "page 59": [
    "Discourage him. Being a hero\u0027s not all it\u0027s cracked up to be.",
    "Encourage him. He should chase his dream, get out and see the world."
  ],
  "page 58": [
    "Continue"
  ],
  "page 51": [
    "End Game and Leave Comments"
  ],
  "page 50": [
    "End Game and Leave Comments"
  ],
  "page 66": [
    "End Game and Leave Comments"
  ],
  "page 68": [
    "I\u0027ll give the store my commendation. That will get people to shop here.",
    "No, I should just leave now. He can figure this out on his own."
  ],
  "page 69": [
    "End Game and Leave Comments"
  ],
  "page 60": [
    "I accept in a heartbeat. I need to bring them back!",
    "... No. The Count is playing a trick on me. I won\u0027t let him."
  ],
  "page 61": [
    "End Game and Leave Comments"
  ],
  "page 64": [
    "End Game and Leave Comments"
  ],
  "page 63": [
    "He admitted he was trying to trick me with his earlier offer. No more. I\u0027ll strike him down until finally, I kill him for good.",
    "I\u0027ll take his offer. I just need to get out of this place."
  ]
}