[
  "95",
  "From A Great Height",
  "Saika",
  "6",
  "5",
  "6.03",
  "https://chooseyourstory.com/story/From_A_Great_Height.aspx",
  "You can\u0027t remember when the world first started shaking, but then one day everything started crashing down. It\u0027s not a case of fixing it, or even surviving the aftermath. You can only rebuild and start again.\nThis is my entry for the March 2017 Chaos Contest.\n  Endings\nThere are 18 endings in total. A few of them may be very similar to each other. Bear in mind also that some endings cannot achieved without saving a particular character (or not saving them).\n  Features\n- The objective of this game is to survive the effects of the chaos on the world around you and reach a location of appropriate stability which will bring you contentment. There is an exploration aspect to this. You will not learn everything about the world around you in just one playthrough.\n- Most of the \"chaos\" taking place in the game world is not immediately visible to the protagonist (aside from some special endings), but it is primarily responsible for the effects on the surrounding environment and therefore remains the central theme.\n- I started writing this 7 days before the deadline, so it isn\u0027t quite as long and detailed as I wanted it to be. Examples of this are the fleshing out of particular character backgrounds, implementing multiple foreign languages, cultures, technologies and fantasy races. Some aspects are deliberately left up to the reader\u0027s imagination.\n- Many characters will appear to speak to you in a foreign, cryptic language (referred to as \"Common Tongue\" by themselves). Readers may or may not recognise this to be a form of substitution cipher which is easily decipherable if you know how, but it is not essential to know what they are saying.\nEDIT: I\u0027m so glad someone decided to poke the mutant with a stick and uncover another previously unseen scenario. It wasn\u0027t until later that I realised the majority of people would probably never ever see that part of the story."
]