{"page 123":"Leave them, their tactics aren\u0027t working","page 244":"You nod and prepare for battle","page 365":"Run for it, it\u0027s over","page 243":"\"The Old Man is a psycho and I owe him nothing, I will help you\" you reply.","page 364":"Take them down fast before they kill too many of your shamblers","page 125":"Sneaking out","page 124":"Stay and help get ready for the push East with the military guys, they have the guns afterall","page 245":"Relaxing in the New City","page 127":"Agree to run and help, they aren\u0027t too far away after all","page 369":"keep searching for mutants, if they are going to be suspicious either way, you want good minions to fight them","page 126":"Morning hunger","page 129":"Morning in the blood stained van","page 128":"Late night munchies","page 249":"Going with the lie","page 77":"Help things end for him","page 76":"How to handle things...","page 79":"Assessing the situation","page 78":"Slip away, you don\u0027t want to stay a second longer","page 71":"Climb the barricade","page 70":"Check this floor first","page 72":"It\u0027s only a shambler and one or two of them aren\u0027t really an issue. Raid this place for supplies","page 75":"The rooftop conversation","page 74":"The apartments rooftop","page 130":"Give it up. Who are you kidding that you have amazing mind powers that you simply never noticed before?","page 251":"What you get for lying","page 372":"Just grab some shamblers and go, no point in wasting time here","page 250":"Screw the old man, your now trapped in the middle of enemy territory and utterly surrounded. Sell him out to these guys, they are stronger than him and that\u0027s what matters.","page 132":"Stay with the heavily armed convoy","page 253":"Concentrate on the two \u0027Lords\u0027 above you, hit their minds hard enough and you could get away or even defeat them","page 374":"Attacking in the moonlight","page 252":"Concentrate on its mind, if you get control of that then you can use it to let you escape.","page 373":"Waiting for nightfall","page 112":"Mission 1","page 233":"Screw the old man, your now trapped in the middle of enemy territory and utterly surrounded. Sell him out to these guys, they are stronger than him and that\u0027s what matters.","page 354":"Starting out for the compound","page 111":"Enlist with the stadium guards","page 232":"Tell some of the truth, that you encountered someone that might match that description but no details, if they push cover up the involvement.","page 114":"Rear?","page 235":"Follow the urge","page 356":"kill the woman and the man now, screw the information, you know where to find to compound alone","page 113":"Front?","page 234":"Welcome to the thunderdone!","page 355":"Starting out for the compound","page 116":"Follow orders, grab tins and run","page 358":"It\u0027s worth the time and effort, go searching for mutants","page 236":"force it down","page 357":"Northward with killing on the mind","page 239":"Final choices","page 117":"\"Hold on, your gun will attract more of them, I\u0027ll use my bat then make my own way back, I know how to move safely alone!\"","page 238":"Understanding","page 359":"Just grab some shamblers and go, no point in wasting time here","page 88":"Inside the stadium doors","page 87":"Approaching the stadium at dawn","page 119":"life as a guard","page 89":"After the Exam","page 80":"Assessing the situation","page 82":"Let him in? What can an old man do?","page 81":"Looping back to the stadium","page 84":"Let him go and work out what he meant later","page 83":"Keep silent and prepare to defend yourself","page 85":"Take him out fast, he is unarmed and old","page 240":"The red path","page 361":"Head on up the road openly and claim the scavengers sent you so you can get inside","page 360":"Approaching the target, horde following behind","page 121":"Keep quiet, you know full well what happened and don\u0027t want to be next","page 242":"\"I will help the Old man, I owe him that much\" you finally respond","page 363":"Moonlight attacks","page 120":"Raise your hand","page 241":"Find your own path","page 362":"Slip off the road before you are noticed, you can easily climb the wall and attack in the night","page 6":"The Alleyway","page 145":"Go to meet the harbinger","page 387":"Wait it out, you have enough food for a while and you can observe more","page 5":"Chicken out and head out the Back","page 144":"Happy evenings rest","page 265":"The Empty Stadium","page 386":"Test the bunker, there might be a way it if the company selling it were scammers","page 8":"North, back into the alleyways","page 147":"life goes on and breakfast is good","page 389":"Leave and head back South, you have learned what you need to crush the Eastern colony","page 7":"Heading West to Avoid the Mob","page 146":"Ignore his summons and stay with the stadium, training your new gift on missions.","page 267":"The Northern highway alone","page 388":"Leave and head back South, you have learned what you need to crush the Eastern colony","page 2":"The Front Door","page 149":"Extreame morning hunger","page 1":"Down the Stairs","page 148":"Relax and settle back in your chair","page 269":"Call out and open it carefully, could be a survivor and infected generally can\u0027t work doors.","page 4":"Outside","page 3":"The Back Door","page 99":"Looping back to the stadium","page 98":"The gas station roof","page 9":"East to clear out the mob","page 91":"First light in the stadium","page 90":"Your new home at the stadium","page 93":"You can lie about it and just say it was a cut. You aren\u0027t showing any other signs to make them suspicious after all","page 94":"own up but point out that you have taken the vaccine and bites don\u0027t affect you.","page 97":"Head right for the building next door and jump onto a balcony, don\u0027t waste time on security doors","page 96":"Test the doors, they might even be unlocked","page 390":"Wait it out, you have enough food for a while and you can observe more","page 150":"Go to meet the harbinger","page 271":"You can\u0027t give up yet, it\u0027s not as if you have anything else to do is it?","page 270":"You can\u0027t sacrifice yourself by running into an ambush for them. Head North!","page 391":"Test this thing properly, you have guns and access to gunpowder afterall","page 152":"The next few weeks","page 394":"Leave and head back South, you have learned what you need to crush the Eastern colony","page 151":"Keep blocking him out, you have everything you need right here, make sure to keep a good grip on your horde though.","page 272":"Late night munchies","page 393":"Test this thing properly, you have guns and access to gunpowder afterall","page 154":"Warn the Capt. Now before it is too late, he mentioned alternate routes for emergencies and this definitely counts as one.","page 396":"The first night","page 153":"The morning of the East Run","page 395":"Safe-Haven","page 255":"Lie. You can\u0027t have them know you are affiliated with him, tell them you only recently came from the North before turning East to the city centre and didn\u0027t meet another harbinger.","page 376":"Get out of here, if your horde is loosing, you have to save yourself","page 133":"Sneaking out","page 254":"Concentrate on the combat, it\u0027s based off a human so it has human weaknesses, hit it\u0027s eyes, nose and tendons, then see if it can fight you.","page 375":"Your wound has to wait, support your horde before it is too late","page 136":"The testing continues","page 135":"Testing time","page 256":"What you get for lying","page 377":"Morning in the shed","page 138":"You\u0027re a Harbinger and you\u0027ve eaten people for years, time to flex those powers, use the shamblers to help you wipe the stadium survivors out.","page 137":"Morning revelations","page 258":"Soak up the arenas glory","page 379":"Chase them down, then slaughter the others as well, they killed your new pet","page 139":"You are a harbinger, but you aren\u0027t sure you want to attack these people right now. Stay playing nice as you are while you train your powers, maybe get out on some scavenges to test yourself further.","page 0":"Morning Sun in the Big City","page 381":"Pretend to be a human fleeing the violence like the others to get inside whatever it is they are running for","page 380":"Pull back and wait to see what is going on, there is a lot of them","page 141":"Mission 2","page 262":"Lash out at the city minds, crush them before their horde does any more damage","page 261":"The Old man lead you into a trap, kill him now!","page 143":"You feed of humans sure, but you aren\u0027t controled by that need and you are enjoying having friends for a change. Hold off wiping out the stadium for now","page 385":"Morning in the well loved home","page 142":"Take the first step to wiping the stadium out, use the infected to kill the team then eat them before returning","page 384":"Time to feast and heal","page 288":"Start looking for a likely source of food","page 166":"Wait for nightfall then sneak them in slowly. Attack once you have a good force inside","page 287":"North into the rural areas","page 169":"Wait for the rest of your horde, you have time before the guard change and it will be safer to swarm everything at once.","page 168":"You have a handful of fast ones and a handful of shamblers, strike now as the others make their way up. You can take out most of the other guards as the rest of your horde gets inside.","page 289":"Keep heading South, cover the ground now then sort out food later","page 170":"Go to meet the harbinger","page 291":"Back North to the Highway then decide your new path","page 290":"Morning in the Mall","page 172":"Head out to attack from the rear; make sure your horde gets inside","page 293":"Keep going South, mutants move mostly by night and you know to be careful now","page 295":"Keep going South, aim right for the city\u0027s heart","page 173":"Ambush the two near you and keep hidden for now, wait for the right moment.","page 294":"Search some of the Towers, no telling what you might find","page 176":"Rush the balcony; if you take it out you can get more infected inside to deal with the big gun.","page 297":"Just leave quietly, it\u0027s a little weird and you don\u0027t trust it","page 175":"Rush the big gun, so long as it\u0027s around, you are doomed","page 296":"Look for the Subway station, there has to be one nearby","page 277":"The morning after the tests.","page 398":"Hold off one more day to plan and prepare","page 155":"Don\u0027t warn him or they will realize what you are, just get away yourself before the trap closes","page 276":"Late night munchies","page 397":"Well before dawn","page 158":"Go to meet the harbinger","page 279":"Heading East with your new powers","page 157":"TIme to get back to the stadium for part two","page 278":"Further tests","page 399":"Go now, take out a few guards to reduce numbers then open the gate","page 159":"Ignore him, you will deal with the stadium first then decide his fate later","page 161":"Hold off for now, they are a suspicious lot and probably won\u0027t believe that you are the only one to get away twice in a row.","page 160":"Call in the horde to swarm them and feed, the fresh human flesh boosts your healing so maybe your powers too.","page 163":"Waking up as lord of your own little horde.","page 284":"Choices for the morning","page 283":"Run for it, no telling what someone locked in there","page 165":"Hit the stadium right away, get infected inside before they can react and defend properly","page 286":"East along the Highway","page 285":"South, into the City","page 188":"A restful night sleep","page 190":"A restful nights sleep.","page 192":"Keep the defence in place","page 191":"Sudden attack","page 194":"Final push East","page 196":"That works fine by you, head in with your friends","page 195":"Carefully approach","page 197":"Restrictions aren\u0027t really your thing and you do have an open invite with the City Minds","page 298":"A busted lock means nothing, every building in the city has one. Go on in.","page 179":"Turning the convoy South","page 181":"Send the infected as the last gambit","page 180":"Holding the defence","page 183":"A strange way to wake up","page 185":"Waking for dinner","page 184":"Checking everything is intact","page 187":"protect but keep being weary of them for now just in case","page 186":"To protect and serve?","page 400":"Head right for the gate and get it open for your shamblers","page 402":"Take them down fast before they kill too many of your shamblers","page 401":"Get out of here, if your horde is loosing, you have to save yourself","page 404":"waiting for nightfall","page 403":"The bunker","page 406":"Wait one more day, it wont hurt","page 405":"Gate open first, then while the shamblers get killed, you hide in the bunker with the others","page 408":"Prisoner in the bunker","page 407":"Go now, take out a few guards to reduce numbers then open the gate","page 409":"Reaching the highway from the North","page 199":"Heading Back to the city","page 19":"Take it Slow and Careful as you Open the Door","page 420":"Into the bunker! it should be close enough!","page 18":"Heading West to Avoid the Mob","page 301":"Keep going South, aim right for the city\u0027s heart","page 422":"Attack the guard on the wall and dodge the three below","page 300":"Search some of the Towers, no telling what you might find","page 421":"Attack the guards on the ground, surprise them","page 303":"Keep going South, aim right for the city\u0027s heart","page 302":"Look for the Subway station, there has to be one nearby","page 305":"Back North to the Highway then decide your new path","page 426":"Get out of here, if your horde is loosing, you have to save yourself","page 304":"Look for the Subway station, there has to be one nearby","page 425":"Take them down fast before they kill too many of your shamblers","page 11":"The Alleyway","page 307":"North into the rural areas","page 428":"Pretend to want to prove your innocence to the guards, then strike fast and kill the armed ones","page 10":"North, back into the alleyways","page 306":"East along the Highway","page 427":"Surviving in the bunker","page 13":"Stay to FIght","page 309":"This is pretty suspicious, head back North","page 12":"North, back into the alleyways","page 429":"Hold off, you can\u0027t be sure of vitory in this confined space and with so many guns around, the panic would help but you couldn\u0027t be sure to kill all the guards before they shot you","page 15":"Heading North","page 17":"East to clear out the mob","page 16":"North, back into the alleyways","page 29":"Alleys in the morning","page 410":"East with the dawn","page 412":"Judgement day","page 415":"Get out of here, if your horde is loosing, you have to save yourself","page 414":"Take them down fast before they kill too many of your shamblers","page 22":"Night in the Northern Alleys","page 417":"Try to get close with talking, then when they relax, strike fast","page 21":"Night in the Northern Alleys","page 416":"Slip close quietly, they will be night blind so you can completly surprise one then leap for the other","page 24":"Hotel room for the night","page 419":"The raised alarm call","page 23":"Hotel basement for the Night","page 418":"Clearing the guards out before the rampage","page 26":"Basement holdout","page 25":"Run for higher ground","page 28":"Into the stadium district","page 200":"Welcome to the thunderdome?","page 321":"Heading North to train before you make for the Colony","page 442":"Morning arrival at Safe-Haven","page 441":"Walking talking and eating","page 202":"Settling into the new city life","page 323":"Check out the House, beds are too big to loot right?","page 444":"First evening in the haven","page 201":"The new arena?","page 322":"Head onto the Grain Silo","page 443":"The Safe-Haven of Safe-Haven","page 204":"Meeting the man","page 446":"Send the shamblers away, staying here for a while wouldn\u0027t be so bad","page 203":"You nod and prepare for battle","page 324":"Check out the Barn, They often have second levels and old hay makes a comfortable enough bed.","page 445":"Clear your mind of the stupid thoughts and emotions, you are a harbinger","page 206":"Back out politely and head back to the stadium, you were happier there and the old man is a bit creepy.","page 327":"Check out the House, beds are too big to loot right?","page 448":"Head right for the gate and get it open for your shamblers","page 205":"Choose to stay and learn, it\u0027s what you are after all, a harbinger.","page 326":"Head onto the Grain Silo","page 447":"Go now, take out a few guards to reduce numbers then open the gate","page 33":"Bash it with a bat then continue, it\u0027s just one shambler afterall","page 208":"Training time","page 329":"Head onto the Grain Silo","page 32":"Head out to the main streets","page 328":"Check out the Barn, They often have second levels and old hay makes a comfortable enough bed.","page 449":"Settling into the community life","page 35":"Approaching the stadium","page 209":"More mental exercises","page 36":"Scout the area out","page 39":"You aren\u0027t waiting around to get shot","page 38":"Might as well go along with it again since they haven\u0027t fired yet and your currently goal is to find survivors after all.","page 31":"Keep to the Alleys and move carefully","page 30":"Into the stadium district","page 330":"Head onto the Grain Silo","page 450":"A romance ending in blue","page 310":"Keeping on South to see what you find","page 431":"To feast or to kill? you have all the time in the world to decide","page 430":"Planning a raider attack","page 312":"Charge through before any more turn up!","page 311":"Keeping on South to see what you find","page 314":"Tell them the truth, they are the same as you after all","page 435":"The Raiders arrival","page 437":"Part B of the plan","page 315":"Lie to them, can\u0027t show all your cards right away.","page 436":"Acceptance and new trust","page 44":"Check the shutters, look for a weakness","page 318":"life as a trainee harbinger in the city","page 439":"Journey of death","page 43":"The Shop","page 317":"Further down the rabbit hole","page 438":"The coming days","page 46":"Check for fire escapes to get in from the roof","page 45":"Check for fire escapes to get in from the roof","page 319":"The weeks to come","page 48":"Inside the shop","page 47":"Go find a weapon","page 49":"Run for it!","page 40":"You aren\u0027t waiting around to get shot","page 42":"The apartments","page 41":"Or carefully plan out how to get into the stadium. You\u0027ll obviously have to get your arm healed up first and make sure they don\u0027t recognize you as the guy that ran away in a hail of bullets.","page 101":"You\u0027re strong, put your shoulder to it and see whats hidden behind the door","page 222":"Start taking them over, it\u0027s always best to move with your own little horde for protection","page 343":"Suggest you all go outside then and discuss it there. You can get close to them that way and attack right now!","page 342":"Stay with them for a bit and continue playing nice, you have nothing to loose that way","page 224":"They are weak, the Old man said he was stronger than them individually when he faced them before. Take this one out here and now. The second one won\u0027t be an issue alone.","page 223":"Simply move them aside, might be best not to approach with an army at your back","page 344":"Bide your time, you\u0027ll get your chance at them soon","page 105":"Time to break out of here, you\u0027re stronger than most and a few good charges will bust the door wide open.","page 347":"Hold off, they can get you inside a compound full of humans, that is worth the wait.","page 104":"Test the doors, they might even be unlocked","page 225":"Play everything safe, sure the attack is weak but the other one hasn\u0027t turned up. Hold fast and see what happens.","page 346":"They are open, attack now! You can get the location from one of them after the guards are dead","page 228":"Who are they to order you about, they have their horde for protection and you have yours.","page 349":"The woman seems the easier one to break, Kill the man now in front of her too so she breaks sooner.","page 106":"Wait it out. What\u0027s a couple of days in solitary when you\u0027ve spent years doing it?","page 227":"Heading in to meet the harbingers alone","page 348":"They have no food or water, leave them a day or two while you feast on the guards in front of them, they will be desperate soon enough","page 109":"Your new home at the stadium","page 54":"Announcing your presence","page 108":"Inside the stadium doors","page 229":"Heading in to meet the harbingers alone","page 57":"Head out to the main streets","page 59":"compliance","page 58":"Run for it","page 51":"Investigate","page 50":"Wait and see","page 53":"Busting in","page 52":"steer clear","page 350":"The silo painted red","page 110":"Check out the caged shamblers","page 352":"Morning in the red silo","page 211":"Setting up time","page 332":"Morning in the silo","page 210":"Heading out to the ambush","page 331":"A painful wakening","page 213":"What have you been doing, you need to help them","page 334":"Go for it, they trapped you in here and eating humans is what you do after all","page 212":"Look away from the haze and attack","page 333":"Quarantine in the silo","page 215":"Finally the reveal","page 214":"Time to clean up","page 335":"wait out the quarantine, a few days wont hurt and you have things to test on the shambler","page 217":"Frontal attack, you aren\u0027t going to walk right into enemy territory alone.","page 338":"The difference between the shambler and your guards","page 216":"Back at the apartment","page 337":"Sudden light in the face","page 66":"Head right for the building next door and jump onto a balcony, don\u0027t waste time on security doors","page 219":"Battle in red","page 65":"Test the doors, they might even be unlocked","page 218":"Undercover, get inside and you can take out the enemy without risking your horde, more infected left alive means more ready to attack the Eastern colony after.","page 339":"Morning resolutions","page 68":"Head right for the building next door and jump onto a balcony, don\u0027t waste time on security doors","page 67":"Break it open, you\u0027re this close already","page 69":"Climb the barricade","page 62":"This isn\u0027t worth it, head back to the apartment and check it out properly","page 63":"Go find a weapon","page 341":"Ambush them, you may like her company but you gain more from eating them","page 340":"Decision time"}