{"page 123":"I can\u0027t.  I can\u0027t.  I\u0027m too sick.  It\u0027s too much, Kelly.  I\u0027m sorry. \n\n\nI can\u0027t make it all the way there to you.  But maybe there\u0027s a way I can help from here.\n\n\nI\u0027ll watch that last episode one more time.  Maybe I can make out your words this time.  Maybe I can find a way to stop you from making that leap.  One last try and then, yes, I\u0027ll come to you.\n\n\nI know you\u0027ll be waiting for me, there in the air above the molten iron.\n\n\n \n","page 122":"Yes, Kelly.  I going to you.  When I jump, will I feel your hand in mine, suddenly, a moment before we are consumed by the molten metal?  Will we hang there in the air forever?  Or will it just be over, so fast, that I won\u0027t know the difference between my body melting away and the warmth of seeing you again?\n\n\n \n\nI will see you soon.  I will see you in a moment.\n","page 127":"But it means something, I think.  Think of the infinity of the time and space, and the unlikelihood of me, and you, and KUaF, and a means of communicating remotely, all taking shape from atoms, and all now, at this moment at this exact moment.\n\n\nYou and I both lovers of Kelly and everything she stands for are both here, together sharing what we love.\n\n\nIt means something.  When Kelly and Can\u0027tgaroo found the pair of silver keys, they didn\u0027t leave them on the bridge.  The knew that keys mean locks.  You take one key, and I\u0027ll take the other.\n","page 126":"OK, question 3.  Who was the leader of the Night Patrol for most of seasons 2 and 3?\n\n\n \n","page 128":"Let\u0027s just skip, then, if we are skipping.  You can watch a show and skip episodes, and you can sit in your basement and skip your life.\n\n\nWhy not skip a human being trying to talk to you, to share something with you?\n\n\nKelly would have something to say about loyalty and trying to find good in people.\n\n\n \n","page 77":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 76":"I wasn\u0027t going to give that option because I was positive nobody would want to \"go back to the quiz.\" just skip a part.\n\n\nLike Kelly \"skipping\" over the introduction to the spellbook leading to all of that destruction in Season two.\n\n\nThere\u0027s a person behind these words, and won\u0027t be \"skipped\" for a point, so you can get through it faster, so you have five more minutes to do something senseless.\n\n\nI want, I need to show you.  I need you to look at me, whereever you are, to look me in the face, to see me in front of you.  You can\u0027t skip me then.\n\n\nLeave me up on your screen just a little longer, a little while longer.  Don\u0027t let it end like this.  Please.\n\n\n \n\n \n\n \n\n \n\n \n\nVulnerability (System Infected Trojan/Rootkit quarantined); your IP address and location may have been logged remotely.  Strongly recommend restarting.\n","page 79":"Year by year, you\u0027ll think of me, of this moment.   There is nothing more intimate.   You give me a place in your soul to live. \n\n\nAnd if you keep this particular page up, just one second more than you have to, I\u0027ll know you understand, that you want me to be there with you, that you are letting yourself feel something.  You don\u0027t have to be all dead inside.   We can be together and feel something finally.\n\n\nThink of this moment as you go to sleep especially.\n\n\nI am in here.\n","page 78":"I wasn\u0027t going to give that option because I was positive nobody would want to \"go back to the quiz.\" just skip a part.\n\n\nLike Kelly \"skipping\" over the introduction to the spellbook leading to all of that destruction in Season two.\n\n\nThere\u0027s a person behind these words, and won\u0027t be \"skipped\" for a point, so you can get through it faster, so you have five more minutes to do something senseless.\n\n\nI want, I need to show you.  I need you to look at me, whereever you are, to look me in the face, to see me in front of you.  You can\u0027t skip me then.\n\n\nLeave me up on your screen just a little longer, a little while longer.  Don\u0027t let it end like this.  Please.\n\n\n \n\n \n\n \n\n \n\n \n\nVulnerability (System Infected Trojan/Rootkit quarantined); your IP address and location may have been logged remotely.  Strongly recommend restarting.\n","page 71":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 70":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 73":"On the bus, at work, in the cafe, everyone is on their phones, on their laptops.  They don\u0027t look at me.\n\n\nBut no, actually, you must be on your phone or your computer listening to me.  One of you is.  It could be that barista who I\u0027m looking at now, as I write this particular choice.\n\n\nThe barista is clearing out a filter while she looks at her phone with one hand.  Please be you, barisa with the soft brown hair and the light dusting of freckles.  I need it to be you.\n","page 72":"I\u0027m talking to you, reading this quiz.  Don\u0027t just skim past me and click below to get rid of me.  I\u0027m here, I\u0027m trying to connect with you for one moment in our whole lives.\n\n\nI go whole days, you know, when I don\u0027t talk to anyone.  I go out after a silent alone breakfast, I walk to a cafe, push some money at the barista (If I\u0027m lucky I\u0027ll get to say \"large coffee, please,\" and the barista will say \"Have a good one.\")\n\n\nA good one!  She must say that a thousand times a days.  But she doesn\u0027t know I need it, I listen to it.  A human being said words to me and I eat it up like a starving pet.\n\n\nI go on the train and ride wordlessly to work, work silently in a windowless room and come home.\n","page 75":"It\u0027s all right.  I knew it was unlikely.   You are someone else.\n\n\nOur lives brought us together, to this moment.  You said you came here for me, and it almost doesn\u0027t matter who you are.\n\n\nI believe you can\u0027t control when love will come.  Our lives find themselves connected right now.  That\u0027s a kind of love.  My words here, passing into your eyes, to reside in your brain.  And they will stay there, curled up, sweetly sleeping in your synapses.\n\n\n \n","page 74":"I know that I haven\u0027t published this yet, but you may be looking at this in \"sneak preview\" mode, watching me as I type, or watching my words.  I know you wouldn\u0027t lie to me.\n\n\nYou actually just looked up as I saved this page.  I\u0027m in here every day and I watch you.  You seem sad, like you would understand.  You have a cut on your wrist, and I wish I could bandage it properly. \n\n\nYou shouldn\u0027t work with a cut.  You sliced it with a can opener.  I saw the blood on the paper towels in the garbage when I went into the bathroom after you.  I hope you\u0027ll be all right.  It\u0027s not too deep.\n","page 130":"...\n","page 112":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 111":"It\u0027s like a prisoner, you know what I mean.  Behind a sheet of bulletproof glass with their loved one touching the glass.  They can\u0027t feel it, but the presence is there.   Knowing someone is there--it matters.\n\n\nPlease.  Think about Rhea-Lynn when she was captured in the Forgetting Forest.  Her one hand and her bloody bandaged stump, reaching out for help through the bars, the camera zooming in on her eyes.\n\n\nAnd Kelly, grimly riding towards her to save her.  She didn\u0027t leave anyone to die, to be captured.  She rescued.  It\u0027s what she did.\n\n\nPlease.\n","page 114":"No, don\u0027t say that.  It\u0027s not true!  What do you need me to do?\n","page 113":"I will, Kelly.  How?\n","page 116":"Kelly, talk to me.  Don\u0027t just stare at the screen.  I\u0027m here.  What do you need me to do?  Tell me.  I\u0027m here.  I\u0027ve been waiting for you do tell me.\n","page 115":"Kelly, talk to me.  Don\u0027t just stare at the screen.  I\u0027m here.  What do you need me to do?  Tell me.  I\u0027m here.  I\u0027ve been waiting for you do tell me.\n","page 118":"Goodbye, Kelly.  I\u0027m sorry.  I\u0027m going to go and open the window.  I know you\u0027re out there thinking of me.\n\n\nThat\u0027s enough.  The light feels warm.  You\u0027re out there.  You\u0027re alive somehow.\n\n\nGoodbye.\n","page 117":"Kelly, talk to me.  Don\u0027t just stare at the screen.  I\u0027m here.  What do you need me to do?  Tell me.  I\u0027m here.  I\u0027ve been waiting for you do tell me.\n","page 88":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 87":"Remember that opening the Nonesuch Door with her key destroyed Can\u0027tgaroo.  She was left mindless and withered.  But remember her last words.\n\n\n\"I\u0027m glad...we tried.\"  And she looked at Kelly.  And the point is that we try to find those locks that our keys open.  That\u0027s what we are here for.\n\n\nThat\u0027s why you are here.\n","page 119":"You can\u0027t say goodbye that way.  Kelly!  Kelly!  Where have you been?  What should I do?  How did you find me?\n\n\n \n","page 89":"And then, as the show faded out, in slow motion she stepped into the white-hot liquid iron, but remember, remember, her eyes never left mine, locked on mine, making that eye contact as she fell.\n\n\nAnd the strangest thing.\n\n\nShe reached back, her palm up, soft fingers slightly curled, and extended that hand towards me as if handing me something or inviting me to take her hand as she jumped, or a gesture of...I don\u0027t know.\n\n\nI\u0027ve watched that grainy VHS-captured clip of that last moment over and over one thousand times, wearing out the magnetic tape there.  She\u0027s almost saying something, murmuring it with her lips.\n\n\nBut the sound of the screaming molten metal and the laughter of the triumphant C. Rex, and the cries of Silver Jenny and Sir Humble shouting, \"No! No! it\u0027s not worth it, Kelly!\" and Fleetfoot neighing in pain--I can\u0027t hear what she says.\n\n\nYou must have watched and rewatched it too.  What was she saying?  Could you make it out?\n\n\n \n","page 80":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 82":"Where would I be if not for you\n\n\nI know I wouldn\u0027t be here today\n\n\nI\u0027d be sitting and thinking\n\n\nAnd trying to find you\n\n\nThrowing my life away!\n\n\n \n\nNow you\u0027ve opened my eyes\n\n\nrode through my heart\n\n\nAnd I want you to know for sure\n\n\nYou\u0027re the one with the magic\n\n\nThe one with the charm\n\n\nMy life would be tragic\n\n\nIf you hadn\u0027t come\n\n\nMy Kelly\u0027s fantastic\n\n\nAnd it\u0027s clear you\u0027re the one\n\n\nYou\u0027ve helped me to grow\n\n\nInto so much more\n\n\n \n\nOnce I tried to hold on\n\n\nBut she fell into dark\n\n\nAnd she vanished so far away\n\n\nWhen I dream she\u0027s still here\n\n\nAnd she holds out her hand!\n\n\nKelly might reappear\n\n\nAnd she might understand\n\n\nAnd I need you be,\n\n\nYes I need you to be still there.\n\n\n \n\n \n","page 81":"Were you in the audience?  You, the reader of my quiz.  Would you have teased me afterwards?  You would not have.  Your have had to hide your applause, but you would look up and see me and hear me recite my poem.  You would have realized that I loved what you love.\n\n\nAnd our eyes would meet across the dark auditorium, and then it wouldn\u0027t have mattered how our classmates were witnessing my humiliation, the stoic, stiff, eyes-averted pose of my parents, or the way the teachers were muttering \"oh, my god\" quietly, this as my poem was still going on.\n","page 84":"And that\u0027s what love is, at the end.  Especially at the end.  The was no resolution at the end of Season Three.  They didn\u0027t know it was going to be the last episode for a long time.\n\n\nNone of us know when our final episode is.  Kelly and Friends\u0027 final moment were part one of a two-part episode which never got completed.\n\n\nRemember, Kelly choosing to give her life for another.  Kelly stopped off the ridge, into the molten iron that surrounded Cantankerous Rex\u0027s castle, to try to bargain for the life of dead, dead Little Lily.\n\n\n\"If you want a life for a life, take mine!\" she screamed.  \"Take mine!\"\n","page 83":"And that\u0027s what love is, at the end.  Especially at the end.  The was no resolution at the end of Season Three.  They didn\u0027t know it was going to be the last episode for a long time.\n\n\nNone of us know when our final episode is.  Kelly and Friends\u0027 final moment were part one of a two-part episode which never got completed.\n\n\nRemember, Kelly choosing to give her life for another.  Kelly stopped off the ridge, into the molten iron that surrounded Cantankerous Rex\u0027s castle, to try to bargain for the life of dead, dead Little Lily.\n\n\n\"If you want a life for a life, take mine!\" she screamed.  \"Take mine!\"\n","page 86":"I wasn\u0027t going to give that option because I was positive nobody would want to \"go back to the quiz.\" just skip a part.\n\n\nLike Kelly \"skipping\" over the introduction to the spellbook leading to all of that destruction in Season two.\n\n\nThere\u0027s a person behind these words, and won\u0027t be \"skipped\" for a point, so you can get through it faster, so you have five more minutes to do something senseless.\n\n\nI want, I need to show you.  I need you to look at me, whereever you are, to look me in the face, to see me in front of you.  You can\u0027t skip me then.\n\n\nLeave me up on your screen just a little longer, a little while longer.  Don\u0027t let it end like this.  Please.\n\n\n \n\n \n\n \n\n \n\n \n\nVulnerability (System Infected Trojan/Rootkit quarantined); your IP address and location may have been logged remotely.  Strongly recommend restarting.\n","page 85":"But it means something, I think.  Think of the infinity of the time and space, and the unlikelihood of me, and you, and KUaF, and a means of communicating remotely, all taking shape from atoms, and all now, at this moment at this exact moment.\n\n\nYou and I both lovers of Kelly and everything she stands for are both here, together sharing what we love.\n\n\nIt means something.  When Kelly and Can\u0027tgaroo found the pair of silver keys, they didn\u0027t leave them on the bridge.  The knew that keys mean locks.  You take one key, and I\u0027ll take the other.\n","page 121":"I want to believe you.  I\u0027m so sick, Kelly.\n\n\nBut I\u0027m not so sick that I don\u0027t remember the episode where Cantankerous Rex and his witch doctor Sorcerous Horserous disguised themselves as you and Sir Humble to capture Little Lily. \n\n\nIt\u0027s not you.  You don\u0027t know enough, you aren\u0027t acting like her.\n\n\nC. Rex, I see you.  I will find you.  I can\u0027t bring her back, I know that, and I\u0027m so sick with chills and my joints ache, but I\u0027m coming to find you.  Now that you are in my world, I can kill you.\n\n\nI am coming for you.  \"Weapons can\u0027t stop me!\" you used to say.\n\n\nWe\u0027ll see.\n","page 120":"I\u0027m coming for you, Kelly.  I\u0027m just typing this, sick but hopeful.  I\u0027m getting up from my chair, still typing this, getting up, packing clothes.\n\n\nAnd I\u0027m going to drive until I reach the horizon and find you, your short red hair, your sword in your belt, your eyes on me, your hand held out to me, and this time I will grasp it without glass between us.\n\n\nKelly, I got old.  When you see me you won\u0027t recognize me.  But it\u0027s me, Gower, older, but me. \n\n\nI\u0027m coming to you.\n","page 6":"Wrong!  On the show, only Silver Jenny and Little Lily rode blue steeds because they hadn\u0027t passed the Test of Purity.  Kelly did ride a blue steed at the start of season one, but remember that wasn\u0027t Fleetfoot, that was Clover, but Clover was deemed unworthy and disappeared after like episode four.\n","page 19":"Wrong--sorry.  Uncle Skunkle was that creature who came back with the Friends through the vortex when they got the acorn from the Forever Tree, and he lives in the garbage cans outside Little Lily\u0027s cottage.  He always looked at the Friends sadly when they left for an adventure.\n\n\n\"Can I come this time?  I can fight.  I can fight.\"\n\n\n\"No, Uncle Skunkle, go back into your garbage cans.  Go to sleep in the banana peels.\"\n","page 145":"You know a moderate amount about Kelly Unicornstrider and Friends.  Not too bad!  You could be Little Lily or Sir Humble!\n\n\nI suppose you can\u0027t be Little Lily, actually.  She\u0027s long gone, and I don\u0027t know how to find her again. \n\n\nI have to remember to take the above sentence out before I publish this.\n\n\n \n\nThe End\n","page 5":"What was the name of the first episode of season 2?\n\n\n \n","page 18":"Gotcha!  Cantankerous Rex was the toughest of the Night Patrol, but he wasn\u0027t the leader!  Remember how C. Rex used to say, \"I\u0027m in charge here,\" but that wasn\u0027t really true, and he used to bring out bodies of people and animals he had killed and throw them on a big scale outside his castle to prove he was the toughest.  Just carts filled with bodies in sacks.  You know, they didn\u0027t show anything, but there were just these big red-stained sacks, and he would just throw them on the scale with his tiny arms.\n\n\n\"One hundred, two hundred, three hundred, four, five hundred, six hundred, sacks full of gore.\"\n\n\nC. Rex was not the leader, but he represented something on the show about facing down the toughest possible enemy, someone you can\u0027t possibly defeat.  How do you deal with that?  You must defeat him, but he is far stronger than you. \n\n\nFleetfoot whispered to Kelly once \"C. Rex is death.  Run, Kelly.\"  I always think of that when I get up in the middle of the night and I think of Kelly\u0027s response, \"Wherever I run, I would be running towards him.\"\n\n\nI actually got a shiver writing that.\n","page 144":"Wow!  You know a lot about Kelly Unicornstrider and Friends!  You could be Kelly yourself!\n\n\n \n\nYou\u0027re not, but you could be.  You could be.\n\n\n \n","page 8":"What was the name of the first episode of season 2?\n\n\n \n","page 7":"Right!  Of course you remember Fleetfoot\u0027s white mane and tail swishing across the screen during the opening credits at that part of the song.  I\u0027m actually humming it right now while I\u0027m typing this.\n\n\n \n\n\"...And we will ride through the meadows in the early morn and be our bravest in the desert storm!\"\n\n\n \n\nI bet every single kid who watched Kelly Unicornstrider and Friends, when the Iraq War happened in the \u002790s was singing that in their head.  I remember when we were all in assembly, and the principal said in this really grave voice, \"Children, we are at war.  Our country is at war,\" I was just singing that part in my head about the desert storm. \n\n\nSo anyway, yes, pure white is the answer.\n","page 146":"Sorry, but you don\u0027t know much about Kelly Unicornstrider and Friends!  I recommend you watch the whole series again!\n\n\n \n\n-----------------------\n\n\nAdding this as a final note.  I don\u0027t care if it doesn\u0027t matter to you.  Just clicking through will get you a bad score, and you don\u0027t care.  I could write anything here and it doesn\u0027t matter.  I\u0027m sorry.  I\u0027m just so sorry to you and to Kelly and to everyone.  Just tell my parents and my co-workers--just tell them something.  Tell them to play my quiz.\n\n\nGoodbye.\n\n\n \n","page 2":"Nope!  There are no tan steeds in Equinox.  Fan fact:  the only tan steeds in the whole series were in the dream sequence set in the Old West.\n\n\n \n","page 1":"Question One:\n\n\nOK, let\u0027s start with an easy one.  What color was Fleetfoot, Kelly\u0027s faithful steed?\n\n\n \n","page 4":"Nope!  Remember that only the Night Patrol\u0027s steeds were black.  They began with lighter colors, and gradually, as their souls were corrupted, they grew darker and darker, until there was only a patch of lightness over their heart.\n\n\nThen the patch grew smaller and small under there was only a dot of lightness.  And this would stay, for a long time.  But it was a mark of pride for a Night Patrol Steed to commit an act of horror so heinous that even that bit over their heart would disappear.  That is what happened, of course, when Cantankerous Rex abducted Little Lily.\n\n\nWe didn\u0027t see exactly what he did, as the camera just focused in on his patch of lightness, and we watched it darken and sizzle and harden, scale-like, over his heart.\n","page 3":"What was the name of the first episode of season 2?\n\n\n \n","page 11":"That\u0027s right!  This was a really surprising episode.  When season two was picked up, you could tell the creators didn\u0027t expect it, and this script was a little more hastily thrown together than the others.  But that\u0027s what makes it work.  You remember how the whole first half of the episode was that picnic on Kelly\u0027s lawn, in front of the swan pond, and the living fireworks were spelling out funny things.\n\n\nIt went on for a long time, with no conflict or monsters or argument.  Just...friends enjoyed each other, and steeds and riders sharing food.  It made you think about how you don\u0027t need any of that.  And how also that kind of joy goes away, always. \n\n\nBecause the second half of the episode has Cantankerous Rex and his Wreckers just smashing up the party, breaking the living fireworks in half, stepping on the picnic basket, and taking Fleetfoot prisoner.  That\u0027s of course the episode where Fleetfoot got her fear of sharp teeth.\n","page 99":"And the episode ended with the skin of Duke Drake slowly going blue.  It didn\u0027t show what happened, but it was obvious.\n\n\n\"I need...one more...grain...of sand,\" he says, and that\u0027s kind of like the point you want so badly.  One more.  To you, that makes the difference.  You\u0027ve convinced yourself you need it like air, to seal that rift where the oxygen escapes.\n\n\nThe number will go up, and some counter will tick over in you, some itch scratched for a second, and then you\u0027ll be hungry again, like the Hunger Feast Kelly served in the Mirror lands, the food that starves you.\n","page 10":"Good guess, but \"Gnu Beginning\" was actually Season Three\u0027s first episode.  That\u0027s the one where Kelly and Fleetfoot enter into the world of talking animals and bring back the acorn of the Forever Tree. \n\n\nThe show didn\u0027t last long enough, of course, to let the new Forever Tree grow in Equinox, but if it had, it would have grown into a huge oak tree that could maintain a stable portal between Equinox and the talking animals land, which I bet they would have used to save the talking animals from the Meat-Eater, the dragon lord they sort of hinted at who was coming to devour the talking animals in the stinger at the end.\n","page 98":"No, no, I understand. \n\n\nDo you remember the part, at the middle part of S2 before the midseason break, how Duke Drake Duck thought he could use the Riders to repair the Smothered Realm (remember, the air was slowly trickling out of their realm through a pinhole rift between worlds, and the duck knights were always wondering if today was the day when the oxygen finally ran out.)\n\n\nAnd Duke Drake needed to fill the Fay Queen\u0027s goblet with 10,000 perfect diamonds before the last grain of sand fell from the upper dome of the hourglass to the lower dome.\n\n\nHe was running to put the ten thousandth diamond in when the last grain fell, dropping down the narrow neck of the hourglass with an audible tink, settling softly in the sand below.\n\n\n \n","page 13":"No, sorry.  \"Under the Rainbow...and Arrows!\" was the name of S1E16, where Little Lily found the pot of gold under the rainbow and gave it back to the leprechauns in exchange for her Bow of Ten Sorrows.  You remember how the bow would never strike true, but always miss its target by a hair.\n\n\nIt\u0027s purpose wasn\u0027t to wound, but to make the target think about how near they came to death, and they would freeze, heart beats, pulse in their ears, knowing what almost happened.\n\n\nThat allowed Kelly and the other Friends to kill them while they were paralyzed with fear and sorrow.\n","page 12":"Wrong--but understandable.  \"Thicker than Water\" is actually the name of the boat that Kelly borrowed in S2E2 to save Fleetfoot.  Remember how she was running up and down the deck with Little Lily and saying \"I don\u0027t know how to sail this thing!\" and then the boat started talking and asking her if she remember what the boat name means--\"Blood is Thicker than Water.\"\n\n\nAnd Kelly said, \"Blood,\" and Little Lily said, like she was making a promise, \"Blood.\"  I didn\u0027t get that at the time, but I realized later, watching it, that they were all swearing revenge, like, they were not just going to rescue Fleetfoot.  They were going to slaughter everyone in Cantakerous Rex\u0027s castle to do it.  They didn\u0027t really show that, but once you understood the \"Blood\" part, it\u0027s really obvious, especially the bit where Kelly is washing her hands and face at the end and you can clearly see it\u0027s covered with blood.\n\n\nRemember:  \"It\u0027s never going to come out, and I don\u0027t care.\"  I missed so much of what was going on, on that show when I was a kid.\n","page 15":"OK, question 3.  Who was the leader of the Night Patrol for most of seasons 2 and 3?\n\n\n \n","page 9":"What was the name of the first episode of season 2?\n\n\n \n","page 14":"OK, question 3.  Who was the leader of the Night Patrol for most of seasons 2 and 3?\n\n\n \n","page 17":"That\u0027s right!  Flynocerous was the nominal leader.  He wasn\u0027t the toughest or the biggest, but he had the bloodline, and he was a good planner.  He knew he was old, and that he didn\u0027t have much time to defeat Kelly and the Friends.  They spent a lot of time on his illness, how he was slowly dying from the feet up, which I found really creepy as a kid.  Flynocerous just had these dead hooves, or whatever you call rhinocerous feet, and he dragged them along as he flew a bit off the ground.\n\n\n\"Soon the sickness will reach my heart,\" he would say, and I think it was meant as a joke, because they did that cheesy sound effect like they do for puns on the show, with the slide whistle, but I never thought that was funny, and I don\u0027t think the writers meant it like that. \n","page 16":"OK, question 3.  Who was the leader of the Night Patrol for most of seasons 2 and 3?\n\n\n \n","page 91":"I\u0027ve considered that.\n\n\nBut what? \n\n\nI knew what you\u0027re thinking.  The invisible Gem she took from Gorgoil and Garguine, the stone twins from S2E11.  It never got used or mentioned again, but the writing on the plaque on the wall near the pedestal she took it from said \"To be Used in Case of Greatest Sadness.\"\n\n\nI held my hand to her--I do, each time I rewatch it, and I take the invisible gem from her.\n\n\nShe wants me to have it.  Because she knows she was about to die.  I have it, here on my desk.\n\n\nBut a gem that can be broken like that only once is a difficult thing.  How do I know when it\u0027s the Greatest Sadness?\n\n\nAnd I don\u0027t know what she wants me to do with it.\n","page 90":"I\u0027ve thought of that.  But why, I always wonder.  Neither of us would survive that molten iron.\n\n\nDid saving Little Lily require a double sacrifice?  Is that why the second  half of the episode never aired, would never air?  If so, was Kelly\u0027s sacrifice in vain?\n\n\nI thought about it.  The show had been stuck, frozen in time as Kelly jumped.  She remained the same, ageless, perfect girl, while I aged and changed and things grew worse here.  And people forgot about you.\n\n\nI admit I\u0027ve touched the screen to try to take your hand.  I\u0027ve hurt my hand.\n\n\nI\u0027ve broken my hand.\n\n\nI\u0027ve broken two TV sets.  When I was younger obviously.  My college roommate got really scared, and later I ended up with a double dorm room, all to myself.\n\n\nTouching the screen doesn\u0027t help, I don\u0027t think.  Unless it did, and I\u0027ve already passed through into Equinox, and what\u0027s left here is empty.\n\n\nWhich might explain a lot.\n\n\n \n","page 93":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 92":"I must have put that link there last night.  I thought I had a bad cold, but now I\u0027m sure I have the flu.  I don\u0027t even remember putting that link there.\n\n\nDid I get up in the middle of the night after taking cold medicine and come downstairs to the computer and type that?\n\n\nWhy would you click that?  Why would you claim to be Kelly?  I know you aren\u0027t.  You\u0027re just someone poking a link on a phone.\n\n\nOh, my god.  But she would, she would try to contact me this way, is the thing.  I\u0027m so sick.  My joints hurt.  Walking the ten feet to the coffeemaker is impossible.  I can\u0027t lift my arm high enough to get the filters.  This is a horrible flu and you are taking advantage of how sick I am.  I have to get back into bed.\n\n\n \n","page 95":"Why are points worth causing me so much pain?  They don\u0027t do anything.  But people like to see numbers grow larger because it makes them feel like they will never die.  I know it\u0027s not personal.  I\u0027m a means to an end. \n\n\nAt work, I fill out forms so students can take their online classes (each enrollee giving the dean a point, I suppose) or dealing with begging students who got 59 on an essay exam (I need one more point!  Give me that point!)\n\n\nHere\u0027s your point!  Here\u0027s your stupid point!\n","page 94":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 97":"Let\u0027s just skip, then, if we are skipping.  You can watch a show and skip episodes, and you can sit in your basement and skip your life.\n\n\nWhy not skip a human being trying to talk to you, to share something with you?\n\n\nKelly would have something to say about loyalty and trying to find good in people.\n\n\n \n","page 96":"0.6 was the Neilsen rating of the final season.  One more point would have saved it, would have saved Kelly from falling into the moat of burning iron forever, the two-part episode never completed.  How about you give me one point, and I\u0027ll give you your point.\n\n\nBut you can\u0027t, and you\u0027ll take that point from me, and Kelly will fall forever, be dying forever.\n\n\nAnd then (and this is the sickest part of all) you will give me a point because you will be asked to \"End Game and Leave Comments\" and you\u0027ll give me points on a rating scale, when a single point would have saved her.  But you look at a list of rating and click one without a moment\u0027s thought.  \"Three, kind of short, but whatever\"; \"One, stupid\"; \"Two, thanks for the free point.\"\n\n\nIt\u0027s not me who needs those points.\n","page 150":"I must have put that link there last night.  I thought I had a bad cold, but now I\u0027m sure I have the flu.  I don\u0027t even remember putting that link there.\n\n\nDid I get up in the middle of the night after taking cold medicine and come downstairs to the computer and type that?\n\n\nWhy would you click that?  Why would you claim to be Kelly?  I know you aren\u0027t.  You\u0027re just someone poking a link on a phone.\n\n\nOh, my god.  But she would, she would try to contact me this way, is the thing.  I\u0027m so sick.  My joints hurt.  Walking the ten feet to the coffeemaker is impossible.  I can\u0027t lift my arm high enough to get the filters.  This is a horrible flu and you are taking advantage of how sick I am.  I have to get back into bed.\n\n\n \n","page 152":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 151":"I suppose I am.  I\u0027m not there.  I could be dead now and my words would still be there, speaking to you.  You don\u0027t know.  There\u0027s no way for you to know.\n\n\nI\u0027m here, but perhaps not for long. \n\n\nThree seasons isn\u0027t very long.  66 episodes x 47 min \u003d 3,102 minutes, or 51.7 hours, or about 2.15 days.\n\n\nHow well can you get to know someone in 2.15 days?\n\n\nHow many days of my life have I spent thinking about a girl who only exists now in my mind?  Because Kelly is gone.  She\u0027s gone and faded and dead.\n","page 154":"Question Nine:\n\n\nI was just in my basement pacing around, thinking about what would make a good question nine, when I found this in a box labeled 1985.  I was ten.  This is what it says, verbatim, errors and all:\n\n\n-------------------------------------------\n\n\nSir Greg, the mighty warrior of renown, who had slain sixty bandits with one stroke of his sword, sighed and looked out the window.  The muscular man who had done quets for the princess.  Then Kelly came in.  Sir Greg was apprenticed to Kelly and she loved him.\n\n\nKelly hummed to herself as she came in.  She had been here in Equinox for three years almost now and Sir Greg had been special, the one she invited in like Little Lily and Sir Humble but more special because he could fight with her. \n\n\n\"We got a message from King Grandler the Thrid, and we have to go save him from Cantankerous Rex.  Come on, we\u0027ll do it together.\"\n\n\n\"Let\u0027s go\" Sir Greg said!, \"You can count on me.\"  And he held out his hand to her, and she took it.  They held hands for a minute and then they left to go fight.\n\n\n\"We\u0027ll always fight together\" promised Kelly, with a steely glint in her eyes.  She ran a hand through her short red hair.  \"Always.\"\n\n\n------------------------------\n\n\nIt goes on like that for ninety pages, written in a primitive word processor program and printed out on a dot matrix printer.\n\n\nSo I guess my question is this.  Should I throw it away?  Is it time to throw that away?\n\n\n \n","page 153":"I must have put that link there last night.  I thought I had a bad cold, but now I\u0027m sure I have the flu.  I don\u0027t even remember putting that link there.\n\n\nDid I get up in the middle of the night after taking cold medicine and come downstairs to the computer and type that?\n\n\nWhy would you click that?  Why would you claim to be Kelly?  I know you aren\u0027t.  You\u0027re just someone poking a link on a phone.\n\n\nOh, my god.  But she would, she would try to contact me this way, is the thing.  I\u0027m so sick.  My joints hurt.  Walking the ten feet to the coffeemaker is impossible.  I can\u0027t lift my arm high enough to get the filters.  This is a horrible flu and you are taking advantage of how sick I am.  I have to get back into bed.\n\n\n \n","page 29":"Close, but not right.  Rhea-Lynn used a fencing foil after Snapdragon bit her hand off and she had to change weapons.\n\n\nAfter she was rescued from the Forgetting Forest she took a foil from the body of one of the guards (after Fleetfoot snorted fire at him) and she used it thereafter.  I always think about that, like, charcoaled body in a vaguely smeared  human shape, with a shining foil lying on the hand part, untouched by the smoke or the ash.  And I always think about how Kelly walked past him and just pointed to the foil and said, \"take it\" to Rhea-Lynn, like she had gotten so hardened by everything.\n","page 136":"No.  If she had wings, she wouldn\u0027t have fallen.  But if your goal is to sacrifice yourself by throwing yourself away, wings don\u0027t help.\n","page 135":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 138":"No, you\u0027ve demonstrated that clearly.  I made myself vulnerable, and you hurt me.  We\u0027d better end this now.  We don\u0027t need more questions.\n\n\nI\u0027m just sorry I wasted your time.  But if there\u0027s one thing I recommend, it\u0027s to watch the show.\n\n\nI forgive you.  If Kelly can sacrifice herself, I can take your anger.\n\n\nLet\u0027s just end this here, and when we cross paths again on the forum or whatever, let\u0027s just pretend this didn\u0027t happen, that this was just a stupid quiz I made for my first game, and forget it, forget it, forget it.\n","page 137":"Yes.  She felt bad.\n\n\nKelly cried a lot, a lot more than your typical protagonist.  She hid her tears, but she cried before fighting, and she cried after fighting, but it didn\u0027t stop her from fighting.  She fought harder for her tears.\n\n\nShe cried when she wiped her blade on the body of Flynocerous after she took revenge.  And she cried just before stepping off the rim of the moat, to sacrifice herself, to fall, to die.  You can see it.\n\n\nPeople who grew up in the age of VHS know how hard it was to pause.  The screen shook and horizontal lines marred the texture of the paused scene.  But she was crying.  You can it if you look carefully.  I was too.\n","page 139":"...\n\n\nThank you.  That\u0027s not the answer I expected, but it might be the one I needed.  I\u0027m going to not even finish this quiz.  You should just watch the show and then again.  All the answers are in there.\n\n\nKelly is gone.\n\n\nBut knowing you are here--it helps too.  Come find me if you want.  I\u0027ll be there, waiting, thinking about you.\n\n\nYou don\u0027t have to finish this quiz.  Maybe it\u0027s best to leave things unfinished.  Then they sort of live on a little longer than otherwise.  Maybe.\n","page 22":"Okay, question 4!\n\n\nWhat distinctive weapon did Kelly\u0027s first companion, Rhea-Lynn use before she was defeated by Snapdragon?\n\n\n \n","page 21":"Okay, question 4!\n\n\nWhat distinctive weapon did Kelly\u0027s first companion, Rhea-Lynn use before she was defeated by Snapdragon?\n\n\n \n","page 24":"Okay, question 4!\n\n\nWhat distinctive weapon did Kelly\u0027s first companion, Rhea-Lynn use before she was defeated by Snapdragon?\n\n\n \n","page 23":"Okay, question 4!\n\n\nWhat distinctive weapon did Kelly\u0027s first companion, Rhea-Lynn use before she was defeated by Snapdragon?\n\n\n \n","page 26":"After four questions, I just want to also mix in a very short bit of fiction I wrote about Kelly when I was about 14.  This is sort of an imagining of what it was like the morning before Kelly fell through the vortex into Equinox:\n\n\nKelly stared at herself for a little while. Her hair looked different. It was usually long and black, but today it was reddish and short. She rubbed her eyes with the back of her hands, and suddenly remembered that she had dyed her hair the night before, and hacked some of it off. She thought it was pretty even last night, but this morning it looked a little crooked. She liked the color, though.\n\n\nBoy, would Mom be surprised.  Kelly wondered for about the millionth time if she was pretty or not. She was pretty borderline, she thought. Right on the edge of pretty and non-pretty.  She opened her eyes wide and looked at them. Yesterday, when Lily and she had gone to the cosmetics counter at the mall, the saleslady told her that she was using the wrong eye makeup. The saleslady said that Kelly was using makeup for someone with brown eyes, but that she really had hazel eyes.  Kelly inspected her eyes very carefully, but they still looked brown to her.\n\n\nShe picked out a red tie-dyed shirt, and a pair of relatively clean jeans, and a bead necklace which she noticed hanging over her lamp shade. It was broken, so she tied the ends together.\n","page 25":"Right!  Rhea-Lynn used a bronze two-handed axe that was given to her by the Weather Bee at the start of first season until she was defeated by Snapdragon, who bit her right hand off.  I don\u0027t know anyone who wasn\u0027t scarred by that scene, like really scarred.  They didn\u0027t show it, not really.  I mean, the sound it made when he bit her was bad enough but  I know how these scenes usually go--there\u0027s a bite and the good character clutches their hand and there\u0027s a little scream or something and then they magically heal her.\n\n\nBut this wasn\u0027t like that.  \"You can\u0027t put a hand back on,\" I remember the Weather Bee saying.  But mostly what I will remember for the rest of my life, and this shot was not in focus, and it wasn\u0027t even in the center of the screen, was Rhea-Lynn\u0027s arm ending at the bite with two bones sticking out.  It was just for a second.\n\n\nI didn\u0027t really realize that people\u0027s forearms had two bones in it.  I was just a kid, but something about seeing those two bones really affected me.  It wasn\u0027t cartoony either, just like the ragged look like after my grandmother had eaten boiled chicken and the bone was sticking out with ragged meat on it.  Like I said, it was just for a second, and it was off to the side, but somehow that made it even worse, like it was just this thing the camera had happened to catch.\n\n\nAfter that she used a fencing foil and they put the axe in a ceremonial place on the hearth in Fleetfloot\u0027s stall (remember Fleetfoot had a fireplace in her stall).\n","page 28":"After four questions, I just want to also mix in a very short bit of fiction I wrote about Kelly when I was about 14.  This is sort of an imagining of what it was like the morning before Kelly fell through the vortex into Equinox:\n\n\nKelly stared at herself for a little while. Her hair looked different. It was usually long and black, but today it was reddish and short. She rubbed her eyes with the back of her hands, and suddenly remembered that she had dyed her hair the night before, and hacked some of it off. She thought it was pretty even last night, but this morning it looked a little crooked. She liked the color, though.\n\n\nBoy, would Mom be surprised.  Kelly wondered for about the millionth time if she was pretty or not. She was pretty borderline, she thought. Right on the edge of pretty and non-pretty.  She opened her eyes wide and looked at them. Yesterday, when Lily and she had gone to the cosmetics counter at the mall, the saleslady told her that she was using the wrong eye makeup. The saleslady said that Kelly was using makeup for someone with brown eyes, but that she really had hazel eyes.  Kelly inspected her eyes very carefully, but they still looked brown to her.\n\n\nShe picked out a red tie-dyed shirt, and a pair of relatively clean jeans, and a bead necklace which she noticed hanging over her lamp shade. It was broken, so she tied the ends together.\n","page 27":"Sorry!  Rhea-Lynn never used a whip in combat, although she did own one.  You can clearly see it in S1E21 (\"From Bard to Verse\") and S2E16 (\"The Middle of the Beginning of the End\") in her study, and she references it in the latter episode saying that she took it from someone who tried to use it on her to punish her when she stuttered.\n\n\nIt is strongly implied that this was her father, Dr. Marmot, who she made the voodoo doll of in S3E3 (\"On Pins and Needles). \n","page 20":"No, the Weather Bee was friendly, remember?  He wore the orange bathrobe, and was the wizard Quicksilver in disguise.  He was the first one to meet them when they came to Equinox.\n\n\n\"Don\u0027t be afraid children.  Sleep here.  And I will watch you all night, smoothing your hair and singing you to sleep.\"  He said that in his quavery, soft voice.  I used to say that to myself when I went to sleep, if I was scared or upset, and I would touch my own hair like the Weather Bee stroked Fargo, Lady Leora\u0027s little brother.\n\n\nRemember how Fargo was gone in the morning, and the Weather Bee said Fargo left early to seek adventure on his own.  I always thought they were trying to set up a spinoff, but you never saw Fargo again.  That\u0027s typical of the very early episodes though.  Lots of loose ends.\n","page 0":"Hi, I\u0027m Gower, long-time fan of classic TV shows.  And this is a quiz about one of the greatest TV shows of the 1980s, Kelly Unicornstrider and Friends (KUaF--aired 1982-1985)\n\n\nIf you are like me, you grew up in the 1980s with high-quality TV meant for kids or younger teens, but which has a lot to offer adults as well:  Inspector Gadget, The Smurfs, He-Man, Fraggle Rock, and so forth.  These are, of course, the big names, with detailed, surprisingly arcing plots that extended over seasons and reasonable character continuity. \n\n\nBut there were also less popular shows that nevertheless had an outsized influence on media and popular culture, like Dangermouse, Galtar and the Goldenlance, and of course, Kelly Unicornstrider and Friends.\n\n\nSo if you\u0027re an \u002780s kid, or if you love great classic TV, step back in time with me and see how much you remember about Kelly Unicornstrider and Friends! \n\n\n \n","page 33":"Then she started thinking about Eric Power.  People said Eric was the greatest guy in the whole middle school. He had very light blond hair, (hair of spun gold, as Lily called it) and blue eyes that had a little rim of gold around them (which proved that he was sent for them from a magical planet of perfect beings, Lily said.) He played baseball and tennis, and seemed not to care too much about anything, which made him very attractive in the girls\u0027 eyes. He was very confident, and, unlike the other boys in ninth grade, was not afraid to talk and joke around with the girls.\n\n\nBut did Kelly think of Eric as more than a friend?\n\n\n \n","page 32":"After four questions, I just want to also mix in a very short bit of fiction I wrote about Kelly when I was about 14.  This is sort of an imagining of what it was like the morning before Kelly fell through the vortex into Equinox:\n\n\nKelly stared at herself for a little while. Her hair looked different. It was usually long and black, but today it was reddish and short. She rubbed her eyes with the back of her hands, and suddenly remembered that she had dyed her hair the night before, and hacked some of it off. She thought it was pretty even last night, but this morning it looked a little crooked. She liked the color, though.\n\n\nBoy, would Mom be surprised.  Kelly wondered for about the millionth time if she was pretty or not. She was pretty borderline, she thought. Right on the edge of pretty and non-pretty.  She opened her eyes wide and looked at them. Yesterday, when Lily and she had gone to the cosmetics counter at the mall, the saleslady told her that she was using the wrong eye makeup. The saleslady said that Kelly was using makeup for someone with brown eyes, but that she really had hazel eyes.  Kelly inspected her eyes very carefully, but they still looked brown to her.\n\n\nShe picked out a red tie-dyed shirt, and a pair of relatively clean jeans, and a bead necklace which she noticed hanging over her lamp shade. It was broken, so she tied the ends together.\n","page 34":"Obviously Kelly--and Lily--had crushes on him.  How could they not?  He was perfect and even though he didn\u0027t get particularly good grades, and people knew for a fact that he was probably going to end up like Kirk, his older brother, working at the auto shop, covered in grease and stinking of cheap beer, he looked the part of the golden boy now.\n\n\nSo it was a good thing that the vortex opened Kelly later thought.  She had almost made a terrible mistake.  She had almost kissed Eric when the lights went out at the Harvest Dance.  She had almost let herself be that stupid.\n\n\nWhat do you think happened to Eric when Kelly went through the Vortex into Equinox?\n\n\n \n","page 37":"So that\u0027s where that piece of fanfiction ends, and I guess it helps you picture what was going on in Kelly\u0027s mind right before she was taken by the vortex.  So, anyway, more quiz questions.\n\n\nQuestion 5!\n\n\nWhat that the lesson that they tried to teach at the end of every episode of KUaF?\n","page 36":"She would never.  She would never think of Eric that way.  Because there was another boy named Greg who sat apart from everyone else, and he was liked to read, and in fourth grade his mother made him wear red overalls to school.\n\n\nNobody noticed Greg because he wasn\u0027t as loud as everyone else and because he played the timpani in band and didn\u0027t play sports, and once he brought a backgammon board to school and tried to interest people in it.\n\n\nBut Kelly realized that she loved Greg.  It hit her suddenly.   \"I\u0027m going to write him a note,\" she said to Lily.\n\n\n\"To Greg?  Really?\"\n\n\n\"Yes.  I\u0027m going to tell him that I kind of like him.\"\n\n\nShe put her pen to the paper and wrote the note, using a purple pen, and she told him everything and she sealed the envelope, terrified.  She was going to bring it to his house.\n\n\nBut then the vortex came and she was gone, gone, sucked into Equinox.\n","page 39":"I guess that\u0027s what people do.  They just go on.  One foot in front of the other.  School, school, work, work, sleep, wake up.\n\n\nThat\u0027s what Eric had to do, and he did it, and gradually Kelly\u0027s face and voice faded away for him.  He tried to hold on to it, but he grew up, and she didn\u0027t (because she was gone) and soon he realized it was absurd to think that way about a girl who went away so long ago.  So he never had any of her, after a while.  She was gone for him.\n","page 38":"He got too close, and he was ruptured by a spray of energy when the vortex opened.  He turned into a red mist that dusted the side of Kelly\u0027s house, and nobody noticed he was gone for a few days in all the excitement over the vortex opening and Kelly and Lily falling into it.  It hurt him, badly.\n\n\nWhen they finally realized he was gone, they just thought he\u0027d run off somewhere with his brother or something and died in the woods.\n","page 31":"Wrong:  the Starred Wand belonged to Starmane, the pack leader of Fleetfoot\u0027s herd.  The Starred Wand was the intelligent wand that turned out to be the Scarred Wand in disguise and held the personality that took over Starmane until they were forced to burn out his evil with the branding iron.  (Remember the Steeds cannot live if they are branded, so this essentially killed Starmane, not that they actually showed that on the show.)\n","page 30":"After four questions, I just want to also mix in a very short bit of fiction I wrote about Kelly when I was about 14.  This is sort of an imagining of what it was like the morning before Kelly fell through the vortex into Equinox:\n\n\nKelly stared at herself for a little while. Her hair looked different. It was usually long and black, but today it was reddish and short. She rubbed her eyes with the back of her hands, and suddenly remembered that she had dyed her hair the night before, and hacked some of it off. She thought it was pretty even last night, but this morning it looked a little crooked. She liked the color, though.\n\n\nBoy, would Mom be surprised.  Kelly wondered for about the millionth time if she was pretty or not. She was pretty borderline, she thought. Right on the edge of pretty and non-pretty.  She opened her eyes wide and looked at them. Yesterday, when Lily and she had gone to the cosmetics counter at the mall, the saleslady told her that she was using the wrong eye makeup. The saleslady said that Kelly was using makeup for someone with brown eyes, but that she really had hazel eyes.  Kelly inspected her eyes very carefully, but they still looked brown to her.\n\n\nShe picked out a red tie-dyed shirt, and a pair of relatively clean jeans, and a bead necklace which she noticed hanging over her lamp shade. It was broken, so she tied the ends together.\n","page 156":"I thought you might say so, and I wrote this choice first.  Keep it.  It\u0027s in an ancient manila folder, torn on the edges, faded.  I\u0027m embarrassed of it.  When I die someday someone will find it.\n\n\nThey will wonder why I kept it.  I hope they don\u0027t read it.  But it\u0027s not really mine.  It belonged to that boy a long time ago.  It meant something to me then.  Now I\u0027m ashamed.\n\n\nI\u0027ll put it away and never look at it again.\n","page 155":"I hoped nobody would chose thi,s but I know someone will, and I want to honor the fact that I put this choice here.\n\n\nI know you can\u0027t know that I am telling you the truth, but I have laid out these pages, along with a number of photographs of me when I was child, and an old sleepaway camp yearbook, and personal notebook from when I was in eighth grade, and a VHS tape of me at a talent show, and I sprinkled them with lighter fluid on my driveway.\n\n\nWhen I have finished pressing \"Close and Save Changes\" to this page, I will go out and light a match and watch it burn.  It will stink and make my eyes water with the smoke, and that smell and eye pain will be the last time I feel anything about all of those things.\n\n\nI\u0027m pushing that button now.\n","page 158":"I don\u0027t remember if I\u0027ve been keeping score properly, or if it really matters.  You don\u0027t need me to tell you what a \"Score\" variable is telling you about your knowledge of Kelly Unicornstrider and Friends. \n\n\nEither you understand or you don\u0027t.  I\u0027m tired, and no doubt you are too.\n\n\nI have a tenth and final question, but I think it\u0027s better not to finish this quiz.  It\u0027s better this way.  I\u0027m standing on the third floor bedroom of my house.  The ceiling is very low, and it\u0027s stuffy here.  The laptop is on the broken desk with a forgotten mug of tea next to it.  I\u0027ve opened the window.\n\n\nIt\u0027s been raining.  The ground below is shining.  \n\n\nI hope I\u0027ve set this up correctly to give you a rank based on what you knew.  It was one of the first things I wrote, before I realized what this all would mean to me.  But I hope they work.  There\u0027s nothing worse than a dead link that stays dead forever, going nowhere, never fixed. \n\n\nI\u0027m jealous of you.  You have buttons that say \"Go Back\"; \"Restart\"; \"Save.\"  I never quite realized what those buttons mean.  Buttons that can go back, restart, save.\n\n\nThe black driveway below is glistening in the light of the streetlamp,  glistening like white-hot, shining molten iron.\n\n\n--------------------------------\n\n\nBelow is Your Rank!!!!\n","page 157":"I don\u0027t remember if I\u0027ve been keeping score properly, or if it really matters.  You don\u0027t need me to tell you what a \"Score\" variable is telling you about your knowledge of Kelly Unicornstrider and Friends. \n\n\nEither you understand or you don\u0027t.  I\u0027m tired, and no doubt you are too.\n\n\nI have a tenth and final question, but I think it\u0027s better not to finish this quiz.  It\u0027s better this way.  I\u0027m standing on the third floor bedroom of my house.  The ceiling is very low, and it\u0027s stuffy here.  The laptop is on the broken desk with a forgotten mug of tea next to it.  I\u0027ve opened the window.\n\n\nIt\u0027s been raining.  The ground below is shining.  \n\n\nI hope I\u0027ve set this up correctly to give you a rank based on what you knew.  It was one of the first things I wrote, before I realized what this all would mean to me.  But I hope they work.  There\u0027s nothing worse than a dead link that stays dead forever, going nowhere, never fixed. \n\n\nI\u0027m jealous of you.  You have buttons that say \"Go Back\"; \"Restart\"; \"Save.\"  I never quite realized what those buttons mean.  Buttons that can go back, restart, save.\n\n\nThe black driveway below is glistening in the light of the streetlamp,  glistening like white-hot, shining molten iron.\n\n\n--------------------------------\n\n\nBelow is Your Rank!!!!\n","page 159":"Question Nine:\n\n\nI was just in my basement pacing around, thinking about what would make a good question nine, when I found this in a box labeled 1985.  I was ten.  This is what it says, verbatim, errors and all:\n\n\n-------------------------------------------\n\n\nSir Greg, the mighty warrior of renown, who had slain sixty bandits with one stroke of his sword, sighed and looked out the window.  The muscular man who had done quets for the princess.  Then Kelly came in.  Sir Greg was apprenticed to Kelly and she loved him.\n\n\nKelly hummed to herself as she came in.  She had been here in Equinox for three years almost now and Sir Greg had been special, the one she invited in like Little Lily and Sir Humble but more special because he could fight with her. \n\n\n\"We got a message from King Grandler the Thrid, and we have to go save him from Cantankerous Rex.  Come on, we\u0027ll do it together.\"\n\n\n\"Let\u0027s go\" Sir Greg said!, \"You can count on me.\"  And he held out his hand to her, and she took it.  They held hands for a minute and then they left to go fight.\n\n\n\"We\u0027ll always fight together\" promised Kelly, with a steely glint in her eyes.  She ran a hand through her short red hair.  \"Always.\"\n\n\n------------------------------\n\n\nIt goes on like that for ninety pages, written in a primitive word processor program and printed out on a dot matrix printer.\n\n\nSo I guess my question is this.  Should I throw it away?  Is it time to throw that away?\n\n\n \n","page 44":"Obviously this isn\u0027t it, because there\u0027s actually an episode where Silver Jenny and Kelly hold a rainbow in their hand--the same rainbow where Little Lily gets the gold (S1E16).\n\n\nThe whole point of the show is that you keep trying to touch the thing that everyone says you can\u0027t touch, that you can\u0027t affect, that you can\u0027t move, and if you keep at it, you might get there.  Just because something is intangible, someone is dead, something is gone, whatever, doesn\u0027t mean you give up.  You keep trying.  You find friends to help you.  You try again.  And again.\n","page 43":"So that\u0027s where that piece of fanfiction ends, and I guess it helps you picture what was going on in Kelly\u0027s mind right before she was taken by the vortex.  So, anyway, more quiz questions.\n\n\nQuestion 5!\n\n\nWhat that the lesson that they tried to teach at the end of every episode of KUaF?\n","page 46":"That\u0027s the absence of a right answer, which, I guess, if you asked Sir Humble, he would say is as good as the right answer.  But it\u0027s actually wrong.\n\n\nThat\u0027s one thing they talked about, but no, it wasn\u0027t a big lesson throughout, and Kelly kind of made fun of Sir Humble for thinking that way.   Remember the feast of no food, and the dance with no music.   The show was a little sad in the way that it was always autumn there, always with all the foliage and everything about to die.\n\n\nAll the colors were nearly brown but not yet, forever.  And Sir Humble would say, yes, that\u0027s his point, and Kelly would tell him that he was \"a serious killjoy.\"  That was always how that conversation would end.\n","page 45":"This was sort of the mislead answer, because Fleetfoot used to say \"if you can\u0027t do anything else, find a way to hold hate.  Then at least you can feel something.\"  That was towards the middle of first season, when Fleetfoot was just learning about human emotions.\n\n\nBut remember, that line comes back right at the end when Kelly is going to rescue Little Lily and she\u0027s standing right at the lip of the molten metal, and Silver Jenny is calling her back, and Kelly just looks around and says that line.  I remember screaming at the TV.\n","page 48":"This is a big one.  Why was the show canceled?\n","page 47":"That\u0027s exactly right.  The girl striders and their steeds and their knight companions did a lot of things, a lot of things that other people might have felt ashamed of.\n\n\nThat was the point.  They started out kind of pure and then little by little they had to learn to fight and kill and lie and just--survive, I guess.  They did horrible things, and a lot of it I just didn\u0027t get until I grew up.  LIke, I didn\u0027t realize how they made Lady Rowantree tell them where she had set the Exploding Fire Crystal until I was in my twenties.\n\n\nAnd it kind of feels weird to think that kids were watching that and didn\u0027t realize what was going on in the cellar and why Little Lily shared that uncomfortable look with Sir Humble and the camera stayed dead on their faces the whole time.  But we just didn\u0027t know, and there wasn\u0027t TV like that then to compare it to.\n\n\nBut anyway, the point is that they didn\u0027t feel shame.\n","page 49":"This is a big one.  Why was the show canceled?\n","page 40":"He found happiness and love elsewhere.  Because that\u0027s what happens, I guess to people like Eric.  But like I said, it wouldn\u0027t last.  Even through his happiness and love, he sometimes thought about Kelly.\n\n\nHe was at concert once, his arm around his wife, and he saw that back of someone\u0027s head, a young woman, and he thought--is that--?  It wasn\u0027t, of course.\n\n\nBut his wife knew his longing, his sadness.  She knew she\u0027d never have all of him.  That when Kelly went through the vortex, a part of Eric died inside.\n\n\n \n","page 42":"So that\u0027s where that piece of fanfiction ends, and I guess it helps you picture what was going on in Kelly\u0027s mind right before she was taken by the vortex.  So, anyway, more quiz questions.\n\n\nQuestion 5!\n\n\nWhat that the lesson that they tried to teach at the end of every episode of KUaF?\n","page 41":"So that\u0027s where that piece of fanfiction ends, and I guess it helps you picture what was going on in Kelly\u0027s mind right before she was taken by the vortex.  So, anyway, more quiz questions.\n\n\nQuestion 5!\n\n\nWhat that the lesson that they tried to teach at the end of every episode of KUaF?\n","page 161":"You are hearing me.  My poem, my life, my everything, is like a note in a fragile bottle tossed into the ocean, and you smiling at me across the audience--you talking a moment to read my words now, means the bottle has been found and opened.\n\n\nAnd even though a little water had gotten in through the cork and the ink is little blurred, you can still read it, and it doesn\u0027t matter, it doesn\u0027t matter, it doesn\u0027t matter.\n\n\n \n\n \n","page 160":"Question Nine:\n\n\nI was just in my basement pacing around, thinking about what would make a good question nine, when I found this in a box labeled 1985.  I was ten.  This is what it says, verbatim, errors and all:\n\n\n-------------------------------------------\n\n\nSir Greg, the mighty warrior of renown, who had slain sixty bandits with one stroke of his sword, sighed and looked out the window.  The muscular man who had done quets for the princess.  Then Kelly came in.  Sir Greg was apprenticed to Kelly and she loved him.\n\n\nKelly hummed to herself as she came in.  She had been here in Equinox for three years almost now and Sir Greg had been special, the one she invited in like Little Lily and Sir Humble but more special because he could fight with her. \n\n\n\"We got a message from King Grandler the Thrid, and we have to go save him from Cantankerous Rex.  Come on, we\u0027ll do it together.\"\n\n\n\"Let\u0027s go\" Sir Greg said!, \"You can count on me.\"  And he held out his hand to her, and she took it.  They held hands for a minute and then they left to go fight.\n\n\n\"We\u0027ll always fight together\" promised Kelly, with a steely glint in her eyes.  She ran a hand through her short red hair.  \"Always.\"\n\n\n------------------------------\n\n\nIt goes on like that for ninety pages, written in a primitive word processor program and printed out on a dot matrix printer.\n\n\nSo I guess my question is this.  Should I throw it away?  Is it time to throw that away?\n\n\n \n","page 164":"You knew nothing, and I am sorry.  This has all been meaningless to you, just an indulgent and pretentious bunch of pages strung together, just gibberish, and I\u0027m sorry.\n\n\nThings have changed in twenty-five years.  There is good VR,  mainstream arc-filled fantasy epics on TV, paranormal drama, and dozens of superhero sagas in the movies.\n\n\nThe graveyard is full of forgotten shows like KUaF, and someday nobody will remember.  When I die, I will probably be the last person to care or wonder where she is, or what she would look like then.\n\n\nBetter this way, probably.  Always young, always brave, always falling.\n\n\nGoodbye.  And again, I\u0027m sorry.  I\u0027m sorry, player.  I\u0027m sorry, Kelly. \n\n\nGoodbye.\n","page 101":"Let\u0027s just skip, then, if we are skipping.  You can watch a show and skip episodes, and you can sit in your basement and skip your life.\n\n\nWhy not skip a human being trying to talk to you, to share something with you?\n\n\nKelly would have something to say about loyalty and trying to find good in people.\n\n\n \n","page 100":"Sometimes I wish we could.  I don\u0027t blame you for asking.  But if there\u0027s one thing Kelly and Friends has taught me it\u0027s that you can\u0027t go back.\n\n\nYou\u0027ve hurt me, and you need to learn not to do that.  You can\u0027t just say \"start over\" like I\u0027m not here.  I remember.\n\n\nI\u0027m sitting here looking at my old art and my old poems.  And my old costumes, like the one of Sir Humble with the big leather belt that he hung his bladeless sword on.  These costumes don\u0027t fit me anymore obviously.   But I still have them.  No, I can\u0027t go back and \"start over.\"  I don\u0027t have a button up top to restart like you, as if you could *really* restart.  You can\u0027t you know.  You can try, but everything I\u0027ve said is in you now.\n\n\nYou can\u0027t restart the way you want to restart.\n\n\n \n","page 103":"Sometimes damage is done and you hurt someone and they stay hurt.  The trouble is you don\u0027t think.  You click a story and you assume it\u0027s just some stupid words someone threw down, and you\u0027ll just zip through them.\n\n\nDo you treat people like commodities that way in your real life?  If you see someone sitting near you on the train, do you hurt them and them try to start over?\n\n\nKelly tried to start over--that the whole point of all of Season Three.  Remember, they started everything over.  S3E1 is a shot-by-shot refilming of S1E1, but everything about it is a little wrong.  LIie the clothes are shabbier and the props look like they\u0027ve been stored in a mildewy closet for two years.\n\n\nAll the lines are the same, the movement the same.\n\n\nRhea-Lynn, weirdly, has her hook hand, even though back in S1E1 of course she hadn\u0027t been defeated by Snapdragon yet, and lost her hand.  And her hook hand is missing its tip, like someone had mistreated it in the prop room.  Slowly they realize they\u0027ve gone back, and everything is the same except for their battle scars.\n\n\nKelly\u0027s long laceration on her forearm is still there, and you can see where Healer Amandrea had to sort of sew with a piece of rawhide.  It looks a little infected.  Little Lily has that scar across her eyebrow, a chunk of the hair missing as the white scar crosses it--a scar she got at the end of season two.  Fleetfoot looks wearvy and sick, like he did when he aged magically when he and Kelly found the Nonesuch door.\n\n\nThey are back, they started over, but when you go back, the scars are still there.\n","page 102":"Yes.  End the game.  Why not.  I\u0027ll just disappear.  End the game.\n\n\nLeave comments.  I will stay here for a while, though, watching the screen.  I hope you\u0027ll think about me, about what you\u0027ve done, and I hope it hurts.  I hope when you are asked in years to come if you have any regrets, you\u0027ll say, \"no, not really,\" and then you\u0027ll pause, and a guilty pang will strike at you, and you\u0027ll think of me.\n\n\nSo end the game and leave comments.  End it.\n","page 104":"Question Eight:\n\n\nWhy did Kelly reject the eagle wings as a gift after she recovered the Lost Medallion?\n","page 107":"Oh.\n","page 106":"How did you not know I loved you?\n","page 55":"Question 7:\n\n\nBe honest here.\n\n\nDid you play this because you like me personally, because you are a fan of the show, or because you just want the point for playing through this game?\n","page 109":"I\u0027m sick.  I\u0027m really sick.\n","page 54":"That\u0027s just wrong.  It\u0027s just completely wrong.  The story wasn\u0027t over.  Remember how season three ended.  It doesn\u0027t matter that the Night Patrol had mostly been scattered, Kelly threw herself into the molten metal.  That\u0027s the important part, that she was going to die, and Season Four was going to show why that didn\u0027t happen. \n\n\nYou know how that is when you have a two-part episode and at the end of part one it looks like someone died and there is honestly no way they could have escaped it.  You see the sword come down full force at someone\u0027s unprotected head, and the screen freezes with the blade one millimeter above the head.\n\n\n...to be continued!...\n\n\nBut then in part two, they show that scene again, clearly reshot, and someone parries the blow.  In a \"part two\" episode, they show you what really happened.\n\n\nThat\u0027s what they would have done with Kelly jumping into the molten metal to save Little Lily, to trade her life for Lily\u0027s.  So I don\u0027t see how you can say the show was over, because it wasn\u0027t.  That\u0027s not what canceled means.\n","page 108":"I\u0027m so sorry, Kelly.  I was so stupid.  What do I do?  What do I do now?\n","page 57":"Question 7:\n\n\nBe honest here.\n\n\nDid you play this because you like me personally, because you are a fan of the show, or because you just want the point for playing through this game?\n","page 56":"Possibly a contributing reason, but not really the reason.  If you follow, or followed celebrity gossip recently, you might remember that Jo Hops was played by Petra Glenn (she used to go by Petra Glynn, and Petra J. Glynn in the 80s) and that she mentioned Kelly Unicornstrider and Friends in her memoir last year (2018), which sort of got lost in the shuffle when a ton of actresses were all publishing memoirs all at the same time like Reese Witherspoon and Busy Philips.  \n\n\nAnyway, Petra Glynn did really bad after KUaF (you can look her up on IMDB and see the decline from 1985 to now) going from that to an episode of Alien Nation in 1989, a two episode spot on Baywatch also in 1989, and Sabrina, the Teenage Witch, playing herself (2003) and honestly, I\u0027m telling you everything of note, aside from a one-liner on a CSI (2007) and a disaster of an appearance on Dancing with the Stars (2013).\n\n\nWhatever they asked her to do never really came out.  She and the director had a screaming fight.  And the director said (this is reported by two extras who were on the set) that \"I\u0027m not asking Petra to do it.  I\u0027m asking Jo Hops to do it.\" \n\n\nWithout Jo Hops, the whole arc fell apart, since Jo was the chosen girl who was supposed to learn from Kelly when Kelly was ready to...actually, I don\u0027t think it was ever totally made clear when or why Jo was supposed to replace Kelly as the leader.   But there was a lot of set up for it, and without her, it fell apart.\n\n\nBut, no, that\u0027s not why the show was cancelled.\n","page 59":"Question 7:\n\n\nBe honest here.\n\n\nDid you play this because you like me personally, because you are a fan of the show, or because you just want the point for playing through this game?\n","page 58":"This is the right answer, of course.  I know you\u0027re thinking, didn\u0027t it only run 1982-1985?\n\n\nThat\u0027s true, but even though the show shut down, it wasn\u0027t canceled, not really.  Canceled is over, and there was talk about a movie for a while, and there was a comic book (four issues, limited edition 1986).  And the book Stories Set In... (Small Beer Press 2008) had a longish short story set in a thinly disguised world of Equinox, actually about Fleetfoot\u0027s foals.\n\n\nSo that\u0027s not canceled.  That\u0027s still going on.  There\u0027s more stories and there\u0027s a chance to find out what happened.\n\n\nBy the way, I have all of the comics, but my copy #3 in only poor-fair condition with the third leaf torn and part of the upper right corner panel missing.  Silver Jenny is saying \"Even so, I rec\" and you can\u0027t see the rest and I wonder if it\u0027s \"I recognize...\" or \"I recommend\" or \"I reconsidered\" or \"I received a message from Kelly and she\u0027s all right.\"  That would be just the sort of thing Silver Jenny would say in just one panel.  So I want to buy that issue if anyone has it with that panel visible.  Don\u0027t tell me what it says, I want to read it myself.  PM me on the forum.  I will pay top dollar for it.\n","page 51":"This is a big one.  Why was the show canceled?\n","page 50":"This is a big one.  Why was the show canceled?\n","page 53":"Question 7:\n\n\nBe honest here.\n\n\nDid you play this because you like me personally, because you are a fan of the show, or because you just want the point for playing through this game?\n","page 52":"It might be.  I don\u0027t know if that was a factor.   They did something so weird with Silver Jenny at third season (that was after she started playing with gray magic) and she removed her own eyelids.  It was a huge reveal when she said two episodes later,\n\n\n\"I did it on purpose.  I want to see everything.\"\n\n\nI\u0027m not sure how they filmed it.   Did they just time every shot around her blinks?  Did Silver Jenny just never need to blink, and she just stood there, watching (like Silver Jenny did) and judging everyone with those eyes.  You couldn\u0027t look away from them, and I guess that was sort of the point. \n\n\nWhen the commercials came on, I couldn\u0027t even think about them--I remember that Power Machines (from Galoob!) commercial, and all I could think about were those eyes.\n","page 110":"By the time you\u0027re reading this, you know, whatever happened to me happened already.  I don\u0027t care anymore.\n\n\nAt least I know you\u0027re there.  You care enough to tell me to go to the doctor, I suppose.\n\n\nThe curelings from S1E14 healed by taking people\u0027s pain.  They did it by touching skin, and where they touched, their skin went gray.  You don\u0027t have any way to know, but I\u0027m touching my screen now.\n\n\nRight in the middle, my whole hand resting on my screen.\n\n\nI don\u0027t know who you are.  I can\u0027t know if you are doing it.  I need to feel like someone is with right now, just for a second.  Just touch the screen with your skin.\n","page 66":"My point is that I\u0027m here.  I am certainly here.  I don\u0027t know where else I would be--and you are--well, I don\u0027t know where you are.\n\n\nI picture you, though.  I picture you on your phone, lying back on a deck chair on a Carribean cruise.  I don\u0027t know if there is wi-fi on a cruise.  One second.\n\n\nI just looked it up and there is.  You can get it.  So you are on a cruise, a Carribean cruise, and it turns out the Carribean is south of Florida, which I knew but I always for some reason think is near South America.\n\n\nAnyway, you are lying in the sun.  You are beautiful.  You are basking, going for a tan, I guess, and you take your phone and put on my quiz, shading the screen from the glare of the sun.  In the distance, the ship is just about near the coast of Argentina, and the sun is really coming down, and you think of me.\n","page 68":"Sunscreen applied to Carribean-hot skin leads to more, I think.  We are in public, so we mustn\u0027t.  I reach out to smooth out a bit of lotion on your shoulder and then I pick up your glass of pina colada playfully, meeting your eyes and rubbing my finger along the rim of the glass.  I take a sip.  It tastes of rum and coconut and unfortunately the sunscreen I just rubbed all over the rim of the glass.\n\n\nBut I can\u0027t really do that, even though you want me to.  I\u0027m only words here.\n","page 67":"Almost like your child.  You watch over me.  I\u0027m safe with you next to me, and I\u0027m actually in your hand, in the phone, in these exact words you are reading.  I appreciate what you\u0027re saying.\n\n\nBut at the same time, it hurts me, for you to say that.  I\u0027m not your child.  I\u0027m just writing a quiz, and I don\u0027t need you to treat me like a child.\n\n\nTurn and look at me.  Never mind.  You don\u0027t get it. \n","page 69":"Let\u0027s just skip, then, if we are skipping.  You can watch a show and skip episodes, and you can sit in your basement and skip your life.\n\n\nWhy not skip a human being trying to talk to you, to share something with you?\n\n\nKelly would have something to say about loyalty and trying to find good in people.\n\n\n \n","page 60":"It\u0027s funny.  We don\u0027t even know each other.  Maybe you\u0027ve seen me around the forum or you\u0027ve chatted with me elsewhere online.  But you never sought me out to say \"hi\" in any other context.  But you\u0027re doing my quiz because you \"like me,\" you say.\n\n\nThat\u0027s really fine and ok.  It\u0027s like we\u0027re talking.  I\u0027m sitting in my basement.  I\u0027m just telling you so you can picture me correctly.   I\u0027m showing, not telling.  The walls are dark gray, and a little bit damp, but over by the boiler, not here by the computer.\n\n\nThe washing machine has a quarter stuck in it somewhere so every time it spins, it makes a cliack sound.  It\u0027s maddening.  But I\u0027m used to it.  If there were more clothes in it, it would be muffled I think, but there\u0027s just my clothes.\n\n\nI\u0027m tired, but I need to finish this choice at least.  I feel a little empty tonight.\n","page 62":"Oh.  It\u0027s good that you are telling me that.  I\u0027m writing this right now alone, at 3:40 am at my desk.\n\n\nIt\u0027 raining, and I have a pale green mug of cold tea here.  I\u0027m pointing to it.  Sometimes I make tea, thinking it will help, and then I forget about it, and it sits, growing cold.\n\n\nAnyway, I\u0027m sitting up, late, writing this choice.  I left this one till last because I don\u0027t want to think someone would choose it.  I\u0027m here.  We are far away from each other, but I\u0027m here, and I\u0027m a real person who only wants you to take a moment and connect with me, to see me.\n","page 61":"I hoped you would find this quiz, my friend.  There are not many of us. We larned to hide, I guess.\n\n\nOur mothers told us not to dress like Sir Humble or Can\u0027tgaroo or especially Kelly Unicornstrider for Halloween.  She suggested a clown or a baseball player.  We wanted to be none of those.  We put on the armor or the green dress or the wizard robes.\n\n\nWe got up in front of the school for the talent show read our poems about KUaF dressed as Sir Humble.    We weren\u0027t nervous until we saw the paper shaking in our hands, and seeing it, the paper shook more.\n\n\nWe didn\u0027t remember never to feel shame.\n","page 63":"I don\u0027t see how you can say that, though.  You\u0027ve been cold to me.  You\u0027ve never taken the time to find out who \"Gower\" is, not really.  I\u0027m a google search away.\n\n\nYou don\u0027t come to visit me or ask me to come to meet you or your real friends or your family.  Because we are like family, or I thought we were.  I\u0027ve given a lot to the intereractive literature community over the years, and yeah, I get lip service, oh, I respect you, hey cool post, whatever.\n\n\nBut I\u0027m a person, and I have feelings, I just want to connect.  I can\u0027t just skim over the surface with you like this and then you click a button and I\u0027m gone.  Then you go trading memes and lols on the forum with other people.\n"}